{
    "title": "Overcoming Intimidation",
    "date": "1996-08-18",
    "blurb": "In this sermon, Kevin reflects on the pain and division caused by recent tensions in the community. He condemns the intimidation of police families and local businesses, urging the community to resist evil and pursue peace with reference to scripture. Kevin draws parallels with Joseph's story, emphasizing forgiveness and God's purpose for peace, and encourages steadfast faith and persistence in seeking God's healing.",
    "raw_text": "During the week I had a couple of conversations that brought home to me in a very real way the pain that has come to many people as a result of the tensions of the last couple of months in our Province. On Friday evening I met with an RUC officer and his wife, members of the Parish of Ahoghill. I had last spoken to them about a month ago. At that stage the intimidation of police families had not affected them. Last Friday he told me he had been threatened and told his house would be burned. After much anguish, and for the sake of his wife and young children, he has decided to move out of Ahoghill. I have learned of at least one other RUC family who have been similarly threatened and who intend to do the same. Men and women who over the years have put their life on the line in the service of this Province, hounded out of this village by a small criminal element who would call themselves loyalist.\n\nEarlier in the week, I was talking to a Protestant business in Portglenone. He has been threatened and his business subjected to a boycott. That boycott has been fomented by a small criminal element on the nationalist side and is maintained by fear. His concern is that the situation could easily develop into one of escalating boycotts which would leave the village of Portglenone divided long after the present tensions had subsided. That he said does no good to anyone.\n\nOn the Sunday after the Twelfth, as I reflected on the mayhem of the previous week, I maintained that Satan had stalked the streets of our Province. My experiences this week have graphically underlined the truth of that for me. Evil is at work on the streets of our own villages, working through small criminal elements on both sides of the divide, who would drag us all back into the mayhem of the past.\n\n> \"Brethren, be sober, be vigilant, because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour; whom resist, steadfast in the faith.\" - 1 Peter 5:8\n\nAs I say this, I fully realise that there are deep seated fears within our community, people feel that the identity and ethos of the community are threatened. But we do no service to ourselves or the God we profess to serve if we go down the path of deepening strife and division. We must always be aware that evil can work in subtle ways - taking that which is good and honourable and perverting it. Loyalty to the crown can be perverted into the mentality that would intimidate police and their families out of Ahoghill. Those who purport to defend their communities by the same token engage in the intimidation of those who dare to stand up to them.\n\nAs we seek to pursue our political objectives, as we seek to uphold tradition, we must do so with constant reference to the Lord we worship and seek to serve. This is the substance of the statement by the Presbyterian Church when it reminded us all that all allegiances, all traditions must be continually tested against scripture. This requires an ongoing willingness to listen to the voice of scripture, which is God's word to us today.\n\nThe passage appointed as our Old Testament lesson has always spoken very powerly to me. Last week we read of Joseph, the dreamer, the favoured younger son of his father Jacob, consigned to slavery in Egypt by his brothers. Joseph, if you recall had dreamed dreams that troubled his brothers. Dreams that spoke of a destiny for Joseph that they could not share and so they sought to get rid of him. Joseph pursued his dream and, despite much suffering along the way, entered upon his destiny. This morning we find Joseph, now virtual ruler of Egypt, face to face with his brothers. The human reaction would have been one of vengeance. And which of us, in Joseph's position, would not have been so tempted. But that was not Joseph's way because it was not God's way. The way of vengeance would have seen the brothers dead or in slavery and in the process God's people, descendants of Jacob, snuffed out. Joseph recognises that through his suffering and eventual prosperity, God has provided an opportunity. \"God did send me before you to preserve life.\" He recognised that God's purpose was not just prosperity for Joseph but also life for the very brothers who had sought to destroy him. For that to come to pass required in Joseph a costly and I'm sure initially painful obedience to the will of God.\n\nMuch has happened in our Province that stands in the way of peace. Things have been done, things have been said that make it harder to pursue that peace. There are many who do not want that peace, who would by threat and intimidation seek to prevent it. There are even those who would seem to suggest that it is not God's way. We must never forget however, those who over the past thirty years have been wounded in body, mind and soul by the violence of our times. The onus is on those of us who have not been so affected to stand firm in our hope and in our prayers.\n\nIn the Gospel passage a Canaanite woman, one outside the people of God, comes to Jesus in prayer for her daughter. Jesus' initial reaction seems harsh and uncaring - his mission he says is to his own people. But her persistence and her faith are rewarded by his healing touch upon her daughter. There is among many a sense of fear and foreboding at this time. Division and fear seem to be gaining the upper hand. But that is not God's way and it must not be our way. Now is the time to stay with our vision of peace and understanding in our land, now is the time to stay with our prayer to the Lord. I firmly believe that our faith and our persistence will be honoured by God, his healing, his peace will come.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/1996-08-16-proper15-Intimidation-in-Ahoghill.txt",
        "raw_ocr_content": "Pentecost 12 (Trinity 11) 1996 Proper 15\n-\nYear A)\nDuring the week I had a couple of conversations that brought home\nto me in a vrey real way the pain that has come to many people as a\nresult of the tensions of the last couple of months in our Province.\nOn Friday evening I met with an RUC officer and his wife, members\nof the Parish of Ahoghill. I had last spoken to them about a month\nago. At that stage the intimidation of police families had not affected\nthem. Last Friday he told me he had been threatened and told his\nhouse would be burned. After much anguish, and for the sake of his\nwife and young children, he has decided to move out of Ahoghill. I\nhave learned of at least one other RUC family who have been similarly\nthreatened and who intend to do the same. Men and women who over\nthe years have put their life on the line in the service of this Province,\nhounded out of this village by a small criminal element who would\ncall themselves loyalist.\nEarlier in the week, I was talking to a Protestant business in\nPortglenone. He has been threatened and his business subjected to a\nboycott. That boycott has been fomented by a small criminal element\non the nationalist side and is maintained by fear. His concern is that\nthe situation could easily develop into one of escalating boycotts\nwhich would leave the village of Portglenone divided long after the\npresent tensions had subsided. That he said does no good to anyone.\nOn the Sunday after the Twelfth, as I reflected on the mayhem of the\nprevious week, I maintained that Satan had stalked the streets of our\nProvince. My experiences this week have graphically underlined the\ntruth of that for me. Evil is at work on the streets of our own villages,\nworking through small criminal elements on both sides of the divide,\nwho would drag us all back into the mayhem of the past.\n-2/4-\nPentecost 12 (Trinity 11)\n-\n1996 Proper 15\nWHE\nYear A)\nI thought on the sentence from the first letter of Peter that introduces\nthe second alternative form of Evening Prayer. \"Brethren, be sober, be\nvigilant, because your adversary the devil, as a roaring lion, walketh\nabout, seeking whom he may devour; whom resist, steadfast in the\nfaith.\"\nAs I say this, I fully realise that there are deep seated fears within our\ncommunity, people feel that the identity and ethos of the community\nare threatened. But we do no service to ourselves or the God we\nprofess to serve if we go down the path of deepening strife and\ndivision. We must always be aware that evil can work in subtle ways -\ntaking that which is good and honourable and perverting it. Loyalty to\nthe crown can be perverted into the mentality that would intimidate\npolice and their families out of Ahoghill. Those who purport to\ndefend their communities by the same token engage in the intimidation\nof those who dare to stand up to them.\nAs we seek to pursue our political objectives, as we seek to uphold\ntradition, we must do so with constant reference to the Lord we\nworship and seek to serve. This is the substance of the statement by\nthe Presbyterian Church when it reminded us all that all allegiances,\nall traditions must be continually tested against scripture. This\nrequires an ongoing willingness to listen to the voice of scripture,\nwhich is God's word to us today.\nThe passage appointed as our Old Testament lesson has always spoken\nvery powerfully to me. Last week we read of Joseph, the dreamer, the\nfavoured younger son of his father Jacob, consigned to slavery in\nEgypt by his brothers. Joseph, if you recall had dreamed dreams that\ntroubled his brothers. Dreams that spoke of a destiny for joseph that\n-3/4-\nPentecost 12 (Trinity 11) 1996 Proper 15\nYear A)\nthey could not share and so they sought to get rid of him. Joseph\npursued his dream and, despite much suffering along the way,\nenteredupon his destiny. This morning we find Joseph, now virtual\nruler of Egypt, face to face with his brothers. The human reaction\nwould have been one of vengeance. And which of us, in Joseph's\nposition, would not have been so tempted. But that was not Joseph's\nway because it was not God's way. The way of vengeance would have\nseen the brothers dead or in slavery and in the process God's people,\ndescendants of Jacob, snuffed out. Joseph recognises that through his\nsuffering and eventual prosperity, God has provided an opportunity.\n\"God did send me before you to preserve life.\" He recognised that\nGodás purpose was not just prosperity for Joseph but also life for the\nvery brothers who had sought to destroy him. For that to come to pass\nrequired in Jospeh a costly and I'm sure initially painful obedience to\nthe will of God.\nMuch has happened in our Province that stands in the way of peace.\nThings have been done, things have been said that make it harder to\npursue that peace. There are many who do not want that peace, who\nwould by threat and intimidation seek to prevent it. There are even\nthose who would seem to suggest that it is not God's way. We must\nnever forget however, those who over the past thirty years have been\nwounded in body, mind and soul by the violence of our times. The\nonus is on those of us who have not been so affected to stand firm in\nour hope and in our prayers.\nIn the Gospel passage a Canaanite woman, one outside the people of\nGod, comes to Jesus in prayer for her daughter. Jesus' initial reaction\nseems harsh and uncaring - his mission he says is to his own people.\nBut her persistance and her faith are rewarded by his healing touch\n376\n413\n305\nupon her daughter. There is among many a sense of fear and\nforooding at this time. Division and fear seem to be gaining the upper\nhand. But that is not God's way and it must not be our way. Now is\nthe time to stay with out vision of peace and understanding in our\nland, now is the time to stay with our prayer to the Lord. I firmly\nbelieve that our faith and our persistance will be honoured by God, his\nhealing, his peace will come.\n393\n3\n2.\n-4/4-\nTommy\nPentecost 12 (Trinity 11) 1996 Proper 15 Year A)"
    }
}