{
    "title": "Sunday before Lent",
    "date": "2011-02-27",
    "blurb": "This sermon reflects on the story of the Transfiguration of our Lord and the disciples' journey with Jesus. It emphasizes the importance of not just admiring Jesus, but obeying and following him. The sermon also discusses the disciples' struggle to understand who Jesus was and assures that Jesus is with us in our struggles and searches.",
    "raw_text": "One of the TV series I remember when I was growing up was the BBC programme 'Steptoe and Son'. It is the story of a father and son working in a rather haphazard partnership as Rag and bone men – the forerunners of the recycling business. The son Harold feels trapped and yearns to move on and yet cannot bring himself to leave – the old man for his part cannot understand his discontent. He looks back to the old days, repeating stories of his time in the trenches of the 1st World War. Harold knows the stories so well he can repeat them word for word – knows them so well he has stopped listening.\n\nWe read as our Gospel reading the story of the Transfiguration of our Lord before his disciples – as with so many of the Gospel stories it can become so familiar that we all too easily stop listening as it is read to us. As we stop listening, we stop reflecting, so we stop learning.\n\nThis is one of the few incidents in the Gospels apart from the passion that is referred to in the Epistles, the 2nd letter of Peter. This incident comes at a crucial point in the Gospel story and the disciples’ fellowship with Jesus. Up to this time, apart from some opposition from religious leaders, he had by and large been well received. From this point on Jesus sets his face towards Jerusalem and his coming suffering and death.\n\nFrom the very outset the disciples had had some remarkable experiences of Jesus – there had been his baptism in the river Jordan by John and with it the voice from heaven; there had been the stilling of the storm; they had been present as he had taught and healed. They knew he was different and yet they did not know why. Prior to this we read of Peter’s confession of Jesus as the Christ – but when Jesus goes on to talk of his coming suffering and death, Peter cannot bear to think of it – 'No Lord, this will never happen to you!' – only to suffer the chilling rebuke, 'Get you behind me, Satan!'\n\nAs the Gospel story unfolds, we read of a deepening crisis for the disciples as they watch their master, in whom they had put such hope, for whom they had abandoned their families and security, set his face towards Jerusalem and his coming suffering and death. At this crucial point in the story the disciples are, in the events described in our Gospel reading, given a number of assurances concerning Jesus – though in truth they are only to recognise them after the events of Good Friday and Easter.\n\nIn the vision of Jesus talking with Moses and Elijah, the Gospel writer sets Jesus’ ministry in the wider context of the whole salvation history – God giving the law through Moses, God calling his people through the prophets. The words from heaven recall the experiences of Jesus’ baptism: 'This is my son, whom I love; with him I am well pleased; listen to him!' Jesus is there not just to be admired – he is there to be obeyed and to be followed.\n\nThe disciples journey on with Jesus. In our day we continue to read the Gospel story, in the context of the Mount of Transfiguration. This is not the story of one more failed Messiah, this is Gospel truth - this is God acting, speaking, living, dying in the person of Jesus. As we watch, he asks the same question of us that he asked of disciples of old – 'Who do you say that I am?'\n\nThere is a further aspect to this story and the events surrounding it that I want to reflect on this morning. At this point in their walk with Jesus the disciples were still very much in the process of coming to terms with who Jesus was. Peter had confessed that he was the Christ – yet did not understand what that implied, what was required of Jesus. When, in the story we read today, Peter sees Jesus with Moses and Elijah, he wants to cling to that, to perpetuate that experience. But this is not to be; it is but a precursor of something deeper, more profound. They are aware of none other than God himself bearing witness to Jesus – and they are terrified.\n\nJesus comes to them and touches them, just as he touched the leper, the halt and the blind and says, 'Get up; don’t be afraid.' We often make the mistake of thinking that Jesus only makes himself known, only draws close to those who fully understand, fully know who he is and what he came to do – that he stands aloof from those who do not fully know, who do not fully understand. Jesus comes to us in the midst of our searching, in the midst of our struggle to understand, in the midst of our often struggling discipleship. He is there with us on the storm tossed waters of life – not standing on the beach waiting for us to struggle ashore; he is there with the father desperately worried for his son; he is there with two sisters grieving for their brother Lazarus, with the woman who, as the self righteous look on, comes to wash his feet with her tears.\n\nWe do not live our life in isolation from the rest of life but in the midst of life. Prior to his return to the Father, Matthew tells us of Jesus’ promise to his disciples that he would be with them always, to the very end of time.\n\nAs we prepare to embark on the season of Lent, as we prepare in heart and mind to follow Jesus’ journey to Jerusalem, as we seek to deepen our understanding of Jesus, of his teaching, his life, his death and resurrection, as we wrestle with all the ups and downs of life, may we know that we do so in his presence and in his power.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/1beforelent2011.txt",
        "raw_ocr_content": "Page 1 of 3\nSunday before Lent – 2020- year A\nOne of the TV series I remember when I was growing up was the BBC\nprogramme ‘Steptoe and Son’. It is the story of a father and son working in a\nrather haphazard partnership as Rag and bone men – the forerunners of the\nrecycling business. The son Harold feels trapped and yearns to move on and\nyet cannot bring himself to leave – the old man for his part cannot understand\nhis discontent. He looks back to the old days, repeating stories of his time in\nthe trenches of the 1st World War. Harold knows the stories so well he can\nrepeat them word for word – knows them so well he has stopped listening.\nWe read as our Gospel reading the story of the Transfiguration of our Lord\nbefore his disciples – as with so many of the Gospel stories it can become so\nfamiliar that we all too easily stop listening as it is read to us. As we stop\nlistening, we stop reflecting, so we stop learning.\nThis is one of the few incidents in the Gospels apart from the passion that is\nreferred to in the Epistles, the 2nd letter of Peter. This incident comes at a\ncrucial point in the Gospel story and the disciples’ fellowship with Jesus. Up\nto this time, apart from some opposition from religious leaders, he had by and\nlarge been well received. From this point on Jesus sets his face towards\nJerusalem and his coming suffering and death.\nFrom the very outset the disciples had had some remarkable experiences of\nJesus – there had been his baptism in the river Jordan by John and with it the\nvoice from heaven; there had been the stilling of the storm; they had been\npresent as he had taught and healed. They knew he was different and yet they\ndid not know why. Prior to this we read of Peter’s confession of Jesus as the\nChrist – but when Jesus goes on to talk of his coming suffering and death, Peter\ncannot bear to think of it – ‘No Lord, this will never happen to you!’ – only to\nsuffer the chilling rebuke, ‘Get you behind me, Satan!’\nPage 2 of 3\nSunday before Lent – 2020- year A\nAs the Gospel story unfolds, we read of a deepening crisis for the disciples as\nthey watch their master, in whom they had put such hope, for whom they had\nabandoned their families and security, set his face towards Jerusalem and his\ncoming suffering and death. At this crucial point in the story the disciples are,\nin the events described in our Gospel reading, given a number of assurances\nconcerning Jesus – though in truth they are only to recognise them after the\nevents of Good Friday and Easter.\nIn the vision of Jesus talking with Moses and Elijah, the Gospel writer sets\nJesus’ ministry in the wider context of the whole salvation history – God\ngiving the law through Moses, God calling his people through the prophets.\nThe words from heaven recall the experiences of Jesus’ baptism: ‘This is my\nson, whom I love; with him I am well pleased; listen to him!’ Jesus is there\nnot just to be admired – he is there to be obeyed and to be followed.\nThe disciples journey on with Jesus. In our day we continue to read the Gospel\nstory, in the context of the Mount of Transfiguration. This is not the story of\none more failed Messiah, this is Gospel truth - this is God acting, speaking,\nliving, dying in the person of Jesus. As we watch, he asks the same question of\nus that he asked of disciples of old – ‘Who do you say that I am?’\nThere is a further aspect to this story and the events surrounding it that I want\nto reflect on this morning. At this point in their walk with Jesus the disciples\nwere still very much in the process of coming to terms with who Jesus was.\nPeter had confessed that he was the Christ – yet did not understand what that\nimplied, what was required of Jesus. When, in the story we read today, Peter\nsees Jesus with Moses and Elijah, he wants to cling to that, to perpetuate that\nexperience. But this is not to be; it is but a precursor of something deeper,\nmore profound. They are aware of none other than God himself bearing\nwitness to Jesus – and they are terrified.\nPage 3 of 3\nSunday before Lent – 2020- year A\nJesus come s to them and touches them, just as he touched the leper, the halt\nand the blind and says, ‘Get up; don’t be afraid.’ We often make the mistake\nof thinking that Jesus only makes himself known, only draws close to those\nwho fully understand, fully know who he is and what he came to do – that he\nstands aloof from those who do not fully know, who do not fully understand.\nJesus comes to us in the midst of our searching, in the midst of our struggle to\nunderstand, in the midst of our often struggling discipleship. He is there with\nus on the storm tossed waters of life – not standing on the beach waiting for us\nto struggle ashore; he is there with the father desperately worried for his son;\nhe is there with two sisters grieving for their brother Lazarus, with the woman\nwho, as the self righteous look on, comes to wash his feet with her tears.\nWe do not live our life in isolation from the rest of life but in the midst of life.\nPrior to his return to the Father, Matthew tells us of Jesus’ promise to his\ndisciples that he would be with them always, to the very end of time.\nAs we prepare to embark on the season of Lent, as we prepare in heart and\nmind to follow Jesus’ journey to Jerusalem, as we seek to deepen our\nunderstanding of Jesus, of his teaching, his life, his death and resurrection, as\nwe wrestle with all the ups and downs of life, may we know that we do so in\nhis presence and in his power."
    }
}