{
    "title": "Transfigured and Transformed",
    "date": "2017-02-26",
    "blurb": "This sermon focuses on the concept of transformation, using biblical references from Matthew 17:2, 2 Corinthians 3:18, and Romans 12:2. It discusses the transfiguration of Jesus and how we, as believers, are being transformed into the same image from one degree of glory to another. The sermon emphasizes the importance of not conforming to the world but being transformed by the renewing of our minds.",
    "raw_text": "TRANSFIGURED\n\nMatthew 17:2 - And he was transfigured before them, and his face shone like the sun, and his clothes became dazzling white.\n\nTRANSFORMED\n\n2 Corinthians 3:18 - And all of us, with unveiled faces, seeing the glory of the Lord as though reflected in a mirror, are being transformed into the same image from one degree of glory to another; for this comes from the Lord, the Spirit.\n\nRomans 12:2 - Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God--what is good and acceptable and perfect.\n\nPrayer at signing of the Cross at Baptism\n\nMay almighty God deliver you from the powers of darkness, restore in you the image of his glory, and lead you in the light and obedience of Christ. Amen.\n\nMatthew 17:1-9\n\nSix days later, Jesus took with him Peter and James and his brother John and led them up a high mountain, by themselves. And he was transfigured before them, and his face shone like the sun, and his clothes became dazzling white. Suddenly there appeared to them Moses and Elijah, talking with him. Then Peter said to Jesus, \"Lord, it is good for us to be here; if you wish, I will make three dwellings here, one for you, one for Moses, and one for Elijah.\" While he was still speaking, suddenly a bright cloud overshadowed them, and from the cloud a voice said, \"This is my Son, the Beloved; with him I am well pleased; listen to him!\" When the disciples heard this, they fell to the ground and were overcome by fear. But Jesus came and touched them, saying, \"Get up and do not be afraid.\" And when they looked up, they saw no one except Jesus himself alone.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/1beforelent2017 - notes.txt",
        "raw_ocr_content": "TRANSFIGURED\nMatt 17:2\n2 And he was transfigured before them, and his face shone like the sun, and his clothes became\ndazzling white\nMt 17:2 kai; metemorfwvqh e[mprosqen aujtw'n, kai; e[lamyen to; provswpon aujtou' wJ\" oJ h{lio\", ta;\nde; iJmavtia aujtou' ejgevneto leuka; wJ\" to; fw'\".\nTRANSFORMED\n2 Cor 3:18\n18 And all of us, with unveiled faces, seeing the glory of the Lord as though reflected in a mirror, are\nbeing transformed into the same image from one degree of glory to another; for this comes from the\nLord, the Spirit.\n2Co 3:18 hJmei'\" de; pavnte\" ajnakekalummevnw/ proswvpw/ th;n dovxan kurivou katoptrizovmenoi th;n\naujth;n eijkovna metamorfouvmeqa ajpo; dovxh\" eij\" dovxan kaqavper ajpo; kurivou pneuvmato\".\nRomans 12:2\n2 Do not be conformed to this world, but be transformed by the renewing of your minds, so that you\nmay discern what is the will of God--what is good and acceptable and perfect.\nRo 12:2 kai; mh; suschmativzesqe tw'/ aijw'ni touvtw/, ajlla; metamorfou'sqe th'/ ajnakainwvsei tou'\nnoo;\" eij\" to; dokimavzein uJma'\" tiv to; qevlhma tou' qeou', to; ajgaqo;n kai; eujavreston kai; tevleion.\nPrayer at signing of the Cross at Baptism\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\nMatthew 17:1-9\nMt 17:1 Kai; meq j hJmevra\" e}x paralambavnei oJ jIhsou'\" to;n Pevtron kai; jIavkwbon\nkai; jIwavnnhn to;n ajdelfo;n aujtou' kai; ajnafevrei aujtou;\" eij\" o[ro\" uJyhlo;n kat j\nijdivan.\nMt 17:2 kai; metemorfwvqh e[mprosqen aujtw'n, kai; e[lamyen to; provswpon aujtou' wJ\"\noJ h{lio\", ta; de; iJmavtia aujtou' ejgevneto leuka; wJ\" to; fw'\".\nMt 17:3 kai; ijdou; w[fqh aujtoi'\" Mwu>sh'\" kai; jHliva\" sullalou'nte\" met j aujtou'.\nMt 17:4 ajpokriqei;\" de; oJ Pevtro\" ei\\pen tw'/ jIhsou': kuvrie, kalovn ejstin hJma'\" w|de ei\\\nnai: eij qevlei\", poihvsw w|de trei'\" skhnav\", soi; mivan kai; Mwu>sei' mivan kai; jHliva/\nmivan.\nMt 17:5 e[ti aujtou' lalou'nto\" ijdou; nefevlh fwteinh; ejpeskivasen aujtouv\", kai; ijdou; fwnh;\nejk th'\" nefevlh\" levgousa: ou|to\" ejstin oJ uiJov\" mou oJ ajgaphtov\", ejn w|/\neujdovkhsa: ajkouvete aujtou'.\nMt 17:6 kai; ajkouvsante\" oiJ maqhtai; e[pesan ejpi; provswpon aujtw'n kai; ejfobhvqhsan\nsfovdra.\nMt 17:7 kai; prosh'lqen oJ jIhsou'\" kai; aJyavmeno\" aujtw'n ei\\pen: ejgevrqhte kai; mh;\nfobei'sqe.\nMt 17:8 ejpavrante\" de; tou;\" ojfqalmou;\" aujtw'n oujdevna ei\\don eij mh; aujto;n jIhsou'n\nmovnon.\nMt 17:9 Kai; katabainovntwn aujtw'n ejk tou' o[rou\" ejneteivlato aujtoi'\" oJ jIhsou'\" levgwn:\nmhdeni; ei[phte to; o{rama e{w\" ou| oJ uiJo;\" tou' ajnqrwvpou ejk nekrw'n ejgerqh'/.\nSix days later, Jesus took with him Peter and James and his brother John and led\nthem up a high mountain, by themselves. 2 And he was transfigured before them, and\nhis face shone like the sun, and his clothes became dazzling white. 3 Suddenly there\nappeared to them Moses and Elijah, talking with him. 4 Then Peter said to Jesus,\n\"Lord, it is good for us to be here; if you wish, I will make three dwellings here, one for\nyou, one for Moses, and one for Elijah.\" 5 While he was still speaking, suddenly a\nbright cloud overshadowed them, and from the cloud a voice said, \"This is my Son, the\nBeloved; with him I am well pleased; listen to him!\" 6 When the disciples heard this,\nthey fell to the ground and were overcome by fear. 7 But Jesus came and touched\nthem, saying, \"Get up and do not be afraid.\" 8 And when they looked up, they saw no\none except Jesus himself alone."
    }
}