{
    "title": "Transfiguration: A Journey of Transformation",
    "date": "2017-02-26",
    "blurb": "This sermon discusses the story of Transfiguration, emphasizing the importance of not clinging to spiritual experiences but focusing on the person of Jesus. It encourages the congregation to allow their encounters with Christ to transform them, rather than seeking to perpetuate the experience. The sermon concludes with a reminder of God's intention for us to be living expressions of his blessing.",
    "raw_text": "Sunday before Lent – Year A – 2017\nTransfiguration\n\nThis is the Gospel of the Lord. What went through your mind as it was read? It is so outside our ordinary experience. What are we to make of this story of Transfiguration? What does it have to say to us as we tackle the issues that we face in daily living, what does it have to say to our Confirmation candidates as they explore the faith, what does it have to say to Stuart and Sinead as they bring their child for Baptism (later today)?\n\nSo let us just stop and read this a bit more slowly, look at it a bit more deeply. The first point I want to make is that there are two principal strands, two principal groups of actors in this story. On the one hand there are Peter and the disciples and on the other, God and Jesus. As the events unfold, as we are told of Jesus’ appearance changing, of Moses and Elijah talking with their master, we are told of Peter declaring, ‘Lord it is good for us to be here; if you wish I will make three dwellings here .....’ Peter is understandably wrapped up in the experience. But more than that, in his offer to build the three dwellings, there is a desire to perpetuate the experience. ‘It is good to be here’ starts to drift into an attitude of ‘I want to stay here’.\n\nThen, almost cutting across him, something else begins to happen as we are told, in terms reminiscent of the events on Sinai, of a voice out of the cloud saying ‘This is my son, the beloved, listen to him.’ The disciples fall to the ground, only to feel the touch of Jesus as he says to them ‘Get up, and do not be afraid.’ And Jesus leads them back down the mountain. The emphasis is not so much on the experience but on the person of Jesus.\n\nWhere do we fit in to all of this, what does this have to say to us? When we have any sort of memorable experience it is only natural to want to stay in the moment – when we fall in love, when we hear a beautiful piece of music. But the more we try to hang onto the moment, the more it can slip from our grasp. Love develops as we learn more and more (both good and bad) about our beloved. Our appreciation of a piece of music, of a piece of art, develops the more we listen, the more we examine, the more we set them in the wider context of other works.\n\nAs I said, the more we try to hang onto the moment, the more it can slip from our grasp. The same can be true of spiritual experience. We can have a wonderful experience of peace, of joy, when God seems to be particularly close – we might associate it with a particular person, a particular place. And when we go back to it we find it is never quite the same. Try as we might, we never recapture it. We are trying to stay on the mountain.\n\nThe more I think about that, the more I think that we are focussing more on the experience rather than on the person we encounter in that experience. Like the disciples, Jesus leads us back down the mountain. We never forget the experience but we can’t hang on to the experience.\n\nWhere is this leading us? As I frequently point out, our New Testament was not written in English but in Greek. It is sometimes instructive to see how the same Greek word is used in different parts of the New Testament. Take the word that we have translated as ‘transfigure’ in our Gospel reading. The same Greek word appears in the letters of Paul. But in each case it refers not to Jesus, but to us, as the word is translated by our word transformed:\n\n18And all of us, with unveiled faces, seeing the glory of the Lord as though reflected in a mirror, are being transformed into the same image from one degree of glory to another; for this comes from the Lord, the Spirit. 2 Cor 3:18\n\n2Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God? what is good and acceptable and perfect. Romans 12:2\n\nIn other words, in the Gospel it is about what is happening to Jesus: in the writings of Paul it is about what is happening to us as a result of our encounter with Christ.\n\nAll this is brought together rather nicely in the words of the Hymn ‘Mine eyes have seen the glory of the coming of the Lord’\n\nIn the beauty of the lilies, Christ was born across the sea,\nWith a glory in his bosom that transfigures you and me.\nAs he died to make men holy, let us live to make men free.\n\nTo go back to these two threads I was talking about in our Gospel narrative. To try to stay on the mountain with the experience is a way of just staying still, of stagnation. To come down from the mountain with the Christ we encounter in the experience is the way of transformation, of growth\n\nNow I think we can return to that question I posed near the beginning:\n\nSo what are we to make of this story of Transfiguration that we read as our Gospel story? What does it have to say to us as we tackle the issues that we face in daily living, what does it have to say to our Confirmation candidates as they explore the faith, what does it have to say to Stuart and Sinead as they bring their child for Baptism (later today)?\n\nIn the course of the service, after the signing of the Cross, Tom will pray over Saoirse\n\nMay almighty God deliver you from the power of darkness,\nRestore in you the image of his glory,\nAnd lead you in the light and obedience of Christ.\n\nTransfiguration is all about transformation, responding to that voice that came out of the cloud on the mountain, ‘This is my son, the beloved, with him I am well pleased, listen to him.’ It is about becoming what God has always intended us to be, that we might be living expressions of the blessing that the Bishop says at the end of the Confirmation Service:\n\nGo forth into the world in peace;\nbe of good courage;\nhold fast that which is good;\nrender to no one evil for evil;\nstrengthen the fainthearted; support the weak;\nhelp the afflicted; honour everyone;\nlove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand the blessing of God almighty,\nthe Father, the Son, and the Holy Spirit,\nbe among you and remain with you always. Amen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/1beforeLent2017.txt",
        "raw_ocr_content": "Page 1 of 4\nSunday before Lent – Year A – 2017\nTransfiguration\nThis is the Gospel of the Lord. What went through your mind as it was read?\nIt is so outside our ordinary experience. What are we to make of this story of\nTransfiguration? What does it have to say to us as we tackle the issues that we\nface in daily living, what does it have to say to our Confirmation candidates as\nthey explore the faith, what does it have to say to Stuart and Sinead as they\nbring their child for Baptism (later today)?\nSo let us just stop and read this a bit more slowly, look at it a bit more deeply.\nThe first point I want to make is that there are two principal strands, two\nprincipal groups of actors in this story. On the one hand there are Peter and the\ndisciples and on the other, God and Jesus. As the events unfold, as we are told\nof Jesus’ appearance changing, of Moses and Elijah talking with their master,\nwe are told of Peter declaring, ‘Lord it is good for us to be here; if you wish I\nwill make three dwellings here .....’ Peter is understandably wrapped up in the\nexperience. But more than that, in his offer to build the three dwellings, there\nis a desire to perpetuate the experience. ‘It is good to be here’ starts to drift\ninto an attitude of ‘I want to stay here’.\nThen, almost cutting across him, something else begins to happen as we are\ntold, in terms reminiscent of the events on Sinai, of a voice out of the cloud\nsaying ‘This is my son, the beloved, listen to him.’ The disciples fall to the\nground, only to feel the touch of Jesus as he says to them ‘Get up, and do not\nbe afraid.’ And Jesus leads them back down the mountain. The emphasis is\nnot so much on the experience but on the person of Jesus.\nPage 2 of 4\nSunday before Lent – Year A – 2017\nTransfiguration\nWhere do we fit in to all of this, what does this have to say to us?\nWhen we have any sort of memorable experience it is only natural to want to\nstay in the moment – when we fall in love, when we hear a beautiful piece of\nmusic. But the more we try to hang onto the moment, the more it can slip from\nour grasp. Love develops as we learn more and more (both good and bad)\nabout our beloved. Our appreciation of a piece of music, of a piece of art,\ndevelops the more we listen, the more we examine, the more we set them in the\nwider context of other works.\nAs I said, the more we try to hang onto the moment, the more it can slip from\nour grasp. The same can be true of spiritual experience. We can have a\nwonderful experience of peace, of joy, when God seems to be particularly close\n– we might associate it with a particular person, a particular place. And when\nwe go back to it we find it is never quite the same. Try as we might, we never\nrecapture it. We are trying to stay on the mountain.\nThe more I think about that, the more I think that we are focussing more on the\nexperience rather than on the person we encounter in that experience. Like the\ndisciples, Jesus leads us back down the mountain. We never forget the\nexperience but we can’t hang on to the experience.\nWhere is this leading us? As I frequently point out, our New Testament was\nnot written in English but in Greek. It is sometimes instructive to see how the\nPage 3 of 4\nSunday before Lent – Year A – 2017\nTransfiguration\nsame Greek word is used in different parts of the New Testament. Take the\nword that we have translated as ‘transfigure’ in our Gospel reading. The same\nGreek word appears in the letters of Paul. But in each case it refers not to\nJesus, but to us, as the word is translated by our word transformed:\n18And all of us, with unveiled faces, seeing the glory of the Lord as\nthough reflected in a mirror, are being transformed into the same\nimage from one degree of glory to another; for this comes from the\nLord, the Spirit. 2 Cor 3:18\n2Do not be conformed to this world, but be transformed by the\nrenewing of your minds, so that you may discern what is the will of\nGod? what is good and acceptable and perfect. Romans 12:2\nIn other words, in the Gospel it is about what is happening to Jesus: in the\nwritings of Paul it is about what is happening to us as a result of our encounter\nwith Christ.\nAll this is brought together rather nicely in the words of the Hymn ‘Mine eyes\nhave seen the glory of the coming of the Lord’\nIn the beauty of the lilies, Christ was born across the sea,\nWith a glory in his bosom that transfigures you and me.\nAs he died to make men holy, let us live to make men free.\nTo go back to these two threads I was talking about in our Gospel narrative.\nTo try to stay on the mountain with the experience is a way of just staying still,\nof stagnation. To come down from the mountain with the Christ we encounter\nin the experience is the way of transformation, of growth\nNow I think we can return to that question I posed near the beginning:\nPage 4 of 4\nSunday before Lent – Year A – 2017\nTransfiguration\nSo what are we to make of this story of Transfiguration that we read as our\nGospel story? What does it have to say to us as we tackle the issues that we\nface in daily living, what does it have to say to our Confirmation candidates as\nthey explore the faith, what does it have to say to Stuart and Sinead as they\nbring their child for Baptism (later today)?\nIn the course of the service, after the signing of the Cross, Tom will pray over\nSaoirse\nMay almighty God deliver you from the power of darkness,\nRestore in you the image of his glory,\nAnd lead you in the light and obedience of Christ.\nTransfiguration is all about transformation, responding to that voice that came\nout of the cloud on the mountain, ‘This is my son, the beloved, with him I am\nwell pleased, listen to him.’ It is about becoming what God has always\nintended us to be, that we might be living expressions of the blessing that the\nBishop says at the end of the Confirmation Service:\nGo forth into the world in peace;\nbe of good courage;\nhold fast that which is good;\nrender to no one evil for evil;\nstrengthen the fainthearted; support the weak;\nhelp the afflicted; honour everyone;\nlove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand the blessing of God almighty,\nthe Father, the Son, and the Holy Spirit,\nbe among you and remain with you always. Amen."
    }
}