{
    "title": "Journey of Faith and Transfiguration",
    "date": "2014-02-23",
    "blurb": "The sermon explores the speaker's journey from agnosticism to faith, driven by a fascination with the natural world and science. It discusses the concept of 'transfiguration', using the biblical story of Jesus' transfiguration as a metaphor for personal spiritual transformation. The sermon emphasizes the Christian life as a process of becoming more like Jesus, of growing into Christ.",
    "raw_text": "I have always had a fascination with the natural world about me, whether it be just looking into the night sky or at a sunset - or just the order of the physical world as revealed to us through science. It is this, as I have remarked before, that prompted me as I set out on my journey from teenage agnosticism towards faith. I often think back to my late 'A' Level Physics master, Howard Stockley. Howard was a devout Anglican. One afternoon, in the middle of a class, maybe someone has said something flippant, he turned on us and challenged our teenage atheism – don't tell me, he challenged us, that this is all just an accident. He went on to speak of order, of beauty, of purpose. I often look back to that class that afternoon as a turning point in my own spiritual growth, that took me somewhat nervously into my local Parish church.\n\nShortly after this I came to Trinity and it was my privilege to study under Ernest Walton, Nobel Laureate and devout Methodist who had no problem combining a devout Christian faith with a brilliant scientific, enquiring mind. In those early years of my faith journey, I came to sense an \"other\" a deeper reality that lay behind such wonders as the beauty of the night sky, that amazing structure in each cell in my body called DNA that enabled me to grow from the tiniest speck in my mother's womb into this body I now possess. Over the years, I find myself identifying over and over again with the writer of Psalm 8 as he too stands in wonder at the world about him, that the God who brought it all into being should have a care and a concern for him.\n\n> \"When I consider your heavens, the work of your fingers, the moon and stars that you have ordained : What is man that you are mindful of him; the son of man that you should seek him out.\" (Ps 8:4,5)\n\nThese moments of wonder, moments of insight when the eternal breaks through and touches us. In these moments of wonder, we are not just spectators. There is a sense of meeting, of engagement with the God who reveals something of himself in the wonder of his creation.\n\nWith these thoughts of insight, of wonder, of worship, let us just turn to our Gospel passage for this morning - in which we read of that strange episode on the Mount of Transfiguration. To set it in its context, in St Matthew's Gospel this comes immediately after the confession of Jesus as the Messiah and his teaching concerning his coming death and their call to take up their cross and follow him.\n\nThat small inner group of Peter, James and John are given a moment of insight, a glimpse of the deeper reality of Jesus as they beheld something of the glory of Jesus on the mountain top. I recall words that we read from St John at Christmas, \"And the word became flesh and lived among us, and we have seen his glory.\" (John 1:14) Again Peter, James and John were more than just spectators. Whatever happened on that mountain was an experience that touched them deeply; they saw Jesus in a new way, that experience changed them.\n\nThis word \"transfiguration\" set other thoughts in motion. I thought of words from the hymn \"Mine eyes have seen the glory of the coming of the Lord\", in particular verse 2:\n\n> \"In the beauty of the lilies\nChrist was born across the sea,\nwith a glory in his bosom\nthat transfigures you and me.\"\n\nTransfigures, changes at a fundamental level. In the person of Jesus we get a glimpse, an insight of man as God intended him to be. In Jesus, both in the glory of the mountain top and the degradation of the cross, we have a connection through faith between what we are and what we were intended to be. To go back to that first chapter of John's Gospel:\n\n> \"But to all who received him, who believed in his name, he gave power to become children of God.\" (John 1:12)\n\nThe Christian life is a life of transfiguration, a life of transformation, as we realise, by God's grace, our dignity as ones made in the image of God. Over the last few weeks, we have read of the call of the first disciples, we those words of Jesus to Simon Peter when his brother brought him to Jesus, \"You are Simon, son of John. You will be called Cephas.\" (that is Peter) His life from then on was process of turning Simon into Peter; the Simon he was becoming the Peter Jesus called him to be.\n\nThe revised Catechism, as it reflects on the work and nature of the Holy Spirit, says \"the Holy Spirit enables me to become more like Jesus.\" My life as one of becoming more like Jesus, or as Paul would put it, one of growing into Christ. There is a lovely old prayer that has become a favourite of mine over the years:\n\n> \"O Lord Jesus Christ, who didst deign to be made like unto men, the sharer of our sorrows, the companion of our journeys, the light of our ignorance, the remedy of our infirmities: So fill us with thy Spirit and endue us with thy grace that, as thou hast been made like unto us, we may grow more like unto thee.\"",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/1beforelent2014.txt",
        "raw_ocr_content": "Page 1 of 3\nSunday Before Lent – 2014 – Year A\nI have always had a fascination with the natural world about me, whether it be\njust looking into the night sky or at a sunset - or just the order of the physical\nworld as revealed to us through science. It is this, as I have remarked before,\nthat prompted me as I set out on my journey from teenage agnosticism towards\nfaith. I often think back to my late ‘A’ Level Physics master, Howard\nStockley. Howard was a devout Anglican. One afternoon, in the middle of a\nclass, maybe someone has said something flippant, he turned on us and\nchallenged our teenage atheism – don’t tell me, he challenged us, that this is all\njust an accident. He went on to speak of order, of beauty, of purpose. I often\nlook back to that class that afternoon as a turning point in my own spiritual\ngrowth, that took me somewhat nervously into my local Parish church.\nShortly after this I came to Trinity and it was my privilege to study under\nErnest Walton, Nobel Laureate and devout Methodist who had no problem\ncombining a devout Christian faith with a brilliant scientific, enquiring mind.\nIn those early years of my faith journey, I came to sense an \"other\" a deeper\nreality that lay behind such wonders as the beauty of the night sky, that\namazing structure in each cell in my body called DNA that enabled me to\ngrow from the tiniest speck in my mother's womb into this body I now possess.\nOver the years, I find myself identifying over and over again with the writer of\nPsalm 8 as he too stands in wonder at the world about him, that the God who\nbrought it all into being should have a care and a concern for him.\n\"When I consider your heavens, the work of your fingers, the moon and stars\nthat you have ordained : What is man that you are mindful of him; the son of\nman that you should seek him out.\" (Ps 8:4,5)\nThese moments of wonder, moments of insight when the eternal breaks\nthrough and touches us. In these moments of wonder, we are not just\nspectators. There is a sense of meeting, of engagement with the God who\nPage 2 of 3\nSunday Before Lent – 2014 – Year A\nreveals something of himself in the wonder of his creation.\nWith these thoughts of insight, of wonder, of worship, let us just turn to our\nGospel passage for this morning - in which we read of that strange episode on\nthe Mount of Transfiguration. To set it in its context, in St Matthew's Gospel\nthis comes immediately after the confession of Jesus as the Messiah and his\nteaching concerning his coming death and their call to take up their cross and\nfollow him.\nThat small inner group of Peter, James and John are given a moment of insight,\na glimpse of the deeper reality of Jesus as they beheld something of the glory\nof Jesus on the mountain top. I recall words that we read from St John at\nChristmas, \"And the word became flesh and lived among us, and we have seen\nhis glory.\" (John 1:14) Again Peter, James and John were more than just\nspectators. Whatever happened on that mountain was an experience that\ntouched them deeply; they saw Jesus in a new way, that experience changed\nthem.\nThis word \"transfiguration\" set other thoughts in motion. I thought of words\nfrom the hymn \"Mine eyes have seen the glory of the coming of the Lord\", in\nparticular verse 2:\n\"In the beauty of the lilies\nChrist was born across the sea,\nwith a glory in his bosom\nthat transfigures you and me.\"\nTransfigures, changes at a fundamental level. In the person of Jesus we get a\nglimpse, an insight of man as God intended him to be. In Jesus, both in the\nglory of the mountain top and the degradation of the cross, we have a\nPage 3 of 3\nSunday Before Lent – 2014 – Year A\nconnection through faith between what we are and what we were intended to\nbe. To go back to that first chapter of John's Gospel:\n\"But to all who received him, who believed in his name, he gave power to\nbecome children of God.\" (John 1:12)\nThe Christian life is a life of transfiguration, a life of transformation, as we\nrealise, by God's grace, our dignity as ones made in the image of God. Over\nthe last few weeks, we have read of the call of the first disciples, we those\nwords of Jesus to Simon Peter when his brother brought him to Jesus, \"You are\nSimon, son of John. You will be called Cephas.\" (that is Peter) His life from\nthen on was process of turning Simon into Peter; the Simon he was becoming\nthe Peter Jesus called him to be.\nThe revised Catechism, as it reflects on the work and nature of the Holy Spirit,\nsays \"the Holy Spirit enables me to become more like Jesus.\" My life as one of\nbecoming more like Jesus, or as Paul would put it, one of growing into Christ.\nThere is a lovely old prayer that has become a favourite of mine over the years:\n\"O Lord Jesus Christ, who didst deign to be made like unto men, the sharer of\nour sorrows, the companion of our journeys, the light of our ignorance, the\nremedy of our infirmities: So fill us with thy Spirit and endue us with thy\ngrace that, as thou hast been made like unto us, we may grow more like unto\nthee."
    }
}