{
    "title": "Transfiguration and Insight",
    "date": "2021-02-14",
    "blurb": "In this sermon, Kevin explores the concept of transfiguration and how it relates to our understanding of Jesus. He discusses the highs and lows of life and faith, and the role of the Church as the Body of Christ in providing support and hope. He also addresses the impact of the ongoing pandemic and the Church's responsibility to be a beacon of light and hope in society.",
    "raw_text": "Sunday before Lent – 2021 – year B (Transfiguration)\n\nCould I begin by asking you a question? What went through your mind as you read our Gospel passage, Mark’s account of the Transfiguration of Jesus, either before the service or as it was read in the context of this service? For myself, whenever I read passages such as this, or the miracles of feeding or healing, I ask myself, ‘What experience did the disciples have, what experience of Jesus lay behind, this account?’ This is a question we have to ask ourselves whether we take these passages literally or see them as expressing in symbolic form their experience of Jesus as healer, as feeder, as Son of God.\n\nThe narrative itself is set on the top of a mountain, frequently in the scriptures a place of encounter, of revelation – we think of Moses on Sinai, of Elijah on Mount Horeb hearing the still small voice, of the Sermon on the Mount. The words out of the cloud, ‘This is my son …. listen to him.’ recall words spoken from the heavens in the accounts of Jesus’ Baptism. In the vision of Jesus talking with Moses and Elijah, this episode not only looks to the past but also looks forward to his coming passion and death. As I read over this passage a theme that seemed to run through it for me is that of insight, of understanding, of who this Jesus is.\n\nAnd so transfiguration isn’t just something that happens to Jesus, to which the disciples are simply passive observers; this is also something that happens to them. It is on this level of insight, of understanding, that this passage begins to speak to me.\n\nThere are those things can happen in life that cloud our vision. We can get sidetracked, our priorities in life can get skewed to the detriment of other commitments and our own spiritual journey. It could be pressures of work, hobbies which are not bad in themselves as long as they are kept in their proper place in our overall lives and commitments – when that slips there is a skewing of our priorities to the detriment of ourselves and others. But I would go further than that. Particularly in these straightened times sheer worry, worry over ourselves, over those we love can simply weigh us down.\n\nThis past year has been like no other. This pandemic, that has paralysed societies across the globe, which has now gripped our country for a year, has traumatised our society in a way no other crisis has, not even the global financial crash of ten years ago. The programme on RTE this week on the Covid ICU unit in Tallaght University Hospital gave a vivid picture of what this virus has done to individuals, to families, the incredible strain it has placed on members of staff facing this day in and day out.\n\nIt has impacted on our economy. Businesses are left wondering will they ever reopen. Employees are left will they have a job to go back to, will their homes, will their families be secure, Then there is the long term impact on our education system, young people at crucial stages in their lives in limbo. Will there be exams or won’t there, in the meantime staring at screens, trying to study, trying to stay motivated. All through this starved of interactions with friends, that we just took for granted when we were their age.\n\nAt times like this, we lose sight of the goodness of God, lose faith in God, faith in other people, and sometimes even faith in ourselves. What we all need at times like that are beacons, beacons of hope, of life, of love.\n\nThat is the darker side of things. Then there are those moments of insight, that can move us to worship, that can set us on a new direction. Times perhaps in our lives when we feel a real sense of the moment, when things fall into place – this is the person I love, this is the job that is really meant for me. This is the move I should make in my life. Moments also when God seems to break through. It might be in the course of an act of worship when the readings, the music, the prayers just seem to come together in a way that God seems real and close and personal.\n\nWhat I have been talking about are the highs and lows of life, of faith, these moments of blindness, of insight. Are these highs and lows, these moments of insight and blindness simply to be the experience, the plight of the individual? This is where the image of the Church as the Body of Christ has a particular importance in our thinking. We are not just a group of isolated individuals, we are the Body of Christ with a commitment, a care for one another. Here to stand alongside one another, to embrace one another in our hurts and anxieties; just to be there, with one another, for one another. There to shine light into one another’s darkness, to steady stumbling feet when the path is rough or uncertain – to be beacons of hope and light in the darkness and uncertainty of another’s life.\n\nMaybe, as members of the Church, the Body of Christ living and active in the world, that is our vocation, our particular calling at this time.\n\nCalled to be the ones in whom the light of Christ might shine in the lives of those who are struggling at this time, physically, mentally, spiritually.\n\nThe Christian Church has a major role to play in speaking into our national situation at this time in our history. Just as we as individuals are called to be beacons of light and hope in the life of another. The Church in our generation is called to be a beacon of light and hope in the life of our society, to be a voice of truth and integrity in the public place, to be a voice for those who have no voice in our society, those on the margins. To be the voice that says to our society, to those who have the power, who have the wealth, ‘This is my son, my beloved. Listen to him.’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/1bflent2021.txt",
        "raw_ocr_content": "Page 1 of 4\nSunday before Lent – 2021 – year B (Transfiguration)\nCould I begin by asking you a question?\nWhat went through your mind as you read our Gospel passage, Mark’s account\nof the Transfiguration of Jesus, either before the service or as it was read in the\ncontext of this service? For myself, whenever I read passages such as this, or\nthe miracles of feeding or healing, I ask myself, ‘What experience did the\ndisciples have, what experience of Jesus lay behind, this account?’ This is a\nquestion we have to ask ourselves whether we take these passages literally or\nsee them as expressing in symbolic form their experience of Jesus as healer, as\nfeeder, as Son of God.\nThe narrative itself is set on the top of a mountain, frequently in the scriptures a\nplace of encounter, of revelation – we think of Moses on Sinai, of Elijah on\nMount Horeb hearing the still small voice, of the Sermon on the Mount. The\nwords out of the cloud, ‘This is my son …. listen to him.’ recall words spoken\nfrom the heavens in the accounts of Jesus’ Baptism. In the vision of Jesus\ntalking with Moses and Elijah, this episode not only looks to the past but also\nlooks forward to his coming passion and death. As I read over this passage a\ntheme that seemed to run through it for me is that of insight, of understanding,\nof who this Jesus is.\nAnd so transfiguration isn’t just something that happens to Jesus, to which the\ndisciples are simply passive observers; this is also something that happens to\nthem. It is on this level of insight, of understanding, that this passage begins to\nspeak to me.\nPage 2 of 4\nSunday before Lent – 2021 – year B (Transfiguration)\nThere are those things can happen in life that cloud our vision. We can get side\ntracked, our priorities in life can get skewed to the detriment of other\ncommitments and our own spiritual journey. It could be pressures of work,\nhobbies which are not bad in themselves as long as they are kept in their proper\nplace in our overall lives and commitments – when that slips there is a skewing\nof our priorities to the detriment of ourselves and others. But I would go\nfurther than that. Particularly in these straightened times sheer worry, worry\nover ourselves, over those we love can simply weigh us down.\nThis past year has been like no other. This pandemic, that has paralysed\nsocieties across the globe, which has now gripped our country for a year, has\ntraumatised our society in a way no other crisis has, not even the global\nfinancial crash of ten years ago. The programme on RTE this week on the\nCovid ICU unit in Tallaght University Hospital gave a vivid picture of what\nthis virus has done to individuals, to families, the incredible strain it has placed\non members of staff facing this day in and day out.\nIt has impacted on our economy. Businesses are left wondering will they ever\nreopen. Employees are left will they have a job to go back to, will their homes,\nwill their families be secure, Then there is the long term impact on our\neducation system, young people at crucial stages in their lives in limbo. Will\nthere be exams or won’t there, in the meantime staring at screens, trying to\nstudy, trying to stay motivated. All through this starved of interactions with\nfriends, that we just took for granted when we were their age.\nPage 3 of 4\nSunday before Lent – 2021 – year B (Transfiguration)\nAt times like this, we lose sight of the goodness of God, lose faith in God, faith\nin other people, and sometimes even faith in ourselves. What we all need at\ntimes like that are beacons, beacons of hope, of life, of love.\nThat is the darker side of things. Then there are those moments of insight, that\ncan move us to worship, that can set us on a new direction. Times perhaps in\nour lives when we feel a real sense of the moment, when things fall into place –\nthis is the person I love, this is the job that is really meant for me. This is the\nmove I should make in my life. Moments also when God seems to break\nthrough. It might be in the course of an act of worship when the readings, the\nmusic, the prayers just seem to come together in a way that God seems real and\nclose and personal.\nWhat I have been talking about are the highs and lows of life, of faith, these\nmoments of blindness, of insight. Are these highs and lows, these moments of\ninsight and blindness simply to be the experience, the plight of the individual?\nThis is where the image of the Church as the Body of Christ has a particular\nimportance in our thinking. We are not just a group of isolated individuals, we\nare the Body of Christ with a commitment, a care for one another. Here to\nstand alongside one another, to embrace one another in our hurts and anxieties;\njust to be there, with one another, for one another. There to shine light into one\nanother’s darkness, to steady stumbling feet when the path is rough or\nuncertain – to be beacons of hope and light in the darkness and uncertainty of\nanother’s life.\nPage 4 of 4\nSunday before Lent – 2021 – year B (Transfiguration)\nMaybe, as members of the Church, the Body of Christ living and active in the\nworld, that is our vocation, our particular calling at this time.\nCalled to be the ones in whom the light of Christ might shine in the lives of\nthose who are struggling at this time, physically, mentally, spiritually.\nThe Christian Church has a major role to play in speaking into our national\nsituation at this time in our history. Just as we as individuals are called to be\nbeacons of light and hope in the life of another. The Church in our generation\nis called to be a beacon of light and hope in the life of our society, to be a voice\nof truth and integrity in the public place, to be a voice for those who have no\nvoice in our society, those on the margins. To be the voice that says to our\nsociety, to those who have the power, who have the wealth, ‘This is my son,\nmy beloved. Listen to him.’"
    }
}