{
    "title": "Seeking Truth Amidst Chaos",
    "date": "2019-11-24",
    "blurb": "In this sermon, Kevin discusses the importance of discerning truth amidst the chaos of political campaigns and social media. Drawing parallels between the 1st century Jerusalem and the 21st century, he emphasizes the need for critical thinking, educating our conscience, and standing firm for truth. He also highlights the role of the Church in testifying to the truth and addressing issues of justice and reconciliation.",
    "raw_text": "2nd Sunday before Advent – Year C – 2019\n\n‘And Jesus said, ‘Beware you are not lead astray’.’ Luke 21:8.\n\nOver in Britain they are now in the midst of a General Election Campaign. In the United States, quite apart from attempts to impeach the President, they too are gearing up for their elections this time next year. The outcomes of both of those campaigns are likely to have ramifications for years to come and an impact beyond the national boundaries of either of these countries.\n\nThese campaigns are going to be hard fought, which could be seen as code for bitter and ill tempered. The electorate is already being bombarded with promises and half-promises, truths and half truths and down right lies, be they in the form of distorted facts, distorted videos or whatever.\n\nIt was said by an American Senator as World War I drew to a close, that the first casualty of war is truth. With the advent of social media platforms, and the ability they give the combatants to completely bypass traditional media platforms; all this has had its impact on modern warfare and the reporting of modern warfare. Terrorist attacks, such as that on the Mosque in New Zealand, can be broadcast live on platforms such as Facebook. Extremist groups, be they far right or far left, can post racist, sectarian, homophobic, islamaphobic material unchallenged – and as a consequence innocents can, and indeed have, suffered.\n\nIn our Gospel reading, we find Jesus and the disciples in Jerusalem. At that time Jerusalem was awash with expectation, with rumours. Periodically Messianic figures appeared with promises of God’s immediate return, the overthrow of the Roman oppressor and the establishment of God’s Kingdom on earth.\n\n‘And Jesus said, ‘Beware you are not lead astray’.’\n\nWhether we are talking about 1st century Jerusalem and its Messianic speculation or 21st century political campaigns, both raise issues of truth, discernment of truth and the importance of standing firm for truth.\n\nIn John’s Gospel we read, as Jesus stood before Pilate, as the mob outside demanded his death, as Pilate sought to understand who was this strange character brought before him, he asks\n\n“So you are a king?” Jesus answered, “You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.” Pilate asked him, “What is truth?” John 18:37,38\n\nWhat is truth? That is a question not just for a cynical Roman governor, it is a question for all time. It is a question for us. What is truth? How do we separate truth from rumour, from inuendo, from falsehood, from deceit?\n\nI suppose first of all, we need to be prepared to think for ourselves. We place a great emphasis on conscience, on freedom of conscience. But conscience is more than just gut reaction, more than just what my friends think. We have a duty to educate our conscience in reading, in reflection, in prayer. I often go back to a definition of prayer given to me when I was starting out in ministry by the late Billy Wynne, one time Vicar of St Ann’s in Dublin, founder of Samaritans in Ireland. ‘I’ve more and more come to see prayer in terms of thinking things through before God.’\n\nAs I thought on that this week, I found myself, as I do more and more these days, going to the Psalms, and references to truth.\n\nLead me in your truth, and teach me,\nfor you are the God of my salvation;\nfor you I wait all day long. Psalm 25.5\n\nYou desire truth in the inward being;\ntherefore teach me wisdom in my secret heart. Ps 51:6\n\nTeach me your way, O Lord,\nthat I may walk in your truth;\ngive me an undivided heart to revere your name. Ps 86:11\n\nIn the Psalms I encounter a God who accompanies me through life; with me as I wrestle with problems, with me as I make mistakes in my judgement, calling me back to his side. This is reflected in Jesus’ promise to his disciples in the Upper Room on the night before he died. They will not be cast adrift, they will not be alone.\n\nAnd I will ask the Father, and he will give you another Advocate, to be with you forever. This is the Spirit of truth, whom the world cannot receive, because it neither sees him nor knows him. You know him, because he abides with you, and he will be in you. John 14:16,17\n\nWhat is truth? We have thought of the importance of taking the trouble to think for ourselves; the importance of conscience, of educating our conscience, of thinking things through before God. With this process of search, which by definition is an ongoing process, comes a necessary humility. I seek the truth but I do not pretend to fully grasp the truth. So my convictions, even my strongest convictions, are expressed with humility.\n\nOf course the place of truth, of standing up for truth is not always a comfortable place to be. Going back to Jesus before Pilate.\n\n“You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.”\n\nThis is the vocation of the Church, the Body of Christ, to testify to the truth, to speak truth to power, to vested interests, to public opinion. It is not the role of the Church to get involved in politics, but it is the role of the Church to speak to politics, to address issues of justice, of reconciliation in our society. As Christians, as members of the body politic, we play our part in seeking truth, thinking through issues in the light of our Christian conviction and participating as citizens and as Christians in the political process.\n\nTo go back to the Psalms:\n\nTeach me your way, O Lord,\nthat I may walk in your truth; Ps 86:11",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/2bfadvent2019.txt",
        "raw_ocr_content": "Page 1 of 4\n2nd Sunday before Advent – Year C – 2019\n‘And Jesus said, ‘Beware you are not lead astray’.’ Luke 21:8.\nOver in Britain they are now in the midst of a General Election Campaign. In\nthe United States, quite apart from attempts to impeach the President, they too\nare gearing up for their elections this time next year. The outcomes of both of\nthose campaigns are likely to have ramifications for years to come and an\nimpact beyond the national boundaries of either of these countries.\nThese campaigns are going to be hard fought, which could be seen as code for\nbitter and ill tempered. The electorate is already being bombarded with\npromises and half-promises, truths and half truths and down right lies, be they\nin the form of distorted facts, distorted videos or whatever.\nIt was said by an American Senator as World War I drew to a close, that the\nfirst casualty of war is truth. With the advent of social media platforms, and\nthe ability they give the combatants to completely bypass traditional media\nplatforms; all this has had its impact on modern warfare and the reporting of\nmodern warfare. Terrorist attacks, such as that on the Mosque in New Zealand,\ncan be broadcast live on platforms such as Facebook. Extremist groups, be\nthey far right or far left, can post racist, sectarian, homophobic, islamaphobic\nmaterial unchallenged – and as a consequence innocents can, and indeed have,\nsuffered.\nIn our Gospel reading, we find Jesus and the disciples in Jerusalem. At that\ntime Jerusalem was awash with expectation, with rumours. Periodically\nMessianic figures appeared with promises of God’s immediate return, the\nPage 2 of 4\n2nd Sunday before Advent – Year C – 2019\noverthrow of the Roman oppressor and the establishment of God’s Kingdom\non earth.\n‘And Jesus said, ‘Beware you are not lead astray’.’\nWhether we are talking about 1st century Jerusalem and its Messianic\nspeculation or 21st century political campaigns, both raise issues of truth,\ndiscernment of truth and the importance of standing firm for truth.\nIn John’s Gospel we read, as Jesus stood before Pilate, as the mob outside\ndemanded his death, as Pilate sought to understand who was this strange\ncharacter brought before him, he asks\n“So you are a king?” Jesus answered, “You say that I am a king. For\nthis I was born, and for this I came into the world, to testify to the\ntruth. Everyone who belongs to the truth listens to my voice.” Pilate\nasked him, “What is truth?” John 18:37,38\nWhat is truth? That is a question not just for a cynical Roman governor, it is a\nquestion for all time. It is a question for us. What is truth? How do we\nseparate truth from rumour, from inuendo, from falsehood, from deceit?\nI suppose first of all, we need to be prepared to think for ourselves. We place a\ngreat emphasis on conscience, on freedom of conscience. But conscience is\nmore than just gut reaction, more than just what my friends think. We have a\nduty to educate our conscience in reading, in reflection, in prayer. I often go\nback to a definition of prayer given to me when I was starting out in ministry\nby the late Billy Wynne, one time Vicar of St Ann’s in Dublin, founder of\nPage 3 of 4\n2nd Sunday before Advent – Year C – 2019\nSamaritans in Ireland. ‘I’ve more and more come to see prayer in terms of\nthinking things through before God.’\nAs I thought on that this week, I found myself, as I do more and more these\ndays, going to the Psalms, and references to truth.\nLead me in your truth, and teach me,\nfor you are the God of my salvation;\nfor you I wait all day long. Psalm 25.5\nYou desire truth in the inward being;\ntherefore teach me wisdom in my secret heart. Ps 51:6\nTeach me your way, O Lord,\nthat I may walk in your truth;\ngive me an undivided heart to revere your name. Ps 86:11\nIn the Psalms I encounter a God who accompanies me through life; with me as\nI wrestle with problems, with me as I make mistakes in my judgement, calling\nme back to his side. This is reflected in Jesus’ promise to his disciples in the\nUpper Room on the night before he died. They will not be cast adrift, they will\nnot be alone.\nAnd I will ask the Father, and he will give you another Advocate, to\nbe with you forever. This is the Spirit of truth, whom the world cannot\nreceive, because it neither sees him nor knows him. You know him,\nbecause he abides with you, and he will be in you. John 14:16,17\nWhat is truth? We have thought of the importance of taking the trouble to think\nfor ourselves; the importance of conscience, of educating our conscience, of\nthinking things through before God. With this process of search, which by\ndefinition is an ongoing process, comes a necessary humility. I seek the truth\nbut I do not pretend to fully grasp the truth. So my convictions, even my\nstrongest convictions, are expressed with humility.\nPage 4 of 4\n2nd Sunday before Advent – Year C – 2019\nOf course the place of truth, of standing up for truth is not always a\ncomfortable place to be. Going back to Jesus before Pilate.\n“You say that I am a king. For this I was born, and for this I came into\nthe world, to testify to the truth. Everyone who belongs to the truth\nlistens to my voice.”\nThis is the vocation of the Church, the Body of Christ, to testify to the truth, to\nspeak truth to power, to vested interests, to public opinion. It is not the role of\nthe Church to get involved in politics, but it is the role of the Church to speak\nto politics, to address issues of justice, of reconciliation in our society. As\nChristians, as members of the body politic, we play our part in seeking truth,\nthinking through issues in the light of our Christian conviction and\nparticipating as citizens and as Christians in the political process.\nTo go back to the Psalms:\nTeach me your way, O Lord,\nthat I may walk in your truth; Ps 86:11"
    }
}