{
    "title": "Creation's Purpose",
    "date": "2021-02-07",
    "blurb": "In this sermon, Kevin explores the theme of creation and its purpose. He recalls how his journey to faith began in physics classes, where he pondered the order and purpose in the universe. He discusses the teachings of French theologian, Teilhard de Chardin, and the Apostle Paul, both of whom saw a progression and purpose in creation. Kevin emphasizes that our care for the world and for each other are integral parts of our worship and response to God's love.",
    "raw_text": "As I read over the lessons appointed for this Second Sunday before Lent, with a theme of creation running through them, my mind went back to my school days, and my 'A' level Physics master, Howard Stockley. People are often surprised when I say that my journey to faith began in Howard’s physics classes. I recall one particular afternoon, Howard had been talking about gravity, the part it plays in the ordered movements of the planets around the sun, the movement of stars in the galaxies. Howard, a devout Christian, suddenly stopped and looked around us and said; 'And don’t tell me that this is all a bloody accident!' Like most of my fellow classmates, I had at that time showed no interest in faith. I look back to that afternoon, a time when Howard got me thinking about the idea of creation having a purpose, a direction.\n\nThe French theologian, Teilhard de Chardin, looking at the created world, saw a process of progression in the created order from individual atoms, to crystalline structures, to single cell life forms, to multicellular ones, on into the animal kingdom through to man himself. He talks of these various stages as creation 'groping' towards a fulfilment.\n\nPaul, in his letter to the Church at Rome, speaks of creation groaning:\n\n> For the creation waits with eager longing for the revealing of the children of God; for the creation was subjected to futility, not of its own will but by the will of the one who subjected it, in hope that the creation itself will be set free from its bondage to decay and will obtain the freedom of the glory of the children of God. We know that the whole creation has been groaning in labour pains until now; and not only the creation, but we ourselves, who have the first fruits of the Spirit, groan inwardly while we wait for adoption, the redemption of our bodies. Romans 8:19-23\n\nAs with Chardin’s 'groping' there is in this image of creation groaning, of labour pains culminating in childbirth, this same sense of direction, of purpose of movement towards a fulfilment.\n\nFrom very early on in my spiritual journey, as I held together my newfound faith and my love of physics, which persists to this day, I have thought a lot around the words of Psalm 8:\n\n> 4 When I consider your heavens, the work of your fingers, the moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; the son of man, that you should seek him out?\n\nWhat is man, that you should be mindful of him? Where do I, where does humanity fit into the greater scheme of things?\n\nI begin to see an answer in words that we read in our lesson from Paul’s letter to the Colossians, as he speaks of Christ:\n\n> 16for in him all things in heaven and on earth were created, things visible and invisible, whether thrones or dominions or rulers or powers – all things have been created through him and for him. Col 1:16\n\nGod’s purposes extend beyond me, beyond my own personal redemption.\n\n> 20and through him God was pleased to reconcile to himself all things, whether on earth or in heaven, by making peace through the blood of his cross. Col 1:20\n\nAll God’s purposes of creation reach their fulfilment in the person of Jesus. His life, death and resurrection have significance not just for me, but for all humanity, for all creation.\n\nThis means that this created world, this planet on which we live, in all its beauty, its complexity, its fragility is precious in God’s sight. As we read in Genesis, 'God saw all that he had made and it was very good.' It follows that our care for this world, for the environment is not an optional extra to my Christian profession but part and parcel of my worship, part and parcel of my response to God’s love for me in Christ.\n\nFurthermore, as ones made in the image of God, we are challenged to recognise the image of God in my fellow man. Not just in those who are like me, but in the one who is different; different class, different creed, culture, nationality; in the one who is awkward, the one who is difficult.\n\nThis means that issues of justice, of reconciliation are again to be part and parcel of my worship, my service of God, part and parcel of my response to God’s love for me in Christ.\n\nAs my late Physics master, Howard Stockley, reminded that group of slightly cynical teenagers one afternoon, this wonderful world in which we live is not a 'bloody accident'. In this world we behold his glory in all that he has made, and in his son, we encounter his love and discover his purpose for us and for all mankind.\n\nIn the words of the General Thanksgiving in the Book of Common Prayer:\n\n> Almighty God, Father of all mercies, we your unworthy servants give you humble thanks for all your goodness and loving-kindness to us and to all whom you have made. We bless you for our creation, preservation, and all the blessings of this life; but above all for your immeasurable love in the redemption of the world by our Lord Jesus Christ; for the means of grace, and for the hope of glory. And, we pray, give us such an awareness of your mercies, that with truly thankful hearts we may show forth your praise, not only with our lips, but in our lives, by giving up ourselves to your service, and by walking before you in holiness and righteousness all our days; through Jesus Christ our Lord, to whom, with you and the Holy Spirit, be honour and glory throughout all ages. Amen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/2bflent2021.txt",
        "raw_ocr_content": "Page 1 of 4\n2nd Sunday before Lent – Year B – 2021\nAs I read over the lessons appointed for this Second Sunday before Lent, with a\ntheme of creation running through them, my mind went back to my school days,\nand my ‘A’ level Physics master, Howard Stockley. People are often surprised\nwhen I say that my journey to faith began in Howard’s physics classes. I recall one\nparticular afternoon, Howard had been talking about gravity, the part it plays in the\nordered movements of the planets around the sun, the movement of stars in the\ngalaxies. Howard, a devout Christian, suddenly stopped and looked around us and\nsaid; ‘And don’t tell me that this is all a bloody accident!’ Like most of my fellow\nclassmates, I had at that time showed no interest in faith. I look back to that\nafternoon, a time when Howard got me thinking about the idea of creation having a\npurpose, a direction.\nThe French theologian, Teilhard de Chardin, looking at the created world, saw a\nprocess of progression in the created order from individual atoms, to crystalline\nstructures, to single cell life forms, to multicellular ones, on into the animal\nkingdom through to man himself. He talks of these various stages as creation\n‘groping’ towards a fulfilment.\nPaul, in his letter to the Church at Rome, speaks of creation groaning:\nFor the creation waits with eager longing for the revealing of the children\nof God; for the creation was subjected to futility, not of its own will but by\nthe will of the one who subjected it, in hope that the creation itself will be\nset free from its bondage to decay and will obtain the freedom of the glory\nof the children of God. We know that the whole creation has been groaning\nin labour pains until now; and not only the creation, but we ourselves, who\nhave the first fruits of the Spirit, groan inwardly while we wait for\nadoption, the redemption of our bodies. Romans 8:19-23\nPage 2 of 4\n2nd Sunday before Lent – Year B – 2021\nAs with Chardin’s ‘groping’ there is in this image of creation groaning, of labour\npains culminating in childbirth, this same sense of direction, of purpose of\nmovement towards a fulfilment.\nFrom very early on in my spiritual journey, as I held together my newfound faith\nand my love of physics, which persists to this day, I have thought a lot around the\nwords of Psalm 8:\n4 When I consider your heavens, the work of your fingers, ♦\nthe moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; ♦\nthe son of man, that you should seek him out?\nWhat is man, that you should be mindful of him? Where do I, where does\nhumanity fit into the greater scheme of things?\nI begin to see an answer in words that we read in our lesson from Paul’s letter to the\nColossians, as he speaks of Christ:\n16for in him all things in heaven and on earth were created, things visible\nand invisible, whether thrones or dominions or rulers or powers – all things\nhave been created through him and for him. Col 1:16\nGod’s purposes extend beyond me, beyond my own personal redemption.\n20and through him God was pleased to reconcile to himself all things,\nwhether on earth or in heaven, by making peace through the blood of his\ncross. Col 1:20\nAll God’s purposes of creation reach their fulfilment in the person of Jesus. His\nlife, death and resurrection have significance not just for me, but for all humanity,\nfor all creation.\nPage 3 of 4\n2nd Sunday before Lent – Year B – 2021\nThis means that this created world, this planet on which we live, in all its beauty, its\ncomplexity, its fragility is precious in God’s sight. As we read in Genesis, ‘God\nsaw all that he had made and it was very good.’ It follows that our care for this\nworld, for the environment is not an optional extra to my Christian profession but\npart and parcel of my worship, part and parcel of my response to God’s love for me\nin Christ.\nFurthermore, as ones made in the image of God, we are challenged to recognise the\nimage of God in my fellow man. Not just in those who are like me, but in the one\nwho is different; different class, different creed, culture, nationality; in the one who\nis awkward, the one who is difficult.\nThis means that issues of justice, of reconciliation are again to be part and parcel of\nmy worship, my service of God, part and parcel of my response to God’s love for\nme in Christ.\nAs my late Physics master, Howard Stockley, reminded that group of slightly\ncynical teenagers one afternoon, this wonderful world in which we live is not a\n‘bloody accident’. In this world we behold his glory in all that he has made, and in\nhis son, we encounter his love and discover his purpose for us and for all mankind.\nIn the words of the General Thanksgiving in the Book of Common Prayer:\nAlmighty God, Father of all mercies, we your unworthy servants give you\nhumble thanks for all your goodness and loving-kindness to us and to all\nwhom you have made. We bless you for our creation, preservation, and all\nthe blessings of this life; but above all for your immeasurable love in the\nredemption of the world by our Lord Jesus Christ; for the means of grace,\nand for the hope of glory. And, we pray, give us such an awareness of your\nmercies, that with truly thankful hearts we may show forth your praise, not\nonly with our lips, but in our lives, by giving up ourselves to your service,\nand by walking before you in holiness and righteousness all our days;\nPage 4 of 4\n2nd Sunday before Lent – Year B – 2021\nthrough Jesus Christ our Lord, to whom, with you and the Holy Spirit, be\nhonour and glory throughout all ages. Amen."
    }
}