{
    "title": "Values and Vision",
    "date": "2010-11-14",
    "blurb": "In this sermon, Kevin discusses the importance of understanding our values as a faith community, which are greatly influenced by our perception of God. He explores the correlation between a person's social and theological attitudes and their perception of God. He also uses the story from Victor Hugo's 'Les Miserables' to illustrate the values of forgiveness and redemption.",
    "raw_text": "Last Sunday, when Paul Hoey of Church 21, the Church of Ireland Parish Development programme, was with us, he was challenging us to reflect on how we see ourselves as a Church. As he reflected on Jesus’ washing of his disciples’ feet, he focussed on a vocation of service, ourselves as a servant community, serving Christ, serving others in the name of Christ.\n\nIn the course of his sermon and in conversation with a group after the service, he spoke of the need for a church, a community to develop a vision for itself. But before that we need a clear understanding of our values as a community. Vision, values – these can all too easily remain as fairly nebulous terms. During the week I was turning over in my mind what do we understand by ‘values’.\n\nAs I looked over the Lessons appointed for today and in particular the portion ‘Song of Isaiah’ appointed for use instead of a Psalm, I was struck by the words:\n\n> God is my salvation\n> God is my strength.\n\nThat set me thinking, ‘What picture do I have of God?’\n\nFor the values we adopt as a faith community are very much determined by our understanding of the God in whom we believe. Looking back over the very varied places I have served in my time in ministry, I have seen a wide a wide range of Church communities both inside and outside the Church of Ireland. I would see a fairly strong correlation between a person’s social and theological attitudes and their perception, their picture of God. A person with very judgemental attitudes towards others would generally have a fairly austere view of God. God as judge, the wrath of God would figure more strongly in their thinking than the love of God and God as one who welcomes the outcast.\n\nBy the same token those with laissez faire attitudes on social and theological issues would not be as comfortable with the idea of God as holy and the sovereignty, the majesty of God.\n\nAs a casual exercise I put the words ‘God is’ into the search engine of my computer Bible. It was a fairly crude exercise but not withstanding that it was interesting to see what came up.\n\nThere was a very strong sense of God present with his people, of Covenant, of a God who is committed to his people. But alongside that there was also a very strong sense of God as wholly other, as holy, of the majesty of God and, yes, the judgement of God.\n\nApproaching as we are the season of Advent and Christmas we are presented with another picture of God in the person of Christ. I often find myself reflecting on words of Bishop David Jenkins, who, when he was Bishop of Durham, got himself involved in a lot of controversy – on occasion it has to be said on the basis of tabloid misrepresentation of Bishop Jenkins’ statements. Speaking of the Incarnation he spoke of Jesus as ‘the face of God towards us’\n\nPut that statement alongside the description of the Church as ‘The Body of Christ’, and our vocation to show Christ to the world in all that we are as individuals and as a community.\n\nIf we stay with Bishop Jenkins’ descriptions of Jesus as ‘the face of God towards us’, it begs the question ‘what face of God am I showing to the world?’ This is where my core beliefs - what is my picture, what is my perception of God – will actually be reflected in the values we adopt as individuals and as a Christian community.\n\nAgain this can stay at a fairly nebulous level – it is good to explore a concrete example. In this regard, just a Jesus made some of his most telling points through story, through parable, literature and film can give us much food for thought. During the week I came across a story I first heard some thirty years ago. It comes from the start of Victor Hogo’s novel, ‘Les Miserables’\n\nThe story starts in 1815 in Digne. The peasant Jean Valjean has just been released from imprisonment in the Bagne of Toulon after nineteen years - five for stealing bread for his starving sister and her family, and fourteen more for numerous escape attempts. Upon being released, he is required to carry a yellow passport that marks him as a convict, despite having already paid his debt to society by serving his time in jail. Rejected by innkeepers, who do not want to take in a convict, Valjean sleeps on the street. This makes him even angrier and more bitter. However, the benevolent Bishop Myriel, the Bishop of Digne, takes him in and gives him shelter. In the middle of the night, he steals the bishop’s silverware and runs. He is caught, but the bishop rescues him by claiming that the silverware was a gift and at that point gives him his two silver candlesticks as well, chastising him to the police for leaving in such a rush that he forgot these most valuable pieces. After the police have left the bishop then \"reminds\" him of the promise, which Valjean has no recollection of making, to use the silver to make an honest man of himself. In the film made of this story, as Jean Valjean stands before the Bishop totally confused by what the Bishop has done and why the he has done this the Bishop tells him, ‘Jean Valjean I have redeemed you from evil and hatred and I have given you back to God.’\n\nWhat are the values that are brought out in this story? What picture of God was presented by the Bishop in the garden that day? They are the values, are they not, of he who said to the woman taken in adultery, ‘Go and sin no more.’; of he who prayed for those who crucified him, ‘Father forgive them, they do not know what they are doing.’; of him who taught in the parable of the sheep and the goats:\n\n> I was hungry and you fed me, I was thirsty and you gave me a drink, I was homeless and you gave me a room, I was shivering and you gave me clothes, I was sick and you stopped to visit, I was in prison and you came to me.’ Matt 25:35\n\nBishop David Jenkins spoke of Jesus as the ‘face of God towards us’. What is my core picture, my fundamental understanding of God? That is what will lie at the heart of my values. As members of the Body of Christ, what face of God will we present to the world this coming week in our homes, our neighbourhood, our places of work and recreation?\n\nI will just finish with the words of a prayer found near the body of a dead child in Ravensbrook Concentration Camp 1945\n\n> O Lord, remember not only the men and women of good will, but also those of ill will. But do not remember all the sufferings they have inflicted on us; remember the fruits we have bought, thanks to this suffering; our comradeship, our humility, our courage, our generosity, the greatness of heart which has grown out of all this; and when they come to judgement let all the fruits we have born be their forgiveness.\n\nIn that simple prayer I am taught that no one, no one is beyond the redemptive, transforming love of the God and Father of our Lord Jesus Christ. May we be empowered to be channels of that love in the world of today.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/2nd beforeadvent2010.txt",
        "raw_ocr_content": "Page 1 of 4\n2nd Sunday before Advent – Year C – 2010\nLast Sunday, when Paul Hoey of Church 21, the Church of Ireland Parish Development\nprogramme, was with us, he was challenging us to reflect on how we see ourselves as a\nChurch. As he reflected on Jesus’ washing of his disciples’ feet, he focussed on a vocation\nof service, ourselves as a servant community, serving Christ, serving others in the name of\nChrist.\nIn the course of his sermon and in conversation with a group after the service, he spoke of\nthe need for a church, a community to develop a vision for itself. But before that we need\na clear understanding of our values as a community. Vision, values – these can all too\neasily remain as fairly nebulous terms. During the week I was turning over in my mind\nwhat do we understand by ‘values’.\nAs I looked over the Lessons appointed for today and in particular the portion ‘Song of\nIsaiah’ appointed for use instead of a Psalm, I was struck by the words:\nGod is my salvation\nGod is my strength.\nThat set me thinking, ‘What picture do I have of God?’\nFor the values we adopt as a faith community are very much determined by our\nunderstanding of the God in whom we believe. Looking back over the very varied places I\nhave served in my time in ministry, I have seen a wide a wide range of Church\ncommunities both inside and outside the Church of Ireland. I would see a fairly strong\ncorrelation between a person’s social and theological attitudes and their perception, their\npicture of God. A person with very judgemental attitudes towards others would generally\nhave a fairly austere view of God. God as judge, the wrath of God would figure more\nstrongly in their thinking than the love of God and God as one who welcomes the outcast.\nBy the same token those with laissez faire attitudes on social and theological issues would\nnot be as comfortable with the idea of God as holy and the sovereignty, the majesty of\nGod.\nPage 2 of 4\n2nd Sunday before Advent – Year C – 2010\nAs a casual exercise I put the words ‘God is’ into the search engine of my computer Bible.\nIt was a fairly crude exercise but not withstanding that it was interesting to see what came\nup.\nThere was a very strong sense of God present with his people, of Covenant, of a God who\nis committed to his people. But alongside that there was also a very strong sense of God\nas wholly other, as holy, of the majesty of God and, yes, the judgement of God.\nApproaching as we are the season of Advent and Christmas we are presented with another\npicture of God in the person of Christ. I often find myself reflecting on words of Bishop\nDavid Jenkins, who, when he was Bishop of Durham, got himself involved in a lot of\ncontroversy – on occasion it has to be said on the basis of tabloid misrepresentation of\nBishop Jenkins’ statements. Speaking of the Incarnation he spoke of Jesus as ‘the face of\nGod towards us’\nPut that statement alongside the description of the Church as ‘The Body of Christ’, and our\nvocation to show Christ to the world in all that we are as individuals and as a community.\nIf we stay with Bishop Jenkins’ descriptions of Jesus as ‘the face of God towards us’, it\nbegs the question ‘what face of God am I showing to the world?’ This is where my core\nbeliefs - what is my picture, what is my perception of God – will actually be reflected in\nthe values we adopt as individuals and as a Christian community.\nAgain this can stay at a fairly nebulous level – it is good to explore a concrete example. In\nthis regard, just a Jesus made some of his most telling points through story, through\nparable, literature and film can give us much food for thought. During the week I came\nacross a story I first heard some thirty years ago. It comes from the start of Victor Hogo’s\nnovel, ‘Les Miserables’\nThe story starts in 1815 in Digne. The peasant Jean Valjean has just been released from\nimprisonment in the Bagne of Toulon after nineteen years - five for stealing bread for his\nstarving sister and her family, and fourteen more for numerous escape attempts. Upon\nbeing released, he is required to carry a yellow passport that marks him as a convict,\nPage 3 of 4\n2nd Sunday before Advent – Year C – 2010\ndespite having already paid his debt to society by serving his time in jail. Rejected by\ninnkeepers, who do not want to take in a convict, Valjean sleeps on the street. This makes\nhim even angrier and more bitter. However, the benevolent Bishop Myriel, the Bishop\nof Digne, takes him in and gives him shelter. (Film clip at 11:00) In the middle of the\nnight, he steals the bishop’s silverware and runs. He is caught, but the bishop rescues him\nby claiming that the silverware was a gift and at that point gives him his two silver\ncandlesticks as well, chastising him to the police for leaving in such a rush that he forgot\nthese most valuable pieces. After the police have left the bishop then \"reminds\" him of the\npromise, which Valjean has no recollection of making, to use the silver to make an honest\nman of himself. In the film made of this story, as Jean Valjean stands before the Bishop\ntotally confused by what the Bishop has done and why the he has done this the Bishop\ntells him, ‘Jean Valjean I have redeemed you from evil and hatred and I have given you\nback to God.’\nWhat are the values that are brought out in this story? What picture of God was presented\nby the Bishop in the garden that day? They are the values, are they not, of he who said to\nthe woman taken in adultery, ‘Go and sin no more.’; of he who prayed for those who\ncrucified him, ‘Father forgive them, they do not know what they are doing.’; of him who\ntaught in the parable of the sheep and the goats:\nI was hungry and you fed me, I was thirsty and you gave me a drink, I\nwas homeless and you gave me a room, I was shivering and you gave\nme clothes, I was sick and you stopped to visit, I was in prison and you\ncame to me.’ Matt 25:35\nBishop David Jenkins spoke of Jesus as the ‘face of God towards us’. What is my core\npicture, my fundamental understanding of God? That is what will lie at the heart of my\nvalues. As members of the Body of Christ, what face of God will we present to the world\nthis coming week in our homes, our neighbourhood, our places of work and recreation?\nI will just finish with the words of a prayer found near the body of a\ndead child in Ravensbrook Concentration Camp 1945\nPage 4 of 4\n2nd Sunday before Advent – Year C – 2010\nO Lord, remember not only the men and women of good will, but also\nthose of ill will. But do not remember all the sufferings they have\ninflicted on us; remember the fruits we have bought, thanks to this\nsuffering; our comradeship, our humility, our courage, our generosity,\nthe greatness of heart which has grown out of all this; and when they\ncome to judgement let all the fruits we have born be their forgiveness.\nIn that simple prayer I am taught that no one, no one is beyond the redemptive,\ntransforming love of the God and Father of our Lord Jesus Christ. May we be empowered\nto be channels of that love in the world of today."
    }
}