{
    "title": "Power of Forgiveness",
    "date": "2017-04-23",
    "blurb": "The sermon discusses the power of forgiveness and the ability to let go of resentments. It emphasizes the teachings of Jesus, who encouraged forgiveness and discouraged holding onto grievances. The sermon also touches on the importance of self-forgiveness and the healing power of Christ's love.",
    "raw_text": "Second Sunday of Easter – Year A – 2017\n\nJesus came and stood among them and said, “Peace be with you!” After he said this, he showed them his hands and side. The disciples were overjoyed when they saw the Lord. Again Jesus said, “Peace be with you! As the Father has sent me, I am sending you.” And with that he breathed on them and said, “Receive the Holy Spirit. If you forgive anyone his sins, they are forgiven; if you do not forgive them, they are not forgiven.”\n\nWhenever you hear those words read out in Church what word comes to your mind? The word that comes to my mind is that of power. It is a power that Churchmen have used down the years to bolster their position, their authority over their flock as they have asserted a power to include, power to exclude from fellowship, from communion.\n\nYet these are words on the lips of Jesus to his disciples as he greets them in the upper room on that first Easter night. What are we to make of them?\n\nLet’s start with that initial gift of the Spirit And with that he breathed on them and said, “Receive the Holy Spirit. In the Revised Catechism one of the functions of the Spirit is to ‘Enable us to become more like Jesus’\n\nMore like Jesus, who when presented with a women taken in adultery by a crowd intent on stoning her, said ‘Let he who is without sin cast the first stone.’ and to the woman ‘Woman, your sins are forgiven. Go and sin no more’\n\nMore like Jesus, who when Peter comes up and asks: \"Lord, if a brother sins against me, how often should I forgive? As many as seven times?\" 22 Jesus said to him, \"Not seven times, but, I tell you, seventy-seven times.\"\n\nTo make the point he tells a story of a servant, forgiven a huge debt by his master that he could never hope to repay. He then turns on a fellow servant demanding instant repayment of a trivial amount, only to experience the full wrath of his master.\n\nThen Jesus says: So my heavenly Father will also do to every one of you, if you do not forgive your brother or sister from your heart.\"\n\nWhat we are talking about here is hanging on to grievances, hanging onto resentments. That is not the way of Christ.\n\nIt is in this light I go on to think about what Jesus means when he talks about forgiving and retaining sins. For we do have a power; a power to hang onto resentments or to let them go. We all know of situations of long standing conflict in families, in communities.\n\nThere is something deeply debilitating about unresolved conflict, about cycles of recrimination, whether in families or in communities. In the course of the Northern Ireland conflict there were a series of ‘tit for tat’ killings in which innocent people on one side were killed to avenge the killing of someone on the other side. But there were those other occasions when people deliberately chose to break that cycle. Who out of their own experience of grief declared very publicly, ‘This must stop. Let no other family experience the pain that we are feeling now.’\n\nSo I have come to see those words of Jesus:\n\nIf you forgive anyone his sins, they are forgiven; if you do not forgive them, they are not forgiven.\n\nnot so much in terms of authority given to grant or withhold forgiveness but rather as a simple statement of how things are – if I choose to forgive or not to forgive – if I choose to break the cycle or let hurt and resentment continue.\n\nIn that light, Jesus comes to us through the locked doors of the past. He is inviting us to unlock doors – to unlock doors of resentment, of regret, of prejudice – to enable new beginnings. In Christ, in death and resurrection, God makes new beginning in us. He invites us, he empowers us to be agents of his healing, reconciling, door opening love in the world in which we live and move and have our being.\n\nThere is another aspect to this that I want to think about. It is one thing to forgive another person – it is quite another to forgive ourselves. Which of us does not carry our own burdens of disappointments, of regrets of things done or left undone, the word spoken that we can never take back? The Risen Christ comes to us through the locked doors of our regrets and self recrimination and invites us to let go, to accept his healing, forgiving love.\n\nReceive the Holy Spirit, receive the power to become more like Christ, allow the Risen Christ to minister to you.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/2ofeaster2017.txt",
        "raw_ocr_content": "Page 1 of 3\nSecond Sunday of Easter – Year A – 2017\nJesus came and stood among them and said, “Peace be with you!” After he said this, he\nshowed them his hands and side. The disciples were overjoyed when they saw the Lord.\nAgain Jesus said, “Peace be with you! As the Father has sent me, I am sending you.” And\nwith that he breathed on them and said, “Receive the Holy Spirit. If you forgive anyone his\nsins, they are forgiven; if you do not forgive them, they are not forgiven.”\nWhenever you hear those words read out in Church what word comes to your\nmind? The word that comes to my mind is that of power. It is a power that\nChurchmen have used down the years to bolster their position, their authority\nover their flock as they have asserted a power to include, power to exclude\nfrom fellowship, from communion.\nYet these are words on the lips of Jesus to his disciples as he greets them in the\nupper room on that first Easter night. What are we to make of them?\nLet’s start with that initial gift of the Spirit And with that he breathed on them\nand said, “Receive the Holy Spirit. In the Revised Catechism one of the\nfunctions of the Spirit is to ‘Enable us to become more like Jesus’\nMore like Jesus, who when presented with a women taken in adultery by a\ncrowd intent on stoning her, said ‘Let he who is without sin cast the first\nstone.’ and to the woman ‘Woman, your sins are forgiven. Go and sin no\nmore’\nMore like Jesus, who when Peter comes up and asks: \"Lord, if a brother sins\nagainst me, how often should I forgive? As many as seven times?\" 22 Jesus\nsaid to him, \"Not seven times, but, I tell you, seventy-seven times.”\nPage 2 of 3\nSecond Sunday of Easter – Year A – 2017\nTo make the point he tells a story of a servant, forgiven a huge debt by his\nmaster that he could never hope to repay. He then turns on a fellow servant\ndemanding instant repayment of a trivial amount, only to experience the full\nwrath of his master.\nThen Jesus says: So my heavenly Father will also do to every one of you, if\nyou do not forgive your brother or sister from your heart.\"\nWhat we are talking about here is hanging on to grievances, hanging onto\nresentments. That is not the way of Christ.\nIt is in this light I go on to think about what Jesus means when he talks about\nforgiving and retaining sins. For we do have a power; a power to hang onto\nresentments or to let them go. We all know of situations of long standing\nconflict in families, in communities.\nThere is something deeply debilitating about unresolved conflict, about cycles\nof recrimination, whether in families or in communities. In the course of the\nNorthern Ireland conflict there were a series of ‘tit for tat’ killings in which\ninnocent people on one side were killed to avenge the killing of someone on\nthe other side. But there were those other occasions when people deliberately\nchose to break that cycle. Who out of their own experience of grief declared\nvery publicly, ‘This must stop. Let no other family experience the pain that we\nare feeling now.’\nSo I have come to see those words of Jesus:\nPage 3 of 3\nSecond Sunday of Easter – Year A – 2017\nIf you forgive anyone his sins, they are forgiven; if you do not forgive\nthem, they are not forgiven.\nnot so much in terms of authority given to grant or withhold forgiveness but\nrather as a simple statement of how things are – if I choose to forgive or not to\nforgive – if I choose to break the cycle or let hurt and resentment continue.\nIn that light, Jesus comes to us through the locked doors of the past. He is\ninviting us to unlock doors – to unlock doors of resentment, of regret, of\nprejudice – to enable new beginnings. In Christ, in death and resurrection, God\nmakes new beginning in us. He invites us, he empowers us to be agents of his\nhealing, reconciling, door opening love in the world in which we live and move\nand have our being.\nThere is another aspect to this that I want to think about. It is one thing to\nforgive another person – it is quite another to forgive ourselves. Which of us\ndoes not carry our own burdens of disappointments, of regrets of things done or\nleft undone, the word spoken that we can never take back? The Risen Christ\ncomes to us through the locked doors of our regrets and self recrimination and\ninvites us to let go, to accept his healing, forgiving love.\nReceive the Holy Spirit, receive the power to become more like Christ, allow\nthe Risen Christ to minister to you."
    }
}