{
    "title": "The Mystery of God's Love",
    "date": "2019-11-10",
    "blurb": "In this sermon, Kevin explores the concept of questioning and seeking understanding in the face of life's challenges. He discusses the importance of acknowledging our limitations in understanding God and the value of faith in the face of uncertainty. He encourages us to embrace the mystery of God's love and to open our hearts to the transformative power of faith.",
    "raw_text": "3rd Sunday before Advent – Year C – 2019\n\nI often find myself thinking of the character Topol in the film ‘Fiddler on the Roof’. He was a poor Jewish man living in Czarist Russia who had an ongoing dialogue with God as to why he was put on this earth as a poor man. At one point he asks, ‘Would it spoil some vast eternal plan if I were a wealthy man?’ He used to think of the sort of things he would do if he was rich. One of the things he would we able to do would be to spend some time in the synagogue, talking with Rabbis about his faith, asking questions, ‘questions that would cross a rabbi’s eyes.’\n\nOver the years, as I have got to appreciate the Psalms more and more, I have come to appreciate the value of being able to ask very honest searching questions in the face of life’s difficulties and challenges. It strikes me as a very Jewish thing to do – asking, probing, challenging. Why is there suffering, why do the wicked seem to prosper, why, why?\n\nMany people came to Jesus with questions – there were questions that came from the heart, that represented a search for the truth, for meaning in the face of suffering. Then there were questions, such as we read this morning, that were intended to entrap, to trip him up, ‘questions that would cross a rabbi’s eyes.’\n\nAs we read our Gospel reading this morning, I think it worth reminding ourselves that Jesus discouraged speculation. On different occasions people, including the disciples, came to him with questions for which there were no answers. On one occasion he was asked when the Father was going to bring in the Kingdom; to which Jesus replied, ‘Not even the Son of Man knows’. Jesus felt comfortable living with uncertainty in the context of his total trust in God.\n\nAnd yet we still feel we ought to know answers – that can slip into an arrogance of thinking that we do know, that we do have the answers and that everyone else is wrong.\n\nThe Apostle Paul, as he reflected on the mystery of Christian love, acknowledged the limitations of his own knowledge in his first letter to the Church at Corinth:\n\n> For we know in part and we prophesy in part, but when completeness comes, what is in part disappears. When I was a child, I talked like a child, I thought like a child, I reasoned like a child. When I became a man, I put the ways of childhood behind me. For now we see only a reflection as in a mirror; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known. 1 Cor 13:3ff\n\nBefore God, all of us are able to see but dimly. Like Paul, all of us need to acknowledge the limitations and imperfection of our knowledge of God. The early theologians of the Church as they sought, in the light of Scripture, to understand the nature of God, used the term ‘incomprehensible’. They used this term not in the sense that we cannot know God, rather that we cannot define him, describe him as we can describe aspects of his creation – he is beyond our understanding.\n\nWe know him as our creator, we encounter him in creation as we gaze in wonder at the night sky or a sunset or just stop to reflect on the amazing complexity and beauty of life in all its forms from the simplest of organisms to the wonder of our own bodies; our ability to hear, to taste, to smell, to see. My own spiritual pilgrimage began in a growing wonder at the beauty of this world and the underlaying order that science reveals from the smallest of particles that make up the atom to the enormity of the Universe of which this earth is but a tiny part. What am I in all of this? It was a question that such as this that evoked from the Psalmist those lovely words that we find in Psalm 8:\n\n> When I consider your heavens,\n> the work of your fingers,\n> the moon and the stars,\n> which you have set in place,\n> what is mankind that you are mindful of them,\n> human beings that you care for them?\n> You have made them a little lower than the angels\n> and crowned them with glory and honor.\n> You made them rulers over the works of your hands;\n> you put everything under their feet:\n> all flocks and herds,\n> and the animals of the wild,\n> the birds in the sky,\n> and the fish in the sea,\n> all that swim the paths of the seas.\n> Lord, our Lord,\n> how majestic is your name in all the earth! Ps 8:3-9\n\nThe very posing of that question, ‘What is man?’, asked in the context of wonder, in itself leads us towards the answer. The admission that we don’t know why God should bother with sinful man, opens us to the realisation that he does, opens our hearts to the significance of Jesus, his teaching, his death and resurrection and moves us to worship.\n\nWe began thinking of questions that were asked of Jesus. There were questions from the heart, questions seeking meaning and purpose – and then there were questions that were simply designed to ‘cross a rabbi’s eyes’, to trip him up, to entrap him. Questions asked by people who thought they knew all the answers. Their certainty arose from hearts that were closed, impervious to ideas other than their own. They had no conception of God outside their own definitions. We too can seek to restrict God to the limits of our own understanding, our own definitions.\n\nJesus pointed them to a God beyond their own formulae to the God of Abraham, the God of Isaac, the God of Jacob; God not of the dead but of the living. A God who we not only worship but with whom we can engage.\n\nIt is as I confess that I do jot know, that I don’t have all the answers, that my heart is opened up to the God and Father of my Lord Jesus Christ and with Paul, I confess in my heart: ‘For now we see only a reflection as in a mirror; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known.’ 1 Cor 13:9",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/3bfadvent2019.txt",
        "raw_ocr_content": "Page 1 of 4\n3rd Sunday before Advent – Year C – 2019\nI often find myself thinking of the character Topol in the film ‘Fiddler on the\nRoof’. He was a poor Jewish man living in Czarist Russia who had an ongoing\ndialogue with God as to why he was put on this earth as a poor man. At one\npoint he asks, ‘Would it spoil some vast eternal plan if I were a wealthy man?’\nHe used to think of the sort of things he would do if he was rich. One of the\nthings he would we able to do would be to spend some time in the synagogue,\ntalking with Rabbis about his faith, asking questions, ‘questions that would\ncross a rabbi’s eyes.’\nOver the years, as I have got to appreciate the Psalms more and more, I have\ncome to appreciate the value of being able to ask very honest searching\nquestions in the face of life’s difficulties and challenges. It strikes me as a very\nJewish thing to do – asking, probing, challenging. Why is there suffering, why\ndo the wicked seem to prosper, why, why?\nMany people came to Jesus with questions – there were questions that came\nfrom the heart, that represented a search for the truth, for meaning in the face\nof suffering. Then there were questions, such as wee read this morning, that\nwere intended to entrap, to trip him up, ‘questions that would cross a rabbi’s\neyes.’\nAs we read our Gospel reading this morning, I think it worth reminding\nourselves that Jesus discouraged speculation. On different occasions people,\nincluding the disciples, came to him with questions for which there were no\nanswers. On one occasion he was asked when the Father was going to bring in\nPage 2 of 4\n3rd Sunday before Advent – Year C – 2019\nthe Kingdom; to which Jesus replied, ‘Not even the Son of Man knows’. Jesus\nfelt comfortable living with uncertainty in the context of his total trust in God.\nAnd yet we still feel we ought to know answers – that can slip into an\narrogance of thinking that we do know, that we do have the answers and that\neveryone else is wrong.\nThe Apostle Paul, as he reflected on the mystery of Christian love,\nacknowledged the limitations of his own knowledge in his first letter to the\nChurch at Corinth:\nFor we know in part and we prophesy in part, but when completeness\ncomes, what is in part disappears. When I was a child, I talked like a\nchild, I thought like a child, I reasoned like a child. When I became a\nman, I put the ways of childhood behind me. For now we see only a\nreflection as in a mirror; then we shall see face to face. Now I know in\npart; then I shall know fully, even as I am fully known. 1 Cor 13:3ff\nBefore God, all of us are able to see but dimly. Like Paul, all of us need to\nacknowledge the limitations and imperfection of our knowledge of God. The\nearly theologians of the Church as they sought, in the light of Scripture, to\nunderstand the nature of God, used the term ‘incomprehensible’. They used\nthis term not in the sense that we cannot know God, rather that we cannot\ndefine him, describe him as we can describe aspects of his creation – he is\nbeyond our understanding.\nWe know him as our creator, we encounter him in creation as we gaze in\nwonder at the night sky or a sunset or just stop to reflect on the amazing\ncomplexity and beauty of life in all its forms from the simplest of organisms to\nPage 3 of 4\n3rd Sunday before Advent – Year C – 2019\nthe wonder of our own bodies; our ability to hear, to taste, to smell, to see. My\nown spiritual pilgrimage began in a growing wonder at the beauty of this world\nand the underlaying order that science reveals from the smallest of particles\nthat make up the atom to the enormity of the Universe of which this earth is but\na tiny part. What am I in all of this? It was a question that such as this that\nevoked from the Psalmist those lovely words that we find in Psalm 8:\nWhen I consider your heavens,\nthe work of your fingers,\nthe moon and the stars,\nwhich you have set in place,\nwhat is mankind that you are mindful of them,\nhuman beings that you care for them?\nYou have made them a little lower than the angels\nand crowned them with glory and honor.\nYou made them rulers over the works of your hands;\nyou put everything under their feet:\nall flocks and herds,\nand the animals of the wild,\nthe birds in the sky,\nand the fish in the sea,\nall that swim the paths of the seas.\nLord, our Lord,\nhow majestic is your name in all the earth! Ps 8:3-9\nThe very posing of that question, ‘What is man?’, asked in the context of\nwonder, in itself leads us towards the answer. The admission that we don’t\nknow why God should bother with sinful man, opens us to the realisation that\nhe does, opens our hearts to the significance of Jesus, his teaching, his death\nand resurrection and moves us to worship.\nWe began thinking of questions that were asked of Jesus. There were\nquestions from the heart, questions seeking meaning and purpose – and then\nthere were questions that were simply designed to ‘cross a rabbi’s eyes’, to trip\nPage 4 of 4\n3rd Sunday before Advent – Year C – 2019\nhim up, to entrap him. Questions asked by people who thought they knew all\nthe answers. Their certainty arose from hearts that were closed, impervious to\nideas other than their own. They had no conception of God outside their own\ndefinitions. We too can seek to restrict God to the limits of our own\nunderstanding, our own definitions.\nJesus pointed them to a God beyond their own formulae to the God of\nAbraham, the God of Isaac, the God of Jacob; God not of the dead but of the\nliving. A God who we not only worship but with whom we can engage.\nIt is as I confess that I do jot know, that I don’t have all the answers, that my\nheart is opened up to the God and Father of my Lord Jesus Christ and with\nPaul, I confess in my heart: ‘For now we see only a reflection as in a mirror;\nthen we shall see face to face. Now I know in part; then I shall know fully,\neven as I am fully known.’ 1 Cor 13:9"
    }
}