{
    "title": "Belonging and Love",
    "date": "2019-11-10",
    "blurb": "Kevin's sermon on the 3rd Sunday before Advent in 2019 focuses on the themes of belonging, love, and the importance of community. He reflects on the assembly by 4th class on friendship and loneliness, and connects these ideas to Jesus' teachings on loving God and our neighbors. The sermon emphasizes the message of 'Little children, love one another,' as the core of Christian life and the expression of our belonging to God and each other.",
    "raw_text": "3rd Sunday before Advent – Year C – 2019\n\n**Belonging**\n\n4th class had a lovely assembly – had a look at the whole subject of friendship. During prayers at the end, they asked us to think of people who are lonely. When you are lonely, you feel that you don't belong. Other people have friends – you don't. Other people are having fun – you aren't. We all need to feel that we belong. We all need to feel that we matter. We all need to feel that we are loved.\n\nI want to bring those ideas of belonging, of what matters to us, to our reading – people were often trying to trip Jesus up with difficult questions. Remember Israel was occupied territory and people resented the Romans who were in charge. They asked Jesus – 'Should we pay taxes?' Jesus said give to Caesar what belongs to Caesar – and give to God the things that belong to God. In other words, decide what is important to you, decide 'Who do I belong to? What does it mean when I say that I belong to God?'\n\nWe come back to what 4th class were thinking about – love, loyalty, friendship. God has shown his love for us – we need to think of how we love. At one point Jesus was asked what he thought were the most important commandments: Love God, Love your neighbour.\n\nThere is a story of one of Jesus' followers, John, when he was an old man would say to all he met, 'Little children, love one another.' When he came to die he was the last living member of that group of disciples that Jesus called to follow him. As he lay dying, those around him asked him what was his message to the Church. He said simply, 'Little children, love one another.' 'John, is there nothing more you would like to say?' The old man smiled and simply said, 'Little children, love one another.'\n\nA vital way of showing our love for God is to share that love with others. Starting with 4th Class assembly and their thoughts on friendship and loneliness, we've been talking about belonging. Trust, loyalty, listening. The more I have come to know about God, the more I have come to know about Jesus, the more I have come to discover in my own life that he is one who listens, listens when I am worried or sad, listens when I am happy. He is one I have learned to trust; he is one who stays with me even when I seem to forget him.\n\nI discover, in the words of a song, 'Now I know He is mine I am His forever. He is leading me along life's way.' In discovering that, I discover that the one who loves me, is calling me to love those around me. We belong to him – and we belong to each other.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/3bfadvent2019 family service.txt",
        "raw_ocr_content": "Page 1 of 3\n3rd Sunday before Advent – Year C – 2019\nBelonging\n4th class had a lovely assembly – had a look at the whole subject of\nfriendship.\nDuring prayers at the end they asked us to think of people who are\nlonely.\nWhen you are lonely you feel that you don’t belong\nOther people have friends – you don’t\nOther people are having fun – you aren’t\nWe all need to feel that we belong\nWe all need to feel that we matter\nWe all need to feel that we are loved.\nI want to bring those ideas of belonging, of what matters to us to our\nreading – people were often trying to trip Jesus up with difficult\nquestions. Remember Israel was occupied territory and people\nresented the Romans who were in charge.\nThey asked Jesus – ‘Should we pay taxes?’\nPage 2 of 3\n3rd Sunday before Advent – Year C – 2019\nJesus said give to Caesar what belongs to Caesar – and give to God\nthe things that belong to God. In other words decide what is important\nto you, decide ‘Who do I belong to?\nWhat does it mean when I say that I belong to God?\nWe come back to what 4th class were thinking about – love, loyalty,\nfriendship. God has shown his love for us – we need to think of how\nwe love .\nAt one point Jesus was asked what he thought were the most\nimportant commandments\nLove God\nLove your neighbour.\nThere is a story of one of Jesus’ followers, John, when he was an old\nman would say to all he met, ‘Little children, love one another.’\nWhen he came to die he was the last living member of that group of\ndisciples that Jesus called to follow him. As he lay dying, those\naround him asked him what was his message to the Church. He said\nsimply, ‘Little children, love one another.’ John is there nothing more\nyou would like to say. The old man smiled and simply said ‘Little\nchildren, love one another.’\nPage 3 of 3\n3rd Sunday before Advent – Year C – 2019\nA vital way of showing our love for God is to share that love with\nothers.\nStarting with 4th Class assembly and their thoughts on friendship and\nloneliness, we’ve been talking about belonging. Trust, loyalty,\nlistening. The more I have come to know about God, the more I have\ncome to know about Jesus, the more I have come to discover in my\nown life that he is one who listens, listens when I am worried or sad,\nlistens when I am happy. He is one I have learned to trust; he is one\nwho stays with me even when I seem to forget him.\nI discover, in the words of a song,\nNow I know He is mine I am His forever\nHe is leading me along life’s way\nIn discovering that, I discover that the one who loves me, is calling me\nto love those around me.\nWe belong to him – and we belong to each other."
    }
}