{
    "title": "Journey with God",
    "date": "2014-05-04",
    "blurb": "The sermon discusses the journey of life with God, using the metaphor of planning a holiday. It emphasizes that God is always with us, listening to us in gentle understanding, and speaking to us in the quiet places of our hearts. The sermon is given in the context of a baptism, marking the beginning of a lifelong journey with God.",
    "raw_text": "Rachel and I are currently in the process of planning our holiday. We have booked our passage on the ferry – we know when we are leaving and we when we are coming back. We are now in the process of planning the journey – what route are we taking, where are we going to stop, what do we want to see and do along the way. Then of course, what preparations are we going to have to make? We need to check the car, the caravan. We have to arrange insurance. Whatever preparations we make, a journey always involves an element of the unexpected, whether good or bad.\n\nThis morning, in the context of our 11 o’clock service we are welcoming Ross Coulter into the family of the Church in Baptism. The pastoral introduction to the Service of Baptism in the Prayer Book begins with these words:\n\n>Baptism marks the beginning of a journey with God which lasts for the rest of our lives, the first step in response to God’s love.\n\nWe are all on that journey, different stages on that journey. Along that road there will be light and dark, joy and sadness; times of great fulfilment, times of worry and confusion..\n\nIt is in the nature of this life long journey that there is always more that lies ahead of us, always further to travel, always more to experience, to learn of the God with whom we travel.\n\nOur Gospel reading today is a story of a journey; a journey from doubt and confusion, through encounter and on towards restored hope and faith. It is a very human story and for me is one of the most powerful of the resurrection narratives.\n\nI want to reflect on it this morning in the context of the words of a blessing that I would often use at the end of a service.\n\n>Go, and know that the Lord goes with you:\nlet him lead you each day into the quiet place of your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen.\n\nWe follow a Lord who accompanies us along the road of life. Sometimes we are aware of that presence. Sometimes our pain is such that we cannot see, we cannot feel his presence – but he is there listening in gentle understanding.\n\nAnd that was their first experience of the stranger who walked with them that afternoon along the road out of Jerusalem – one who listened, listened to their pain, their disappointed hopes.\n\nHaving been heard, they began to hear, to listen to what the stranger had to say. Often, too often well meaning friends will try to solve our problems, try to soften our pain before we have had a chance to unburden our pain. Then, and only then can we begin to hear.\n\n>Go, and know that the Lord goes with you:\nlet him lead you each day into the quiet place of your heart, where he will speak with you;\n\nAs the stranger begins to speak, they begin to listen and, as they recall later,\n\n>Were not our hearts burning within us while he was talking to us on the road, while he was opening the scriptures to us?’\n\nAt no point has the stranger forced himself upon them. And so as they come to the end of the day, he prepares to move on – but they want him to stay. He joined them uninvited but now they want to hear more. And in the simple act of breaking of bread, their eyes are opened and they see, truly see who has walked the road with them that day, who has listened to their pain, who has spoken into their pain, who has brought light into the darkness of their hearts.\n\nAs quickly as he has appeared the stranger goes, but now they know they are not alone, that they will never be alone.\n\n>Go, and know that the Lord goes with you:\nthat he is with you always,\nwherever you are and however you may feel.\n\nAt the end of the service of Baptism, we say to the child:\n\n>‘You have received the light of Christ;\nwalk in this light all the days of your life.\n\nAt whatever stage we are at on the journey of life, may we know\nmay we know that the Lord goes with us:\nthat he leads us each day into the quiet place of our hearts, where he will speak with us;\nmay we know that he watches over us –\nthat he listens to us in gentle understanding,\nthat he is with us always,\nwherever we are and however you may feel.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/3ofeaster2014.txt",
        "raw_ocr_content": "Page 1 of 3\n3rd Sunday of Easter – Year A – 2014 – Baptism at 11:00am\nRachel and I are currently in the process of planning our holiday. We have\nbooked our passage on the ferry – we know when we are leaving and we when\nwe are coming back. We are now in the process of planning the journey –\nwhat route are we taking, where are we going to stop, what do we want to see\nand do along the way. Then of course, what preparations are we going to have\nto make? We need to check the car, the caravan. We have to arrange\ninsurance. Whatever preparations we make, a journey always involves an\nelement of the unexpected, whether good or bad.\nThis morning, in the context of our 11 o’clock service we are welcoming Ross\nCoulter into the family of the Church in Baptism. The pastoral introduction to\nthe Service of Baptism in the Prayer Book begins with these words:\nBaptism marks the beginning of a journey with God which lasts for\nthe rest of our lives, the first step in response to God’s love.\nBCP 2004 p 357\nWe are all on that journey, different stages on that journey. Along that road\nthere will be light and dark, joy and sadness; times of great fulfilment, times of\nworry and confusion..\nIt is in the nature of this life long journey that there is always more that lies\nahead of us, always further to travel, always more to experience, to learn of the\nGod with whom we travel.\nOur Gospel reading today is a story of a journey; a journey from doubt and\nconfusion, through encounter and on towards restored hope and faith. It is a\nvery human story and for me is one of the most powerful of the resurrection\nnarratives.\nPage 2 of 3\n3rd Sunday of Easter – Year A – 2014 – Baptism at 11:00am\nI want to reflect on it this morning in the context of the words of a blessing that\nI would often use at the end of a service.\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen.\nGo, and know that the Lord goes with you:\n…..\nknow that he watches over you -\nthat he listens to you in gentle understanding,\nWe follow a Lord who accompanies us along the road of life. Sometimes we\nare aware of that presence. Sometimes our pain is such that we cannot see, we\ncannot feel his presence – but he is there listening in gentle understanding.\nAnd that was their first experience of the stranger who walked with them that\nafternoon along the road out of Jerusalem – one who listened, listened to their\npain, their disappointed hopes.\nHaving been heard, they began to hear, to listen to what the stranger had to say.\nOften, too often well meaning friends will try to solve our problems, try to\nsoften our pain before we have had a chance to unburden our pain. Then, and\nonly then can we begin to hear.\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nPage 3 of 3\n3rd Sunday of Easter – Year A – 2014 – Baptism at 11:00am\nAs the stranger begins to speak, they begin to listen and, as they recall later,\nWere not our hearts burning within us while he was talking to us on\nthe road, while he was opening the scriptures to us?’\nAt no point has the stranger forced himself upon them. And so as they come to\nthe end of the day, he prepares to move on – but they want him to stay. He\njoined them uninvited but now they want to hear more. And in the simple act\nof breaking of bread, their eyes are opened and they see, truly see who has\nwalked the road with them that day, who has listened to their pain, who has\nspoken into their pain, who has brought light into the darkness of their hearts.\nAs quickly as he has appeared the stranger goes, but now they know they are\nnot alone, that they will never be alone.\nGo, and know that the Lord goes with you:\n………………………….\nthat he is with you always,\nwherever you are and however you may feel.\nAt the end of the service of Baptism, we say to the child:\n‘You have received the light of Christ;\nwalk in this light all the days of your life.\nAt whatever stage we are at on the journey of life, may we know\nmay we know that the Lord goes with us:\nthat he leads us each day into the quiet place\nof our hearts, where he will speak with us;\nmay we know that he watches over us –\nthat he listens to us in gentle understanding,\nthat he is with us always,\nwherever we are and however we may feel:"
    }
}