{
    "title": "Politics and Religion",
    "date": "2023-02-05",
    "blurb": "The sermon discusses the intersection of politics and religion, emphasizing the importance of Christian values in the political process. It highlights the need for justice, integrity, and concern for the marginalized in society. The sermon also explores the concept of covenant in the context of political order, suggesting a partnership between the governed and the governing.",
    "raw_text": "3rd Sunday before Lent – 2023- year A – Booterstown and Mount Merrion\n\nIt is lovely to have the chance to join you in worship this morning. Back in my student days I lived for two years in Frascati Park and St Philip and St James was my Parish Church (and when I went to work in St Mary’s Hospital in the Phoenix Park, Sheila Hillis signed my pay cheques.)\n\nFor the last couple of years since I retired from Howth, we’ve been living in Jordanstown, just north of Belfast. So there’s talk of Protocol boycotts, will we, won’t we have an election. If we have an election, will it solve anything? Will people stay locked in their fixed positions as our public services and vulnerable people left to drift as we are left in our political limbo.\n\nOur Old Testament Lesson set for this 3rd Sunday before Lent is all about politics, the hypocrisy of those in power as they make a show of their piety and turn a blind eye to the poor and the marginalised. This passage is a particularly striking example of how in Jewish spirituality, thought is given to how religious principle is carried on through into the nuts and bolts of daily living; as such it is a reminder of the importance of allowing our religious conviction to inform our choices in daily life, including the choices we make as a society.\n\nFrom 1989n to 2005, we lived in Ahoghill, just outside Ballymena. When people mention Ballymena, the name of Paisley generally comes up. Ahoghill Parish was in fact the Parish of Terence O’Neill, who back in the 1960’s attempted to move Northern Ireland politics on. The Parish was proud of that connection and the more moderate politics that it represented. In his last address as Prime Minister to the people of Northern Ireland; he had lamented that ‘our religion could have enriched our politics instead we have allowed our politics to demean our religion.’\n\nThat is an issue for every generation of Christians as they seek to play their part in the body politic. How can our religious conviction enrich our politics?\n\nOne of the most fundamental insights into human nature is to be found in the opening chapter of Genesis when we are told that man is made ‘in the image of God’. But having said that, central to the Hebrew understanding of God is that God has no image. So God is Being in its infinite, open-ended unpredictability. What is divine about humanity is its diversity, not its uniformity. The ancient rabbis expressed this truth quite simply, ‘When coins are minted in a single mould they are all alike. But when people are made in the image of God they are all different.’ (Faith in the Future – Jonathan Sacks – p 108). But man is more than an individual, however precious. As creation unfolded, at each stage we are told God saw it and God declared that it was good. But there is one thing that God declares not to be good – ‘It is not good for man to be alone.’ Man is made for community – the political process is about the ordering of that wider community. The key Biblical concept in this regard is that of Covenant. The concept of covenant has much to offer us as we reflect on the nature of the political process.\n\nIn the context of a political order the concept of covenant presupposes a reciprocity, a mutual respect and consent. At its heart, government is a partnership between those who govern and those who are governed and covenant is rooted in a vision of a human being for whom freedom and responsibility go hand in hand. God and man are linked in a shared enterprise and so covenant will always be set within a wider context of morality; power, and the exercise of power, is always subject to constraints of justice and there will always be a tension between power and justice. In the context of our political process, we have to decide will the people we entrust with power exercise that power with justice. Those elected have to decide how they can honour trust.\n\nIt is this context that our Old Testament and Gospel readings speak with a particular force. One of the marks of a just society is to be found in how that society protects the weak and the marginalised, the poor and the alien. This is why it is essential that Christians engage in the political process; that we bring our own individual Christian conviction to bear on the issues of our day. I recall, during my time in the North, just as the Mitchell talks were beginning, that would result in the Good Friday Agreement, being among a group of clergy meeting with the then leader of the Alliance Party, David Alderdyce. We asked him what role the Churches could play at this time. I will never forget his reply. ‘Too often in the past’, he said, ‘the Churches have acted as chaplains to the tribe; rather than the Prophet, saying the sometimes uncomfortable ‘thus saith the Lord’.’ We have an uncomfortable history in both parts of this island of Church and politics, expressed in terms of power. The prophet of old went into the court of the King and spoke truth to power. We have long left behind the ‘Protestant Parliament for a Protestant people’ of the North and the Church presuming to dictate social policy in the Republic. Leaving behind presumptions of power, we should not be afraid to assume the role of the prophet, to bring our own Christian conviction to bear on the public debate. But as we do so we remember before God those on whom hard decisions fall, those who have answered the call to leadership in our society.\n\nThis is why, as members of the Church of Ireland, we remember before God in prayer all those called to leadership in our society, and particularly those in leadership in our political process. So this Sun day, as we will do so every Sunday, we will remember those who serve in the Oireachtas. We pray that God may work in and through our political system, in all its flaws, strengthening voices that speak for justice and integrity that the despair, cynicism and selfishness that can so easily creep into our national life may be supplanted by hope, by integrity and by a genuine care and concern for all.\n\nAlmighty and merciful God, who in days of old didst give to this land the benediction of thy holy Church. Withdraw not, we pray thee, thy favour from us, but so correct what is amiss, and supply what is lacking, that we may more and more bring forth fruit to thy glory; through Jesus Christ, our Lord.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/3rdbeforelent2023.txt",
        "raw_ocr_content": "Page 1 of 3\n3rd Sunday before Lent – 2023- year A – Booterstown and Mount Merrion\nIt is lovely to have the chance to join you in worship this morning. Back in my\nstudent days I lived for two years in Frascati Park and St Philip and St James was\nmy Parish Church (and when I went to work in St Mary’s Hospital in the Phoenix\nPark, Sheila Hillis signed my pay cheques.)\nFor the last couple of years since I retired from Howth, we’ve been living in\nJordanstown, just north of Belfast. So there’s talk of Protocol boycotts, will we,\nwon’t we have an election. If we have an election, will it solve anything? Will\npeople stay locked in their fixed positions as our public services and vulnerable\npeople left to drift as we are left in our political limbo.\nOur Old Testament Lesson set for this 3rd Sunday before Lent is all about politics,\nthe hypocrisy of those in power as they make a show of their piety and turn a blind\neye to the poor and the marginalised. This passage is a particularly striking example\nof how in Jewish spirituality, thought is given to how religious principle is carried\non through into the nuts and bolts of daily living; as such it is a reminder of the\nimportance of allowing our religious conviction to inform our choices in daily life,\nincluding the choices we make as a society.\nFrom 1989n to 2005, we lived in Ahoghill, just outside Ballymena. When people\nmention Ballymena, the name of Paisley generally comes up. Ahoghill Parish was\nin fact the Parish of Terence O’Neill, who back in the 1960’s attempted to move\nNorthern Ireland politics on. The Parish was proud of that connection and the more\nmoderate politics that it represented. In his last address as Prime Minister to the\npeople of Northern Ireland; he had lamented that ‘our religion could have enriched\nour politics instead we have allowed our politics to demean our religion.’\nThat is an issue for every generation of Christians as they seek to play their part in\nthe body politic. How can our religious conviction enrich our politics?\nPage 2 of 3\n3rd Sunday before Lent – 2023- year A – Booterstown and Mount Merrion\nOne of the most fundamental insights into human nature is to be found in the\nopening chapter of Genesis when we are told that man is made ‘in the image of\nGod’. But having said that, central to the Hebrew understanding of God is that God\nhas no image. So God is Being in its infinite, open-ended unpredictability. What is\ndivine about humanity is its diversity, not its uniformity. The ancient rabbis\nexpressed this truth quite simply, ‘When coins are minted in a single mould they are\nall alike. But when people are made in the image of God they are all different.’\n(Faith in the Future – Jonathan Sacks – p 108). But man is more than an individual,\nhowever precious. As creation unfolded, at each stage we are told God saw it and\nGod declared that it was good. But there is one thing that God declares not to be\ngood – ‘It is not good for man to be alone.’ Man is made for community – the\npolitical process is about the ordering of that wider community. The key Biblical\nconcept in this regard is that of Covenant. The concept of covenant has much to\noffer us as we reflect on the nature of the political process.\nIn the context of a political order the concept of covenant presupposes a reciprocity,\na mutual respect and consent. At its heart, government is a partnership between\nthose who govern and those who are governed and covenant is rooted in a vision of\na human being for whom freedom and responsibility go hand in hand. God and man\nare linked in a shared enterprise and so covenant will always be set within a wider\ncontext of morality; power, and the exercise of power, is always subject to\nconstraints of justice and there will always be a tension between power and justice.\nIn the context of our political process, we have to decide will the people we entrust\nwith power exercise that power with justice. Those elected have to decide how they\ncan honour trust.\nIt is this context that our Old Testament and Gospel readings speak with a particular\nforce. One of the marks of a just society is to be found in how that society protects\nthe weak and the marginalised, the poor and the alien. This is why it is essential that\nChristians engage in the political process; that we bring our own individual Christian\nPage 3 of 3\n3rd Sunday before Lent – 2023- year A – Booterstown and Mount Merrion\nconviction to bear on the issues of our day. I recall, during my time in the North,\njust as the Mitchell talks were beginning, that would result in the Good Friday\nAgreement, being among a group of clergy meeting with the then leader of the\nAlliance Party, David Alderdyce. We asked him what role the Churches could play\nat this time. I will never forget his reply. ‘Too often in the past’, he said, ‘the\nChurches have acted as chaplains to the tribe; rather than the Prophet, saying the\nsometimes uncomfortable ‘thus saith the Lord’.’ We have an uncomfortable history\nin both parts of this island of Church and politics, expressed in terms of power. The\nprophet of old went into the court of the King and spoke truth to power. We have\nlong left behind the ‘Protestant Parliament for a Protestant people’ of the North and\nthe Church presuming to dictate social policy in the Republic. Leaving behind\npresumptions of power, we should not be afraid to assume the role of the prophet, to\nbring our own Christian conviction to bear on the public debate. But as we do so we\nremember before God those on whom hard decisions fall, those who have answered\nthe call to leadership in our society.\nThis is why, as members of the Church of Ireland, we remember before God in\nprayer all those called to leadership in our society, and particularly those in\nleadership in our political process. So this Sun day, as we will do so every Sunday,\nwe will remember those who serve in the Oireachtas. We pray that God may work in\nand through our political system, in all its flaws, strengthening voices that speak for\njustice and integrity that the despair, cynicism and selfishness that can so easily\ncreep into our national life may be supplanted by hope, by integrity and by a genuine\ncare and concern for all.\nAlmighty and merciful God, who in days of old didst give to this land\nthe benediction of thy holy Church. Withdraw not, we pray thee, thy\nfavour from us, but so correct what is amiss, and supply what is\nlacking, that we may more and more bring forth fruit to thy glory;\nthrough Jesus Christ, our Lord."
    }
}