{
    "title": "Religion and Politics",
    "date": "2011-02-13",
    "blurb": "The sermon discusses the role of religious conviction in political choices, emphasizing the importance of voting with integrity and considering the greater good of society. It explores the concept of covenant in politics, which implies mutual respect and consent between the governed and the governors. The sermon urges the congregation to reflect on how their Christian values influence their political decisions.",
    "raw_text": "The long awaited election is finally upon us. We have been inundated with interviews, debates, claims and counterclaims as to who is to be best suited to lead this country through the next crucial period in our history. Next Friday the responsibility falls upon the electorate to exercise our responsibility as we cast our votes. What are the issues that will influence our choice? Will it be local or national issues that hold most sway in our minds? Will our choice be determined by what the candidates have to offer to our particular interest group or are we prepared to recognise that maybe our interests need to be subordinated to the greater good of our society.\n\nOur Old Testament Lesson set for this 3rd Sunday before Lent could almost have been picked for a Sunday before a General Election. This passage is a particularly striking example of how in Jewish spirituality, thought is given to how religious principle is carried on through into the nuts and bolts of daily living; as such it is a reminder of the importance of allowing our religious conviction to inform our choices in daily life, including the choices we will be making on Friday.\n\nBefore I go any further could I state the obvious and stress that there is no single political philosophy that carries a particular Biblical authority. I recall on the Sunday before the referendum on the Good Friday Agreement in Northern Ireland I had stressed the importance of casting your vote, that you could vote ‘Yes’ or ‘No’ with equal integrity. One parishioner still came out of Church demanding to know had my sermon been written by Tony Blair or David Trimble.\n\nThe former Prime Minister of Northern Ireland, the late Captain Terence O’Neill, in the course of his last address as Prime Minister to the people of Northern Ireland, had lamented that ‘our religion could have enriched our politics instead we have allowed our politics to demean our religion.’ How can our religious conviction enrich our politics?\n\nOne of the most fundamental insights into human nature is to be found in the opening chapter of Genesis when we are told that man is made ‘in the image of God’. But having said that, central to the Hebrew understanding of God is that God has no image. So God is Being in its infinite, open-ended unpredictability. What is divine about humanity is its diversity, not its uniformity. The ancient rabbis expressed this truth quite simply, ‘When coins are minted in a single mould they are all alike. But when people are made in the image of God they are all different.’ (Faith in the Future – Jonathan Sacks – p 108). But man is more than an individual, however precious. As creation unfolded, at each stage we are told God saw it and God declared that it was good. But there is one thing that God declares not to be good – ‘It is not good for man to be alone.’ Man is made for community – the political process is about the ordering of that wider community. The key Biblical concept in this regard is that of Covenant. The concept of covenant has much to offer us as we reflect on the nature of the political process.\n\nIn the context of a political order the concept of covenant presupposes a reciprocity, a mutual respect and consent. At its heart, government is a partnership between those who govern and those who are governed and covenant is rooted in a vision of a human being for whom freedom and responsibility go hand in hand. God and man are linked in a shared enterprise and so covenant will always be set within a wider context of morality; power, and the exercise of power, is always subject to constraints of justice and there will always be a tension between power and justice. In the context of the election on Friday, we have to decide will the people we entrust with power exercise that power with justice.\n\nIt is this context that our Old Testament and Gospel readings speak with a particular force. One of the marks of a just society is to be found in how that society protects the weak and the marginalised, the poor and the alien. What sort of Ireland is going to emerge from our present crisis over the next four or five years? That question is very much at the heart of what we will be deciding next Friday. That is why as Christians it is essential that we engage in this process; that we bring our own individual Christian conviction to bear on the choice we make this coming week.\n\nSo for this coming week let us hold up this whole process before God in prayer. Let us pray for all who are offering themselves for election; let us pray for ourselves as we make our own particular choice, that the values we proclaim here in Church may inform that choice; let us pray that God may work in and through this whole process that the despair, cynicism and selfishness that has crept into our national life may be supplanted by hope, by integrity and by a genuine care and concern for all.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/3rdbeforelent2011.txt",
        "raw_ocr_content": "Page 1 of 3\n3rd Sunday before Lent – 2011- year A\nThe long awaited election is finally upon us. We have been inundated with interviews,\ndebates, claims and counterclaims as to who is to be best suited to lead this country\nthrough the next crucial period in our history. Next Friday the responsibility falls upon the\nelectorate to exercise our responsibility as we cast our votes. What are the issues that will\ninfluence our choice? Will it be local or national issues that hold most sway in our minds?\nWill our choice be determined by what the candidates have to offer to our particular\ninterest group or are we prepared to recognise that maybe our interests need to be\nsubordinated to the greater good of our society.\nOur Old Testament Lesson set for this 3rd Sunday before Lent could almost have been\npicked for a Sunday before a General Election. This passage is a particularly striking\nexample of how in Jewish spirituality, thought is given to how religious principle is\ncarried on through into the nuts and bolts of daily living; as such it is a reminder of the\nimportance of allowing our religious conviction to inform our choices in daily life,\nincluding the choices we will be making on Friday.\nBefore I go any further could I state the obvious and stress that there is no single political\nphilosophy that carries a particular Biblical authority. I recall on the Sunday before the\nreferendum on the Good Friday Agreement in Northern Ireland I had stressed the\nimportance of casting your vote, that you could vote ‘Yes’ or ‘No’ with equal integrity.\nOne parishioner still came out of Church demanding to know had my sermon been written\nby Tony Blair or David Trimble.\nThe former Prime Minister of Northern Ireland, the late Captain Terence O’Neill, in the\ncourse of his last address as Prime Minister to the people of Northern Ireland, had\nlamented that ‘our religion could have enriched our politics instead we have allowed our\npolitics to demean our religion.’ How can our religious conviction enrich our politics?\nPage 2 of 3\n3rd Sunday before Lent – 2011- year A\nOne of the most fundamental insights into human nature is to be found in the opening\nchapter of Genesis when we are told that man is made ‘in the image of God’. But having\nsaid that, central to the Hebrew understanding of God is that God has no image. So God is\nBeing in its infinite, open-ended unpredictability. What is divine about humanity is its\ndiversity, not its uniformity. The ancient rabbis expressed this truth quite simply, ‘When\ncoins are minted in a single mould they are all alike. But when people are made in the\nimage of God they are all different.’ (Faith in the Future – Jonathan Sacks – p 108). But\nman is more than an individual, however precious. As creation unfolded, at each stage we\nare told God saw it and God declared that it was good. But there is one thing that God\ndeclares not to be good – ‘It is not good for man to be alone.’ Man is made for community\n– the political process is about the ordering of that wider community. The key Biblical\nconcept in this regard is that of Covenant. The concept of covenant has much to offer us\nas we reflect on the nature of the political process.\nIn the context of a political order the concept of covenant presupposes a reciprocity, a\nmutual respect and consent. At its heart, government is a partnership between those who\ngovern and those who are governed and covenant is rooted in a vision of a human being\nfor whom freedom and responsibility go hand in hand. God and man are linked in a\nshared enterprise and so covenant will always be set within a wider context of morality;\npower, and the exercise of power, is always subject to constraints of justice and there will\nalways be a tension between power and justice. In the context of the election on Friday,\nwe have to decide will the people we entrust with power exercise that power with justice.\nIt is this context that our Old Testament and Gospel readings speak with a particular force.\nOne of the marks of a just society is to be found in how that society protects the weak and\nthe marginalised, the poor and the alien. What sort of Ireland is going to emerge from our\npresent crisis over the next four or five years? That question is very much at the heart of\nwhat we will be deciding next Friday. That is why as Christians it is essential that we\nPage 3 of 3\n3rd Sunday before Lent – 2011- year A\nengage in this process; that we bring our own individual Christian conviction to bear on\nthe choice we make this coming week.\nSo for this coming week let us hold up this whole process before God in prayer. Let us\npray for all who are offering themselves for election; let us pray for ourselves as we make\nour own particular choice, that the values we proclaim here in Church may inform that\nchoice; let us pray that God may work in and through this whole process that the despair,\ncynicism and selfishness that has crept into our national life may be supplanted by hope,\nby integrity and by a genuine care and concern for all."
    }
}