{
    "title": "Journey of Faith",
    "date": "2017-05-07",
    "blurb": "This sermon, given on the 4th Sunday of Easter in 2017, discusses the theme of journey. It marks the last service in St Mary’s before moving into the Parish Centre for nearly five months due to roof work. The sermon also celebrates the baptism of Zoe Groarke, symbolising the start of a lifelong journey of faith. The sermon draws parallels between the congregation's temporary displacement and the biblical stories of wandering and journeying, emphasizing that the church is not a building, but a people.",
    "raw_text": "4th Sunday of Easter – YEAR A – 2017\nSunday before move into the Parish Centre for work on the roof of St Mary’s\n\nToday, Sunday 7th May, 4th Sunday of Easter, is something of a landmark for the Parish of Howth. We will having our last services here in St Mary’s as we prepare to move into the Hall in the Parish Centre for nearly five months.\n\nIt is also a day on which we celebrate the baptism of Zoe Groarke. I want to take up the theme of journey. Baptism marks the beginning of a lifelong journey of faith, a journey with God, a journey into God.\n\nOf course journey is one of the great themes of the Bible. The Jewish people celebrate, among many other Festivals, the Festival of Sukkot, the Festival of Tabernacles, which is celebrated in the autumn – this year it will be on October 17th, around the time we will be moving back into the Church. It recalls the time when they wandered in the Wilderness of Sinai.. In fact the whole thing goes on for a week.\n\nFor that week the Orthodox Jew will leave his house and live in a temporary shelter, a ‘sukkot’ in the garden. It is here, for the week of the Festival they will eat and sleep, study and entertain their friends.\n\nIt is a time of remembering who they are. The very name Hebrew is derived from a word for ‘one who wanders from place to place’. We read in the book of Numbers of their ongoing journey through the desert – They travelled and they encamped – they travelled and they encamped – all in the presence of God who sustained them and lead them. Each year in their temporary homes they remember their vulnerability down through the years as a wandering people as a persecuted people they are moved form place to place.\n\nJonathan Sacks, in writing of this Festival, says:\n\n>Sitting in the sukkot under its canopy of leaves I often think of my ancestors and their wanderings across Europe in search of safety, and I begin to understand how faith was their only home. It was fragile, chillingly exposed to the storms of prejudice and hate. But it proved stronger than empires. Their faith survived. Faith in the Future p 151\n\nWe have been thinking of the Jewish people being reminded in the time they spent in their temporary shelter of who they were. May this time in our temporary shelter be a reminder of who we are. I recall the late Bishop Noel Willoughby, in the course of a debate in the General Synod on the use of Church buildings, saying ‘The Church is what is left when the buildings fall down.’\n\nAs we move out into our temporary shelter we will continue to meet and encourage one another. We will continue to worship, to reflect on God’s word, to receive the sacraments, to pray for ourselves and those in need, to seek God’s help and strength for our daily life.\n\nBut it will be different. We won’t be sitting in our familiar pew. We won’t be seeing the familiar stained glass windows, we will miss the rich sound of the organ – and of course we will be sharing communion in a different, perhaps more intimate way, gathering around the table rather than viewing what is going on up in the sanctuary.\n\nOf course there is another difference. The Jews live in their sukkot for only a week, we will be in our temporary shelter for nearly five months. Looking ahead through the lectionary over the next five months; we will shortly be celebrating Ascension and Pentecost and then the season of Trinity. Our Old Testament lessons through the season of Trinity this year are drawn from Genesis and Exodus. We will be following the call of Abraham, of Isaac and Jacob. We will hear the story of the descent into Egypt, of slavery, of the call of Moses. We will read of Passover, of deliverance at the Red Sea, of the giving of the Law on Sinai and the subsequent wandering in the desert before the final entry into the Promised Land.\n\nAs we follow that great Biblical journey, as part of the People of God, meeting to worship in our own temporary shelter, we will be reflecting our own spiritual journey, the start of which is symbolised in our Baptism. It will be an opportunity to reflect on who we are. We are not an institution, we are not a building, we are not even a tradition - we are a people. We are the Body of Christ, a Royal Priesthood called to make Christ present in the world in which we live.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/4ofeaster2017.txt",
        "raw_ocr_content": "Page 1 of 3\n4th Sunday of Easter – YEAR A – 2017\nSunday before move into the Parish Centre for work on the roof of St Mary’s\nToday, Sunday 7th May, 4th Sunday of Easter, is something of a landmark for\nthe Parish of Howth. We will having our last services here in St Mary’s as we\nprepare to move into the Hall in the Parish Centre for nearly five months.\nIt is also a day on which we celebrate the baptism of Zoe Groarke. I want to\ntake up the theme of journey. Baptism marks the beginning of a lifelong\njourney of faith, a journey with God, a journey into God.\nOf course journey is one of the great themes of the Bible. The Jewish people\ncelebrate, among many other Festivals, the Festival of Sukkot, the Festival of\nTabernacles, which is celebrated in the autumn – this year it will be on October\n17th, around the time we will be moving back into the Church. It recalls the\ntime when they wandered in the Wilderness of Sinai.. In fact the whole thing\ngoes on for a week.\nFor that week the Orthodox Jew will leave his house and live in a temporary\nshelter, a ‘sukkot’ in the garden. It is here, for the week of the Festival they\nwill eat and sleep, study and entertain their friends.\nIt is a time of remembering who they are. The very name Hebrew is derived\nfrom a word for ‘one who wanders from place to place’. We read in the book\nof Numbers of their ongoing journey through the desert – They travelled and\nthey encamped – they travelled and they encamped – all in the presence of God\nwho sustained them and lead them. Each year in their temporary homesthey\nremember their vulnerability down through the years as a wandering people as\na persecuted people they are moved form place to place.\nPage 2 of 3\n4th Sunday of Easter – YEAR A – 2017\nSunday before move into the Parish Centre for work on the roof of St Mary’s\nJonathan Sacks, in writing of this Festival, says:\nSitting in the sukkot under its canopy of leaves I often think of my\nancestors and their wanderings across Europe in search of safety, and I\nbegin to understand how faith was their only home. It was fragile,\nchillingly exposed to the storms of prejudice and hate. But it proved\nstronger than empires. Their faith survived. Faith in the Future p 151\nWe have been thinking of the Jewish people being reminded in the time they\nspent in their temporary shelter of who they were. May this time in our\ntemporary shelter be a reminder of who we are. I recall the late Bishop Noel\nWilloughby, in the course of a debate in the General Synod on the use of\nChurch buildings, saying ‘The Church is what is left when the buildings fall\ndown.’\nAs we move out into our temporary shelter we will continue to meet and\nencourage one another. We will continue to worship, to reflect on God’s word,\nto receive the sacraments, to pray for ourselves and those in need, to seek\nGod’s help and strength for our daily life.\nBut it will be different. We won’t be sitting in our familiar pew. We won’t be\nseeing the familiar stained glass windows, we will miss the rich sound of the\norgan – and of course we will be sharing communion in a different, perhaps\nmore intimate way, gathering around the table rather than viewing what is\ngoing on up in the sanctuary.\nOf course there is another difference. The Jews live in their sukkot for only a\nweek, we will be in our temporary shelter for nearly five months. Looking\nPage 3 of 3\n4th Sunday of Easter – YEAR A – 2017\nSunday before move into the Parish Centre for work on the roof of St Mary’s\nahead through the lectionary over the next five months; we will shortly be\ncelebrating Ascension and Pentecost and then the season of Trinity. Our Old\nTestament lessons through the season of Trinity this year are drawn from\nGenesis and Exodus. We will be following the call of Abraham, of Isaac and\nJacob. We will hear the story of the descent into Egypt, of slavery, of the call\nof Moses. We will read of Passover, of deliverance at the Red Sea, of the\ngiving of the Law on Sinai and the subsequent wandering in the desert before\nthe final entry into the Promised Land.\nAs we follow that great Biblical journey, as part of the People of God, meeting\nto worship in our own temporary shelter, we will be reflecting our own\nspiritual journey, the start of which is symbolised in our Baptism. It will be an\nopportunity to reflect on who we are. We are not an institution, we are not a\nbuilding, we are not even a tradition - we are a people. We are the Body of\nChrist, a Royal Priesthood called to make Christ present in the world in which\nwe live."
    }
}