{
    "title": "The Call of Peter",
    "date": "2019-02-17",
    "blurb": "This sermon reflects on the story of Peter's call by Jesus, as told by St Luke. It explores the stages of Peter's call, from Jesus meeting him in his own territory to the transformation of a place of failure into a place of success with Jesus's presence. The sermon encourages us to venture into our 'deep places' of fear and failure, not alone, but with the presence of Christ.",
    "raw_text": "4th Sunday before Lent – Year C – 2019\n\nSunday by Sunday the Scriptures are read the length and breadth of this island. Sermons are preached, people are lead in prayer, in penitence, in praise, in worship. At one level it is part of who we are as individuals, as a community, as a society. Our Christian culture has shaped attitudes, behaviour, our legal system. While our Christian heritage has undoubtedly shaped us as individuals and as a society, by the same token, we have to ask what difference has our Christian culture made, to what extent does it distinguish us from other cultures, other societies?\n\nThat celebrated former Dean of St Patrick’s, Jonathan Swift, once remarked of his own society; “We have enough religion to make us hate, but not enough religion to make us love one another.” At what level does our Christian faith, our Christian practice impact upon our daily living?\n\nThese questions came to mind as I read over and reflected on our Gospel reading for today. This is a familiar story told to us by St Luke of the call of Peter. The details are well known. Jesus teaches the crowd from Peter’s boat; there is the command to go out and put down nets, the large catch, all issuing in Peter’s call.\n\nIt is worth reflecting on how Luke has chosen to tell this story, the way he has brought the elements together, that speaks not just of Peter’s call but sets me thinking about what stage I am at in my own Christian pilgrimage.\n\nThere are four distinct stages to this story:\n\n1. Jesus sees Peter.\n2. asks Peter to pull out a little from the shore\n3. asks Peter to pull out into deep water and put down the nets\n4. Peter’s response and call.\n\nJesus comes upon Peter where he is at, on his own territory. He and his companions had had a difficult night; they are exhausted after a long night with nothing to show for it. God comes to us, meets us where we are at, physically, emotionally, spiritually. There is a prayer of blessing that I would often use that God meets us in the quiet places of our heart, that he speaks to us in gentle understanding, wherever we are, however we may feel.\n\nJesus then invites Peter to go out a little form the shore. This is still home territory, this is where Peter feels at home – at this point, to be with Jesus, to do as Jesus asks is neither threatening or challenging. God invites us to move out a little from the shore, to move on a bit from where he first comes to us. Like Peter, we are still in our comfort zone as we are drawn into simple acts of obedience, simple acts of service.\n\nThen Jesus asks Peter to take a further step – to go further out from the shore, to go out into the deep waters, to put down his nets for a catch. Peter’s response has a tinge of weary compliance. As I say, Peter and his colleagues have had a bad night – out all night with nothing to show for it – they are worn out. But there is something about this stranger and they go. If you think about it for a moment, Luke tells us of them going back to a place of failure and disappointment – but this time in the presence of Jesus. The situation is transformed – a catch beyond their wildest expectations.\n\nThis set me thinking – what is the deep place that Jesus calls us to go out into? Maybe it is a place where we have been before and failed; maybe it is a place where we have been hurt. Maybe it is a place where we are afraid to go. Maybe it is a place we have refused to venture into. A place, a situation where we have tried to serve, have tried to be faithful and we have failed – we have come back emotionally and spiritually bruised. A task we feel we ought to do and yet are afraid to – afraid we would fail, afraid we would hurt ourselves in the process, hurt others. Jesus is there – ‘Come on out into the deep.’ Then of course the call is not to go out alone into the deep, it is a call to go out in the presence of Christ; in the presence of one who can work through even our most abject failures and weaknesses; who can calm our fears, who can make up what is lacking in our service.\n\nAs I have read the story this week, I have come back again and again to Peter heading out into the deep, against perhaps his better judgement. Having gone he discovers the difference the presence of Jesus makes – a place of failure and disappointment is transformed. In words reminiscent of Isaiah in our first lesson, he is suddenly aware of his own weakness and inadequacy and he experiences his own call to follow.\n\nMaybe this week is a week we are spending a little off shore, in the simple tasks of service and obedience that Jesus places upon us in our ordinary day to day discipleship. Or maybe we are being called out into the deep – a broken relationship that needs healing, a hurt that needs confession or forgiveness, a task that needs to be tackled – we are wary of heading out, of getting out of our depth.\n\nMay we go out this week in the knowledge that God goes with us into whatever situation, whatever difficulty – in the midst of it all may we know his presence and his peace.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/4thbeforelent2019.txt",
        "raw_ocr_content": "Page 1 of 4\n4th Sunday before Lent – Year C – 2019\nSunday by Sunday the Scriptures are read the length and breadth of this island.\nSermons are preached, people are lead in prayer, in penitence, in praise, in\nworship. At one level it is part of who we are as individuals, as a community,\nas a society. Our Christian culture has shaped attitudes, behaviour, our legal\nsystem. While our Christian heritage has undoubtedly shaped us as individuals\nand as a society, by the same token, we have to ask what difference has our\nChristian culture made, to what extent does it distinguish us from other\ncultures, other societies?\nThat celebrated former Dean of St Patrick’s, Jonathan Swift, once remarked of\nhis own society; “We have enough religion to make us hate, but not enough\nreligion to make us love one another.” At what level does our Christian faith,\nour Christian practice impact upon our daily living?\nThese questions came to mind as I read over and reflected on our Gospel\nreading for today. This is a familiar story told to us by St Luke of the call of\nPeter. The details are well known. Jesus teaches the crowd from Peter’s boat;\nthere is the command to go out and put down nets, the large catch, all issuing in\nPeter’s call.\nIt is worth reflecting on how Luke has chosen to tell this story, the way he has\nbrought the elements together, that speaks not just of Peter’s call but sets me\nthinking about what stage I am at in my own Christian pilgrimage.\nPage 2 of 4\n4th Sunday before Lent – Year C – 2019\nThere are four distinct stages to this story:\nJesus sees Peter.\nasks Peter to pull out a little from the shore\nasks Peter to pull out into deep water and put down the nets\nPeter’s response and call.\nJesus comes upon Peter where he is at, on his own territory. He and his\ncompanions had had a difficult night; they are exhausted after a long night\nwith nothing to show for it. God comes to us, meets us where we are at,\nphysically, emotionally, spiritually. There is a prayer of blessing that I would\noften use that God meets us in the quiet places of our heart, that he speaks to us\nin gentle understanding, wherever we are, however we may feel.\nJesus then invites Peter to go out a little form the shore. This is still home\nterritory, this is where Peter feels at home – at this point, to be with Jesus, to do\nas Jesus asks is neither threatening or challenging. God invites us to move out\na little from the shore, to move on a bit from where he first comes to us. Like\nPeter, we are still in our comfort zone as we are drawn into simple acts of\nobedience, simple acts of service.\nThen Jesus asks Peter to take a further step – to go further out from the shore,\nto go out into the deep waters, to put down his nets for a catch. Peter’s\nresponse has a tinge of weary compliance. As I say, Peter and his colleagues\nPage 3 of 4\n4th Sunday before Lent – Year C – 2019\nhave had a bad night – out all night with nothing to show for it – they are worn\nout. But there is something about this stranger and they go. If you think about\nit for a moment, Luke tells us of them going back to a place of failure and\ndisappointment – but this time in the presence of Jesus. The situation is\ntransformed – a catch beyond their wildest expectations.\nThis set me thinking – what is the deep place that Jesus calls us to go out into?\nMaybe it is a place where we have been before and failed; maybe it is a place\nwhere we have been hurt. Maybe it is a place where we are afraid to go.\nMaybe it is a place we have refused to venture into. A place, a situation where\nwe have tried to serve, have tried to be faithful and we have failed – we have\ncome back emotionally and spiritually bruised. A task we feel we ought to do\nand yet are afraid to – afraid we would fail, afraid we would hurt ourselves in\nthe process, hurt others. Jesus is there – ‘Come on out into the deep.’ Then of\ncourse the call is not to go out alone into the deep, it is a call to go out in the\npresence of Christ; in the presence of one who can work through even our most\nabject failures and weaknesses; who can calm our fears, who can make up what\nis lacking in our service.\nAs I have read the story this week, I have come back again and again to Peter\nheading out into the deep, against perhaps his better judgement. Having gone\nhe discovers the difference the presence of Jesus makes – a place of failure and\ndisappointment is transformed. In words reminiscent of Isaiah in our first\nPage 4 of 4\n4th Sunday before Lent – Year C – 2019\nlesson, he is suddenly aware of his own weakness and inadequacy and he\nexperiences his own call to follow.\nMaybe this week is a week we are spending a little off shore, in the simple\ntasks of service and obedience that Jesus places upon us in our ordinary day to\nday discipleship. Or maybe we are being called out into the deep – a broken\nrelationship that needs healing, a hurt that needs confession or forgiveness, a\ntask that needs to be tackled – we are wary of heading out, of getting out of our\ndepth.\nMay we go out this week in the knowledge that God goes with us into\nwhatever situation, whatever difficulty – in the midst of it all may we know his\npresence and his peace."
    }
}