{
    "title": "Guided Journey",
    "date": "2020-05-10",
    "blurb": "This sermon is about finding directions in life with Jesus as our guide. It draws parallels between our spiritual journey and a physical journey, with Jesus as our spiritual 'dragoman' who goes ahead of us to prepare the way. The sermon encourages us to press on towards our ultimate goal of union with Christ, with the understanding that we are all learners on this path of faith.",
    "raw_text": "A number of years ago Rachel and I were in Kathmandu, the capital of Nepal. Kathmandu is a busy, bustling place – lots of noise, lots of traffic and you rarely see any street signs – you look out for landmarks to mark your return journey.\n\nWe had gone to visit a particular place and started to make our way back to the hotel. We soon realised that we had missed a turn and were lost. We went into a shop to ask directions to our hotel. The manager started to explain the route and then called a member of his staff and told him to lead us back to where we were staying. We arrived safely and when we went to offer a tip, it was politely refused – he was simply doing what his boss had asked him to do, to help visitors in a strange city.\n\nFinding directions is what our Gospel reading is about. Disciples asking of Jesus, where are you going? How can we go if we do not know the way?\n\nLast week, as we reflected on our Gospel reading, we were thinking of shepherds, particularly shepherds in 1st century Palestine. The shepherd was one who stayed with the flock, one who knows and is known by his sheep. This would have been a familiar picture to those who were listening to Jesus as he spoke of sheep and shepherds.\n\nIn our Gospel reading, we return to Jesus in the upper room with his disciples on the night before he died. To the distress and confusion of the disciples he talks of going.\n\n> 'In my Father’s house there are many dwelling-places. If it were not so, would I have told you that I go to prepare a place for you? And if I go and prepare a place for you, I will come again and will take you to myself, so that where I am, there you may be also. John 14:2ff'\n\nThe word that we have translated as dwelling places (μοναὶ), is one that would have been familiar to Jesus’ hearers. 1st century Palestine sat at the junction of several major trade routes along which camel caravans transported goods to and from Egypt, Asia Minor and beyond. Along these routes would be a string of μοναὶ, resting places. Places where the travellers could rest, where they could water and feed their animals before moving on to the next resting place on their route. Each caravan would employ a dragoman. The function of the dragoman was to go ahead of the caravan, to identify and prepare a resting spot for the travellers, before returning and guiding the caravan towards it.\n\nJesus, speaks of going ahead, returning:\n\n> 'And if I go and prepare a place for you, I will come back and take you to be with me that you also may be where I am. John 14:3'\n\nI see this on two levels; there is that ultimate journey through life, through death to our ultimate union with him. But there are also the various stages along that road, as we draw into a deeper understanding of Christ, who he is, who he calls me to be. Jesus offers himself as a spiritual dragoman, a companion along the way.\n\nAs I reflected on that, my mind turned to Paul’s Letter to the Philippians. Paul is reflecting on his own journey of faith, his own developing understanding. He writes:\n\n> 'I want to know Christ—yes, to know the power of his resurrection and participation in his sufferings, becoming like him in his death, and so, somehow, attaining to the resurrection from the dead.\n\n> Not that I have already obtained all this, or have already arrived at my goal, but I press on to take hold of that for which Christ Jesus took hold of me. Brothers and sisters, I do not consider myself yet to have taken hold of it. But one thing I do: Forgetting what is behind and straining toward what is ahead, I press on toward the goal to win the prize for which God has called me heavenward in Christ Jesus. Philippians 3:12ff'\n\nNot that I have already obtained all this, or have already arrived at my goal. I take great comfort in the fact that Paul still sees himself as a learner on the path of faith.\n\n> 'but I press on to take hold of that for which Christ Jesus took hold of me. Brothers and sisters, I do not consider myself yet to have taken hold of it. But one thing I do: Forgetting what is behind and straining toward what is ahead, I press on toward the goal'\n\nWhenever I read that I have a picture of walking across rough terrain. You come to a ditch or a fence and there is someone who has gone ahead who turns to reach back to help me across the ditch, over the fence.\n\nWe are all on a journey, with Christ, into Christ. We travel that journey with our eyes on the ultimate goal, our communion with Christ and those who have gone before us in the faith. In the words of the writer of the Letter to the Hebrews:\n\n> 'let us run with perseverance the race that is set before us, looking to Jesus the pioneer and perfecter of our faith, Hebrews 12:1,2'\n\nThe risen Christ meets us at different points along that journey, leading us further onwards.\n\nWe travel that journey in community, as fellow travellers with our sisters and brothers in Christ. As we have thought so often in these weeks after Easter, at times we draw upon the strength and encouragement of our fellow travellers. At other times it falls to us to be the ones to encourage others along the way as we are Christ for one another along the road of life.\n\nI will just close with the words of Hymn 611 in our hymn book, which takes its inspiration from that ancient Irish hymn, St Patrick’s Breastplate.\n\n> '1 Christ be beside me,\n> Christ be before me,\n> Christ be behind me,\n> King of my heart.\n> Christ be within me,\n> Christ be below me,\n> Christ be above me,\n> never to part.\n> 2 Christ on my right hand,\n> Christ on my left hand,\n> Christ all around me,\n> shield in the strife.\n> Christ in my sleeping,\n> Christ in my sitting,\n> Christ in my rising,\n> never to part.\n> 3 Christ be in all hearts\n> thinking about me,\n> Christ be on all tongues\n> telling of me.\n> Christ be the vision\n> in eyes that see me,\n> in ears that hear me,\n> Christ ever be.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/5ofeaster2020.txt",
        "raw_ocr_content": "Page 1 of 4\n5th Sunday of Easter – Year A – 2020\nLink to YouTube Service - https://youtu.be/xi6xfrqKNJQ\nA number of years ago Rachel and I were in Kathmandu, the capital of Nepal.\nKathmandu is a busy, bustling place – lots of noise, lots of traffic and you\nrarely see any street signs – you look out for landmarks to mark your return\njourney.\nWe had gone to visit a particular place and started to make our way back to the\nhotel. We soon realised that we had missed a turn and were lost. We went into\na shop to ask directions to our hotel. The manager started to explain the route\nand then called a member of his staff and told him to lead us back to where we\nwere staying. We arrived safely and when we went to offer a tip, it was\npolitely refused – he was simply doing what his boss had asked him to do, to\nhelp visitors in a strange city.\nFinding directions is what our Gospel reading is about. Disciples asking of\nJesus, where are you going? How can we go if we do not know the way?\nLast week, as we reflected on our Gospel reading, we were thinking of\nshepherds, particularly shepherds in 1st century Palestine. The shepherd was\none who stayed with the flock, one who knows and is known by his sheep.\nThis would have been a familiar picture to those who were listening to Jesus as\nhe spoke of sheep and shepherds.\nIn our Gospel reading, we return to Jesus in the upper room with his disciples\non the night before he died. To the distress and confusion of the disciples he\ntalks of going.\nPage 2 of 4\n5th Sunday of Easter – Year A – 2020\n2In my Father’s house there are many dwelling-places. If it were not\nso, would I have told you that I go to prepare a place for you? 3And if\nI go and prepare a place for you, I will come again and will take you\nto myself, so that where I am, there you may be also. John 14:2ff\nThe word that we have translated as dwelling places (μοναὶ), is one that would\nhave been familiar to Jesus’ hearers. 1st century Palestine sat at the junction of\nseveral major trade routes along which camel caravans transported goods to\nand from Egypt, Asia Minor and beyond. Along these routes would be a string\nof μοναὶ, resting places. Places where the travellers could rest, where they\ncould water and feed their animals before moving on to the next resting place\non their route. Each caravan would employ a dragoman. The function of the\ndragoman was to go ahead of the caravan, to identify and prepare a resting spot\nfor the travellers, before returning and guiding the caravan towards it.\nJesus, speaks of going ahead, returning:\nAnd if I go and prepare a place for you, I will come back and take you\nto be with me that you also may be where I am. John 14:3\nI see this on two levels; there is that ultimate journey through life, through\ndeath to our ultimate union with him. But there are also the various stages\nalong that road, as we draw into a deeper understanding of Christ, who he is,\nwho he calls me to be. Jesus offers himself as a spiritual dragoman, a\ncompanion along the way.\nAs I reflected on that, my mind turned to Paul’s Letter to the Philippians. Paul\nis reflecting on his own journey of faith, his own developing understanding.\nHe writes:\nPage 3 of 4\n5th Sunday of Easter – Year A – 2020\nI want to know Christ—yes, to know the power of his resurrection and\nparticipation in his sufferings, becoming like him in his death, and so,\nsomehow, attaining to the resurrection from the dead.\nNot that I have already obtained all this, or have already arrived at my\ngoal, but I press on to take hold of that for which Christ Jesus took\nhold of me. Brothers and sisters, I do not consider myself yet to have\ntaken hold of it. But one thing I do: Forgetting what is behind and\nstraining toward what is ahead, I press on toward the goal to win the\nprize for which God has called me heavenward in Christ Jesus.\nPhilippians 3:12ff\nNot that I have already obtained all this, or have already arrived at my goal.\nI take great comfort in the fact that Paul still sees himself as a learner on the\npath of faith.\nbut I press on to take hold of that for which Christ Jesus took hold of me. Brothers and\nsisters, I do not consider myself yet to have taken hold of it. But one thing I do: Forgetting\nwhat is behind and straining toward what is ahead, I press on toward the goal\nWhenever I read that I have a picture of walking across rough terrain. You\ncome to a ditch or a fence and there is someone who has gone ahead who turns\nto reach back to help me across the ditch, over the fence.\nWe are all on a journey, with Christ, into Christ. We travel that journey with\nour eyes on the ultimate goal, our communion with Christ and those who have\ngone before us in the faith. In the words of the writer of the Letter to the\nHebrews:\nlet us run with perseverance the race that is set before us, looking to\nJesus the pioneer and perfecter of our faith, Hebrews 12:1,2\nThe risen Christ meets us at different points along that journey, leading us\nfurther onwards.\nPage 4 of 4\n5th Sunday of Easter – Year A – 2020\nWe travel that journey in community, as fellow travellers with our sisters and\nbrothers in Christ. As we have thought so often in these weeks after Easter, at\ntimes we draw upon the strength and encouragement of our fellow travellers.\nAt other times it falls to us to be the ones to encourage others along the way as\nwe are Christ for one another along the road of life.\nI will just close with the words of Hymn 611 in our hymn book, which takes its\ninspiration from that ancient Irish hymn, St Patrick’s Breastplate.\n1 Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part.\n2 Christ on my right hand,\nChrist on my left hand,\nChrist all around me,\nshield in the strife.\nChrist in my sleeping,\nChrist in my sitting,\nChrist in my rising,\nnever to part.\n3 Christ be in all hearts\nthinking about me,\nChrist be on all tongues\ntelling of me.\nChrist be the vision\nin eyes that see me,\nin ears that hear me,\nChrist ever be."
    }
}