{
    "title": "The God Particle and the Incarnation",
    "date": "2011-12-18",
    "blurb": "This sermon explores the intersection of scientific and religious truth, drawing parallels between the search for the Higgs Boson, or 'God Particle', and the Christian understanding of the Incarnation. The sermon emphasizes the radical message of Jesus, who challenges worldly power and calls for a more authentic way of living.",
    "raw_text": "Over the last few weeks we have been hearing news of results of a series of experiments taking place using a mysterious piece of equipment, the Large Hadron Collider at Geneva. This monster particle accelerator, with its capacity to produce very high energy particle beams travelling close to the speed of light, capable of simulating conditions thought to have existed at the time of the Big Bang, the very beginnings of our Universe. It was constructed with the aim of investigating the existence of a particle that up to now has only existed in the fevered minds of the theoretical physicist, the Higgs Boson. This particle, whose existence is suggested by the so called Standard Model on which the current understanding of atomic and nuclear structures is based. This Higgs Boson has been called the God-particle, a sort of Holy Grail of Nuclear physicists, would actually explain the whole concept of mass. Failure to find it in the course of these experiments would send theoretical physicists back to the drawing board.\n\nDuring these last few weeks scientists working at the Large Hadron Collider have reported that they have detected the first possible signs of the illusive Higgs Boson. As one who has held a near life-long passionate belief in the coherence of scientific and religious truth, I have found all this quite exciting. Ernest Walton, the Nobel Laureate, who was Professor of Physics in my time in Trinity once declared that the scientist and the theologian are both seeking after truth; and truth will never contradict truth. He was convinced that the scientist, engaged in the study of the created order, was engaged in a study of nothing less than the work of the Creator.\n\nThose initial results of the experiments conducted in the Large Hadron Collider suggest we are getting glimpses of the fundamental ordering of our physical universe.\n\nThe work of the scientist, as Ernest Walton would have recognised, does not provide the sum total of our understanding of truth. As we approach Christmas, the Feast of the Incarnation, we celebrate a fundamental conviction that lies at the heart of the Christ faith. Theologians down through the years have struggled with expressing this but at the heart of it is the message found in the opening section of the 1st Letter of John (I am quoting from the Message translation).\n\n> 1Jn1:1-2 From the very first day, we were there, taking it all in—we heard it with our own ears, saw it with our own eyes, verified it with our own hands. The Word of Life appeared right before our eyes; we saw it happen! And now we’re telling you in most sober prose that what we witnessed was, incredibly, this: The infinite Life of God himself took shape before us.\n\n> 1Jn1:3-4 We saw it, we heard it, and now we’re telling you so you can experience it along with us, this experience of communion with the Father and his Son, Jesus Christ. Our motive for writing is simply this: We want you to enjoy this, too. Your joy will double our joy!\n\n1 John 1:1ff\n\nStripping aside all theological niceties, what is being said here is that in the person of Jesus, we get a glimpse of God. We get an insight into the nature of God. As I was reflecting at the 9:30 service last Sunday, one of the chants used in worship in the Taize community picks up one of the themes of Psalm 27.\n\n> ‘I am sure I shall see the goodness of the Lord in the land of the living.\nYes, I shall see the goodness of the Lord; hold firm, trust in the Lord.’\n\nWhat is the nature of that goodness that I encounter in the person of Jesus? In many ways, in the way in which we celebrate Christmas, we have tamed the Incarnation. It is a lovely family occasion, like everyone else I really enjoy watching the excitement, the innocence of young children as they talk in hushed tones of their meeting with Santa. It is lovely to see our Churches decorated, to hear the traditional carols and I for one love the Family Service here on Christmas Day. But, without wanting to be a Scrooge, the very festivity of this occasion perhaps blunts the quite radical content of the message this child whose birth we celebrate came to proclaim. That is why I think it very appropriate that on this Sunday before Christmas, in the place of the Psalm we use the Magnificat, the Song of Mary as given to us by St Luke in which a young woman reflects on the child she is to bear.\n\nThe traditional images of Christmas, Joseph, Mary, shepherds, wise men gathered around the crib in the warm glow of candlelight are a cherished part of Christmas but they are not the whole story of Christmas. For behind the story of Christmas is the God of the Magnificat, the one who brings down rulers from their thrones and lifts up the humble; who fills the hungry with good things and who sends the rich empty handed away.\n\nThis is an example of the timeless quality of the Biblical message. Set as it is in a particular time and culture, it none the less resonates with the situation of our own day. In the world about us we see incredible examples of the arrogance and transitory nature of temporal power. We have seen the ongoing pain of Syria where established power of President Assad shows violent contempt for any who would seek to challenge his right to rule. We see the continuing havoc wrought by individual leaders in the world of corporate finance who through a mixture of greed and incompetence brought their companies to the point of collapse; then as the taxpayer faces up to years of austerity, these same people, pleading personal poverty, seek to avoid the personal consequences of the damage they have wrought on this State.\n\nIn the Incarnation, this God of the Magnificat, comes among us in the child of Bethlehem, comes among us to call us to a new, more authentic way of living before God. And so we prepare to celebrate the coming of him who declared that ‘the first shall be last and the last first’; the one who, as his disciples bickered among themselves as to who was going to be the greatest among them, placed a little child in their midst, declaring that except you become as a little child, you shall not enter the kingdom of heaven.’ He was the one, who on the night of the Last Supper, laid aside his coat, taking on the task of the least of the household servants, washing the feet of his disciples:\n\n> Jn 13:12 After he had washed their feet, had put on his robe, and had returned to the table, he said to them, \"Do you know what I have done to you? 13 You call me Teacher and Lord--and you are right, for that is what I am. 14 So if I, your Lord and Teacher, have washed your feet, you also ought to wash one another's feet. 15 For I have set you an example, that you also should do as I have done to you. John 13:12ff\n\nI spoke at the beginning of gaining glimpses of reality, insights into truths at the heart of our understanding of the physical universe. In the midst of our celebrations, both here and in our homes, may God grant to us a deeper insight into the life and teaching of Christ.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/year B/advent42011.txt",
        "raw_ocr_content": "Over the last few weeks we have been hearing news of results of a series of\nexperiments taking place using a mysterious piece of equipment, the Large\nHadron Collider at Geneva. This monster particle accelerator , with its\ncapacity to produce very high energy particle beams travelling close to the\nspeed of light, capable of simulating conditions thought to have existed at the\ntime of the Big Bang, the very beginnings of our Universe. It was constructed\nwith the aim of investigating the existence of a particle that up to now has only\nexisted in the fevered minds of the theoretical physicist, the Higgs Boson. This\nparticle, whose existence is suggested by the so called Standard Model on\nwhich the current understanding of atomic and nuclear structures is based.\nThis Higgs Boson has been called the God-particle, a sort of Holy Grail of\nNuclear physicists, would actually explain the whole concept of mass. Failure\nto find it in the course of these experiments would send theoretical physicists\nback to the drawing board.\nDuring these last few weeks scientists working at the Large Hadron Collider\nhave reported that they have detected the first possible signs of the illusive\nHiggs Boson. As one who has held a near life-long passionate belief in the\ncoherence of scientific and religious truth, I have found all this quite exciting.\nErnest Walton, the Nobel Laureate, who was Professor of Physics in my time\nin Trinity once declared that the scientist and the theologian are both seeking\nafter truth; and truth will never contradict truth. He was convinced that the\nscientist, engaged in the study of the created order, was engaged in a study of\nnothing less than the work of the Creator.\nThose initial results of the experiments conducted in the Large Hadron Collider\nsuggest we are getting glimpses of the fundamental ordering of our physical\nuniverse.\nThe work of the scientist, as Ernest Walton would have recognised, does not\nprovide the sum total of our understanding of truth. As we approach\nChristmas, the Feast of the Incarnation, we celebrate a fundamental conviction\nthat lies at the heart of the Christ faith. Theologians down through the years\nhave struggled with expressing this but at the heart of it is the message found in\nthe opening section of the 1st Letter of John (I am quoting from the Message\ntranslation).\n1Jn1:1-2 From the very first day, we were there, taking it all in—we heard it\nwith our own ears, saw it with our own eyes, verified it with our own\nhands. The Word of Life appeared right before our eyes; we saw it\nhappen! And now we’re telling you in most sober prose that what we\nwitnessed was, incredibly, this: The infinite Life of God himself took\nshape before us.\n1Jn1:3-4 We saw it, we heard it, and now we’re telling you so you can\nexperience it along with us, this experience of communion with the\nFather and his Son, Jesus Christ. Our motive for writing is simply this:\nWe want you to enjoy this, too. Your joy will double our joy!\n1 John 1:1ff\nStripping aside all theological niceties, what is being said here is that in the\nperson of Jesus, we get a glimpse of God. We get an insight into the nature of\nGod. As I was reflecting at the 9:30 service last Sunday, one of the chants used\nin worship in the Taize community picks up one of the themes of Psalm 27.\n‘I am sure I shall see the goodness of the Lord in the land of the living.\nYes, I shall see the goodness of the Lord; hold firm, trust in the Lord.’\nWhat is the nature of that goodness that I encounter in the person of Jesus? In\nmany ways, in the way in which we celebrate Christmas, we have tamed the\nIncarnation. It is a lovely family occasion, like everyone else I really enjoy\nwatching the excitement, the innocence of young children as they talk in\nhushed tones of their meeting with Santa. It is lovely to see our Churches\ndecorated, to hear the traditional carols and I for one love the Family Service\nhere on Christmas Day. But, without wanting to be a Scrooge, the very\nfestivity of this occasion perhaps blunts the quite radical content of the\nmessage this child whose birth we celebrate came to proclaim. That is why I\nthink it very appropriate that on this Sunday before Christmas, in the place of\nthe Psalm we use the Magnificat, the Song of Mary as given to us by St Luke\nin which a young woman reflects on the child she is to bear.\nThe traditional images of Christmas, Joseph, Mary, shepherds, wise men\ngathered around the crib in the warm glow of candlelight are a cherished part\nof Christmas but they are not the whole story of Christmas. For behind the\nstory of Christmas is the God of the Magnificat, the one who brings down\nrulers from their thrones and lifts up the humble; who fills the hungry with\ngood things and who sends the rich empty handed away.\nThis is an example of the timeless quality of the Biblical message. Set as it is\nin a particular time and culture, it none the less resonates with the situation of\nour own day. In the world about us we see incredible examples of the\narrogance and transitory nature of temporal power. We have seen the ongoing\npain of Syria where established power of President Assad shows violent\ncontempt for any who would seek to challenge his right to rule. We see the\ncontinuing havoc wrought by individual leaders in the world of corporate\nfinance who through a mixture of greed and incompetence brought their\ncompanies to the point of collapse; then as the taxpayer faces up to years of\nausterity, these same people, pleading personal poverty, seek to avoid the\npersonal consequences of the damage they have wrought on this State.\nIn the Incarnation, this God of the Magnificat, comes among us in the child of\nBethlehem, comes among us to call us to a new, more authentic way of living\nbefore God. And so we prepare to celebrate the coming of him who declared\nthat ‘the first shall be last and the last first’; the one who, as his disciples\nbickered among themselves as to who was going to be the greatest among\nthem, placed a little child in their midst, declaring that except you become as a\nlittle child, you shall not enter the kingdom of heaven.’ He was the one, who\non the night of the Last Supper, laid aside his coat, taking on the task of the\nleast of the household servants, washing the feet of his disciples:\nJn 13:12 After he had washed their feet, had put on his robe, and had returned to\nthe table, he said to them, \"Do you know what I have done to you? 13 You\ncall me Teacher and Lord--and you are right, for that is what I am. 14 So if I,\nyour Lord and Teacher, have washed your feet, you also ought to wash one\nanother's feet. 15 For I have set you an example, that you also should do as I\nhave done to you. John 13:12ff\nI spoke at the beginning of gaining glimpses of reality, insights into truths at\nthe heart of our understanding of the physical universe. In the midst of our\ncelebrations, both here and in our homes, may God grant to us a deeper insight\ninto the life and teaching of Christ.\nHymn 150\n1 Born in the night,\nMary’s child,\na long way from your home;\ncoming in need,\nMary’s child,\nborn in a borrowed room.\n2 Clear shing light,\nMary’s child,\nyour face lights up our way;\nlight of the world,\nMary’s child,\ndawn on our darkened day.\n3 Truth of our life,\nMary’s child,\nyou tell us God is good;\nprove it is true,\nMary’s child,\ngo to your cross of wood.\n4 Hope of the world,\nMary’s child,\nyou’re coming soon to reign;\nKing of the earth,\nMary’s child,\nwalk in our streets again.\nGeoffrey Ainger (b. 1925)"
    }
}