{
    "title": "Anticipation and Expectation",
    "date": "2017-12-24",
    "blurb": "In this sermon, Kevin explores the anticipation and excitement that comes with the expected arrival of a child, drawing parallels with the anticipation of the coming of Christ. He discusses the emotions of expectation and excitement in the context of the Gospel reading, the account of Mary's visit to her cousin Elizabeth. The sermon also reflects on the nature of God's coming Kingdom as described in the Magnificat, highlighting its transformative power.",
    "raw_text": "On this Sunday, the day before Christmas, it is lovely to be celebrating a Baptism in the context of our morning service. I want to begin with the sense of anticipation and excitement that comes with the expected arrival of a child in a house.\n\nThere are all those questions that are asked of parents. When is the baby due? Do you know whether it is to be a boy or a girl? Have you chosen any names yet? The mother is asked all those intrusive questions, are you happy, are you surprised, are you feeling well, are you feeling sick, how long will you be working for?\n\nThen for the parents themselves there are those first precious signs of life; those first kicks, listening for the heart beat. Then we go for those first ultrasound scans. In our day there was a white haze with the vague outline of a skull – now of course you see the head, the arms, the legs, even features of the face. Then there is the whole process of preparing for the arrival of the child in the home. I don’t mean just the paraphernalia of cots, car seats, push chairs, changing mats and all the rest. A new life is coming, a new life that is going to change that home for ever.\n\nAs parents we wonder what lies ahead for our children. How will this world, this country, this society be in 20, 30, 40 years time? What talents will they develop, what career paths will they follow, what relationships will they form? For John and Catherine’s parents, as with all grandparents, to see the arrival of your grandchildren is a wonderful milestone in our own journey of parenthood.\n\nWhat we are talking about here is a sense of anticipation, of expectation, of excitement. It is with these emotions in mind that approach our reading of our Gospel reading, the account of the visit of one expectant mother to another, of Mary to her cousin Elizabeth. We are told that Elizabeth’s child, who would grow up to be John the Baptist, stirred in the womb as Mary entered the house. Elizabeth greets Mary with words of homage and affection. In the story as related to us by St Luke, Mary responds in words that are now known to us as the Magnificat, sung as one of the canticles at Evening Prayer.\n\nThe words speak of the nature of God’s coming Kingdom. As we were thinking about last Sunday, there was an expectation in contemporary Judaism of a Messianic figure who would overthrow Roman rule and usher in a new Kingdom, God’s Kingdom, centred on Jerusalem. The Magnificat speaks, in what I’ve called ‘upside down’ language of God’s coming in very different terms.\n\n> 50His mercy is for those who fear him\n> from generation to generation.\n> 51He has shown strength with his arm;\n> he has scattered the proud in the thoughts of their hearts.\n> 52He has brought down the powerful from their thrones,\n> and lifted up the lowly;\n> 53he has filled the hungry with good things,\n> and sent the rich away empty. Luke 1:50-53\n\nWords which echo the message of Isaiah that Jesus was read in the synagogue of his home town in Nazareth:\n\n> he has sent me to bring good news to the oppressed,\n> to bind up the broken-hearted,\n> to proclaim liberty to the captives,\n> and release to the prisoners;\n\nThis is the man whose birth we celebrate; this is the Christ we prepare to welcome in our hearts. As we were thinking last week, Advent and Christmas remind us that ours is an incarnational faith; that in the person of Jesus we come face to face with God; that in the person of Jesus was and continues to be living and active in the world, in the lives of those standing on the side of the poor and the marginalised, those taking a stand for justice in the face of injustice, those bearing witness to peace and reconciliation in the face of those who would foster division. In short, in the life and ministry of Jesus, his teaching in word and action, God offers a different vision, a different perspective on this wounded and troubled world, a vision we are called to share in our personal and community life.\n\nAs followers of Christ, as ones baptised in the name of Christ, we are called to offer that different vision. In the face of despair we are called to offer hope; in the world where sleight of hand, where half truth and innuendo have seemed to prevail, we are called to be signs of integrity, of truth. In a world that is fractured along so many lines of culture, of race, economically, socially, we are called to be instruments of reconciliation. May the child we baptise today come to see something of that vision in the life of her family, in the life of this community.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year B/advent42017.txt",
        "raw_ocr_content": "Page 1 of 3\nADVENT 4 – Year B – 2017\nOn this Sunday, the day before Christmas, it is lovely to be celebrating a\nBaptism in the context of our morning service. I want to begin with the sense\nof anticipation and excitement that comes with the expected arrival of a child\nin a house.\nThere are all those questions that are asked of parents. When is the baby due?\nDo you know whether it is to be a boy or a girl? Have you chosen any names\nyet? The mother is asked all those intrusive questions, are you happy, are you\nsurprised, are you feeling well, are you feeling sick, how long will you be\nworking for?\nThen for the parents themselves there are those first precious signs of life;\nthose first kicks, listening for the heart beat. Then we go for those first\nultrasound scans. In our day there was a white haze with the vague outline of a\nskull – now of course you see the head, the arms, the legs, even features of the\nface. Then there is the whole process of preparing for the arrival of the child in\nthe home. I don’t mean just the paraphernalia of cots, car seats, push chairs,\nchanging mats and all the rest. A new life is coming, a new life that is going to\nchange that home for ever.\nAs parents we wonder what lies ahead for our children. How will this world,\nthis country, this society be in 20, 30, 40 years time? What talents will they\ndevelop, what career paths will they follow, what relationships will they form?\nFor John and Catherine’s parents, as with all grandparents, to see the arrival of\nyour grandchildren is a wonderful milestone in our own journey of parenthood.\nPage 2 of 3\nADVENT 4 – Year B – 2017\nWhat we are talking about here is a sense of anticipation, of expectation, of\nexcitement. It is with these emotions in mind that approach our reading of our\nGospel reading, the account of the visit of one expectant mother to another, of\nMary to her cousin Elizabeth. We are told that Elizabeth’s child, who would\ngrow up to be John the Baptist, stirred in the womb as Mary entered the house.\nElizabeth greets Mary with words of homage and affection. In the story as\nrelated to us by St Luke, Mary responds in words that are now known to us as\nthe Magnificat, sung as one of the canticles at Evening Prayer.\nThe words speak of the nature of God’s coming Kingdom. As we were\nthinking about last Sunday, there was an expectation in contemporary Judaism\nof a Messianic figure who would overthrow Roman rule and usher in a new\nKingdom, God’s Kingdom, centred on Jerusalem. The Magnificat speaks, in\nwhat I’ve called ‘upside down’ language of God’s coming in very different\nterms.\n50His mercy is for those who fear him\nfrom generation to generation.\n51He has shown strength with his arm;\nhe has scattered the proud in the thoughts of their hearts.\n52He has brought down the powerful from their thrones,\nand lifted up the lowly;\n53he has filled the hungry with good things,\nand sent the rich away empty. Luke 1:50-53\nWords which echo the message of Isaiah that Jesus was read in the synagogue\nof his home town in Nazareth:\nhe has sent me to bring good news to the oppressed,\nto bind up the broken-hearted,\nto proclaim liberty to the captives,\nand release to the prisoners;\nPage 3 of 3\nADVENT 4 – Year B – 2017\n2to proclaim the year of the LORD’s favour,\nThis is the man whose birth we celebrate; this is the Christ we prepare to\nwelcome in our hearts. As we were thinking last week, Advent and Christmas\nremind us that ours is an incarnational faith; that in the person of Jesus we\ncome face to face with God; that in the person of Jesus was and continues to be\nliving and active in the world, in the lives of those standing on the side of the\npoor and the marginalised, those taking a stand for justice in the face of\ninjustice, those bearing witness to peace and reconciliation in the face of those\nwho would foster division. In short, in the life and ministry of Jesus, his\nteaching in word and action, God offers a different vision, a different\nperspective on this wounded and troubled world, a vision we are called to share\nin our personal and community life.\nAs followers of Christ, as ones baptised in the name of Christ, we are called to\noffer that different vision. In the face of despair we are called to offer hope; in\nthe world where sleight of hand, where half truth and innuendo have seemed to\nprevail, we are called to be signs of integrity, of truth. In a world that is\nfractured along so many lines of culture, of race, economically, socially, we are\ncalled to be instruments of reconciliation. May the child we baptise today\ncome to see something of that vision in the life of her family, in the life of this\ncommunity."
    }
}