{
    "title": "Healing and Wholeness",
    "date": "2009-11-29",
    "blurb": "This sermon delivered on the first Sunday of Advent in 2009 discusses the concept of healing in the Christian Gospel and the Church's role as a community of healing. It reflects on the Church's responsibility to embody Christ in today's world and to be an instrument of deep, fundamental healing. The sermon also addresses the importance of love, commitment, and a sense of belonging in expressing God's love.",
    "raw_text": "Healing is a word that has been associated with the Christian Gospel from the very outset. The writers of the Gospels, in their accounts of the ministry of Jesus, all speak of his healing miracles – of the skin of the leper, the sight of the blind, the hearing of the deaf, the limbs of the lame, the mind of the deranged, the speech of the dumb – all are restored at the touch or the word of Jesus – visible signs of a broken creation, healed, restored to its former perfection.\n\nThe Church, from the very early times, was involved in a healing ministry in the establishment of hospitals for the care of the sick. In our own city the Adelaide, the Rotunda, St Vincents, the Mater, to name but a few, all owe their origins to Christian foundation. Healing, the care for the sick, has always been at the heart of Christian witness. In recent times the ministry of healing, the ministry of prayer and laying on of hands has been reaffirmed in the life of the Church.\n\nToday, as we celebrate in the context of our 11:00 service, the Service of Wholeness and Healing, I want to reflect on the wider issues of healing, of wholeness, in the life of the Church. I want to begin with a description of the Church that encourages us to do this. “The Church is a community of healing”. I want to set that alongside words from our Epistle set for today:\n\n> 'And may the Lord make you increase and abound in love for one another and for all, just as we abound in love for you. And may he so strengthen your hearts in holiness ...' 1 Thess 3:12-13\n\nIn a week that has seen the publication of a report that struck at the very heart of Irish society we have been left with feeling a mixture of shock, of anger, of disbelief as we reflect on a history of abuse, of collusion, of secrecy, of shame in the corridors of Church and State.\n\nWhat place does the Church, what place can the Church have in Irish society? As I reflected on that in my own heart, I thought of words from the Book of the Prophet Isaiah: 'Look to the rock from which you were hewn' Is 51:1\n\nLook to the person of Christ, look to him who called the Church into being, who gave of himself totally and utterly; who as disciples bickered over status said;, 'I am among you as one who serves', 'The greatest among you will be your servant.'\n\nOne of the most profound expressions of the nature of the Church in the new Testament is 'The Body of Christ'. That has always emphasised for me that the Church is more than, much more than, the institutions, the traditions that have often clouded that fundamental vision of the Church as a community called to embody, to incarnate, Christ in the world of today. We are to be nothing less than the hands, the lips, the feet of Christ in the world of today.\n\nAs we have already reflected, healing, deep fundamental healing lay at the heart of the ministry of Jesus. His healing acts are presented in the Gospel as vivid signs of a healing of the created order as, in the words of Isaiah:\n\n> 'Then the eyes of the blind shall be opened, and the ears of the deaf unstopped; then the lame shall leap like a deer, and the tongue of the speechless sing for joy. For waters shall break forth in the wilderness, and streams in the desert; the burning sand shall become a pool, and the thirsty ground springs of water;' Is 35:5-7\n\nAnd so the Church, as the Body of Christ, not only can be, but must be an instrument of healing, deep fundamental healing in the world of today.\n\n> 'May the Lord make you increase and abound in love for one another and for all'\n\nLove is always focussed on the other, always embodies a commitment to the other and includes a sense of belonging. This love is 'for one another and for all'. This means this love is not just to be expressed for one another within the cosy fellowship of the group, it is a love that is to be directed out to the world that we are called to serve in the name of Christ.\n\nIt is this spirit of expressing the love of God in the name of god that motivated Christians of previous generations to found the hospitals of our city; that motivated Christians in Victorian England to campaign for the abolition of slavery, of child labour in the factories, the establishment of schools and sent them overseas in the missionary work of the Church.\n\nTo do the work of God requires something of the heart of God. And so the writer of our Epistle prays that God 'may so strengthen your hearts in holiness'. We will prosper, we will advance not in the strength of our own resolve or our own particular traditions but in the strength and spirit that God alone supplies.\n\nThis has been a sobering week for our country. It is a week that has laid bare the pain of vulnerable that was hidden for so long It is a week that will have left many feeling cynical to say the least about Church, about faith. It is a time to reaffirm in our own hearts what we are as a Church. We are called to be nothing less than the Body of Christ in this place, a community of healing. To be instruments of his healing love in the place and time God has placed us we need to submit ourselves to his sovereign and healing love. May Paul’s prayer for the Thessalonians be a prayer for us in our own time:\n\n> 'And may the Lord make you increase and abound in love for one another and for all, just as we abound in love for you. And may he so strengthen your hearts in holiness ...' 1 Thess 3:12-13",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/Advent 1 - 2009.txt",
        "raw_ocr_content": "Page 1 of 3\nFirst Sunday of Advent – 2009 – year C\nHealing is a word that has been associated with the Christian Gospel from the very outset.\nThe writers of the Gospels, in their accounts of the ministry of Jesus, all speak of his\nhealing miracles – of the skin of the leper, the sight of the blind, the hearing of the deaf,\nthe limbs of the lame, the mind of the deranged, the speech of the dumb – all are restored\nat the touch or the word of Jesus – visible signs of a broken creation, healed, restored to its\nformer perfection.\nThe Church, from the very early times, was involved in a healing ministry in the\nestablishment of hospitals for the care of the sick. In our own city the Adelaide, the\nRotunda, St Vincents, the Mater, to name but a few, all owe their origins to Christian\nfoundation. healing, the care for the sick, has always been at the heart of Christian\nwitness. In recent times the ministry of healing, the ministry of prayer and laying on of\nhands has been reaffirmed in the life of the Church/\nToday, as we celebrate in the context of our 11:00 service, the Service of Wholeness and\nHealing, I want to reflect on the wider issues of healing, of wholeness, in the life of the\nChurch. I want to begin with a description of the Church that encourages us to do this.\n“The Church is a community of healing”. I want to set that alongside words from our\nEpistle set for today:\n‘12And may the Lord make you increase and abound in love for\none another and for all, just as we abound in love for you. 13And\nmay he so strengthen your hearts in holiness ...’ 1 Thess 3:12-13\nIn a week that has seen the publication of a report that struck at the very heart of Irish\nsociety we have been left with feeling a mixture of shock, of anger, of disbelief as we\nreflect on a history of abuse, of collusion, of secrecy, of shame in the corridors of Church\nand State.\nPage 2 of 3\nFirst Sunday of Advent – 2009 – year C\nWhat place does the Church, what place can the Church have in Irish society? As I\nreflected on that in my own heart, I thought of words from the Book of the Prophet Isaiah:\n‘Look to the rock from which you were hewn’ Is 51:1\nLook to the person of Christ, look to him who called the Church into being, who gave of\nhimself totally and utterly; who as disciples bickered over status said;, ‘I am among you as\none who serves’, ‘The greatest among you will be your servant.’\nOne of the most profound expressions of the nature of the Church in the new Testament is\n‘The Body of Christ’. That has always emphasised for me that the Church is more than,\nmuch more than, the institutions, the traditions that have often clouded that fundamental\nvision of the Church as a community called to embody, to incarnate, Christ in the world of\ntoday. We are to be nothing less than the hands, the lips, the feet of Christ in the world of\ntoday.\nAs we have already reflected, healing, deep fundamental healing lay at the heart of the\nministry of Jesus. His healing acts are presented in the Gospel as vivid signs of a healing\nof the created order as, in the words of Isaiah:\nIsa 35:5 Then the eyes of the blind shall be opened,\nand the ears of the deaf unstopped;\nIsa 35:6 then the lame shall leap like a deer,\nand the tongue of the speechless sing for joy.\nFor waters shall break forth in the wilderness,\nand streams in the desert;\nIsa 35:7 the burning sand shall become a pool,\nand the thirsty ground springs of water; Is 35:5-7\nAnd so the Church, as the Body of Christ, not only can be, but must be an instrument of\nhealing, deep fundamental healing in the world of today.\nmay the Lord make you increase and abound in love for one\nanother and for all\nPage 3 of 3\nFirst Sunday of Advent – 2009 – year C\nLove is always focussed on the other, always embodies a commitment to the other and\nincludes a sense of belonging. This love is ‘for one another and for all’. This means this\nlove is not just to be expressed for one another within the cosy fellowship of the group, it is\na love that is to be directed out to the world that we are called to serve in the name of\nChrist.\nIt is this spirit of expressing the love of God in the name of god that motivated Christians\nof previous generations to found the hospitals of our city; that motivated Christians in\nVictorian England to campaign for the abolition of slavery, of child labour in the factories,\nthe establishment of schools and sent them overseas in the missionary work of the Church.\nTo do the work of God requires something of the heart of God. And so the writer of our\nEpistle prays that God ‘may so strengthen your hearts in holiness’. We will prosper, we\nwill advance not in the strength of our own resolve or our own particular traditions but in\nthe strength and spirit that God alone supplies.\nThis has been a sobering week for our country. It is a week that has laid bare the pain of\nvulnerable that was hidden for so long It is a week that will have left many feeling cynical\nto say the least about Church, about faith. It is a time to reaffirm in our own hearts what\nwe are as a Church. We are called to be nothing less than the Body of Christ in this place,\na community of healing. To be instruments of his healing love in the place and time God\nhas placed us we need to submit ourselves to his sovereign and healing love. May Paul’s\nprayer for the Thessalonians be a prayer for us in our own time:\n‘12And may the Lord make you increase and abound in love for\none another and for all, just as we abound in love for you. 13And\nmay he so strengthen your hearts in holiness ...’ 1 Thess 3:12-13"
    }
}