{
    "title": "Symbolism of Figs in Bible",
    "date": "2019-12-01",
    "blurb": "This sermon explores the symbolism of figs in the Bible, from their first appearance in the Garden of Eden to their representation of Israel's spiritual and physical health. The sermon also discusses how figs symbolize prosperity, wellbeing, and security, and how their flourishing in modern-day Israel could be seen as a Messianic sign.",
    "raw_text": "God gives good gifts. When he gave Israel to the Jewish people, it was not just any old piece of land. God says in Deuteronomy 8, 'The Lord your God is bringing you into a good land... a land with wheat and barley, vines and fig trees, pomegranates, olive oil and honey'. There are seven species of food mentioned here, which would be abundant in the land promised to his people.\n\nThe fig is a fruit that crops up again and again in the scriptures, because God does nothing without purpose. The plant becomes a symbol of prosperity, wellbeing, and security. Along with the vine, to sit under the plentiful shade of your own fig tree is the epitome of safety, peace and wellbeing in many Biblical passages.\n\nThe fig tree is also symbolic of Israel itself. It often symbolized the health of the nation both spiritually and physically. Hosea 9:10 says, 'When I found Israel, it was like finding grapes in the desert; when I saw your ancestors, it was like seeing the early fruit on the fig tree.'\n\nIn the New Testament, Yeshua uses the symbolic fig tree, firstly in the calling of Nathanael who was 'sitting under a fig tree' like a 'true Israelite' in John 1:48-50. Later he curses the fruitless fig tree, representing unfruitfulness (Mark 11:12-21), and then uses the fig as a metaphor of how we should recognise the signs of the times (Matthew 24:32).\n\nToday, Israel is full of fig trees, huge, well developed, shady and mature. They produce two harvests of fruit a year. It is possible to consider that the flourishing of figs today in Israel is a Messianic sign in itself. The people are back in the land, the fig trees are abundant and plentiful, and the nation is now waiting for restoration to come.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/advent12019 - notes on figs.txt",
        "raw_ocr_content": "The Symbolism Of Figs In The Bible\nBy ONE FOR ISRAEL (Messianic Jews In Israel)\n4,614\nGod gives good gifts. When he gave Israel to the Jewish people, it was not just\nany old piece of land… God says in Deuteronomy 8,\n“The Lord your God is bringing you into a good land… a land with wheat and barley, vines\nand fig trees, pomegranates, olive oil and honey”.\nThere are seven species of food mentioned here, which would be abundant in\nthe land promised to his people, and it is the time leading up to the Jewish\nholidays when many of them are ripe and ready to be eaten. There is so much\nrichness in what God has created and placed in this land for his people – not\njust in their good taste and nutrition, but in their meaning too. And the fig is a\nfruit that crops up again and again in the scriptures, because God does nothing\nwithout purpose.\nThe blessing of figs\nThe man who checks bags for bombs on our transport system was eating juicy\nfigs and gave one to me with a smile. There is something that just feels rich\nand decadent about figs. The amazing deep colours, the distinctive shape and\nglorious gentle smell.\nIt is no wonder that this feature of God’s creation crops up repeatedly in the\nBible in wonderfully symbollic ways. First of all, we see the figs in the garden of\nEden – covering up the shame of Adam and Eve. In fact, it’s the only tree\nspecified that we know for sure was in the garden. Throughout the scriptures, the\nplant becomes a symbol of prosperity, wellbeing, and security. Along with the\nvine, to sit under the plentiful shade of your own fig tree is the opitome of\nsafety, peace and wellbeing in many Biblical passages. These plants don’t grow\novernight, and it takes time to culture and nurture them – their maturity indicates\nthat the gardener has been continuously and steadfastly there, tending to their\ngrowth over the years. For Israel, exile and wandering has been a byword for\npunishment and so sitting under your own vine and fig tree is a sign of blessing\nand security.\nThe fig tree as a metaphor for Israel\nThe fig tree is also symbollic of Israel itself – It often symbolized the health of\nthe nation both spiritually and physically [1]. Hosea 9:10 says,\n“When I found Israel, it was like finding grapes in the desert; when I saw your ancestors, it was\nlike seeing the early fruit on the fig tree.”\nLater, the Bible tells us of the glorious time when\n“Judah and Israel lived in safety, every man under his vine and his fig tree, from Dan even to\nBeersheba, all the days of Solomon.” (1 Kings 4:25)\nLater still, following the minor prophets we can see warnings to the nation of\nhow God would bring destruction and failure of crops as part of his judgement\nagainst them, specifying empty fig trees that were stripped bare and fruitless.\n(Joel, Habakkuk and Haggai)\nIt’s almost as if the fig was something of a barometer of the health of the nation\n– taken away as punishment, and flourishing in times of restoration.\nIn the New Testament we can also see Yeshua using the symbolic fig tree –\nfirstly in the calling of Nathanael who was “sitting under a fig tree” like a “true\nIsraelite” in John 1:48-50. Later he curses the fruitless fig tree, representing\nunfruitfulness (Mark 11:12-21), and then uses the fig as a metaphor of how we\nshould recognise the signs of the times (Matthew 24:32). This end-times warning\nsystem with the fig analogy is picked up again in Revelation 6:13.\nSo from Genesis to Revelation, the fig features strongly in scriptural symbolism.\nThere are many more interesting references not mentioned here which are also\nworth exploring in Judges, Song of Songs, and parables of Yeshua.\nFigs flourishing in Israel today\nToday Israel is full of fig trees – huge, well developed, shady and mature. They\nproduce two harvests of fruit a year, the early crop around Passover time in the\nspring, even before the leaves have unfurled, and the biggest, best, most juicy\nfruits come into their own in September, close to the Jewish holidays of Rosh\nHaShanah, Yom Kippur and Sukkot (Feast of Trumpets, Day of Atonement and\nFeast of Tabernacles respectively).\nIt is possible to consider that the flourishing of figs today in Israel is a Messianic\nsign in itself – the people are back in the land, the fig trees are abundant and\nplentiful, and the nation is now waiting for restoration to come. We know that the\nrestoration will be a spiritual revival, and all his people greeting their Messiah\nYeshua, saying “Blessed is he who comes in the name of the Lord”, or\n“Welcome Yeshua, our Messiah!” Come, Lord Jesus, and find us ready!\nWhen King Shlomo compared Torah to the fig (Mishlei 27:18), he conveyed an important message\nabout gaining and retaining Torah knowledge.\nRabbi Chiya bar Abba quoted Rabbi Yochanan (Eiruvin 54a) as to why the comparison was made:\n“Just as one constantly finds figs when he approaches the tree (since they do not all ripen at the same time,\nthere are always some available for eating- Rashi), so too will one always find a new taste in the Torah he is\nstudying.”\nIf this message about gaining Torah knowledge is derived from the comparison to the fig tree itself, there is\nanother message from the words of this passage regarding the protection of that fig tree which yields fruit\nfor its protector.\n“One who sees a fig tree in a dream,” say our Sages (Berachot 57a) “it is a message from Heaven that his\nTorah knowledge is retained and protected in him.”\nThe fig tree thus conveys the double message of gaining Torah knowledge by appreciating the new thrill\nwhich comes with every step of learning, and the need to retain and protect that knowledge through constant\nreview so that we can enjoy the fruits of our study even if we are not lucky enough to see a fig tree in our\ndreams."
    }
}