{
    "title": "Advent 3 - Year B",
    "date": "2017-12-17",
    "blurb": "This sermon, delivered on the third Sunday of Advent in 2017, discusses the expectations of the coming of a Messianic figure during the time of John the Baptist. It emphasizes the importance of recognizing Christ in our daily lives and the special place of the poor and marginalized in the Kingdom of God. The sermon calls for hope, integrity, reconciliation, and compassion in a fractured world.",
    "raw_text": "ADVENT 3 – Year B – 2017\n\nAmong you stands one whom you do not know, John 1:26\n\nWe are now well into the season of Advent. We have read as our Old Testament and Gospel readings passages long associated with this time of year., the Servant Songs of the Prophet Isaiah and the Gospel accounts of the ministry of John the Baptist.\n\nIt is the very nature of our Scriptures not only to present us with accounts of events of the time, but at the same time to do so in a manner that seems to transcend time, that speaks to each generation of subsequent readers.\n\nOur Gospel reading, given to us by the writer of the 4th Gospel, tells us of those who came out to see John the Baptist. The period in which John lived and operated was a period of high expectation in contemporary Judaism. Living under Roman rule there was an expectation in some quarters that God was about to intervene decisively in the life of the nation through the coming of a Messianic figure who would overthrow Roman rule and usher in a new golden age of God’s sovereignty.\n\nIn our reading John is closely questioned about who he is, what he is doing. He declares;\n\nAmong you stands one whom you do not know, John 1:26\n\nIn the immediate context of our reading, John is speaking of the figure of the historical Jesus, present, unrecognised among them. I want to just stay with those words of John as we go on in our Advent journey of preparation to welcome Christ in the world of today.\n\nAmong you stands one whom you do not know, John 1:26\n\nOur Old Testament Lesson, one of the Servant Songs of Isaiah, a passage quoted by Jesus when he preached in the synagogue in his home town of Nazareth. In language reminiscent of the Magnificat, it speaks of the particular place of the poor and the marginalised, so often ignored and neglected in the world, those who stand among you whom you do not know – these have a special place in the Kingdom being ushered in:\n\nhe has sent me to bring good news to the oppressed,\nto bind up the broken-hearted,\nto proclaim liberty to the captives,\nand release to the prisoners;\n2to proclaim the year of the LORD’s favour,\n\nTheir place is not to be on the sidelines, to be incidental players in the story:\n\n4They shall build up the ancient ruins,\nthey shall raise up the former devastations;\nthey shall repair the ruined cities,\nthe devastations of many generations.\n8For I the LORD love justice,\nI hate robbery and wrongdoing;\nI will faithfully give them their recompense,\nand I will make an everlasting covenant with them.\n\nIt is, as I say, reminiscent of the upside-down language of the Magnificat,\n\n5 The Lord has shown | strength ~ with his | arm @\nand scattered the | proud in | their con|ceit,\n6 casting down the mighty | from their | thrones @\nand | lifting | up the | lowly.\n7 God has filled the hungry with | good | things @\nand sent the | rich a|way | empty.\n\nAmong you stands one whom you do not know, John 1:26\n\nThere is a chant used by the Taize community that picks up one of the themes of Psalm 27:\n\n‘I am sure I shall see the goodness of the Lord in the land of the living.\nYes, I shall see the goodness of the Lord, hold firm, trust in the Lord.’\n\nIs this more than just a pious whistling in the dark in the face of the grim realities of everyday life? Advent and Christmas remind us that ours is an incarnational faith, centred on a fundamental belief that, in the person of Jesus Christ, God was and continues to be living and active in the world. In the person of Jesus, God knows what it is like to be human, what it is to be tempted, to fear, to suffer, to die. In that life God offers a different vision, a different perspective on this wounded and troubled world. So ours is not a faith divorced from reality but one deeply rooted in reality.\n\nAs followers of Christ, as heralds of the Kingdom, we are called to offer a different vision. In the face of despair we are called to offer hope; in the world where sleight of hand, where half truth and innuendo have seemed to prevail, we are called to be signs of integrity, of truth. In a world that is fractured along so many lines of culture, of race, economically, socially, we are called to be instruments of reconciliation. In short to be ones through whom, in whom, others may ‘see the goodness of the Lord in the land of the living.’\n\nMay God give us grace this advent time to recognise Christ in the different, in the challenging, in the neighbour. In the joy and the celebration of Christmas, may we find room in our hearts for those on the edge, those in need not just of our financial resources but in need of our presence, our compassion, our patience, our time.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/year B/advent32017.txt",
        "raw_ocr_content": "Page 1 of 3\nADVENT 3 – Year B – 2017\nAmong you stands one whom you do not know, John 1:26\nWe are now well into the season of Advent. We have read as our Old\nTestament and Gospel readings passages long associated with this time of\nyear., the Servant Songs of the Prophet Isaiah and the Gospel accounts of the\nministry of John the Baptist.\nIt is the very nature of our Scriptures not only to present us with accounts of\nevents of the time, but at the same time to do so in a manner that seems to\ntranscend time, that speaks to each generation of subsequent .readers.\nOur Gospel reading, given to us by the writer of the 4th Gospel, tells us of those\nwho came out to see John the Baptist. The period in which John lived and\noperated was a period of high expectation in contemporary Judaism. Living\nunder Roman rule there was an expectation in some quarters that God was\nabout to intervene decisively in the life of the nation through the coming of a\nMessianic figure who would overthrow Roman rule and usher in a new golden\nage of God’s sovereignty.\nIn our reading John is closely questioned about who he is, what he is doing. He\ndeclares;\nAmong you stands one whom you do not know, John 1:26\nIn the immediate context of our reading, John is speaking of the figure of the\nhistorical Jesus, present, unrecognised among them. I want to just stay with\nthose words of John as we go on in our Advent journey of preparation to\nwelcome Christ in the world of today.\nAmong you stands one whom you do not know, John 1:26\nPage 2 of 3\nADVENT 3 – Year B – 2017\nOur Old Testament Lesson, one of the Servant Songs of Isaiah, a passage\nquoted by Jesus when he preached in the synagogue in his home town of\nNazareth. In language reminiscent of the Magnificat, it speaks of the particular\nplace of the poor and the marginalised, so often ignored and neglected in the\nworld, those who stand among you whom you do not know – these have a\nspecial place in the Kingdom being ushered in:\nhe has sent me to bring good news to the oppressed,\nto bind up the broken-hearted,\nto proclaim liberty to the captives,\nand release to the prisoners;\n2to proclaim the year of the LORD’s favour,\nTheir place is not to be on the sidelines, to be incidental players in the story:\n4They shall build up the ancient ruins,\nthey shall raise up the former devastations;\nthey shall repair the ruined cities,\nthe devastations of many generations.\n8For I the LORD love justice,\nI hate robbery and wrongdoing;\nI will faithfully give them their recompense,\nand I will make an everlasting covenant with them.\nIt is, as I say, reminiscent of the upside-down language of the Magnificat,\n5 The Lord has shown | strength ~ with his | arm @\nand scattered the | proud in | their con|ceit,\n6 casting down the mighty | from their | thrones @\nand | lifting | up the | lowly.\n7 God has filled the hungry with | good | things @\nand sent the | rich a|way | empty.\nAmong you stands one whom you do not know, John 1:26\nPage 3 of 3\nADVENT 3 – Year B – 2017\nThere is a chant used by the Taize community that picks up one of the themes\nof Psalm 27:\n‘I am sure I shall see the goodness of the Lord in the land of the living.\nYes, I shall see the goodness of the Lord, hold firm, trust in the Lord.’\nIs this more than just a pious whistling in the dark in the face of the grim\nrealities of everyday life? Advent and Christmas remind us that ours is an\nincarnational faith, centred on a fundamental belief that, in the person of Jesus\nChrist, God was and continues to be living and active in the world. In the\nperson of Jesus, God knows what it is like to be human, what it is to be\ntempted, to fear, to suffer, to die. In that life God offers a different vision, a\ndifferent perspective on this wounded and troubled world. So ours is not a\nfaith divorced from reality but one deeply rooted in reality.\nAs followers of Christ, as heralds of the Kingdom, we are called to offer a\ndifferent vision. In the face of despair we are called to offer hope; in the world\nwhere sleight of hand, where half truth and innuendo have seemed to prevail,\nwe are called to be signs of integrity, of truth. In a world that is fractured along\nso many lines of culture, of race, economically, socially, we are called to be\ninstruments of reconciliation. In short to be ones through whom, in whom,\nothers may ‘see the goodness of the Lord in the land of the living.’\nMay God give us grace this advent time to recognise Christ in the different, in\nthe challenging, in the neighbour. In the joy and the celebration of Christmas,\nmay we find room in our hearts for those on the edge, those in need not just of\nour financial resources but in need of our presence, our compassion, our\npatience, our time."
    }
}