{
    "title": "Advent 1 - Year C",
    "date": "2015-11-29",
    "blurb": "This sermon, delivered on the first Sunday of Advent in 2015, discusses the sacrament of Baptism, the journey of faith, and the anticipation of the coming of Christ. It emphasizes the role of John the Baptist in preparing the way for the Kingdom of God and the importance of the Church in expressing the values of reconciliation, justice, and compassion. The sermon also explores the concept of Jesus as both the companion and the destination on the journey of faith.",
    "raw_text": "Every few weeks here in St Mary’s we celebrate the sacrament of Baptism, that sacrament of welcome, of commitment as a new child is welcomed into the fellowship of the Church. As I reflect with parents and godparents on the promises of Baptism, which are in themselves profound and challenging, I observe that these are questions not of people who have arrived but of people who are on a journey, a journey of a lifetime; a journey of faith, a journey into faith.\n\nWe have now started the season of Advent. The décor of Church changes as we move into this season of preparation, the lighting of the Advent Candles serves as a reminder of the impending Festival of Christmas. One of the central characters of our readings during this season is that of John the Baptist and his vocation to prepare the way. In a ministry marked by a call to repentance, he challenges his hearers, challenges the religious establishment of his day to recognise the signs of the imminence of the Kingdom of God.\n\nIn their description of John, the Gospel writers are making a clear connection with words of the prophet Isaiah:\n\n> A voice cries out:\n> \"In the wilderness prepare the way of the LORD,\n> make straight in the desert a highway for our God.\n> Every valley shall be lifted up,\n> and every mountain and hill be made low;\n> the uneven ground shall become level,\n> and the rough places a plain.\n> Then the glory of the LORD shall be revealed,\n> and all people shall see it together,\n> for the mouth of the LORD has spoken.\" Isaiah 40:3ff\n\nThere is a sense of expectation; the days of judgement are over, Jerusalem has paid double for all her sins. The Exile is drawing to a close, there is to be a new entry into the promised Land; God with his people.\n\n> \"In the wilderness prepare the way of the LORD,\n> make straight in the desert a highway for our God.\n\nAnd so the season of Advent carries with it a sense of anticipation, not just of Christmas, but of encounter with God.\n\nPrepare the way of the Lord – in the hearts and minds of God’s people. A call to witness – in our lives, in attitudes and actions showing something of the Christ we seek to serve. The Church, the Body of Christ, called to be a community of the Kingdom, a community expressing in its own common life the values of reconciliation, of justice, of compassion that it commends to the world at large.\n\nIn John’s account of the Last Supper, as Jesus talks to the disciples of his own coming death, his going to the Father, he speaks of his role of going ahead of them and then returning.\n\n> And if I go and prepare a place for you, I will come again\n> and will take you to myself, so that where I am, there you\n> may be also. John 14:3\n\nIn the Palestinian society of that day, when one of the main means of long distance transport was the camel train, there was one who was hired to go ahead of the camel train to find a suitable camping place for the night, where there would be fresh water and shelter, and then return to guide the camel train to their place of rest for the night. John presents us with that picture of Jesus as our guide along the way, going ahead of us, bringing us on further on the journey of life. But there is more to it than that. In that same portion of John’s Gospel, as Thomas asks in some confusion where he is going, Jesus replies with one of those great ‘I am’ sayings, ‘I am the way, the truth and the life.’ Jesus, both the companion along the way and also the one to whom I travel, the focus of my hope; the one in whom and through whom I find hope and meaning in my life.\n\nLet us look at a verse form our Psalm this morning, Ps 25:4\n\n> Lead me in your | truth and | teach me, @\n> for you are the God of my salvation;\n> for you have I | hoped | all the day | long.\n\nEven in the midst of all life’s trials, the Psalmist is confident of God’s presence with him. This is echoed in words of the late Lord Hailsham towards the end of his book ‘A sparrow’s flight’ in which he speaks of his own conviction:\n\n> But he is himself the Way, the Truth and the Life. he is unknown and unknowable, yet constantly revealed, revealed in nature, in beauty, in goodness, in knowledge, but always absent in the negative, the hated and the hateful. He is always present yet constantly eludes my grasp. Being infinite, he cannot be comprised in my understanding. Nevertheless as constantly he reappears in my need. Remaining Christian, I am constantly reassured in my wandering, in my doubting and as constantly lead back by my trusting. I do not know. I do not pretend to know. But I trust, and therefore I believe.\n\nAdvent, with its theme of preparation, or preparing the way for the coming of Christ, reminds me of our own vocation, both as individuals and as a community to be signs along the way of the Kingdom of God, that fellow travellers along the road of life, in all its ups and downs, may see in us something of Christ, something of God breaking through into the world.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/advent12015.txt",
        "raw_ocr_content": "Page 1 of 3\nADVENT 1 – Year C - 2015\nEvery few weeks here in St Mary’s we celebrate the sacrament of Baptism, that\nsacrament of welcome, of commitment as a new child is welcomed into the\nfellowship of the Church.. As I reflect with parents and godparents on the\npromises of Baptism, which are in themselves profound and challenging, I\nobserve that these are questions not of people who have arrived but of people\nwho are on a journey, a journey of a lifetime; a journey of faith, a journey into\nfaith.\nWe have now started the season of Advent. The décor of Church changes as\nwe move into this season of preparation, the lighting of the Advent Candles\nserves as a reminder of the impending Festival of Christmas.\nOne of the central characters of our readings during this season is that of John\nthe Baptist and his vocation to prepare the way. In a ministry marked by a call\nto repentance, he challenges his hearers, challenges the religious establishment\nof his day to recognise the signs of the imminence of the Kingdom of God.\nIn their description of John, the Gospel writers are making a clear connection\nwith words of the prophet Isaiah:\n3 A voice cries out:\n\"In the wilderness prepare the way of the LORD,\nmake straight in the desert a highway for our God.\n4 Every valley shall be lifted up,\nand every mountain and hill be made low;\nthe uneven ground shall become level,\nand the rough places a plain.\n5 Then the glory of the LORD shall be revealed,\nand all people shall see it together,\nfor the mouth of the LORD has spoken.\" Isaiah 40:3ff\nPage 2 of 3\nADVENT 1 – Year C - 2015\nThere is a sense of expectation; the days of judgement are over, Jerusalem has\npaid double for all her sins. The Exile is drawing to a close, there is to be a\nnew entry into the promised Land; God with his people\n\"In the wilderness prepare the way of the LORD,\nmake straight in the desert a highway for our God.\nAnd so the season of Advent carries with it a sense of anticipation, not just of\nChristmas, but of encounter with God.\nPrepare the way of the Lord – in the hearts and minds of God’s people. A call\nto witness – in our lives, in attitudes and actions showing something of the\nChrist we seek to serve. The Church, the Body of Christ, called to be a\ncommunity of the Kingdom, a community expressing in its own common life\nthe values of reconciliation, of justice, of compassion that it commends to the\nworld at large.\nIn John’s account of the Last Supper, as Jesus talks to the disciples of his own\ncoming death, his going to the Father, he speaks of his role of going ahead of\nthem and then returning.\n3 And if I go and prepare a place for you, I will come again\nand will take you to myself, so that where I am, there you\nmay be also. John 14:3\nIn the Palestinian society of that day, when one of the main means of long\ndistance transport was the camel train, there was one who was hired to go\nahead of the camel train to find a suitable camping place for the night, where\nthere would be fresh water and shelter, and then return to guide the camel train\nto their place of rest for the night. John presents us with that picture of Jesus as\nour guide along the way, going ahead of us, bringing us on further on the\nPage 3 of 3\nADVENT 1 – Year C - 2015\njourney of life. But there is more to it than that. In that same portion of\nJohn’s Gospel, as Thomas asks in some confusion where he is going, Jesus\nreplies with one of those great ‘I am’ sayings, ‘I am the way, the truth and the\nlife.’ Jesus, both the companion along the way and also the one to whom I\ntravel, the focus of my hope; the one in whom and through whom I find hope\nand meaning in my life.\nLet us look at a verse form our Psalm this morning, Ps 25:4\n4 Lead me in your | truth and | teach me, @\nfor you are the God of my salvation;\nfor you have I | hoped | all the day | long.\nEven in the midst of all life’s trials, the Psalmist is confident of God’s presence\nwith him. This is echoed in words of the late Lord Hailsham towards the end\nof his book ‘A sparrow’s flight’ in which he speaks of his own conviction:\nBut he is himself the Way, the Truth and the Life. he is unknown and\nunknowable, yet constantly revealed, revealed in nature, in beauty, in\ngoodness, in knowledge, but always absent in the negative, the hated and the\nhateful. He is always present yet constantly eludes my grasp. Being\ninfinite, he cannot be comprised in my understanding. Nevertheless as\nconstantly he reappears in my need. Remaining Christian, I am constantly\nreassured in my wandering, in my doubting and as constantly lead back by\nmy trusting. I do not know. I do not pretend to know. But I trust, and\ntherefore I believe.\nAdvent, with its theme of preparation, or preparing the way for the coming of\nChrist, reminds me of our own vocation, both as individuals and as a\ncommunity to be signs along the way of the Kingdom of God, that fellow\ntravellers along the road of life, in all its ups and downs, may see in us\nsomething of Christ, something of God breaking through into the world."
    }
}