{
    "title": "Advent 3 - Year A - 2016",
    "date": "2016-12-11",
    "blurb": "This sermon discusses the period of Advent and the ministry of John the Baptist. It explores the doubt John the Baptist may have felt while in prison, questioning if he had pointed his followers to the right person, Jesus. The sermon also delves into the issue of doubt in our own walk with God, and how turning to the Psalms can help make sense of the suffering in the world.",
    "raw_text": "In the world of politics, in the wake of any election to a position of leadership, there is always a period of time as the victor consolidates his or her position in the team they choose to gather around them. We have seen in the wake of the competition for the leadership of the Tory party in the UK and in the election for the Presidency of the United States that this can be quite a brutal process. Those who backed the winner can be expected to reap the rewards of loyalty, or at the very least their astuteness, while those on the losing side can see political careers come to a juddering halt. I would suspect at various stages in the run up to elections some people may have been asking themselves ‘Have I backed the right person? – or have I got it wrong?’\n\nIn first century Palestine, now under Roman rule, periodically charismatic leaders arose who were identified with the expected Jewish Messiah. These leaders evoked differing levels of enthusiasm but they were all put down and the leaders and many of their followers died violent and tragic deaths. Over the course of the season of Advent we follow the ministry of John the Baptist who felt called to proclaim the coming of God’s Messiah and in the different Gospel accounts pointed his followers to the person of Jesus. In our Gospel reading this morning we find John in prison. Maybe in the darkness and loneliness of his prison cell John had his moments of doubt. As he heard of some of the things Jesus was doing and saying he wondered, ‘Did I get it wrong, did I point to the wrong person? Have I failed not only myself but the people I directed towards Jesus?’\n\nAnd so from his prison cell, he sends word, “Are you the one who was to come, or should we expect someone else?”. Jesus sends back words of reassurance that evoke passages we read in Isaiah\n\n> 5 Then the eyes of the blind shall be opened,\n> and the ears of the deaf unstopped;\n> 6 then the lame shall leap like a deer,\n> and the tongue of the speechless sing for joy. Is 35:5,6\n\nGo and tell John what you have seen. You are not mistaken; your life has not been in vain. You have not failed.\n\nAs I mused over that Gospel passage this week, a not unrelated question came to my mind, that of the whole issue of doubt in our own walk with God. When we were in Prague earlier this week, we visited the Jewish quarter of the city, visited synagogues that were once thriving places of worship, now housing exhibition centres. On the wall of one was written the names of every Jew from Prague who had perished in the gas chambers of the last war. As we look at things like that, as we look at the suffering of the world about us, whether it be in the city of Aleppo, in the wake of an earthquake or simply in the plight of a mother and doctor in court reliving the events that culminated in the death of her child and her facing charges of manslaughter – which of us at times has not found ourselves asking, ‘Where is God in all of this?’\n\nAs I try to make sense of all of this, I find myself turning more and more to the Psalms, the Psalms that would have been well known by John the Baptist and by Jesus. It is as the Psalmist cries out ‘My God, my God, why have you abandoned me?’ that he begins to understand God’s presence in the lives of his forefathers, coming to an awareness of God’s presence with him as the psalm closes in thankful praise. It is as he cries out in his shame in Psalm 51\n\n> 1 Have mercy on me, O God, in your great goodness; ♦\n> according to the abundance of your compassion\n> blot out my offences.\n> 2 Wash me thoroughly from my wickedness ♦\n> and cleanse me from my sin.\n> 3 For I acknowledge my faults ♦\n> and my sin is ever before me.\n\nthat he come to his own understanding of God’s mercy, even to a sinner as he later confesses:\n\n> 13 Give me again the joy of your salvation ♦\n> and sustain me with your gracious spirit;\n> 14 Then shall I teach your ways to the wicked ♦\n> and sinners shall return to you.\n\nIn the Psalms I find that it is as I share my pain, my regrets, my anger, my thankfulness that I find in a way I find hard to explain that God is there, that he understands, that he sustains. I found myself returning to the closing passage of a book by the late Lord Hailsham, a leading Tory politician as I grew up, one time Home Secretary, finally serving as Lord Chancellor. In this book, ‘A Sparrow’s flight’, he reflects on his own spiritual pilgrimage. In conclusion he wrote:\n\n> ‘And, lo, a paradox appears. I seek God, and behold a bedraggled human figure impaled for ridicule upon a cross. I despair of man, and behold the same figure, enthroned in majesty above the clouds. If I go up to heaven hi is there. If I descend into the depths of misery and grief, he is there also. He is Alpha and Omega, the source of my being and the end of my pilgrimage. He is love, at once the beloved and the eternal lover. He is Father, Son and Holy Spirit, at once the creator, the redeemer, the inspirer of suffering humanity, the companion on my way and the strengthener of my steps. But he is himself the Way, the Truth and the Life. He is unknown and unknowable, yet constantly revealed, revealed in nature, in beauty, in goodness, in knowledge, but always absent in the negative, the hated and the hateful. He is always present yet constantly eludes my grasp. Being infinite, he cannot be comprised in my understanding. Nevertheless as constantly, he reappears in my need. Remaining Christian, I am constantly reassured in my wandering, in my doubting and as constantly lead back by my trusting. I do not know. I do not pretend to know. But I trust, and therefore I believe. Now I see through a glass, darkly. The time is not far distant when, infinitely contrite, I must seek the mercy of an infinitely compassionate judge, and then, face to face, I shall know, even as I am known.’\n> A Sparrow’s Flight – Lord Hailsham p 452\n\n“Go back and report to John what you hear and see: The blind receive sight, the lame walk …” God is still present, even in your doubts and your fears. Rest in his presence and find his peace.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year A/advent32016.txt",
        "raw_ocr_content": "Page 1 of 3\nADVENT 3 - Year A - 2016\nIn the world of politics, in the wake of any election to a position of leadership,\nthere is always a period of time as the victor consolidates his or her position in\nthe team they choose to gather around them. We have seen in the wake of the\ncompetition for the leadership of the Tory party in the UK and in the election\nfor the Presidency of the United States that this can be quite a brutal process.\nThose who backed the winner can be expected to reap the rewards of loyalty,\nor at the very least their astuteness, while those on the losing side can see\npolitical careers come to a juddering halt. I would suspect at various stages in\nthe run up to elections some people may have been asking themselves ‘Have I\nbacked the right person? – or have I got it wrong?’\nIn first century Palestine, now under Roman rule, periodically charismatic\nleaders arose who were identified with the expected Jewish Messiah. These\nleaders evoked differing levels of enthusiasm but they were all put down and\nthe leaders and many of their followers died violent and tragic deaths.\nOver the course of the season of Advent we follow the ministry of John the\nBaptist who felt called to proclaim the coming of God’s Messiah and in the\ndifferent Gospel accounts pointed his followers to the person of Jesus. In our\nGospel reading this morning we find John in prison. Maybe in the darkness\nand loneliness of his prison cell John had his moments of doubt. As he heard\nof some of the things Jesus was doing and saying he wondered, ‘Did I get it\nwrong, did I point to the wrong person? Have I failed not only myself but the\npeople I directed towards Jesus?’\nAnd so from his prison cell, he sends word, “Are you the one who was to\ncome, or should we expect someone else?”. Jesus sends back words of\nreassurance that evoke passages we read in Isaiah\n5 Then the eyes of the blind shall be opened,\nand the ears of the deaf unstopped;\n6 then the lame shall leap like a deer,\nPage 2 of 3\nADVENT 3 - Year A - 2016\nand the tongue of the speechless sing for joy. Is 35:5,6\nGo and tell John what you have seen. You are not mistaken; your life has not\nbeen in vain. You have not failed.\nAs I mused over that Gospel passage this week, a not unrelated question came\nto my mind, that of the whole issue of doubt in our own walk with God. When\nwe were in Prague earlier this week, we visited the Jewish quarter of the city,\nvisited synagogues that were once thriving places of worship, now housing\nexhibition centres. On the wall of one was written the names of every Jew\nfrom Prague who had perished in the gas chambers of the last war. As we look\nat things like that, as we look at the suffering of the world about us, whether it\nbe in the city of Aleppo, in the wake of an earthquake or simply in the plight of\na mother and doctor in court reliving the events that culminated in the death of\nher child and her facing charges of manslaughter – which of us at times has not\nfound ourselves asking, ‘Where is God in all of this?’\nAs I try to make sense of all of this, I find myself turning more and more to the\nPsalms, the Psalms that would have been well known by John the Baptist and\nby Jesus. It is as the Psalmist cries out ‘My God, my God, why have you\nabandoned me?’ that he begins to understand God’s presence in the lives of his\nforefathers, coming to an awareness of God’s presence with him as the psalm\ncloses in thankful praise. It is as he cries out in his shame in Psalm 51\n1 Have mercy on me, O God, in your great goodness; ♦\naccording to the abundance of your compassion\nblot out my offences.\n2 Wash me thoroughly from my wickedness ♦\nand cleanse me from my sin.\n3 For I acknowledge my faults ♦\nand my sin is ever before me.\nthat he come to his own understanding of God’s mercy, even to a sinner as he\nlater confesses:\nPage 3 of 3\nADVENT 3 - Year A - 2016\n13 Give me again the joy of your salvation ♦\nand sustain me with your gracious spirit;\n14 Then shall I teach your ways to the wicked ♦\nand sinners shall return to you.\nIn the Psalms I find that it is as I share my pain, my regrets, my anger, my\nthankfulness that I find in a way I find hard to explain that God is there, that he\nunderstands, that he sustains. I found myself returning to the closing passage\nof a book by the late Lord Hailsham, a leading Tory politician as I grew up,\none time Home Secretary, finally serving as Lord Chancellor. In this book, ‘A\nSparrow’s flight’, he reflects on his own spiritual pilgrimage. In conclusion he\nwrote:\n‘And, lo, a paradox appears. I seek God, and behold a bedraggled\nhuman figure impaled for ridicule upon a cross. I despair of man, and\nbehold the same figure, enthroned in majesty above the clouds. If I go\nup to heaven hi is there. If I descend into the depths of misery and\ngrief, he is there also. He is Alpha and Omega, the source of my being\nand the end of my pilgrimage. He is love, at once the beloved and the\neternal lover. He is Father, Son and Holy Spirit, at once the creator,\nthe redeemer, the inspirer of suffering humanity, the companion on my\nway and the strengthener of my steps. But he is himself the Way, the\nTruth and the Life. He is unknown and unknowable, yet constantly\nrevealed, revealed in nature, in beauty, in goodness, in knowledge, but\nalways absent in the negative, the hated and the hateful. He is always\npresent yet constantly eludes my grasp. Being infinite, he cannot be\ncomprised in my understanding. Nevertheless as constantly, he\nreappears in my need. Remaining Christian, I am constantly reassured\nin my wandering, in my doubting and as constantly lead back by my\ntrusting. I do not know. I do not pretend to know. But I trust, and\ntherefore I believe. Now I see through a glass, darkly. The time is not\nfar distant when, infinitely contrite, I must seek the mercy of an\ninfinitely compassionate judge, and then, face to face, I shall know,\neven as I am known.’\nA Sparrow’s Flight – Lord Hailsham p 452\n“Go back and report to John what you hear and see: The blind receive sight, the\nlame walk …...” God is still present, even in your doubts and your fears. Rest\nin his presence and find his peace."
    }
}