{
    "title": "Work in Progress",
    "date": "2012-12-09",
    "blurb": "This sermon, delivered on the 2nd Sunday of Advent in 2012, explores the theme of life as a 'work in progress'. Drawing from Philippians 1:6, the speaker encourages listeners to view their spiritual journey as an ongoing process, guided and supported by God. The sermon emphasizes the importance of patience, faith, and the continual striving towards a deeper relationship with Christ.",
    "raw_text": "2nd Sunday of Advent - 2006 - year C\n\n'I am confident of this, that he who began a good work in you will carry it on to completion until the day of Christ Jesus.' (Philippians 1:6)\n\nIn the early days of our marriage, we used to have a poster on the wall. It depicted a caterpillar chewing on a leaf, with the caption, 'Be patient with me - God hasn’t finished with me yet.' This poster came to my mind as I read over the portion appointed for the Epistle on this second Sunday of Advent, and in particular the words I took as my text, 'I am confident of this, that he who began a good work in you will carry it on to completion until the day of Christ Jesus.'\n\nI want to take up this theme of my life before God as 'work in progress', moving towards a fulfilment in God’s purposes for me.\n\nLast Sunday, you may recall, I reflected on the Christian life as a journey of a lifetime. A life, the late Archbishop Michael Ramsey reflected, lived as a continual response to our Baptism, discovering in the nuts and bolts of daily living what it means to die to sin and rise to new life in Christ.\n\nWe looked at the promises of our Baptism, promises that Michael Ramsey referred to as a yard stick for life.\n\n'Do you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?'\n\nQuestions not of people who have arrived, but questions asked of people who are on the way, on this journey into Christ, undertaken in the presence of Christ.\n\nThis idea of the continuing nature of our spiritual life before God is brought out in the technical language that Paul has chosen to use in his letter to the Philippians, the significance of which is lost in the process of translation.\n\nThe Greek word that we have translated as 'to begin' is enarchestai; the one we translate as 'to complete' is epitelein. In the language of the Greek society within which the Christians in Philippi lived, these are words associated with the ceremony of sacrifice in Greek religious life. The whole process of preparation of the sacrificial offering and the worshipper is covered by the term enarchestai and the completion of the whole act of sacrifice is covered by the word epitelein. So Paul is developing the idea of my whole ongoing life before God in terms of a spiritual sacrifice which is part of God’s work in my life as much as anything that I may bring to the process.\n\nThis ties in with an item I quoted from Michael Ramsey last week, in which he wrote, 'Baptism declares that a man’s Christianity begins not with what he feels or experiences but with what God has done in Christ.'\n\nGod is there at every stage on my spiritual journey. He was there before I ever set out, there in the person of Jesus ; there as the 'Word became flesh and lived among us full of grace and truth,' in his life and ministry, in his death and resurrection. It is who, who by his Holy Spirit, who was there at the very beginning of my journey, alongside the encouragement of family and friends, awakening in me the first realisation of his call.\n\nIt is he who accompanies me along the way, strengthening me in times of weakness and temptation, drawing me back in times of disobedience and failure. Becoming like me, he enables me to become more like him, enabling me to live up to my call to live as one made in the image of God. 'To all who received him, who believed in his name, he gave power to become children of God.'\n\nI began by talking of caterpillars. Within the caterpillar there is all the potential, the beauty, the delicacy, the glory of the butterfly. It is work in progress. I too am work in progress - God has not finished with me yet. There is within each one of us something of the Christ who lived and died that we might live. As we travel this journey of life may we show forth more and more of him who calls us and travels the road with us.\n\n'Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part. (Hymn 611)'\n\nHe is indeed the Alpha and Omega, the beginning and end of my pilgrimage, the one in whom I live and dwell and have my being.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/advent22012.txt",
        "raw_ocr_content": "1\n2nd Sunday of Advent - 2006 - year C\n‘I am confident of this, that he who began a good work in you will carry it on to\ncompletion until the day of Christ Jesus.’ (Philippians 16)\nIn the early days of our marriage, we used to have a poster on the wall. It\ndepicted a caterpillar chewing on a leaf, with the caption, ‘Be patient with me -\nGod hasn’t finished with me yet.’ This poster came to my mind as I read over\nthe portion appointed for the Epistle on this second Sunday of Advent, and in\nparticular the words I took as my text,\n‘I am confident of this, that he who began a good work in you will carry it on\nto completion until the day of Christ Jesus.’\nI want to take up this theme of my life before God as ‘work in progress’,\nmoving towards a fulfilment in God’s purposes for me.\nLast Sunday, you may recall, I reflected on the Christian life as a journey of a\nlife time. A life, the late Archbishop Michael Ramsey reflected, lived as a\ncontinual response to our Baptism, discovering in the nuts and bolts of daily\nliving what it means to die to sin and rise to new life in Christ.\nWe looked at the promises of our Baptism, promises that Michael Ramsey\nreferred to as a yard stick for life.\n‘Do you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\n2\n2nd Sunday of Advent - 2006 - year C\nDo you come to Christ, the Way, the Truth and the Life?’\nQuestions not of people who have arrived, but questions asked of people who\nare on the way, on this journey into Christ, undertaken in the presence of\nChrist.\nThis idea of the continuing nature of our spiritual life before God is brought out\nin the technical language that Paul has chosen to use in his letter to the\nPhilippians, the significance of which is lost in the process of translation.\nThe Greek word that we have translated as ‘to begin’ is enarchestai; the one\nwe translate as ‘to complete’ is epitelein. In the language of the Greek society\nwithin which the Christians in Philippi lived, these are words associated with\nthe ceremony of sacrifice in Greek religious life. The whole process of\npreparation of the sacrificial offering and the worshipper is covered by the term\nenarchestai and the completion of the whole act of sacrifice is covered by the\nword epitelein. So Paul is developing the idea of my whole ongoing life before\nGod in terms of a spiritual sacrifice which is part of God’s work in my life as\nmuch as anything that I may bring to the process.\nThis ties in with an item I quoted from Michael Ramsey last week, in which he\nwrote, ‘Baptism declares that a man’s Christianity begins not with what he\nfeels or experiences but with what God has done in Christ.’\n3\n2nd Sunday of Advent - 2006 - year C\nGod is there at every stage on my spiritual journey. He was there before I ever\nset out, there in the person of Jesus ; there as the ‘Word became flesh and lived\namong us full of grace and truth,‘ in his life and ministry, in his death and\nresurrection. It is who, who by his Holy Spirit, who was there at the very\nbeginning of my journey, alongside the encouragement of family and friends,\nawakening in me the first realisation of his call.\nIt is he who accompanies me along the way, strengthening me in times of\nweakness and temptation, drawing me back in times of disobedience and\nfailure. Becoming like me, he enables me to become more like him, enabling\nme to live up to my call to live as one made in the image of God. ‘To all who\nreceived him, who believed in his name, he gave power to become children of\nGod.’\nI began by talking of caterpillars. Within the caterpillar there is all the potential,\nthe beauty, the delicacy, the glory of the butterfly. It is work in progress. I too\nam work in progress - God has not finished with me yet. There is within each\none of us something of the Christ who lived and died that we might live. As\nwe travel this journey of life may we show forth more and more of him who\ncalls us and travels the road with us.\n‘Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\n4\n2nd Sunday of Advent - 2006 - year C\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part. (Hymn 611)\nHe is indeed the Alpha and Omega, the beginning and end of my pilgrimage,\nthe one in whom I live and dwell and have my being."
    }
}