{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Advent/year C/advent22018RTE.txt",
        "raw_ocr_content": "Page 1 of 5\n2nd Sunday of Advent – Year C – 2018\nRTE Morning Service\nHave you ever wondered what it would be like to meet some famous character\nout of the past? You get an attempt at trying to visualise this when you go to\nvisit some historic sites and through audio visual displays you are presented\nwith an experience of a character from the past. Earlier in the year we visited\nthe exhibition marking the 100th anniversary of the birth of Nelson Mandela in\nKilmainham Jail. In one of the cells you entered in and heard in his own voice\nhis closing comments at the Treason Trial at which he was sentenced to life on\nRobben Island.\nIn the Gospel readings for this Sunday and next Sunday, Luke presents us with\na vivid picture of John the Baptist. I always think John must have been one of\nthose characters who evoked very strong reactions in people. Crowds flocked\nto hear him, religious leaders regarded him with suspicion - but then he did\nrefer to them as a nest of vipers. Those in political power regarded him as a\nthreat. Herod was intrigued – but he still had him arrested. Herod’s entourage\nconnived in his eventual destruction.\nBut then John was a man with a very clear sense of his mission. He calls the\npeople of his day to repent, to receive a baptism of repentance for the\nforgiveness of sins. The Gospel writer makes a very clear connection between\nthe ministry of John and words from the Book of the Prophet Isaiah, that\nspeaks of\n‘The voice of one crying out in the wilderness:\n“Prepare the way of the Lord,\nmake his paths straight.\nPage 2 of 5\n2nd Sunday of Advent – Year C – 2018\nRTE Morning Service\n5Every valley shall be filled,\nand every mountain and hill shall be made low,\nand the crooked shall be made straight,\nand the rough ways made smooth;\n6and all flesh shall see the salvation of God.”’.\nJohn will speak of one greater than him who is to come, one whose sandals he\nwill be unworthy to unloose.\nAs I read that my mind turned to a passage in Matthew’s Gospel. John by this\nstage is in prison. He has clearly heard of what Jesus is doing and he begins to\nwonder. Has he made a mistake, is Jesus really the one or are we to wait for\nanother. Jesus sends word back:\n“Go and tell John what you hear and see: the blind receive their sight,\nthe lame walk, the lepers are cleansed, the deaf hear, the dead are\nraised, and the poor have good news brought to them. And blessed is\nanyone who takes no offense at me.” Matt 11:4-6\nIn other words, ‘Look around you John – see what is happening’.\nI want to stay with that idea of ‘Look around you’ as we go back to think of the\nwords of Isaiah in today’s Gospel reading in the context of the Church of\ntoday. John saw himself as herald, as forerunner of God’s promised Messiah.\nAdvent as a season of preparation, preparation for Christmas, preparation for\nChrist’s coming in glory, reminds me that the Church – not the Church as\ninstitution, not the Church as clergy, but the Church as all of us, members of\nthe Body of Christ – is called to be a sign of the Kingdom of God breaking in\nto the world of today. Into the world – your world, my world – our offices, our\nPage 3 of 5\n2nd Sunday of Advent – Year C – 2018\nRTE Morning Service\nshops, our homes, our places of recreation, our hospitals and nursing homes,\nthe streets where we live.\nSo, let us look around us, let us see how this can happen in you and in me.\nHow can you and I prepare the way of the Lord, enable Christ’s presence to be\nfelt, Christ’s word to be heard.\n5Every valley shall be filled,\nand every mountain and hill shall be made low,\nAs I reflect on that I think of the valleys and hills that people face in everyday\nlife. The valleys of worry and anxiety – about loved ones, health, employment,\nabout life. The mountains, the barriers that people face in accessing housing,\nemployment, health care; barriers of prejudice – prejudice based on gender,\nethnic origins, on age, on sexuality. Maybe you’re facing some of these\nbarriers yourself, maybe you know others who do. Or maybe, just maybe,\nsome of these barriers are within us, in our attitude to those who are different.\nThe Christ whose coming we proclaim is one who stood alongside those on the\nmargins, is one who touched the leper, who shared table with the tax collector\nand the sinner, who comes even to us. In our own daily life, in simple acts of\npresence, of listening ear, of helping hand, we can fill valleys, we can break\ndown barriers, we can be the presence of Christ in the life of another.\nand the rough ways made smooth;\nPage 4 of 5\n2nd Sunday of Advent – Year C – 2018\nRTE Morning Service\nRough ways talks to me of friction; friction talks of conflict. Conflict is part\nand parcel of the world in which we live. There are conflicts that tear\ncommunities and nations apart. We see the fruits of that in Yemen, in Israel\nand Palestine, in Iraq and Syria. We have seen it in our own land, in the\nTroubles that hung over Northern Ireland for more than a generation. Violence\ncan end but violence can leave its own scars not only in the bodies and minds\nof victims but also in long term grievances, communities suspicious of each\nother. There are political forces that would feed on these suspicions. But then\nthere are those who stand at the interface, the place of hurt and work for peace.\nIn our own individual lives, we have all experienced hurt, we have all been\nagents of hurt. We all know the pain that that can cause in families, in\ncommunities, in Churches. It can be very hard to let go. Afraid of being hurt\nagain, we can shelter behind our hurts, but we also need to feel that our hurt\nhas been heard. I think of the work of the Truth and Reconciliation\nCommission in post-apartheid South Africa, the brain child of Archbishop\nDesmond Tutu. In all its imperfections it provided a forum where deep hurt\nand pain could be expressed, where regrets could be articulated. Out of hurt\nexpressed and acknowledged, itself not an easy or superficial process, healing\nand reconciliation can come, and rough ways can be made smooth.\nLook around you, said Jesus, in response to enquiries from John as to whether\nhe was the one. See what is happening before your eyes. May others look\naround and see in us signs of God’s Kingdom breaking into the world; in lives\nPage 5 of 5\n2nd Sunday of Advent – Year C – 2018\nRTE Morning Service\nthat reach out to others in compassion, in commitment to justice and\nreconciliation in our lives as individuals and communities.\nSo that in us and through us\n6 ….. all flesh shall see the salvation of God.”’.\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen"
    },
    "base": "{\n    \"title\": \"Preparing the Way\",\n    \"date\": \"2018-12-09\",\n    \"blurb\": \"In this sermon, Kevin explores the role of John the Baptist as a herald for the coming of Christ, drawing parallels to the modern Church's mission. He encourages listeners to reflect on the 'valleys' and 'hills' in their lives and the lives of others, and how they can embody Christ's presence through acts of compassion, justice, and reconciliation.\",\n    \"raw_text\": \"Have you ever wondered what it would be like to meet some famous character out of the past? You get an attempt at trying to visualise this when you go to visit some historic sites and through audio visual displays you are presented with an experience of a character from the past. Earlier in the year we visited the exhibition marking the 100th anniversary of the birth of Nelson Mandela in Kilmainham Jail. In one of the cells you entered in and heard in his own voice his closing comments at the Treason Trial at which he was sentenced to life on Robben Island.\\n\\nIn the Gospel readings for this Sunday and next Sunday, Luke presents us with a vivid picture of John the Baptist. I always think John must have been one of those characters who evoked very strong reactions in people. Crowds flocked to hear him, religious leaders regarded him with suspicion - but then he did refer to them as a nest of vipers. Those in political power regarded him as a threat. Herod was intrigued – but he still had him arrested. Herod’s entourage connived in his eventual destruction.\\n\\nBut then John was a man with a very clear sense of his mission. He calls the people of his day to repent, to receive a baptism of repentance for the forgiveness of sins. The Gospel writer makes a very clear connection between the ministry of John and words from the Book of the Prophet Isaiah, that speaks of\\n\\n‘The voice of one crying out in the wilderness:\\n“Prepare the way of the Lord,\\nmake his paths straight.\\n\\nEvery valley shall be filled,\\nand every mountain and hill shall be made low,\\nand the crooked shall be made straight,\\nand the rough ways made smooth;\\nand all flesh shall see the salvation of God.”’.\\n\\nJohn will speak of one greater than him who is to come, one whose sandals he will be unworthy to unloose.\\n\\nAs I read that my mind turned to a passage in Matthew’s Gospel. John by this stage is in prison. He has clearly heard of what Jesus is doing and he begins to wonder. Has he made a mistake, is Jesus really the one or are we to wait for another. Jesus sends word back:\\n\\n“Go and tell John what you hear and see: the blind receive their sight, the lame walk, the lepers are cleansed, the deaf hear, the dead are raised, and the poor have good news brought to them. And blessed is anyone who takes no offense at me.” Matt 11:4-6\\n\\nIn other words, ‘Look around you John – see what is happening’.\\n\\nI want to stay with that idea of ‘Look around you’ as we go back to think of the words of Isaiah in today’s Gospel reading in the context of the Church of today. John saw himself as herald, as forerunner of God’s promised Messiah. Advent as a season of preparation, preparation for Christmas, preparation for Christ’s coming in glory, reminds me that the Church – not the Church as institution, not the Church as clergy, but the Church as all of us, members of the Body of Christ – is called to be a sign of the Kingdom of God breaking in to the world of today. Into the world – your world, my world – our offices, our shops, our homes, our places of recreation, our hospitals and nursing homes, the streets where we live.\\n\\nSo, let us look around us, let us see how this can happen in you and in me. How can you and I prepare the way of the Lord, enable Christ’s presence to be felt, Christ’s word to be heard.\\n\\nEvery valley shall be filled,\\nand every mountain and hill shall be made low,\\n\\nAs I reflect on that I think of the valleys and hills that people face in everyday life. The valleys of worry and anxiety – about loved ones, health, employment, about life. The mountains, the barriers that people face in accessing housing, employment, health care; barriers of prejudice – prejudice based on gender, ethnic origins, on age, on sexuality. Maybe you’re facing some of these barriers yourself, maybe you know others who do. Or maybe, just maybe, some of these barriers are within us, in our attitude to those who are different.\\n\\nThe Christ whose coming we proclaim is one who stood alongside those on the margins, is one who touched the leper, who shared table with the tax collector and the sinner, who comes even to us. In our own daily life, in simple acts of presence, of listening ear, of helping hand, we can fill valleys, we can break down barriers, we can be the presence of Christ in the life of another.\\n\\nand the rough ways made smooth;\\n\\nRough ways talks to me of friction; friction talks of conflict. Conflict is part and parcel of the world in which we live. There are conflicts that tear communities and nations apart. We see the fruits of that in Yemen, in Israel and Palestine, in Iraq and Syria. We have seen it in our own land, in the Troubles that hung over Northern Ireland for more than a generation. Violence can end but violence can leave its own scars not only in the bodies and minds of victims but also in long term grievances, communities suspicious of each other. There are political forces that would feed on these suspicions. But then there are those who stand at the interface, the place of hurt and work for peace.\\n\\nIn our own individual lives, we have all experienced hurt, we have all been agents of hurt. We all know the pain that that can cause in families, in communities, in Churches. It can be very hard to let go. Afraid of being hurt again, we can shelter behind our hurts, but we also need to feel that our hurt has been heard. I think of the work of the Truth and Reconciliation Commission in post-apartheid South Africa, the brain child of Archbishop Desmond Tutu. In all its imperfections it provided a forum where deep hurt and pain could be expressed, where regrets could be articulated. Out of hurt expressed and acknowledged, itself not an easy or superficial process, healing and reconciliation can come, and rough ways can be made smooth.\\n\\nLook around you, said Jesus, in response to enquiries from John as to whether he was the one. See what is happening before your eyes. May others look around and see in us signs of God’s Kingdom breaking into the world; in lives that reach out to others in compassion, in commitment to justice and reconciliation in our lives as individuals and communities.\\n\\nSo that in us and through us\\n6 ….. all flesh shall see the salvation of God.”’.\\n\\nLord, make me an instrument of your peace.\\nWhere there is hatred, let me sow love;\\nwhere there is injury, pardon;\\nwhere there is doubt, faith;\\nwhere there is despair, hope;\\nwhere there is darkness, light;\\nand where"
}