{
    "title": "Jesus, the Light of the World",
    "date": "2015-11-29",
    "blurb": "In this sermon, Kevin uses the metaphor of a mirror reflecting light to explain the role of Jesus as the light of the world. He emphasizes the importance of keeping our faces turned towards Jesus and not letting anything come between us and Him. This way, we can reflect His light to the entire world.",
    "raw_text": "Have you ever sat outside on a bright sunny day and used a mirror to reflect the sun’s light? If one of you will take this flashlight and shine it on me I will show you what I mean. You see, as the light shines on me, I hold up my mirror and I can reflect the light to shine on you. I am not the light, I am just letting my mirror reflect the light to shine on you.\n\nIf I am going to reflect the light on you, there are a couple of things that are very important:\n\n- I must keep my mirror facing toward the light. If I turn away from the light, I cannot reflect the light.\n\n- I must make sure that nothing comes between the light and me. If that happens, I cannot reflect the light.\n\nThe Bible tells us that \"There was a man who was sent from God; his name was John. He came as a witness to testify concerning that light, so that through him all men might believe. He himself was not the light: he came only as a witness to the light. The true light that gives light to every man was coming into the world.\" Who do you think the true light is that the Bible said was coming into the world? That is right! It was Jesus. Jesus is the light of the world.\n\nYou and I need to be like John. The Bible says that we are to let our light shine, but we need to remember that \"Our Light\" is Jesus. We are not the light, we are just mirrors that reflect His light.\n\nIf we are going to reflect the light of Jesus, we must remember a couple of things:\n\n- We must keep our faces turned toward Jesus.\n\n- We must not let anything come between us and Jesus.\n\nWhen we remember those two things, we will reflect His light to the entire world.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/advent12015messychurch.txt",
        "raw_ocr_content": "Page 1 of 2\nAdvent 1 – 2015 – Messy Church – Jesus, the light coming into the world\nHave you ever sat outside on a bright sunny day and used a mirror to\nreflect the sun’s light? If one of you will take this flashlight and shine\nit on me I will show you what I mean. You see, as the light shines on\nme, I hold up my mirror and I can reflect the light to shine on you. I\nam not the light, I am just letting my mirror reflect the light to shine\non you.\nIf I am going to reflect the light on you, there are a couple of things\nthat are very important:\nI must keep my mirror facing toward the light. If I turn away\n\nfrom the light, I cannot reflect the light.\nI must make sure that nothing comes between the light and me. If\n\nthat happens, I cannot reflect the light.\nThe Bible tells us that \"There was a man who was sent from God; his\nname was John. He came as a witness to testify concerning that light,\nso that through him all men might believe. He himself was not the\nlight: he came only as a witness to the light. The true light that gives\nlight to every man was coming into the world.\" Who do you think the\ntrue light is that the Bible said was coming into the world? That is\nright! It was Jesus. Jesus is the light of the world.\nPage 2 of 2\nAdvent 1 – 2015 – Messy Church – Jesus, the light coming into the world\nYou and I need to be like John. The Bible says that we are to let our\nlight shine, but we need to remember that \"Our Light\" is Jesus. We are\nnot the light, we are just mirrors that reflect His light.\nIf we are going to reflect the light of Jesus, we must remember a\ncouple of things:\nWe must keep our faces turned toward Jesus.\n\nWe must not let anything come between us and Jesus.\n\nWhen we remember those two things, we will reflect His light to the\nentire world."
    }
}