{
    "title": "Life Changing Encounters",
    "date": "2014-11-30",
    "blurb": "In this sermon, Kevin discusses the concept of life-changing encounters, using the examples of a couple's journey through marriage and parenthood, and a couple's experience of retirement. He relates these experiences to the spiritual journey of Advent, emphasizing the transformative power of encountering Christ. He encourages the congregation to see Christ in themselves and others, and to let this encounter change their lives.",
    "raw_text": "This morning in our 11 o’clock service we will be celebrating a baptism as Connor and Beckie bring their daughter Isobelle for Baptism, as Beckie’s parents brought her to this church in times past. The arrival of Isobelle has been for this couple marks another stage in the development of their life together. Their meeting and commitment to each other has been a life changing encounter. The birth of their child has been a life changing encounter. I want this morning to think of life changing encounters in the context of our reflections on Advent.\n\nI often think of one delightful couple I knew when I was in Finglas. Jim and Lily were a real Darby and Joan, going everywhere together, often as not hand in hand. When I first arrived in the Parish, Jim was approaching his retirement and they were looking forward to that day like kids look forward to Christmas (which is very appropriate as we enter the season of Advent). They would be saying to everyone, ‘Jim is retiring in 6 months!’, ‘Jim is retiring in 3 months!’, ‘Jim is retiring next week – we cannot wait!’.\n\nI went to see them 6 weeks after Jim’s retirement. You could sense a tension in the house – Lily obviously was not used to having her beloved around all the time and Jim was finding the loss of a regular routine and purpose difficult. You will be pleased to hear that two months later Jim and Lily were back to their old selves – though both admitted to being quite shaken by their initial reaction to Jim’s much anticipated retirement.\n\nI just want to gather together themes we have been talking about. There was that theme of anticipation, looking forward to a wedding, to a retirement. A wedding involves a celebration of a life changing encounter, and encounter between two lives that will never be the same again – an encounter that has the potential to be life enhancing as a couple discover in each other strengths, gifts, insights that enhance and transform their lives. Jim’s retirement was life changing and also life challenging as Jim and Lily had to live out their love for each other in the very different context of Jim’s much anticipated retirement.\n\nI just want to take these themes of life changing, life challenging into our thoughts as we enter this season of Advent, with its themes of preparing for Christ, welcoming Christ. If this encounter is to be life enhancing, life challenging we need to move beyond the conceptual and towards the particular.\n\nThe early Irish Church had a very strong sense of the presence of God in nature, in people, in the world about us. Hymn 611 in our Hymn Book, based on St Patrick’s Breastplate, is a prayer that very much expresses that insight.\n\n> 1 Christ be beside me,\n> Christ be before me,\n> Christ be behind me,\n> King of my heart.\n> Christ be within me,\n> Christ be below me,\n> Christ be above me,\n> never to part.\n> 2 Christ on my right hand,\n> Christ on my left hand,\n> Christ all around me,\n> shield in the strife.\n> Christ in my sleeping,\n> Christ in my sitting,\n> Christ in my rising,\n> never to part.\n> 3 Christ be in all hearts\n> thinking about me,\n> Christ be on all tongues\n> telling of me.\n> Christ be the vision\n> in eyes that see me,\n> in ears that hear me,\n> Christ ever be.\n\nI get a picture here of Christ living in me and Christ living through me in the world of today. I think of words of Paul,\n\n> 20 and it is no longer I who live, but it is Christ who lives in me. And the life I now live in the flesh I live by faith in the Son of God, who loved me and gave himself for me. Gal 2:20\n\nIf I am one who welcomes Christ that means I am prepared to be one who acts, who thinks as Christ would, that in my life, in my actions, in my attitudes others might see something of Christ in me.\n\nBut this business of welcoming Christ goes much further than that. If I am going to talk about the presence of Christ in my life, then I also have think about the presence of Christ in other people. Christ present in my family, in my neighbour, in the person I meet in the office, in school; Christ present in the people I may not like, in people I find difficult; Christ present in the person selling ‘The Big Issue’, the prisoner, the alien, in the one totally different to me.\n\nI began talking about life changing, life challenging, life enhancing encounters in the context of weddings I have been involved in. Advent is about a life changing encounter with Christ. Because if Advent is about preparing to welcome the coming of Christ, and if that is to be more than just a pious hope for the future, then we have to be changed by that prospect as we prepare to welcome him not in some point in the distant future; we welcome him, serve him, worship him in our love and service of one another.\n\n‘As much as you did it to the least of these my brothers and sisters, you did it to me.’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/year B/advent12014(2).txt",
        "raw_ocr_content": "Page 1 of 3\nADVENT 1 – year B – 2014\nThis morning in our 11 o’clock service we will be celebrating a baptism as\nConnor and Beckie bring their daughter Isobelle for Baptism, as Beckie’s\nparents brought her to this church in times past. The arrival of Isobelle has\nbeen for this couple marks another stage in the development of their life\ntogether. Their meeting and commitment to each other has been a life\nchanging encounter. The birth of their child has been a life changing\nencounter. I want this morning to think of life changing encounters in the\ncontext of our reflections on Advent.\nI often think of one delightful couple I knew when I was in Finglas. Jim and\nLily were a real Darby and Joan, going everywhere together, often as not hand\nin hand. When I first arrived in the Parish, Jim was approaching his retirement\nand they were looking forward to that day like kids look forward to Christmas\n(which is very appropriate as we enter the season of Advent). They would be\nsaying to everyone, ‘Jim is retiring in 6 months!’, ‘Jim is retiring in 3 months!’,\n‘Jim is retiring next week – we cannot wait!’.\nI went to see them 6 weeks after Jim’s retirement. You could sense a tension\nin the house – Lily obviously was not used to having her beloved around all the\ntime and Jim was finding the loss of a regular routine and purpose difficult.\nYou will be pleased to hear that two months later Jim and Lily were back to\ntheir old selves – though both admitted to being quite shaken by their initial\nreaction to Jim’s much anticipated retirement.\nI just want to gather together themes we have been talking about. There was\nthat theme of anticipation, looking forward to a wedding, to a retirement. A\nwedding involves a celebration of a life changing encounter, and encounter\nbetween two lives that will never be the same again – an encounter that has the\npotential to be life enhancing as a couple discover in each other strengths, gifts,\ninsights that enhance and transform their lives. Jim’s retirement was life\nPage 2 of 3\nADVENT 1 – year B – 2014\nchanging and also life challenging as Jim and Lily had to live out their love for\neach other in the very different context of Jim’s much anticipated retirement.\nI just want to take these themes of life changing, life challenging into our\nthoughts as we enter this season of Advent, with its themes of preparing for\nChrist, welcoming Christ. If this encounter is to be life enhancing, life\nchallenging we need to move beyond the conceptual and towards the particular.\nThe early Irish Church had a very strong sense of the presence of God in\nnature, in people, in the world about us. Hymn 611 in our Hymn Book, based\non St Patrick’s Breastplate, is a prayer that very much expresses that insight.\n1 Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part.\n2 Christ on my right hand,\nChrist on my left hand,\nChrist all around me,\nshield in the strife.\nChrist in my sleeping,\nChrist in my sitting,\nChrist in my rising,\nnever to part.\n3 Christ be in all hearts\nthinking about me,\nChrist be on all tongues\ntelling of me.\nChrist be the vision\nin eyes that see me,\nin ears that hear me,\nChrist ever be.\nHymn 611\nPage 3 of 3\nADVENT 1 – year B – 2014\nI get a picture here of Christ living in me and Christ living through me in the\nworld of today. I think of words of Paul,\n20 and it is no longer I who live, but it is Christ who lives in me. And the life\nI now live in the flesh I live by faith in the Son of God, who loved me and\ngave himself for me. Gal 2:20\nIf I am one who welcomes Christ that means I am prepared to be one who acts,\nwho thinks as Christ would, that in my life, in my actions, in my attitudes\nothers might see something of Christ in me.\nBut this business of welcoming Christ goes much further than that. If I am\ngoing to talk about the presence of Christ in my life, then I also have think\nabout the presence of Christ in other people. Christ present in my family, in\nmy neighbour, in the person I meet in the office, in school; Christ present in\nthe people I may not like, in people I find difficult; Christ present in the person\nselling ‘The Big Issue’, the prisoner, the alien, in the one totally different to\nme.\nI began talking about life changing, life challenging, life enhancing encounters\nin the context of weddings I have been involved in. Advent is about a life\nchanging encounter with Christ. Because if Advent is about preparing to\nwelcome the coming of Christ, and if that is to be more than just a pious hope\nfor the future, then we have to be changed by that prospect as we prepare to\nwelcome him not in some point in the distant future; we welcome him, serve\nhim, worship him in our love and service of one another.\n‘As much as you did it to the least of these my brothers and sisters, you did it\nto me.’"
    }
}