{
    "title": "Advent 1 - Year A",
    "date": "2016-11-27",
    "blurb": "This sermon reflects on the first Sunday of Advent, a time of preparation and anticipation in the Christian calendar. It draws parallels between the American Festival of Thanksgiving and the Christian story, emphasizing the importance of making these stories our own. The sermon also explores the concept of humanity being created in the image of God, and our calling to be active participants in Christ's story.",
    "raw_text": "Last week saw the American Festival of Thanksgiving, a time at which the American people remember the very early days of the settlers from Britain, the difficulties they had in establishing their communities, a sense of thanks giving when with the gathering of their first harvest. It is a celebration in which Americans make the story of their founding fathers their story.\n\nToday, the First Sunday in Advent, is another special day in the life of the Church. Those of you who were here last Sunday will notice a difference as you came in; gone is the green of the season of Trinity, to be replaced by the purple of Advent. Gone are the flowers - they will be gone until we approach the festival of Christmas. We begin once again our cycle of readings, we embark once again on our weekly hearing of the Christian story, the ministry of John the Baptist, announcing the coming of Jesus, his birth, his life and ministry, his death and resurrection, the coming of the Holy Spirit. Alongside this we will hear once again the Old Testament story of Creation, of Fall, of the story of Moses, the story of slavery and redemption, the teachings of the great prophets. We are, in the words of the old Collect invited to ‘read, mark, learn and inwardly digest, that, through patience and comfort of your holy word, we may embrace and for ever hold fast the blessed hope of everlasting life.’ In this year by year hearing of the story, this ongoing reflection on the great themes of our redemption, we are invited to make this story our story.\n\nIn a hymn from Thanks and Praise that we are using as our offertory at the 11:00 service (which is printed on the Lesson sheets), the hymn writer puts this beautifully,\n\n>Nourish us with sacred story,\ntill we claim it as our own.\n\nIn our Old Testament lesson this morning, from the book of the prophet Isaiah, a passage that looks beyond the present sorry state of the city of Jerusalem, a place of national pride, self sufficiency, self serving religion; that looks through the eyes of God, to see what is to be that is not yet.\n\nThese are words written for their time, a particular crisis in the life of a particular people. But they are a message for all time, they are a message for our time.\n\nThe prophet declares:\n\n>He will teach us his ways,\nso that we may walk in his paths.\n\nNourish us with sacred story,\ntill we claim it as our own.\n\nAdvent is a season of preparation, preparation to celebrate Christmas, preparing for the Kingdom.\n\nGoing back to last Sunday, the end of the Christian year, we reflected on those words of Paul to the Colossians as he spoke of Jesus:\n\n>‘He is the image of the invisible God’ and alongside them words of Bishop David Jenkins, ‘Jesus is the face of God towards us; God with us, God for us.’\n\nAs I continue to reflect on this my mind goes back to the very beginning of the story, the first of the Creation narratives given to us in the Book Genesis, as the writer speaks of man\n\n>So God created humankind in his image,\nin the image of God he created them;\nmale and female he created them. Genesis 1:27\n\nJesus as the image of God; you and me created in the image of God. We see in Jesus, not just the image of the invisible God, we see in the person of Jesus humanity, my humanity, your humanity, as God always intended it to be. This is where this story becomes my story. It is not the distant story of mythical forbears, it becomes the story of what I am called to be.\n\nAnd so our hymn continues\n\n>2 Turn our worship into witness\nin the sacrament of life;\nsend us forth to love and serve you,\nbringing peace where there is strife.\nGive us, Christ, your great compassion\nto forgive as you forgave;\n\nPart of my calling, part of what I am meant to be as one made in the image of God, as one baptised in the name of him who is the image of the invisible God. We are called to be not bystanders but active participants in the story of Christ coming into the world. We are called to make Christ present, to be the hands, the lips, the feet of Christ in the world in which we live.\n\n>Lord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\n\n>O Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\n\n>For it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year A/advent12016.txt",
        "raw_ocr_content": "Page 1 of 3\nADVENT 1 –Year A – 2016\nLast week saw the American Festival of Thanksgiving, a time at which the\nAmerican people remember the very early days of the settlers from Britain, the\ndifficulties they had in establishing their communities, a sense of thanks giving\nwhen with the gathering of their first harvest. It is a celebration in which\nAmericans make the story of their founding fathers their story.\nToday, the First Sunday in Advent, is another special day in the life of the\nChurch. Those of you who were here last Sunday will notice a difference as\nyou came in; gone is the green of the season of Trinity, to be replaced by the\npurple of Advent. Gone are the flowers - they will be gone until we approach\nthe festival of Christmas. We begin once again our cycle of readings, we\nembark once again on our weekly hearing of the Christian story, the ministry of\nJohn the Baptist, announcing the coming of Jesus, his birth, his life and\nministry, his death and resurrection, the coming of the Holy Spirit. Alongside\nthis we will hear once again the Old Testament story of Creation, of Fall, of the\nstory of Moses, the story of slavery and redemption, the teachings of the great\nprophets. We are, in the words of the old Collect invited to ‘read, mark, learn\nand inwardly digest, that, through patience and comfort of your holy word, we\nmay embrace and for ever hold fast the blessed hope of everlasting life.’ In\nthis year by year hearing of the story, this ongoing reflection on the great\nthemes of our redemption, we are invited to make this story our story.\nIn a hymn from Thanks and Praise that we are using as our offertory at the\n11:00 service (which is printed on the Lesson sheets), the hymn writer puts this\nbeautifully,\nNourish us with sacred story,\ntill we claim it as our own.\nIn our Old Testament lesson this morning, from the book of the prophet Isaiah,\na passage that looks beyond the present sorry state of the city of Jerusalem, a\nPage 2 of 3\nADVENT 1 –Year A – 2016\nplace of national pride, self sufficiency, self serving religion; that looks\nthrough the eyes of God, to see what is to be that is not yet.`\nThese are words written for their time, a particular crisis in the life of a\nparticular people. But they are a message for all time, they are a message for\nour time.\nThe prophet declares:\nHe will teach us his ways,\nso that we may walk in his paths.”\nNourish us with sacred story,\ntill we claim it as our own.\nAdvent is a season of preparation, preparation to celebrate Christmas,\npreparing for the Kingdom.\nGoing back to last Sunday, the end of the Christian year, we reflected on those\nwords of Paul to the Colossians as he spoke of Jesus:\n‘He is the image of the invisible God’ and alongside them words of Bishop\nDavid Jenkins, ‘Jesus is the face of God towards us; God with us, God for us.’\nAs I continue to reflect on this my mind goes back to the very beginning of the\nstory, the first of the Creation narratives given to us in the Book Genesis, as the\nwriter speaks of man\nSo God created humankind in his image,\nin the image of God he created them;\nmale and female he created them. Genesis 1:27\nJesus as the image of God; you and me created in the image of God. We see\nin Jesus, not just the image of the invisible God, we see in the person of Jesus\nPage 3 of 3\nADVENT 1 –Year A – 2016\nhumanity, my humanity, your humanity, as God always intended it to be. This\nis where this story becomes my story. It is not the distant story of mythical\nforbears, it becomes the story of what I am called to be.\nAnd so our hymn continues\n2 Turn our worship into witness\nin the sacrament of life;\nsend us forth to love and serve you,\nbringing peace where there is strife.\nGive us, Christ, your great compassion\nto forgive as you forgave;\nPart of my calling, part of what I am meant to be as one made in the image of\nGod, as one baptised in the name of him who is the image of the invisible God.\nWe are called to be not bystanders but active participants in the story of Christ\ncoming into the world. We are called to make Christ present, to be the hands,\nthe lips, the feet of Christ in the world in which we live.\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen"
    }
}