{
    "title": "Funeral of Alastair McMillan",
    "date": "2011-02-23",
    "blurb": "This sermon is a tribute to Alastair McMillan, a man of deep spirituality, peace, and practicality. It reflects on his life, his love for the sea, and his devotion to his family. The sermon also touches on his contributions to the community, his achievements, and his lifelong habits of worship.",
    "raw_text": "We gather here today in St Mary’s Church for the funeral of Alastair McMillan. We have heard the family speak with pride of one who was their father and who also became their friend. This is not just a funeral service but also a service of thanksgiving, a time to reflect on all that we have received in this quiet, understated man, as husband, as father, grandfather, friend.\n\nHe grew up in a strong Presbyterian tradition – his father’s Christian name of John Knox bears ample testimony to that. He was the first infant to be baptised in Howth Presbyterian Church. It came through in taking pleasure in simple things, a distrust of fuss, one who took great pride in his family. There was a serenity to him and a very practical down to earth approach. At the heart of it all, there was a simple, sincerely held, no-nonsense spirituality. One sensed that here was a man at peace with himself.\n\nFor the last few years, Alastair and Muriel have worshipped here in St Mary’s. In that time Alastair has made his own quiet, thoughtful contribution. He served for a while on the Select Vestry, offering his engineering skills to the Rectory project. Again, at the heart of it all a regular participation in Sunday worship – a very rare Sunday when he would not be here.\n\nAlastair lived to a good age – well past the three score years and ten. He was blessed with remarkable health and strength. Still regular in his golf, his sailing, still undertaking projects. The suddenness of his death has caught us all off balance. That suddenness is a reminder of the tenuous hold we all have on life. But as I look back over his life, Alastair has left us with a lesson of living each day, enjoying his golf, his sailing, his family, his life long habits of worship. In that mix there is the contentment and peace of mind he so clearly found.\n\nWe pray that you may know something of the presence of the God who Alastair sought in worship throughout his life; that in his presence you may find peace and hope both for yourselves and for Alastair.\n\nThe following is a poem that sets our hope for Alastair and for ourselves in the context of the sailing traditions of this place:\n\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\nShe is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sea and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says, ‘There she goes!’, there are other eyes watching her coming, and other voices ready to take up the glad shout :\n‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Alastair McMillan.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mr. Alastair McMillan – Howth – 23rd February 2011\nWe gather here today in St Mary’s Church for the funeral of Alastair\nMcMillan. We have heard the family speak with pride of one who was their\nfather and who also became their friend. This is not just a funeral service but\nalso a service of thanksgiving, a time to reflect on all that we have received in\nthis quiet, understated man, as husband, as father, grandfather, friend. He grew\nup in a strong Presbyterian tradition – his father’s Christian name of John Knox\nbears ample testimony to that. He was the first infant to be baptised in Howth\nPresbyterian Church. It came through in taking pleasure in simple things, a\ndistrust of fuss, one who took great pride in his family. There was a serenity to\nhim and a very practical down to earth approach. At the heart of it all, there\nwas a simple, sincerely held, no-nonsense spirituality. One sensed that here\nwas a man at peace with himself. Some time ago he approached me and said\nhe wanted to sort out the details of his funeral; he asked for details of the order\nof service. The other day, when I called to the house after his death, the folder\nwas produced with the finer details, choice of hymns, readings, a poem his\nfather had written for him for his 18th birthday included in the basic structure I\nhad left for him. For the last few years, Alastair and Muriel have worshipped\nhere in St Mary’s. In that time Alastair has made his own quiet, thoughtful\ncontribution. He served for a while on the Select Vestry, offering his\nengineering skills to the Rectory project. Again, at the heart of it all a regular\nparticipation in Sunday worship – a very rare Sunday when he would not be\nhere. He had a life long love of the sea. By all accounts that would have been\nhis first choice of career but his father persuaded him to study engineering. He\nloved sailing both in competitions and in off shore cruising. He was a devoted\nsupporter of the Lifeboat – the family have spoken of his achievements during\nhis spell in office as Chairman and the Gold Medal he received from the Duke\nPage 2 of 3\nFuneral of Mr. Alastair McMillan – Howth – 23rd February 2011\nof Kent. And so I think it is fitting that his coffin is draped with the Lifeboat\nFlag.\nAlastair lived to a good age – well past the three score years and ten. He was\nblessed with remarkable health and strength. Still regular in his golf, his\nsailing, still undertaking projects. The suddenness of his death has caught us\nall off balance. That suddenness is a reminder of the tenuous hold we all have\non life. But as I look back over his life, Alastair has left us with a lesson of\nliving each day, enjoying his golf, his sailing, his family, his life long habits of\nworship. In that mix there is the contentment and peace of mind he so clearly\nfound.\nAlastair was very much a family man, the devotion and the pride was clear for\nall to see. And so the loss, the suddenness of that loss is all the more poignant.\nThose of us outside the immediate family circle come today to offer our love,\nour prayers, our simple presence with the family, with Muriel, with their sons\nJohn, Murray (who cannot be here) and Russell, their children and\ngrandchildren as well as his sister Eileen in South Africa. We assure you of\nour love not just for today but for the days to come as you build a life without\nthe one you love and who has loved you.\nWe pray that you may know something of the presence of the God who\nAlastair sought in worship throughout his life; that in his presence you may\nfind peace and hope both for yourselves and for Alastair.\nAs we have remarked, Alastair was a man who loved the sea.\nPage 3 of 3\nFuneral of Mr. Alastair McMillan – Howth – 23rd February 2011\nThe following is a poem that sets our hope for Alastair and for ourselves in the\ncontext of the sailing traditions of this place\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sea and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}