{
    "title": "All Saints' Reflection",
    "date": "2017-11-01",
    "blurb": "Kevin reflects on the concept of sainthood, emphasizing that it is not reserved for an elite few but is a call for every Christian in their baptism. He draws from the history of the Parish of Howth and its 200-year celebration, the discovery of an ancient burial ground, and the lives of notable saints and ordinary faithful individuals. The sermon encourages us to recognize our own value and calling as saints in the Church of God, highlighting the diversity and faithfulness of the Christian community across time and culture.",
    "raw_text": "ALL SAINTS – 2017 – Broadcast Service\n\nLast year was quite a year for the Parish of Howth. We celebrated 200 years of worship on the site of the present Church. The first Church, built in 1816, was quickly replaced by the present Church, consecrated in 1866. This year, we have just completed an extensive restoration of the external fabric of the Church. We got the roof on just in time for Hurricane Ophelia.\n\nIn the course of our work on the Church this summer it was necessary to install additional drainage. In the course of digging for this we discovered that our Church was built on the site of an ancient burial ground dating back to the 11th century. We came across 30 individuals, men and women, old and young along with evidence of an early settlement. We were reminded of a Christian community existing in Howth long before our Church was built.\n\nOne of the features of our Parish Church of St Mary’s would be the East Window over the communion table, donated to the Church in memory of the last Earl of Howth. At the centre of the window is the figure of the risen and ascended Christ. Then gathered around him are other figures, saints of the Church, exceptional figures who contributed to the early growth of the Church and the Church in Ireland. So we see the figure of St Peter, St Christopher, St Lawrence. Then we have figures of Patrick, Brendan and Brigid, as well as those associated with the Church in this locality, Fintan and Assam, one presenting the church in Sutton. the other the Garland of Howth, a manuscript associated with the Church on Ireland’s Eye.\n\nAll of these were exceptional characters who left their mark on the history of the Church, who have inspired succeeding generations. The trouble is that in ascribing the title saint to any individual, however worthy, it can lead us to a distorted understanding of the whole concept of what it means to be a saint in the Church of God.\n\nOf course in the New Testament sainthood was a much more all embracing term. When Paul was writing to the different churches, he began his letter in these terms:\n\nPaul and Timothy, servants of Christ Jesus,\nTo all the saints in Christ Jesus who are in Philippi, (or whichever Church he was writing to)\n\nHe wasn’t writing to an elite, to a spiritual inner circle; he was writing to the whole Church. What marked them out was not a perfection in their Christian life. Their sainthood rested on the fact that God had laid a claim upon them and they sought to respond to that call in their following of Jesus as Lord and Saviour. They are saints not by the acclamation of men - they are saints by the call of God.\n\nEvery Christian in Baptism is called to sainthood. So we give thanks to God for those men and women down through the ages, known only to God and those close to them, who have responded to the call of their Baptism, who have faithfully followed him in their earthly pilgrimage, serving him and furthering the work of his kingdom in the situation in which he placed them. I go back to those people we found buried in the grounds of our Church, who lived in these parts nearly a thousand years ago. These are not remembered in any windows, or brass plaques in our Church – we know of no names, we only know of their presence.\n\nWe have recently celebrated the 500th anniversary of the action of Martin Luther in nailing his 95 theses to the door of the Cathedral of Wuttenberg. Now we rightly honour the work of great Christian leaders such as Luther, along with Cranmer, Wesley, Pope John 23rd, Oscar Romero, Martin Luther King and the like. But behind each of these were family, friends, teachers, who nurtured them in the faith, sustained them, encouraged them in times of difficulty. Of these we now hear nothing but on a day such as this we thank God for their faithful service that yielded such fruits in the furtherance of God’s Kingdom.\n\nIn our lessons Jeremiah spoke of a time when God’s law would be written on the very hearts of men. In our Gospel reading from St Matthew we hear of Jesus giving us the Beatitudes. Both speak of a vision of lives lived in harmony, in communion with God. Lives in whom God’s law is to be part of their very nature, written on their heart, bearing fruit. These passages speak of our vocation, our calling to be saints in the Church of God.\n\nAll too often we lose sight of that vocation. Overawed by the exploits of the giants of the Church we lose sight of our own value, our own worth in the sight of God as ones made in God’s image, ransomed, healed, restored, forgiven. All too often we lose sight of the value of others – they are of a different class, a different culture, a different tradition – but they too are ones made in God’s image, they too are ransomed, healed, restored, forgiven.\n\nAll Saints is a reminder of the diversity, the faithfulness of those who have gone before; a community spanning time and culture and with that a reminder of the faithfulness of God towards those who are faithful to him. We worship a God who is not a God of the dead but of the living, receiving the worship not only of the Church on earth but also the Church in heaven.\n\nThis season of All Saints is an opportunity to reflect on our own calling, our own vocation, our hope as saints in the Church of God. It is a wonderful reminder of the all encompassing love of God – even for us.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/allsaints2017 - broadcast.txt",
        "raw_ocr_content": "Page 1 of 3\nALL SAINTS – 2017 – Broadcast Service\nLast year was quite a year for the Parish of Howth. We celebrated 200 years of\nworship on the site of the present Church. The first Church, built in 1816,was\nquickly replaced by the present Church, consecrated in 1866. This year, we\nhave just completed an extensive restoration of the external fabric of the\nChurch. We got the roof on just in time for Hurricane Ophelia.\nIn the course of our work on the Church this summer it was necessary to install\nadditional drainage. In the course of digging for this we discovered that our\nChurch was built on the site of an ancient burial ground dating back to the 11th\ncentury. We came across 30 individuals, men and women, old and young\nalong with evidence of an early settlement. We were reminded of a Christian\ncommunity existing in Howth long before our Church was built.\nOne of the features of our Parish Church of St Mary’s would be the East\nWindow over the communion table, donated to the Church in memory of the\nlast Earl of Howth. At the centre of the window is the figure of the risen and\nascended Christ. Then gathered around him are other figures, saints of the\nChurch, exceptional figures who contributed to the early growth of the Church\nand the Church in Ireland. So we see the figure of St Peter, St Christopher, St\nLawrence. Then we have figures of Patrick, Brendan and Brigid, as well as\nthose associated with the Church in this locality, Fintan and Assam, one\npresenting the church in Sutton. the other the Garland of Howth, a manuscript\nassociated with the Church on Ireland’s Eye.\nAll of these were exceptional characters who left their mark on the history of\nthe Church, who have inspired succeeding generations. The trouble is that in\nascribing the title saint to any individual, however worthy, it can lead us to a\ndistorted understanding of the whole concept of what it means to be a saint in\nthe Church of God.\nPage 2 of 3\nALL SAINTS – 2017 – Broadcast Service\nOf course in the New Testament sainthood was a much more all embracing\nterm. When Paul was writing to the different churches, he began his letter in\nthese terms:\nPaul and Timothy, servants of Christ Jesus,\nTo all the saints in Christ Jesus who are in Philippi, (or whichever Church he\nwas writing to)\nHe wasn’t writing to an elite, to a spiritual inner circle; he was writing to the\nwhole Church. What marked them out was not a perfection in their Christian\nlife. Their sainthood rested on the fact that God had laid a claim upon them\nand they sought to respond to that call in their following of Jesus as Lord and\nSaviour. They are saints not by the acclamation of men - they are saints by the\ncall of God.\nEvery Christian in Baptism is called to sainthood. So we give thanks to God for\nthose men and women down through the ages, known only to God and those\nclose to them, who have responded to the call of their Baptism, who have\nfaithfully followed him in their earthly pilgrimage, serving him and furthering\nthe work of his kingdom in the situation in which he placed them. I go back to\nthose people we found buried in the grounds of our Church, who lived in these\nparts nearly a thousand years ago. These are not remembered in any windows,\nor brass plaques in our Church – we know of no names, we only know of their\npresence.\nWe have recently celebrated the 500th anniversary of the action of Martin\nLuther in nailing his 95 theses to the door of the Cathedral of Wuttenberg.\nNow we rightly honour the work of great Christian leaders such as Luther,\nalong with Cranmer, Wesley, Pope John 23rd, Oscar Romero, Martin Luther\nKing and the like. But behind each of these were family, friends, teachers, who\nnurtured them in the faith, sustained them, encouraged them in times of\nPage 3 of 3\nALL SAINTS – 2017 – Broadcast Service\ndifficulty. Of these we now hear nothing but on a day such as this we thank\nGod for their faithful service that yielded such fruits in the furtherance of\nGod’s Kingdom.\nIn our lessons Jeremiah spoke of a time when God’s law would be written on\nthe very hearts of men. In our Gospel reading from St Matthew we hear of\nJesus giving us the Beatitudes. Both speak of a vision of lives lived in\nharmony, in communion with God. Lives in whom God’s law is to be part of\ntheir very nature, written on their heart, bearing fruit. These passages speak of\nour vocation, our calling to be saints in the Church of God.\nAll too often we lose sight of that vocation. Overawed by the exploits of the\ngiants of the Church we lose sight of our own value, our own worth in the sight\nof God as ones made in God’s image, ransomed, healed, restored, forgiven.\nAll too often we lose sight of the value of others – they are of a different class,\na different culture, a different tradition – but they too are ones made in God’s\nimage, they too are ransomed, healed, restored, forgiven.\nAll Saints is a reminder of the diversity, the faithfulness of those who have\ngone before; a community spanning time and culture and with that a reminder\nof the faithfulness of God towards those who are faithful to him. We worship a\nGod who is not a God of the dead but of the living, receiving the worship not\nonly of the Church on earth but also the Church in heaven.\nThis season of All Saints is an opportunity to reflect on our own calling, our\nown vocation, our hope as saints in the Church of God. It is a wonderful\nreminder of the all encompassing love of God – even for us."
    }
}