{
    "title": "All Saints Day Reflection",
    "date": "2012-11-04",
    "blurb": "Kevin's sermon on All Saints Day emphasizes the celebration of the 'foot soldiers' of the Church and the Christian understanding of sainthood. It reflects on the calling to discipleship in baptism and the hope found in the ultimate triumph of good over evil as depicted in the book of Revelation. The sermon also explores the presence of God in daily life and in times of pain, as illustrated by the story of Lazarus.",
    "raw_text": "ALL SAINTS – year B – 2012\n\nDriving along the coast road the other night there were the familiar sights of fireworks in the sky, strangely clad individuals wandering the street, going from door to door. It was of course Halloween, All Hallowes Eve. The following day is All Saints Day and in recent years there has been the option of using the lessons for All Saints on the Sunday closest to All Saints Day. It is an affirmation of the specifically Christian understanding of this season that has been almost obliterated by the customs and folk lore that have grown up around it. Don't get me wrong – I have enjoyed the festivities with my children in the past but it is good in the context of our worship today to reaffirm the Christian dimension.\n\nSo what is distinctive about All Saints? So many of our feast days reflect on the contribution of the giants of the Church – Peter, Paul, Mary, Patrick, Columba, Brigid, Andrew, Barnabas to name but a few; figures who have inspired us down through the ages. All Saints for me is a celebration of the foot soldiers of the Church, the unseen, the unsung heroes of the Church of God. It is an occasion to remember with thanksgiving those who have inspired us on the path of faith, parents, teachers, Sunday School teachers, Youth Leaders, fellow parishioners.\n\nAll Saints also reminds us of our own calling in Baptism to discipleship. On the Sunday before last, as Lucy and later Luke were brought for Baptism, as they were signed with the sign of the Cross I said to each of them. 'Christ claims you for his own, ... Live as a disciple of Christ.' The rest of our lives is a matter of responding to that calling to follow Christ, to embrace our vocation to be saints.\n\nAll Saints is about hope. Our second lesson is drawn from near the end of the book Revelation. This book is written in the context of growing persecution of the Church by the Roman Empire and, using stark images of spiritual warfare, it speaks of the ultimate triumph of good over evil, of light over darkness; the ultimate triumph of God himself. The passage we read, which is often read in the context of a funeral, speaks of a new order at the end of time, a new Jerusalem, of God living among his people. And in that closer presence of God there is to be no pain, no sorrow, no death. In the original Greek in which this passage is written, God living among his people is expressed in the Greek word, skhnow.\n\nVery soon we will hear once again the words of the Christmas Gospel, from the opening chapter of John's Gospel, concluding with those marvellous words: 'And the Word became flesh, and lived among us ...' Lived among us is expressed in that same word, skhnow. This word has the meaning of pitching a tent, or in the context of a tabernacle, a spot where the deity is deemed to be present.\n\nThe passage from Revelation looks forward to a future fulfilment. John's Gospel speaks of God among us in the ups and downs of daily living in 1st century Palestine. With this in mind, we go to our Gospel reading, John's account of the raising of Lazarus. The passage begins with a sister's disappointment, as Mary says, 'Lord, if you had been here, my brother would not have died.' Words spoken to him of whom the Gospel writer has said earlier; 'And the Word became flesh and lived (skhnow) among us.'\n\nAs I reflect on Mary's words of disappointment and the emotion of Jesus in his tears, I have a picture here of God's presence among us in the midst of death, of weeping, of crying; of God among us hearing our disappointment, our confusion, our pain; but more than that, God not only hearing our pain but being moved by our pain.\n\nThis for me is one of the fundamental insights of the Judaeo-Christian understanding of God. A God who hears the cries of his people in slavery in Egypt, a God who hears the cry of Mary mourning for her brother Lazarus, and asking 'Why?'.\n\nThis is the God I meet in Christ; this is the God who calls me to follow. This is the God in whom I find hope and meaning, not just at the end of my earthly pilgrimage but on every step along the way as I seek, in my own imperfect way, to live up to my calling to sainthood, to follow him who died that I might have life, and have it more abundantly.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/allsaints2012.txt",
        "raw_ocr_content": "Page 1 of 3\nALL SAINTS – year B – 2012\nDriving along the coast road the other night there were the familiar sights of\nfireworks in the sky, strangely clad individuals wandering the street, going\nfrom door to door. It was of course Halloween, All Hallowes Eve. The\nfollowing day is All Saints Day and in recent years there has been the option of\nusing the lessons for All Saints on the Sunday closest to All Saints Day. It is\nan affirmation of the specifically Christian understanding of this season that\nhas been almost obliterated by the customs and folk lore that have grown up\naround it. Don’t get me wrong – I have enjoyed the festivities with my\nchildren in the past but it is good in the context of our worship today to\nreaffirm the Christian dimension.\nSo what is distinctive about All Saints? So many of our feast days reflect on\nthe contribution of the giants of the Church – Peter, Paul, Mary, Patrick,\nColumba, Brigid, Andrew, Barnabas to name but a few; figures who have\ninspired us down through the ages. All Saints for me is a celebration of the\nfoot soldiers of the Church, the unseen, the unsung heroes of the Church of\nGod. It is an occasion to remember with thanksgiving those who have inspired\nus on the path of faith, parents, teachers, Sunday School teachers, Youth\nLeaders, fellow parishioners.\nAll Saints also reminds us of our own calling in Baptism to discipleship. On\nthe Sunday before last, as Lucy and later Luke were brought for Baptism, as\nthey were signed with the sign of the Cross I said to each of them.\nChrist claims you for his own, …. Live as a disciple of Christ.\nThe rest of our lives is a matter of responding to that calling to follow Christ, to\nembrace our vocation to be saints.\nPage 2 of 3\nALL SAINTS – year B – 2012\nAll Saints is about hope. Our second lesson is drawn from near the end of the\nbook Revelation. This book is written in the context of growing persecution of\nthe Church by the Roman Empire and, using stark images of spiritual warfare,\nit speaks of the ultimate triumph of good over evil, of light over darkness; the\nultimate triumph of God himself. The passage we read, which is often read in\nthe context of a funeral, speaks of a new order at the end of time, a new\nJerusalem, of God living among his people. And in that closer presence of God\nthere is to be no pain, no sorrow, no death. In the original Greek in which this\npassage is written, God living among his people is expressed in the Greek\nword, skhnow.\nVery soon we will hear once again the words of the Christmas Gospel, from\nthe opening chapter of John’s Gospel, concluding with those marvellous\nwords: ‘And the Word became flesh, and lived among us ….’ Lived among us\nis expressed in that same word, skhnow. This word has the meaning of\npitching a tent, or in the context of a tabernacle, a spot where the deity is\ndeemed to be present.\nThe passage from Revelation looks forward to a future fulfilment. John’s\nGospel speaks of God among us in the ups and downs of daily living in 1st\ncentury Palestine. With this in mind, we go to our Gospel reading, John’s\naccount of the raising of Lazarus. The passage begins with a sister’s\ndisappointment, as Mary says, ‘Lord, if you had been here, my brother would\nPage 3 of 3\nALL SAINTS – year B – 2012\nnot have died.’ Words spoken to him of whom the Gospel writer has said\nearlier; ‘And the Word became flesh and lived (skhnow) among us.’\nAs I reflect on Mary’s words of disappointment and the emotion of Jesus in his\ntears, I have a picture here of God’s presence among us in the midst of death,\nof weeping, of crying; of God among us hearing our disappointment, our\nconfusion, our pain; but more than that, God not only hearing our pain but\nbeing moved by our pain.\nThis for me is one of the fundamental insights of the Judaeo-Christian\nunderstanding of God. A God who hears the cries of his people in slavery in\nEgypt, a God who hears the cry of Mary mourning for her brother Lazarus, and\nasking ‘Why?’.\nThis is the God I meet in Christ; this is the God who calls me to follow. This is\nthe God in whom I find hope and meaning, not just at the end of my earthly\npilgrimage but on every step along the way as I seek, in my own imperfect\nway, to live up to my calling to sainthood, to follow him who died that I might\nhave life, and have it more abundantly."
    }
}