{
    "title": "All Saints' Reflection",
    "date": "2014-11-01",
    "blurb": "Kevin's sermon on All Saints' Day reflects on the true meaning of sainthood, emphasizing that it is not about perfection but about God's claim on individuals who follow Jesus. He encourages the congregation to recognize the value of every person as made in God's image, and to celebrate the faithfulness of God towards those who are faithful to Him. The sermon concludes with a reminder of God's broad love and mercy, as expressed in a hymn.",
    "raw_text": "ALL SAINTS – 2014\n\nOne of the features of our Parish Church of St Mary’s would be the East Window over the communion table, donated to the Church in memory of the last Earl of Howth. At the centre of the window is the figure of the risen and ascended Christ. Then gathered around him are other figures, saints of the Church, exceptional figures who contributed to the early growth of the Church and the Church in Ireland. So we see the figure of St Peter and also of St Lawrence, the patron saint of my home Parish Church in Birmingham. St Lawrence always features holding a grid iron in his hand. This reflects his martyrdom in the early persecution of the Church in the city of Rome. He had been commanded by the magistrates to appear before them with the riches of the Church. He did appear, leading in a group of children, and explained that these were the riches of the Church. He was duly roasted alive on a grid iron for his insolence. Then we have figures of Patrick and Brigid, as well as those associated with the Church in this locality, Fintan and Assam.\n\nAll of these were exceptional characters who left their mark on the history of the Church who have inspired succeeding generations. The trouble is ascribing the title saint to any individual, however worthy, can lead us to a distorted understanding of the whole concept of what it means to be a saint in the Church of God.\n\nWhen Paul was writing to the Church at Philippi he began his letter in these terms:\n\n> Paul and Timothy, servants of Christ Jesus,\n> To all the saints in Christ Jesus who are in Philippi,\n\nHe wasn’t writing to an elite, to a spiritual inner circle; he was writing to the whole Church. What marked them out was not a perfection in their Christian life. Their sainthood rested on the fact that God had laid a claim upon them and they sought to respond to that call in their following of Jesus as Lord and Saviour. They are saints not by the acclamation of men - they are saints by the call of God.\n\nOn this day, we give thanks to God for those men and women down through the ages, known only to God and those close to them, who faithfully followed in their earthly pilgrimage, serving him and furthering the work of his kingdom in the situation in which he placed them. We rightly honour the work of great Christian leaders such as Cranmer, Luther, Wesley, Boenhoffer, Martin Luther King and the like. But behind each of these were family, friends, teachers, who nurtured them in the faith, sustained them, encouraged them in times of difficulty. Of these we now hear nothing but on a day such as this we thank God for their faithful service that yielded such fruits in the furtherance of God’s Kingdom.\n\nWe also celebrate the faithfulness of God towards those who are faithful to him. We worship a God who is not a God of the dead but of the living, receiving the worship not only of the Church on earth but also the Church in heaven.\n\nIn our lesson from Revelation, John gives us a glimpse of the heavenly worship, of the life of the redeemed now at rest. John shares with us his vision of the enormous scope of God’s redeeming activity. After recounting the redeemed of the house of Israel, he goes on to the passage we read to speak of those without number, drawn from every nation, tribe people and language. This speaks to me of a God who breaks down barriers of race and culture that divide. As we read on in this book, one of the themes that come through the complex and sometimes confusing images we find in it, is that in the heavenly courts distinctions are not drawn on the basis of race and culture but on faithfulness to Christ.\n\nAll too often we lose sight of that. Overawed by the exploits of the giants of the Church we lose sight of our own value, our own worth in the sight of God as ones made in God’s image, ransomed, healed, restored, forgiven. All too often we lose sight of the value of others – they are of a different class, a different culture, a different tradition – but they too are ones made in God’s image, they too are ransomed, healed, restored, forgiven.\n\nThis season of All Saints is an opportunity to reflect on our own calling, our own vocation, our hope as saints in the Church of God. It is a wonderful reminder of the all encompassing love of God – even for us.\n\nI would just finish with words of Hymn 9:\n\n> There’s a wideness in God’s mercy,\n> like the wideness of the sea;\n> there’s a kindness in his justice,\n> which is more than liberty.\n> For the love of God is broader\n> than the measure of man’s mind;\n> and the heart of the eternal\n> is most wonderfully kind.\n> But we make his love too narrow\n> by false limits of our own;\n> and we magnify his strictness\n> with a zeal he will not own.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/allsaints2014.txt",
        "raw_ocr_content": "Page 1 of 3\nALL SAINTS – 2014\nOne of the features of our Parish Church of St Mary’s would be the East\nWindow over the communion table, donated to the Church in memory of the\nlast Earl of Howth. At the centre of the window is the figure of the risen and\nascended Christ. Then gathered around him are other figures, saints of the\nChurch, exceptional figures who contributed to the early growth of the Church\nand the Church in Ireland. So we see the figure of St Peter and also of St\nLawrence, the patron saint of my home Parish Church in Birmingham. St\nLawrence always features holding a grid iron in his hand. This reflects his\nmartyrdom in the early persecution of the Church in the city of Rome. He had\nbeen commanded by the magistrates to appear before them with the riches of\nthe Church. He did appear, leading in a group of children, and explained that\nthese were the riches of the Church. He was duly roasted alive on a grid iron\nfor his insolence. Then we have figures of Patrick and Brigid, as well as those\nassociated with the Church in this locality, Fintan and Assam.\nAll of these were exceptional characters who left their mark on the history of\nthe Church who have inspired succeeding generations. The trouble is ascribing\nthe title saint to any individual, however worthy, can lead us to a distorted\nunderstanding of the whole concept of what it means to be a saint in the\nChurch of God.\nWhen Paul was writing to the Church at Philippi he began his letter in these\nterms:\nPaul and Timothy, servants of Christ Jesus,\nTo all the saints in Christ Jesus who are in Philippi,\nHe wasn’t writing to an elite, to a spiritual inner circle; he was writing to the\nwhole Church. What marked them out was not a perfection in their Christian\nlife. Their sainthood rested on the fact that God had laid a claim upon them\nand they sought to respond to that call in their following of Jesus as Lord and\nPage 2 of 3\nALL SAINTS – 2014\nSaviour. They are saints not by the acclamation of men - they are saints by the\ncall of God.\nOn this day, we give thanks to God for those men and women down through\nthe ages, known only to god and those close to them, who faithfully followed\nin their earthly pilgrimage, serving him and furthering the work of his kingdom\nin the situation in which he placed them. We rightly honour the work of great\nChristian leaders such as Cranmer, Luther, Wesley, Boenhoffer, Martin Luther\nKing and the like. But behind each of these were family, friends, teachers, who\nnurtured them in the faith, sustained them, encouraged them in times of\ndifficulty. Of these we now hear nothing but on a day such as this we thank\nGod for their faithful service that yielded such fruits in the furtherance of\nGod’s Kingdom.\nWe also celebrate the faithfulness of God towards those who are faithful to\nhim. We worship a God who is not a God of the dead but of the living,\nreceiving the worship not only of the Church on earth but also the Church in\nheaven.\nIn our lesson from Revelation, John gives us a glimpse of the heavenly\nworship, of the life of the redeemed now at rest. John shares with us his vision\nof the enormous scope of God’s redeeming activity. After recounting the\nredeemed of the house of Israel, he goes on to the passage we read to speak of\nthose without number, drawn from every nation, tribe people and language.\nThis speaks to me of a God who breaks down barriers of race and culture that\ndivide. As we read on in this book, one of the themes that come through the\ncomplex and sometimes confusing images we find in it, is that in the heavenly\ncourts distinctions are not drawn on the basis of race and culture but on\nfaithfulness to Christ.\nPage 3 of 3\nALL SAINTS – 2014\nAll too often we lose sight of that. Overawed by the exploits of the giants of\nthe Church we lose sight of our own value, our own worth in the sight of God\nas ones made in God’s image, ransomed, healed, restored, forgiven. All too\noften we lose sight of the value of others – they are of a different class, a\ndifferent culture, a different tradition – but they too are ones made in God’s\nimage, they too are ransomed, healed, restored, forgiven.\nThis season of All Saints is an opportunity to reflect on our own calling, our\nown vocation, our hope as saints in the Church of God. It is a wonderful\nreminder of the all encompassing love of God – even for us.\nI would just finish with words of Hymn 9\nThere’s a wideness in God’s mercy,\nlike the wideness of the sea;\nthere’s a kindness in his justice,\nwhich is more than liberty.\nFor the love of God is broader\nthan the measure of man’s mind;\nand the heart of the eternal\nis most wonderfully kind.\nBut we make his love too narrow\nby false limits of our own;\nand we magnify his strictness\nwith a zeal he will not own."
    }
}