{
    "title": "Funeral of Anna Kenny",
    "date": "2019-10-10",
    "blurb": "This sermon is a tribute to Anna Kenny, who had a long association with the Wallace family and passed away after a brief illness. The sermon reflects on Anna's life, her qualities, and the memories she left behind. It also discusses the concept of love and its enduring nature, as described by St. Paul in his letter to the Corinthians.",
    "raw_text": "On Tuesday I heard from Vincent Wallace that Anna Kenny, who had a long association with the Wallace family, had died and the process of planning her funeral got under way.\n\nAnna, though of a good age, had kept remarkable health over the years. Then recently she developed a chest infection which when investigated further showed she was seriously ill. She died just four weeks later in Beaumont hospital very much as she had lived, quietly and without fuss. A bereavement, however much we may anticipate it, always carries with it a sense of shock, of loss, of sadness. Someone who has been so much part of our lives is now gone and a gap is left that no one else can fill in quite the same way. It is also a time of a gathering together of memories, the things that made a loved one special, their talents, their weaknesses, their love, their humour, their gentleness. As we gather these memories, our remembering promotes thankfulness, gratitude, to the one we have lost, to God himself. And there is a lot to be thankful for.\n\nAnna, a native of Ballinalee, Co. Longford came to Dublin while still a young woman. When the family she was working for moved to Canada, she opted to stay in Dublin and started working for the Wallace family. So began a near lifelong association with the Wallace family – she is remembered today by her own sisters, Florence and Isobelle, and also as very much part of that wider family. Vincent will share with their appreciation of Anna.\n\nShe shared in many of the family celebrations over the years and they were with her at the end as she departed this life. They have chosen two readings from the Old Testament for her service. We have heard Psalm 139 – this was read by the hospital chaplain as she died. The other is that passage from Ecclesiastes – ‘For everything there is a season …..’ In this we find the whole sweep of life’s experiences before God. There is hope and despair, love and conflict, healing and pain – all human life is there. Behind it all there runs a search of meaning in this complicated business of living.\n\nThe writer talks of a rhythm of life. Where do we find hope, where do we find meaning? I often think we begin that search with each other, we begin with love in which we support each other in our loss. St Paul, talking of love, writes to the Church in Corinth:\n\n> 4 Love is patient; love is kind; love is not envious or boastful or arrogant 5 or rude. …… 7 It bears all things, believes all things, hopes all things, endures all things. 8 Love never ends.\n\nSo today Anna’s sisters, Florence and Isobelle, the Wallace family remember Anna with love and thanksgiving as we commend her to the loving care of Almighty God.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Anna Kenny.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Anna Kenny – St Mary’s, Howth – 10th October 2019\nOn Tuesday I heard form Vincent Wallace that Anna Kenny, who had\nhad a long association with the Wallace family, had died and the\nprocess of planning his funeral got under way.\nAnna, though of a good age, had kept remarkable health over the\nyears. Then recently she developed a chest infection which when\ninvestigated further showed she was seriously ill. She died just four\nweeks later in Beaumont hospital very much as she had lived, quietly\nand without fuss. A bereavement, however much we may anticipate\nit, always carries with it a sense of shock, of loss, of sadness.\nSomeone who has been so much part of our lives is now gone and a\ngap is left that no one else can fill in quite the same way. It is also a\ntime of a gathering together of memories, the things that made a loved\none special, their talents, their weaknesses, their love, their humour,\ntheir gentleness. As we gather these memories, our remembering\npromotes thankfulness, gratitude, to the one we have lost, to God\nhimself. And there is a lot to be thankful for.\nAnna, a native of Ballinalee, Co. Longford came to Dublin while still\na young woman. When the family she was working for moved to\nCanada, she opted to stay in Dublin and started working for the\nWallace family. So began a near lifelong association with the\nWallace family – she is remembered today by her own sisters,\nFlorence and Isobelle, and also as very much part of that wider\nfamily. Vincent will share with their appreciation of Anna.\nPage 2 of 2\nFuneral of Anna Kenny – St Mary’s, Howth – 10th October 2019\nShe shared in many of the family celebrations over the years and they\nwere with her at the end as she departed this life. They have chosen\ntwo readings from the Old Testament for her service. We have heard\nPsalm 139 – this was read by the hospital chaplain as she died. The\nother is that passage from Ecclesiastes – ‘For everything there is a\nseason …..’ In this we find the whole sweep of life’s experiences\nbefore God. There is hope and despair, love and conflict, healing and\npain – all human life is there. Behind it all there runs a search of\nmeaning in this complicated business of living.\nThe writer talks of a rhythm of life. Where do we find hope, where\ndo we find meaning? I often think we begin that search with each\nother, we begin with love in which we support each other in our loss.\nSt Paul, talking of love, writes to the Church in Corinth:\n4 Love is patient; love is kind; love is not envious or\nboastful or arrogant 5 or rude. …… 7 It bears all things,\nbelieves all things, hopes all things, endures all things. 8\nLove never ends.\n1 Cor 13.4-8\nSo today Anna’s sisters, Florence and Isobelle, the Wallace family\nremember Anna with love and thanksgiving as we commend her to\nthe loving care of Almighty God."
    }
}