{
    "title": "Ash Wednesday 2011",
    "date": "2011-03-09",
    "blurb": "This sermon discusses the theme of journey, as seen in the Old Testament, and relates it to our own life journey. It emphasizes the importance of community, repentance, and reflection in this journey. The sermon also draws parallels between the journey of faith and the political journey of the nation, urging the congregation to be guided by spiritual heritage and the teachings of the prophet Micah.",
    "raw_text": "One of the recurring themes of the Old Testament is that of journey; Abram called to leave his homeland in Ur and travel to Canaan. Moses called to journey with God’s people from slavery in Egypt to the Land of Promise. Jesus told stories of journeys – the young man who demanded his inheritance of his father and travelled off – who later journeyed back in penitence to experience the extravagant love of his father. Journeys into exile and slavery. Journeys to the Land of Promise, to the place of renewal and forgiveness.\n\nOur 3rd Eucharistic prayer reminds us that “when we turned away you did not reject us. You came to meet us in your son, welcomed us as your children and prepared a table where we might feast with you. In our own day description of the Church as a pilgrim people. We make our journey not just as individuals but as a community.\n\nAt different stages on their journey of faith the people of Israel were called to repent, to a time of reflection of where they were as a people before God. The prophet Micah made such a call to the people of his day:\n\n> \"With what shall I come before the LORD,\nand bow myself before God on high?\nShall I come before him with burnt offerings,\nwith calves a year old?\nWill the LORD be pleased with thousands of rams,\nwith ten thousands of rivers of oil?\nShall I give my firstborn for my transgression,\nthe fruit of my body for the sin of my soul?\"\nHe has told you, O mortal, what is good;\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God?\nMicah 6:6-8\n\nThis is a journey not just of an individual but as a community. It is a journey with God and towards God but also with one another in which we encourage one another, in which we support and encourage one another.\n\nIt is appropriate that the 31st Dail has met for the first time on the first day of Lent. Now that the election is over and all the rhetoric that goes with that, it is time for us as a community and as a nation to reflect on where we are, what are our aspirations as a people? To what, to whom do we look as reach for those aspirations? Are we to be driven by political dogma, sectional interest – or are we prepared to allow our spiritual heritage to inform. Over the course of our reflections in Lent we will be reflecting on this with particular reference to that challenge of Micah:\n\n> He has told you, O mortal, what is good;\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God?",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/2011 - just people/Ash Wednesday 2011.txt",
        "raw_ocr_content": "Page 1 of 2\nAsh Wednesday 2011\nOne of the recurring themes of the Old Testament is that of journey;\nAbram called to leave his homeland in Ur and travel to Canaan.\nMoses called to journey with God’s people from slavery in Egypt to the Land\nof Promise.\nJesus told stories of journeys – the young man who demanded his inheritance\nof his father and travelled off – who later journeyed back in penitence to\nexperience the extravagant love of his father\nJourneys into exile and slavery\nJourneys to the Land of Promise, to the place of renewal and forgiveness.\nOur 3rd Eucharistic prayer reminds us that “when we turned away you did not\nreject us. You came to meet us in your son, welcomed us as your children and\nprepared a table where we might feat with you\nIn our own day description of the Church as a pilgrim people\nWe make our journey not just as individuals but as a community.\nAt different stages on their journey of faith the people of Israel were called to\nrepent, to a time of reflection of where they were as a people before God.\nThe prophet Micah made such a call to the people of his day:\n\"With what shall I come before the LORD,\nand bow myself before God on high?\nShall I come before him with burnt offerings,\nwith calves a year old?\nWill the LORD be pleased with thousands of rams,\nPage 2 of 2\nAsh Wednesday 2011\nwith ten thousands of rivers of oil?\nShall I give my firstborn for my transgression,\nthe fruit of my body for the sin of my soul?\"\nHe has told you, O mortal, what is good;\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God?\nMicah 6:6-8\nThis is a journey not just of an individual but as a community. It is a journey\nwith God and towards God but also with one another in which we encourage\none another, in which we support and encourage one another.\nIt is appropriate that the 31st Dail has met for the first time on the first day of\nLent. Now that the election is over and all the rhetoric that goes with that, it is\ntime for us as a community and as a nation to reflect on where we are, what are\nour aspirations as a people? To what, to whom do we look as reach for those\naspirations? Are we to be driven by political dogma, sectional interest – or are\nwe prepared to allow our spiritual heritage to inform. Over the course of our\nreflections in Lent we will be reflecting on this with particular reference to that\nchallenge of Micah:\nHe has told you, O mortal, what is good;\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God?"
    }
}