{
    "title": "Ash Wednesday 2013",
    "date": "2013-02-13",
    "blurb": "In this sermon, Kevin reflects on the significance of Ash Wednesday and the journey of Lent. He explores the challenges and temptations that Jesus faced in the desert and relates them to the struggles we face in our own lives. He encourages us to follow Jesus' example of humility, service, and love.",
    "raw_text": "Jesus, you said to your disciples, 'Come follow me.' Lord Jesus, sometimes where you lead is hard to follow. If you are not there, how can we go? But you have promised to be with us, to the very end of time, to go ahead to prepare the way, to come back so that where you are, we may be also.\n\nLord Jesus, we follow and you lead us into the desert. The desert, where you went to pray; the place where Jacob wrestled with God; the place where Moses met with God at the burning bush; the place where Elijah heard the still small voice. The desert – a place of encounter, of meeting, of encouragement. But when I am alone, this is a silent place, a place of alone-ness, a place of hunger, of thirst, of uncertain noises. The desert – a place of temptation, of spiritual trial, of vulnerability.\n\n'For we do not have a high priest who is unable to sympathize with our weaknesses, but we have one who in every respect has been tested as we are, yet without sin.' Hebrews 4:15\n\nLord Jesus, you are with us n our place of hunger, of weakness, of body mind and soul, a place of temptation, temptation to take the easy, the painless, the comfortable way.\n\nYou never said it would be easy – but Lord does it have to be so hard, so lonely? 'Come to me, all you that are weary and are carrying heavy burdens, and I will give you rest. Take my yoke upon you, and learn from me; for I am gentle and humble in heart, and you will find rest for your souls. For my yoke is easy, and my burden is light.' Matt 11:28-30\n\n'But I am with you always, to the very end of time.' Matt 28:20\n\nLord, in my weakness, give me strength in my wavering, give me resolve in my failure, give me your healing, restoring, forgiving love.\n\nLord you are with us on the pinnacle of the Temple. There you were offered the chance of cheap popularity. This is the place where we can set our agenda, our priorities, this is the place where we can impress. Here in your presence, I learn it is not about me – it is about you, trusting you, obeying you, following you.\n\nLord you are with us on the mountain top, surveying the world in all its glitz and glamour. Here I have the opportunity to be important, popular, powerful. This is the place of status, of pleasure, of easy values. For a moment we think we can have all of this – and you. Worship the Lord your God and serve only him.\n\nLord teach us the way of simplicity, of humility, of service, of you.\n\nLord Jesus, you move on from your desert place and you call us to follow. To follow to the point where you touched the leper, healed the sick, fed the hungry, allowed the woman to wash your feet with her tears of regret, sat at table with those despised by the world.\n\nMay we serve as you would have us serve that we may hear your words of welcome: 'Come, you that are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world; for I was hungry and you gave me food, I was thirsty and you gave me something to drink, I was a stranger and you welcomed me, I was naked and you gave me clothing, I was sick and you took care of me, I was in prison and you visited me.' Matt 25:34ff",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/ashwednesday2013.txt",
        "raw_ocr_content": "Page 1 of 3\nAsh Wednesday 2013-02-13\nJesus, you said to your disciples, ‘Come follow me.’\nLord Jesus, sometimes where you lead is hard to follow. If you are not there,\nhow can we go?\nBut you have promised to be with us, to the very end of time,\nto go ahead to prepare the way,\nto come back so that where you are, we may be also.\nLord Jesus, we follow and you lead us into the desert.\nThe desert, where you went to pray;\nthe place where Jacob wrestled with God;\nthe place where Moses met with God at the burning bush;\nthe place where Elijah heard the still small voice.\nThe desert – a place of encounter, of meeting, of encouragement.\nBut when I am alone, this is a silent place, a place of alone-ness, a place of\nhunger, of thirst, of uncertain noises.\nThe desert – a place of temptation, of spiritual trial, of vulnerability.\n15 For we do not have a high priest who is unable to sympathize with our\nweaknesses, but we have one who in every respect has been tested as we are,\nyet without sin. Hebrews 4:15\nLord Jesus, you are with us n our place of hunger, of weakness, of body mind\nand soul, a place of temptation, temptation to take the easy, the painless, the\ncomfortable way.\nPage 2 of 3\nAsh Wednesday 2013-02-13\nYou never said it would be easy – but Lord does it have to be so hard, so\nlonely?\nMt 11:28 \"Come to me, all you that are weary and are carrying heavy burdens, and\nI will give you rest. 29 Take my yoke upon you, and learn from me; for I am\ngentle and humble in heart, and you will find rest for your souls. 30 For my\nyoke is easy, and my burden is light.\" Matt 11:28-30\n‘But I am with you always, to the very end of time.’ Matt 28:20\nLord, in my weakness, give me strength\nin my wavering, give me resolve\nin my failure, give me your healing, restoring, forgiving love.\nLord you are with us on the pinnacle of the Temple. There you were offered\nthe chance of cheap popularity.\nThis is the place where we can set our agenda, our priorities, this is the place\nwhere we can impress.\nHere in your presence, I learn it is not about me – it is about you, trusting you,\nobeying you, following you.\nLord you are with us on the mountain top, surveying the world in all its glitz\nand glamour. Here I have the opportunity to be important, popular, powerful.\nThis is the place of status, of pleasure, of easy values.\nFor a moment we think we can have all of this – and you.\nWorship the Lord your God and serve only him.\nLord teach us the way of simplicity, of humility, of service, of you.\nLord Jesus, you move on from your desert place and you call us to follow. To\nfollow to the point where you touched the leper, healed the sick, fed the\nPage 3 of 3\nAsh Wednesday 2013-02-13\nhungry, allowed the woman to wash your feet with her tears of regret, sat at\ntable with those despised by the world.\nMay we serve as you would have us serve that we may hear your words of\nwelcome:\n'Come, you that are blessed by my Father, inherit the kingdom prepared\nfor you from the foundation of the world; 35 for I was hungry and you\ngave me food, I was thirsty and you gave me something to drink, I was a\nstranger and you welcomed me, 36 I was naked and you gave me\nclothing, I was sick and you took care of me, I was in prison and you\nvisited me.' Matt 25:34ff"
    }
}