{
    "title": "Funeral of Barry Vaughan",
    "date": "2010-07-15",
    "blurb": "This sermon is a tribute to Barry Vaughan, a man of intelligence, humor, and capability. It reflects on his life journey, his love for flying, and his family. The sermon also discusses the concepts of mortality and eternal life, offering hope and comfort in the face of loss.",
    "raw_text": "Last Saturday Barry Vaughan died in Beaumount Hospital. While the end came quite quickly, it was for Barry the end of a long period of struggle and decline that must have been hard for him and certainly hard for those who loved him to watch. On this the day of his funeral we meet to honour the memory of an intelligent, reserved, humorous, capable gentleman and to commend him to the love and care of Almighty God.\n\nBarry in the course of his life lived in five different countries. He was born at Lake Maracaibo in Venezuela where his father was working in the oil business. Schooling, as was the case with all children of expatriate communities, involved a variety of locations and separation from parents fro an extended period of time from quite a young age. He spent a year in Montego Bay in Jamaica before moving on to British Columbia via New York. For his secondary education he was sent to Loughborough (near Derby, in the English East Midlands). During his time there he excelled in cross country running and other athletic events as well as rugby. But towards the end of his time in Loughborough he learned to glide and so began a lifelong association love of flying. When he left school he went to work for Shell in London but this was not his thing. He left to join the RAF in which he served for 8 years. During this time he flew Hawker Hunters and was involved in the Black Arrows, the forerunners of the Red Arrow Display team. He left the RAF to join Aer Lingus and moved to Dublin. Here he met his wife Mary and here they reared their daughter Jane. Mary died relatively young in 1992.\n\nAs I say a reserved man with a remarkable life story, intelligent with a wide range of interests. Jane, while going through papers came across some thoughts that Barry had obviously made concerning today; our reading from Philippians, the hymn ‘The day thou gavest Lord is ended’ along with a couple of poems, one of which I am going to read in the final prayers of this service.\n\nThat passage from Philippians concludes with those lovely words:\n\n> Finally, beloved, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is pleasing, whatever is commendable, if there is any excellence and if there is anything worthy of praise, think about these things.\n\nI just want to set that passage alongside the other passage that we read today, from the second letter of Paul to the Corinthians. Our recent experience of Barry has been of decline, of incapacity. That is not the Barry Vaughan we give thanks for today. Today we are not just looking to the past, we look forward in hope as we entrust Barry into the loving care of Almighty God. In this portion Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home. The words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Barry Vaughan, that all the limitations of these latter years, the frailty, along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ.\n\nSo today we gather to thank God for Barry Vaughan, for the many different ways he touched our lives. We come to pray for his family, his daughter Jane, his sister Linda and close friend Patricia. We gather to set his life and our lives in the context of our faith in a loving and living God as we commend Barry, father, pilot, good friend, remarkable human being into the hands of a loving heavenly Father.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Barry Vaughan.txt",
        "raw_ocr_content": "Page 1 of 5\nFuneral of Barry Vaughan – St Mary’s – July 15th 2010\nLast Saturday Barry Vaughan died in Beaumount Hospital. While the end came quite\nquickly, it was for Barry the end of a long period of struggle and decline that must have\nbeen hard for him and certainly hard for those who loved him to watch. On this the day of\nhis funeral we meet to honour the memory of an intelligent, reserved, humorous, capable\ngentleman and to commend him to the love and care of Almighty God.\nBarry in the course of his life lived in five different countries. He was born at Lake\nMaracaibo in Venezuela where his father was working in the oil business. Schooling, as\nwas the case with all children of expatriate communities, involved a variety of locations\nand separation from parents fro an extended period of time from quite a young age. He\nspent a year in Montego Bay in Jamaica before moving on to British Columbia via New\nYork. For his secondary education he was sent to Loughborough (near Derby, in the\nEnglish East Midlands). During his time there he excelled in cross country running and\nother athletic events as well as rugby. But towards the end of his time in Loughborough\nhe learned to glide and so began a lifelong association love of flying. When he left school\nhe went to work for Shell in London but this was not his thing. He left to join the RAF in\nwhich he served for 8 years. During this time he flew Hawker Hunters and was involved\nin the Black Arrows, the forerunners of the Red Arrow Display team. He left the RAF to\njoin Aer Lingus and moved to Dublin. Here he met his wife Mary and here they reared\ntheir daughter Jane. Mary died relatively young in 1992.\nAs I say a reserved man with a remarkable life story, intelligent with a wide range of\ninterests.\nJane, while going through papers came across some thoughts that Barry had obviously\nmade concerning today; our reading from Philippians, the hymn ‘The day thou gavest\nLord is ended’ along with a couple of poems, one of which I am going to read in the final\nprayers of this service.\nPage 2 of 5\nFuneral of Barry Vaughan – St Mary’s – July 15th 2010\nThat passage from Philippians concludes with those lovely words:\nFinally, beloved, whatever is true, whatever is honorable, whatever is just,\nwhatever is pure, whatever is pleasing, whatever is commendable, if there is any\nexcellence and if there is anything worthy of praise, think about these things.\nspeak to me of a philosophy of life that took Barry through the many and varied stages of\nhis life.\nI just want to set that passage alongside the other passage that we read today, from the\nsecond letter of Paul to the Corinthians. Our recent experience of Barry has been of\ndecline, of incapacity. That is not the Barry Vaughan we give thanks for today. Today we\nare not just looking to the past, we look forward in hope as we entrust Barry into the\nloving care of Almighty God. In this portion Paul presents us with the reality of our own\nmortality and death, he talks very plainly of the body wearing out. But just as he talks of\nthe reality of physical decline and death, Paul talks of our new heavenly home. The\nwords that really stand out for me are ; \"So that what is mortal may be swallowed up by\nlife.\" This is our hope for Barry Vaughan, that all the limitations of these latter years, the\nfrailty, along with all the limitations that go with being human are \"swallowed up by life\",\nthat is our inheritance in Christ.\nSo today we gather to thank God for Barry Vaughan, for the many different\nways he touched our lives. We come to pray for his family, his daughter Jane,\nhis sister Linda and close friend Patricia.\nWe gather to set his life and our lives in the context of our faith in a loving and\nliving God as we commend Barry, father, pilot, good friend, remarkable human\nbeing into the hands of a loving heavenly Father.\nI will close with a prayer that brings home to me the hope that we have in Christ for\nourselves and for those who have gone before us in the faith.\nPage 3 of 5\nFuneral of Barry Vaughan – St Mary’s – July 15th 2010\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be\nfor evermore.\nPage 4 of 5\nFuneral of Barry Vaughan – St Mary’s – July 15th 2010\nPhilippians 4:6-8\n6 Do not worry about anything, but in everything by prayer and supplication with\nthanksgiving let your requests be made known to God. 7 And the peace of God, which\nsurpasses all understanding, will guard your hearts and your minds in Christ Jesus.\nPhil 4:8 Finally, beloved, whatever is true, whatever is honorable, whatever is just,\nwhatever is pure, whatever is pleasing, whatever is commendable, if there is any\nexcellence and if there is anything worthy of praise, think about these things.\n2 Corinthians 4.16 – 5.9\n2Co 4:16 So we do not lose heart. Even though our outer nature is wasting away, our inner\nnature is being renewed day by day. 17 For this slight momentary affliction is preparing us\nfor an eternal weight of glory beyond all measure, 18 because we look not at what can be\nseen but at what cannot be seen; for what can be seen is temporary, but what cannot be\nseen is eternal.\n2Co 5:1 For we know that if the earthly tent we live in is destroyed, we have a building\nfrom God, a house not made with hands, eternal in the heavens. 2 For in this tent we\ngroan, longing to be clothed with our heavenly dwelling -- 3 if indeed, when we have taken\nit off we will not be found naked. 4 For while we are still in this tent, we groan under our\nburden, because we wish not to be unclothed but to be further clothed, so that what is\nmortal may be swallowed up by life. 5 He who has prepared us for this very thing is God,\nwho has given us the Spirit as a guarantee.\n2Co 5:6 So we are always confident; even though we know that while we are at home in the\nbody we are away from the Lord -- 7 for we walk by faith, not by sight. 8 Yes, we do have\nconfidence, and we would rather be away from the body and at home with the Lord. 9 So\nwhether we are at home or away, we make it our aim to please him.\nPage 5 of 5\nFuneral of Barry Vaughan – St Mary’s – July 15th 2010\nHymn 649 (Hymns Ancient & Modern)\n1 Sunset and evening star\nand one clear call for me!\nAnd may there be no moaning of the bar\nwhen I put out to sea,\nbut such a tide as moving seems asleep,\nwhen that which drew from out the boundless deep\nturns again home.\n2 Twilight and evening bell\nand after that the dark!\nAnd may there be no sadness of farewell\nwhen I embark:\nfor though from out our bourne of time and place\nthe flood may bear me far,\nI hope to see my pilot face to face\nwhen I have crost the bar."
    }
}