{
    "title": "Remembering Bill Webb",
    "date": "2014-01-09",
    "blurb": "This sermon is a heartfelt tribute to Bill Webb, a beloved member of the parish who passed away. Kevin speaks of Bill's wisdom, insight, affection for the Parish, loyalty to former clergy, and his welcoming nature. He also highlights Bill's deep faith, his devotion to his family, and his contributions to the Church.",
    "raw_text": "Funeral of Bill Webb – 9th January 2014\n\nNot long after my arrival in Howth, I called at the house of Billy and Jackie Webb. I received that warm and generous welcome that is the hall mark of that house. Bill had spoken of his early years, growing up in Glasnevin, the son of a school teacher, his lifelong friendship with Cecil. Stan, Derek, Aubrey, his time in Trinity and beginning with Craig Gardiners, before going out on his own, his career in accountancy and he went on to speak of this Parish of Howth. He spoke with great pride and affection of Jackie and the family. Then, just as he was about to open the front door, he said, ‘Kevin, there is just one thing I want to say to you. For your first year or two here, your biggest sin will be that you are not Cecil Hyland. But don’t worry, Cecil’s biggest sin when he first came was that he wasn’t Frank Blennerhassett. The Parish will take to you.’ There was so much of Bill Webb in that – wisdom, insight, affection for the Parish, loyalty to former clergy and a life long friend, welcome and encouragement to me; all given with that gentle smile we will always associate with him.\n\nOn this the day of his funeral, we gather to thank God for this man. His lifelong friend Stan McMullen and members of his family have already spoken with great affection of his many gifts, ways in which he touched an enriched their lives. Many of you come here today with particular memories of your own. There was a generosity of spirit to Bill. Many have spoken to me of simple acts of kindness, given without any fuss or condescension. Many have spoken of his loyalty, his humour, his modesty, his consideration for others. I know many who feel a great sense of personal loss at his death.\n\nHe took a great interest in the wider world. Each day, the ‘Irish Times’ would be read front to back. This would give rise to some very interesting and engaging conversations. An accountant to his fingertips, he would have some very interesting observations on the unfolding drama of the demise of the Celtic Tiger.\n\nIn the course of my time here I have come to know and respect him as a man of deep and sincere faith. Attendance at worship was priority. Until very recently, very few were the Sundays when Bill was not here. He gave freely of his time and talents in the service of this Parish. He was for many years a member of Select Vestry, including a spell as Treasurer and latterly as auditor of our accounts. He was a great encourager of others. He would no doubt have had his own preferences in hymns and worship patterns but was most insistent that the youngsters be drawn into the life and worship of the Church. Two of the hymns he chose for this service would reflect that. The parish, the whole parish has lost a loyal friend and servant. Bill was very much a son, a man of the Church of Ireland. He took great pride in the contribution our Church has made to wider society – but there was nothing of the sectarian in Bill. He would have had a genuine concern and respect for all Christian Churches in this country.\n\nAt the heart of Bill’s life was his family, his beloved Jackie, their children Carolyn, Suzanne, Andrea and Rowan. A devoted husband and father they were all his pride and joy and he delighted in the arrival of his grandchildren. It has been my privilege to witness the very obvious deep bonds of affection as Bill faced the final stages of his illness. Jackie and Bill have been a great team. Jackie has often spoken of Bill’s unstinting devotion as she has faced her own illness, the help he gave as she cared for their two fathers in their own home. She often said with a smile, ‘A lesser man would have run’. Jackie for her part certainly returned the favour as she supported Bill through his final illness. It was fitting, when the end came in the early hours of Sunday morning, that Bill was surrounded by his wife and family as they entrusted him to his heavenly Father.\n\nThere is now a huge gap in their lives as Jackie and the family begin to build a life together without the closer presence of Bill. But of course the love that bound Billy and his family together lives on as they remember with tears and laughter one who meant and continues to mean so much. Those of us outside the family circle come today to offer our love and support, to assure you of our love and our prayers in the days that lie ahead.\n\nWe come to set the mystery of death in the context of our Christian faith. We have just celebrated Christmas, the feast of the Incarnation, Emmanuel, God among us in the person of Jesus Christ. In the course of our Christmas services we heard those lovely words from St John’s Gospel:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nDarkness has not had the last word in the life of Bill Webb. Sickness, weakness has not had the final say. A light has gone out in our lives. But the light shines on, the light of Christ, risen, ascended, glorified. Our hope and prayer this day is life and peace for Bill in the closer presence of the God he served and worshipped, free from pain, from weakness.\n\nWell done, thou good and faithful servant. Receive the kingdom prepared for you from the beginning of the world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Bill Webb.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Bill Webb – 9th January 2014\nNot long after my arrival in Howth, I called at the house of Billy and\nJackie Webb. I received that warm and generous welcome that is the\nhall mark of that house. Bill had spoken of his early years, growing\nup in Glasnevin, the son of a school teacher, his lifelong friendship\nwith Cecil. Stan, Derek, Aubrey, his time in Trinity and beginning\nwith Craig Gardiners, before going out on his own, his career in\naccountancy and he went on to speak of this Parish of Howth. He\nspoke with great pride and affection of Jackie and the family. Then,\njust as he was about to open the front door, he said, ‘Kevin, there is\njust one thing I want to say to you. For your first year or two here,\nyour biggest sin will be that you are not Cecil Hyland. But don’t\nworry, Cecil’s biggest sin when he first came was that he wasn’t\nFrank Blennerhassett. The Parish will take to you.’ There was so\nmuch of Bill Webb in that – wisdom, insight, affection for the Parish,\nloyalty to former clergy and a life long friend, welcome and\nencouragement to me; all given with that gentle smile we will always\nassociate with him.\nOn this the day of his funeral, we gather to thank God for this man.\nHis lifelong friend Stan McMullen and members of his family have\nalready spoken with great affection of his many gifts, ways in which\nhe touched an enriched their lives. Many of you come here today with\nparticular memories of your own. There was a generosity of spirit to\nPage 2 of 4\nFuneral of Bill Webb – 9th January 2014\nBill. Many have spoken to me of simple acts of kindness, given\nwithout any fuss or condescension. Many have spoken of his loyalty,\nhis humour, his modesty, his consideration for others. I know many\nwho feel a great sense of personal loss at his death.\nHe took a great interest in the wider world. Each day, the ‘Irish\nTimes’ would be read front to back. This would give rise to some\nvery interesting and engaging conversations. An accountant to his\nfingertips, he would have some very interesting observations on the\nunfolding drama of the demise of the Celtic Tiger.\nIn the course of my time here I have come to know and respect him as\na man of deep and sincere faith. Attendance at worship was priority.\nUntil very recently, very few were the Sundays when Bill was not\nhere. He gave freely of his time and talents in the service of this\nParish. He was for many years a member of Select Vestry, including\na spell as Treasurer and latterly as auditor of our accounts. He was a\ngreat encourager of others. He would no doubt have had his own\npreferences in hymns and worship patterns but was most insistent that\nthe youngsters be drawn into the life and worship of the Church. Two\nof the hymns he chose for this service would reflect that. The parish,\nthe whole parish has lost a loyal friend and servant. Bill was very\nmuch a son, a man of the Church of Ireland. He took great pride in\nPage 3 of 4\nFuneral of Bill Webb – 9th January 2014\nthe contribution our Church has made to wider society – but there was\nnothing of the sectarian in Bill. He would have had a genuine concern\nand respect for all Christian Churches in this country.\nAt the heart of Bill’s life was his family, his beloved Jackie, their\nchildren Carolyn, Suzanne, Andrea and Rowan. A devoted husband\nand father they were all his pride and joy and he delighted in the\narrival of his grandchildren. It has been my privilege to witness the\nvery obvious deep bonds of affection as Bill faced the final stages of\nhis illness. Jackie and Bill have been a great team. Jackie has often\nspoken of Bill’s unstinting devotion as she has faced her own illness,\nthe help he gave as she cared for their two fathers in their own home.\nShe often said with a smile, ‘A lesser man would have run’. Jackie for\nher part certainly returned the favour as she supported Bill through his\nfinal illness. It was fitting, when the end came in the early hours of\nSunday morning, that Bill was surrounded by his wife and family as\nthey entrusted him to his heavenly Father.\nThere is now a huge gap in their lives as Jackie and the family begin\nto build a life together without the closer presence of Bill. But of\ncourse the love that bound Billy and his family together lives on as\nthey remember with tears and laughter one who meant and continues\nto mean so much. Those of us outside the family circle come today to\nPage 4 of 4\nFuneral of Bill Webb – 9th January 2014\noffer our love and support, to assure you of our love and our prayers\nin the days that lie ahead.\nWe come to set the mystery of death in the context of our Christian\nfaith. We have just celebrated Christmas, the feast of the Incarnation,\nEmmanuel, God among us in the person of Jesus Christ. In the course\nof our Christmas services we heard those lovely words from St John’s\nGospel:-\n4What has come into being in him was life, and the life was\nthe light of all people. 5The light shines in the darkness, and\nthe darkness did not overcome it.\n12But to all who received him, who believed in his name, he\ngave power to become children of God, 13who were born, not\nof blood or of the will of the flesh or of the will of man, but of\nGod.\nDarkness has not had the last word in the life of Bill Webb. Sickness,\nweakness has not had the final say. A light has gone out in our lives.\nBut the light shines on, the light of Christ, risen, ascended, glorified.\nOur hope and prayer this day is life and peace for Bill in the closer\npresence of the God he served and worshipped, free from pain, from\nweakness.\nWell done, thou good and faithful servant. Receive the kingdom\nprepared for you from the beginning of the world."
    }
}