{
    "title": "Farewell to Bud Bryce",
    "date": "2015-02-06",
    "blurb": "This sermon is a tribute to Bud Bryce, a man of principle, a loving family man, and a passionate pilot and sailor. Despite his declining health, Bud lived life to the fullest, always grateful for the blessings life had brought him. The sermon also reflects on the Christian understanding of death and the hope of eternal life.",
    "raw_text": "We have come here today to remember with thanksgiving Bud Bryce, husband, father, grandfather, firm friend and of course pilot. Bud was born in Canada and served in the Royal Canadian Air Force. Following on that he moved into civil aviation in Canada. Then, at a time when Aer Lingus were expanding into the transatlantic routes, along with a number of compatriots, he came to Dublin.\n\nHe told me not so long ago that a move back to Canada was postponed by a meeting with Gowan Jeffares and the rest, as he said with that wry smile, was history. Here they established their home and family, rearing their three boys David, Andrew and Richard.\n\nBud would not have described himself as a religious man yet whenever I spoke to him I was aware of a deeply principled man, a man with a deep sense of thankfulness for life, for the blessings that life had brought him. Over the last number of years his health has declined but Bud, being Bud, was determined that he would live life to the full and in this he enjoyed the love and support of his wife Gowan and the rest of the family. he was extremely grateful for the team in Beaumont and the people who donated blood for what became increasingly regular blood transfusions. Only latterly did the much loved annual trip back to California have to be stopped but he still maintained his friendship and meetings with friends.\n\nIn more recent times he would have spoken of his mortality. Observing with that shrew smile and Canadian accent that never went away, 'Kevin, I guess I’m in the departure lounge.' Realistic but not morbid; for as he said that there was a sense of peace and contentment as he looked back over his life. His marriage to Gowan; he and Gowan were very much a team. Gowan had provided that home base in which the boys grew up and gave wonderful love and support to Bud in the course of his illness. The family were very important to him and he took great pride in all three of his sons and the grandchildren.\n\nHe clearly loved flying and the opportunities it gave him from his time in the air force, the transatlantic flights, his time down in Toulon with BAC as Aer Lingus prepared to develop its Airbus fleet. There was his time in Africa, telling again with a wry smile how he managed to gain the trust of one particular African ruler. And of course he featured in that Aer Lingus ad – the music of which will be played at the end of this service.\n\nLiving in Howth enabled Bud to develop another passion, that of sailing. A skilled and experienced sailor, he enjoyed both the local club competitions and the longer haul trips, including participating in the Fastnet race. He gave generously of his time and skills in his support of the RNLI and also helping fellow mariners in the repair and servicing of their boats.\n\nI recall a warm, engaging, deeply principled man of generous spirit, who evoked respect in all who worked with him and the love and affection of family and friends.\n\nBut of course in the midst of our thankfulness there is the deep sense of loss experienced by Gowan, by their sons David, Andrew and Richard and their families.\n\nThere is now a huge gap in their lives as Gowan begin to build a life together without the closer presence of Bud. But of course the love that bound Bud and his family together lives on as they remember with tears and laughter one who meant and continues to mean so much. Those of us outside the family circle come today to offer our love and support, to assure you of our love and our prayers in the days that lie ahead.\n\nWe come to set the mystery of death in the context of our Christian faith. We have recently celebrated Christmas, the feast of the Incarnation, Emmanuel, God among us in the person of Jesus Christ. In the course of our Christmas services we heard those lovely words from St John’s Gospel:-\n\n'What has come into being in him was life, and the life was the light of all people. The light shines in the darkness, and the darkness did not overcome it.\n\nBut to all who received him, who believed in his name, he gave power to become children of God, who were born, not of blood or of the will of the flesh or of the will of man, but of God.'\n\nDarkness has not had the last word in the life of Bud Bryce. Sickness, weakness has not had the final say. A light has gone out in our lives. But the light shines on, the light of Christ, risen, ascended, glorified.\n\nOur hope and prayer this day is life and peace for Bud in the closer presence of God, free from pain, from weakness.\n\nI referred earlier to Bud’s passion for sailing. The following is a poem that sets our hope for Bud and for ourselves in the sailing tradition of this lovely place:\n\nA Parable of Immortality.\n\nI am standing by the seashore. A ship at my side spreads her white sails to the morning breeze and starts for the blue ocean. She is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other. Then someone at my side says, 'There she goes! ‘Gone where? Gone from my sight - that is all. She is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination. Her diminished size is in me, not in her. And just at the moment when someone at my side says, 'There she goes!’ there are other eyes watching her coming, and other voices ready to take up the glad shout : 'Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Bud Bryce.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Bud Bryce – Howth – 6th February 2015\nWe have come here today to remember with thanksgiving Bud Bryce,\nhusband, father, grandfather, firm friend and of course pilot. Bud was\nborn in Canada and served in the Royal Canadian Air Force.\nFollowing on that he moved into civil aviation in Canada. Then, at a\ntime when Aer Lingus were expanding into the transatlantic routes,\nalong with a number of compatriots, he came to Dublin.\nHe told me not so long ago that a move back to Canada was postponed\nby a meeting with Gowan Jeffares and the rest, as he said with that\nwry smile, was history. Here they established their home and family,\nrearing their three boys David, Andrew and Richard.\nBud would not have described himself as a religious man yet\nwhenever I spoke to him I was aware of a deeply principled man, a\nman with a deep sense of thankfulness for life, for the blessings that\nlife had brought him. Over the last number of years his health has\ndeclined but Bud, being Bud, was determined that he would live life to\nthe full and in this he enjoyed the love and support of his wife Gowan\nand the rest of the family. he was extremely grateful for the team in\nBeaumont and the people who donated blood for what became\nincreasingly regular blood transfusions. Only latterly did the much\nloved annual trip back to California have to be stopped but he still\nmaintained his friendship and meetings with friends.\nIn more recent times he would have spoken of his mortality.\nObserving with that shrew smile and Canadian accent that never went\naway, ‘Kevin, I guess I’m in the departure lounge.’ Realistic but not\nPage 2 of 4\nFuneral of Bud Bryce – Howth – 6th February 2015\nmorbid; for as he said that there was a snese of peace and\ncontentment as he looked back over his life. His marriage to Gowan;\nhe and Gowan were very much a team. Gowan had provided that\nhome base in which the boys grew up and gave wonderful love and\nsupport to Bud in the course of his illness. The family were very\nimportant to him and he took great pride in all three of his sons and\nthe grandchildren.\nhe clearly loved flying and the opportunities it gave him from his time\nin the air force, the transatlantic flights, his time down in Toulon with\nBAC as Aer Lingus prepared to develop its Airbus fleet. There was\nhis time in Africa, telling again with a wry smile how he managed to\ngain the trust of one particular African ruler. And of course he\nfeatured in that Aer Lingus ad – the music of which will be played at\nthe end of this service.\nLiving in Howth enabled Bud to develop another passion, that of\nsailing. A skilled and experienced sailor, he enjoyed both the local\nclub competitions and the longer haul trips, including participating in\nthe Fastnet race. He gave generously of his time and skills in his\nsupport of the RNLI and also helping fellow mariners in the repair and\nservicing of their boats.\nI recall a warm, engaging, deeply principled man of generous spirit,\nwho evoked respect in all who worked with him and the love and\naffection of family and friends.\nPage 3 of 4\nFuneral of Bud Bryce – Howth – 6th February 2015\nBut of course in the midst of our thankfulness there is the deep sense\nof loss experienced by Gowan, by their sons David, Andrew and\nRichard and their families.\nThere is now a huge gap in their lives as Gowan begin to build a life\ntogether without the closer presence of Bud. But of course the love\nthat bound Bud and his family together lives on as they remember\nwith tears and laughter one who meant and continues to mean so\nmuch. Those of us outside the family circle come today to offer our\nlove and support, to assure you of our love and our prayers in the days\nthat lie ahead.\nWe come to set the mystery of death in the context of our Christian\nfaith. We have recently celebrated Christmas, the feast of the\nIncarnation, Emmanuel, God among us in the person of Jesus Christ.\nIn the course of our Christmas services we heard those lovely words\nfrom St John’s Gospel:-\n4What has come into being in him was life, and the life was\nthe light of all people. 5The light shines in the darkness, and\nthe darkness did not overcome it.\n12But to all who received him, who believed in his name, he\ngave power to become children of God, 13who were born, not\nof blood or of the will of the flesh or of the will of man, but of\nGod.\nDarkness has not had the last word in the life of Bud Bryce. Sickness,\nweakness has not had the final say. A light has gone out in our lives.\nBut the light shines on, the light of Christ, risen, ascended, glorified.\nPage 4 of 4\nFuneral of Bud Bryce – Howth – 6th February 2015\nOur hope and prayer this day is life and peace for Bud in the closer\npresence of God, free from pain, from weakness.\nI referred earlier to Bud’s passion for sailing. The following is a poem\nthat sets our hope for Bud and for ourselves in the sailing tradition of\nthis lovely place:\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}