{
    "title": "New Beginnings",
    "date": "2020-09-01",
    "blurb": "In this sermon, Kevin welcomes everyone to the new school year at Burrow School, especially the new Junior Infant Class. He acknowledges the fear and excitement that come with new experiences and assures the students that they are not alone. He uses a personal anecdote about a parachute jump to illustrate this point. Kevin also acknowledges the challenges posed by Covid-19 and emphasizes the importance of taking care of each other.",
    "raw_text": "Good morning everyone and welcome to the first School Assembly at the Burrow School of the new School year. A very special welcome to our new Junior Infant Class. I am missing not being with you in person. Normally at this Assembly you would be sitting at my feet in the front row. This is all very new for you – new School, new Teacher, new friends, new things to learn. It all may seem a bit scary at the minute but you will soon settle in, get to know your teacher, get to know your class – get to do and learn all sorts of new exciting things.\n\nWelcome to our new 6th Class. Do you remember when you were in Junior Infants, sitting in that front row, maybe a bit overwhelmed yourselves at all that was going on around you. It has been wonderful watching you develop as people to the stage where you are now the ones to whom the rest of the School looks to as an example of all that is best in the Burrow School.\n\nFor all of us, with all of the precautions we are having to take in the face of Covid 19, this is going to be a very different year. It is great to be back but we are all going to have to take a very special care of each other.\n\nNew things, new experiences can be a bit scary at times. As I was thinking of this, I thought back to one scary time. When I was in my last Parish in Ahoghill in County Antrim we were starting a fund raising project and looking for something a bit out of the ordinary to kick it off. By chance I got talking to a man who organised parachute jumps that were often done as charity fundraisers.\n\nTo cut a long story short, I found myself one afternoon sitting at the door of a plane high above the North Antrim coast strapped to someone else. At that point doing a parachute jump didn’t seem to be a very good idea. Suddenly we were out of the plane and we were falling. And a voice behind me asked, ‘Are you alright there?’ I realised I was not alone; I was strapped to someone who knew exactly what he was doing – suddenly the feeling of falling through the air was brilliant – I was almost disappointed when the parachute opened and we came into land.\n\nMiss Lynn and the staff have worked hard over the summer to ensure that the School is a safe place to come into, a safe place in which to learn, a safe place to be with your friends. You are not alone. You are being looked after by people who know what they are doing. All we ask is that each of you play your part in looking after each other.\n\nMay God bless you all at the start of this new School year. May he lift from you any anxieties, any fears may he keep you all safe. Amen",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Burrow Assembly Sept 2020.txt",
        "raw_ocr_content": "Good morning everyone and welcome to the first School Assembly at the\nBurrow School of the new School year.\nA very special welcome to our new Junior Infant Class. I am missing not being\nwith you in person. Normally at this Assembly you would be sitting at my feet\nin the front row. This is all very new for you – new School, new Teacher, new\nfriends, new things to learn. It all may seem a bit scary at the minute but you\nwill soon settle in, get to know your teacher, get to know your class – get to do\nand learn all sorts of new exciting things.\nWelcome to our new 6th Class. Do you remember when you were in Junior\nInfants, sitting in that front row, maybe a bit overwhelmed yourselves at all\nthat was going on around you. It has been wonderful watching you develop as\npeople to the stage where you are now the ones to whom the rest of the School\nlooks to as an example of all that is best in the Burrow School.\nFor all of us, with all of the precautions we are having to take in the face of\nCovid 19, this is going to be a very different year. It is great to be back but we\nare all going to have to take a very special care of each other.\nNew things, new experiences can be a bit scary at times.\nAs I was thinking of this, I thought back to one scary time. When I was in my\nlast Parish in Ahoghill in County Antrim wed were starting a fund raising\nproject and looking for something a bit out of the ordinary to kick it off. By\nchance I got talking to a man who organised parachute jumps that were often\ndone as charity fundraisers.\nTo cut a long story short, I found myself one afternoon sitting at the door of a\nplane high above the North Antrim coast strapped to someone else. At that\npoint doing a parachute jump didn’t seem to be a very good idea.\nSuddenly we were out of the plane and we were falling. And a voice behind\nme asked, ‘Are you alright there?’ I realised I was not alone; I was strapped to\nsomeone who knew exactly what he was doing – suddenly the feeling of falling\nthrough the air was brilliant – I was almost disappointed when the parachute\nopened and we came into land.\nMiss Lynn and the staff have worked hard over the summer to ensure that the\nSchool is a safe place to come into, a safe place in which to learn, a safe place\nto be with your friends.\nYou are not alone. You are being looked after by people who know what they\nare doing. All we ask is that each of you play your part in looking after each\nother.\nMay God bless you all at the start of this new School year. May he lift from\nyou any anxieties, any fears may he keep you all safe. Amen"
    }
}