{
    "title": "Community and Reconciliation",
    "date": "2021-12-26",
    "blurb": "The sermon reflects on the year 2020, marked by social distancing and isolation, and emphasizes the importance of community and reconciliation. It draws on the teachings of the Incarnation, the Sermon on the Mount, and the letters of the New Testament to highlight the interconnectedness of our relationships with God and our neighbors. The sermon concludes with a call to value each other, in all our differences, as ones made in the image of God.",
    "raw_text": "As I stand at the front of St Mary’s Church in Howth, at the foot of the chancel steps, there is now a large yellow sticker on the floor telling us 'Maintain social distance – 2m'. Stay apart, keep your distance – that is one of the ways we will all remember 2020. In so many, all the strictures of lock down, of enforced separation, of masks; restrictions placed on sports, on community events, on Church life have had a profound and lasting impact. In Church life, I’m thinking not only in terms of our Sunday services but for the ways in which we mark life’s significant moments of birth, marriage and death. These are all restricted to small congregations, leaving no room for the community support that is so important to us. All this has brought home to us how much we need each other. We are made for community. As we read in Genesis, at the very beginning of creation, as God contemplates man in the Garden, 'It is not good for man to be alone.'\n\nAt different points over the Advent and Christmas period, our Gospel readings have been drawn from the opening chapter of John, this wonderful, poetic reflection on the meaning of the Incarnation. And we have heard those words, 'And the Word became flesh and lived among us.' In the Incarnation we learn that we are not alone. As we reflected on Christmas Day; 'God is with us; God remains with us; God will stay with us.' I am not alone. You are not alone. My neighbour is not alone.\n\nThe more I think about that, Incarnation, God coming among us in the person of Jesus, is not just about my own personal relationship with God. It has profound implications for my relationship with my neighbour. In Matthew’s account of the Sermon on the Mount, as Jesus enlarges on the themes of the Beatitudes, he declares:\n\n'Therefore, if you are offering your gift at the altar and there remember that your brother or sister has something against you, leave your gift there in front of the altar. First go and be reconciled to them; then come and offer your gift. Matt 5:23,24'\n\nI have a relationship with my neighbour that cannot be lived out in isolation from my relationship with God. As we pray each time we say the Lord’s Prayer: 'Forgive us our trespasses as we forgive those who trespass against us.' Reconciliation with God and reconciliation of man with man. This is a theme developed in the letters of the New Testament. In the letter to the Ephesians, the writer addresses an issue that was crucial to the early Church as the Church moved out from Jerusalem and into the Gentile world, the relationship between Jewish and Gentile Christians. In a reference to the wall in the Temple precincts that would have separated off the Court of the Gentiles, we read:\n\n'But now in Christ Jesus you who once were far away have been brought near by the blood of Christ. For he himself is our peace, who has made the two groups one and has destroyed the barrier, the dividing wall of hostility, …… His purpose was to create in himself one new humanity out of the two, thus making peace Eph 2:13ff'\n\nAnd in writing to the Galatians, Paul develops this further to included other, seemingly unsurmountable, barriers in contemporary society.\n\n'There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus. Gal 3:28'\n\nI began by referring to the stickers on the floor of our Church telling us to keep our distance, to stay apart. Social distancing, staying apart has been one of the marks of the year that has now passed. I observed that all this has brought home to us the value of community – we do need each other. 'It is not good for man to be alone.'\n\nBut community is not something that we can take for granted. It is all too easy for communities to fracture along lines of politics, culture, race, class, religious conviction. It has been our experience in recent years to see those divisions exacerbated rather than bridged by social media; we have seen the new phenomenon of cyber bullying. In the sphere of politics we have seen twitter feeds and posts on Facebook spreading half truths and innuendo. The other, the different is portrayed as a threat and fears are stoked – often to the benefit of those who seek power for themselves rather than the good of all.\n\nAs I keep on saying, this pandemic has brought home to us the importance of community. May this New Year of 2021 be a year on which we build on that truth as individuals, as a community, as a society. May we value each other, in all our differences, as ones made in the image of God.\n\nAnd the Word became flesh and lived among us: living, dying, rising; to reconcile man to God and man to man. May the redeeming, reconciling Christ continue to be living and active in the world of today, in the Church, in the life and witness of you and me.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Christmas/year B/christmas22021.txt",
        "raw_ocr_content": "Page 1 of 4\nCHRISTMAS 2 – Year B – 2020\nAs I stand at the front of St Mary’s Church in Howth, at the foot of the chancel\nsteps, there is now a large yellow sticker on the floor telling us\n“Maintain social distance – 2m’\nStay apart, keep your distance – that is one of the ways we will all remember\n2020.\nIn so many, all the strictures of lock down, of enforced separation, of masks;\nrestrictions placed on sports, on community events, on Church life have had a\nprofound and lasting impact, In Church life, I’m thinking not only in terms of\nour Sunday services but for the ways in which we mark life’s significant\nmoments of birth, marriage and death. These are all restricted to small\ncongregations, leaving no room for the community support that is so important\nto us. All this has brought home to us how much we need each other. We are\nmade for community. As we read in Genesis, at the very beginning of creation,\nas God contemplates man in the Garden, ‘It is not good for man to be alone.’\nAt different points over the Advent and Christmas period, our Gospel readings\nhave been drawn from the opening chapter of John, this wonderful, poetic\nreflection on the meaning of the Incarnation. And we have heard those words,\n‘And the Word became flesh and lived among us.’\nIn the Incarnation we learn that we are not alone. As we reflected on\nChristmas Day; ‘God is with us; God remains with us; God will stay with us.’\nI am not alone. You are not alone. My neighbour is not alone.\nPage 2 of 4\nCHRISTMAS 2 – Year B – 2020\nThe more I think about that, Incarnation, God coming among us in the person\nof Jesus, is not just about my own personal relationship with God. It has\nprofound implications for my relationship with my neighbour. In Matthew’s\naccount of the Sermon on the Mount, as Jesus enlarges on the themes of the\nBeatitudes, he declares:\n“Therefore, if you are offering your gift at the altar and there\nremember that your brother or sister has something against you, leave\nyour gift there in front of the altar. First go and be reconciled to them;\nthen come and offer your gift. Matt 5:23,24\nI have a relationship with my neighbour that cannot be lived out in isolation\nfrom my relationship with God. As we pray each time we say the Lord’s\nPrayer:\nForgive us our trespasses as we forgive those who trespass against us.\nReconciliation with God and reconciliation of man with man. This is a theme\ndeveloped in the letters of the New Testament. In the letter to the Ephesians,\nthe writer addresses an issue that was crucial to the early Church as the Church\nmoved out from Jerusalem and into the Gentile world, the relationship between\nJewish and Gentile Christians. In a reference to the wall in the Temple\nprecincts that would have separated off the Court of the Gentiles, we read:\nBut now in Christ Jesus you who once were far away have been\nbrought near by the blood of Christ.\nFor he himself is our peace, who has made the two groups one and has\ndestroyed the barrier, the dividing wall of hostility, ………. His\npurpose was to create in himself one new humanity out of the two,\nthus making peace Eph 2:13ff\nAnd in writing to the Galatians, Paul develops this further to included other,\nseemingly unsurmountable, barriers in contemporary society.\nPage 3 of 4\nCHRISTMAS 2 – Year B – 2020\nThere is neither Jew nor Gentile, neither slave nor free, nor is there\nmale and female, for you are all one in Christ Jesus. Gal 3:28\nI began by referring to the stickers on the floor of our Church telling us to keep\nour distance, to stay apart. Social distancing, staying apart has been one of the\nmarks of the year that has now passed. I observed that all this has brought\nhome to us the value of community – we do need each other. ‘It is not good\nfor man to be alone’.\nBut community is not something that we can take for granted. It is all too easy\nfor communities to fracture along lines of politics, culture, race, class, religious\nconviction. It has been our experience in recent years to see those divisions\nexacerbated rather than bridged by social media; we have seen the new\nphenomenon of cyber bullying. In the sphere of politics we have seen twitter\nfeeds and posts on Facebook spreading half truths and innuendo. The other,\nthe different is portrayed as a threat and fears are stoked – often to the benefit\nof those who seek power for themselves rather than the good of all.\nAs I keep on saying, this pandemic has brought home to us the importance of\ncommunity. May this New Year of 2021 be a year on which we build on that\ntruth as individuals, as a community, as a society. May we value each other, in\nall our differences, as ones made in the image of God.\nAnd the Word became flesh and lived among us: living, dying, rising; to\nreconcile man to God and man to man. May the redeeming, reconciling Christ\nPage 4 of 4\nCHRISTMAS 2 – Year B – 2020\ncontinue to be living and active in the world of today, in the Church, in the life\nand witness of you and me."
    }
}