{
    "title": "The Fullness of Time",
    "date": "2011-12-25",
    "blurb": "This sermon explores the concept of 'fullness' in the context of time, God, and spirituality. It delves into various biblical references that discuss the fullness of God, the fullness of time, and the fullness of our own spiritual journey. The sermon encourages us to seek and understand the 'fullness' in our own lives and in our relationship with God.",
    "raw_text": "No one sews a piece of unshrunk cloth on an old cloak, for the patch pulls away from the cloak, and a worse tear is made. This is a metaphor for the concept of 'fullness' that is explored throughout the sermon. The sermon references various biblical passages that discuss the fullness of God, the fullness of time, and the fullness of our own spiritual journey.\n\n> 'Now if their stumbling means riches for the world, and if their defeat means riches for Gentiles, how much more will their full inclusion mean!' (Ro 11:12)\n\nThe sermon encourages us to seek and understand the 'fullness' in our own lives and in our relationship with God. It explores the concept of 'fullness' in the context of time, God, and spirituality. It delves into various biblical references that discuss the fullness of God, the fullness of time, and the fullness of our own spiritual journey.\n\n> 'Love does no wrong to a neighbor; therefore, love is the fulfilling of the law.' (Ro 13:10)\n\nThe sermon ends with a call to action, encouraging us to seek the 'fullness' in our own lives and in our relationship with God. This is a powerful message that resonates with the concept of 'fullness' and the importance of seeking and understanding this in our own lives.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Christmas/year A/christmas22011 - notes.txt",
        "raw_ocr_content": "Page 1 of 3\nchristmas2 -Pradis\nplhvrwma\nplhvrwma\n1 Mt 9:16.\n16 No one sews a piece of unshrunk cloth on an old cloak, for the patch pulls away from the\ncloak, and a worse tear is made.\nMt 9:16 oujdei;\" de; ejpibavllei ejpivblhma rJavkou\" ajgnavfou ejpi; iJmativw/ palaiw'/: ai[rei ga;r to;\nplhvrwma aujtou' ajpo; tou' iJmativou kai; cei'ron scivsma givnetai.\n2 Mk 2:21.\nMk 2:21 \"No one sews a piece of unshrunk cloth on an old cloak; otherwise, the patch pulls away\nfrom it, the new from the old, and a worse tear is made.\nMk 2:21 Oujdei;\" ejpivblhma rJavkou\" ajgnavfou ejpiravptei ejpi; iJmavtion palaiovn: eij de; mhv,\nai[rei to; plhvrwma ajp j aujtou' to; kaino;n tou' palaiou' kai; cei'ron scivsma givnetai.\n3 Ro 11:12\n12 Now if their stumbling means riches for the world, and if their defeat means riches for\nGentiles, how much more will their full inclusion mean!\nRo 11:12 eij de; to; paravptwma aujtw'n plou'to\" kovsmou kai; to; h{tthma aujtw'n plou'to\" ejqnw'n,\npovsw/ ma'llon to; plhvrwma aujtw'n.\n4 Ro 11:25.\nSo that you may not claim to be wiser than you are, brothers and sisters, I want you to\nunderstand this mystery: a hardening has come upon part of Israel, until the full number of the\nGentiles has come in.\nRo 11:25 Ouj ga;r qevlw uJma'\" ajgnoei'n, ajdelfoiv, to; musthvrion tou'to, i{na mh; h\\te ªpar jº\neJautoi'\" frovnimoi, o{ti pwvrwsi\" ajpo; mevrou\" tw'/ jIsrah;l gevgonen a[cri ou| to; plhvrwma tw'n\nejqnw'n eijsevlqh/\n5 Ro 13:10.\n10 Love does no wrong to a neighbor; therefore, love is the fulfilling of the law.\nRo 13:10 hJ ajgavph tw'/ plhsivon kako;n oujk ejrgavzetai: plhvrwma ou\\n novmou hJ ajgavph.\nPage 2 of 3\nchristmas2 -Pradis\nplhvrwma\n6 1Co 10:26.\n\"All things are lawful,\" but not all things build up. 24 Do not seek your own advantage, but that of\nthe other. 25 Eat whatever is sold in the meat market without raising any question on the ground\nof conscience, 26 for \"the earth and its fullness are the Lord's.\"\npavnta e[xestin ajll j ouj pavnta oijkodomei'.\n1Co 10:24 mhdei;\" to; eJautou' zhteivtw ajlla; to; tou' eJtevrou.\n1Co 10:25 Pa'n to; ejn makevllw/ pwlouvmenon ejsqivete mhde;n ajnakrivnonte\" dia; th;n\nsuneivdhsin:\n1Co 10:26 tou' kurivou ga;r hJ gh' kai; to; plhvrwma aujth'\".\n7 Gal 4:4\n3 So with us; while we were minors, we were enslaved to the elemental spirits of the world. 4\nBut when the fullness of time had come, God sent his Son, born of a woman, born under the\nlaw,\nGal 4:3 ou{tw\" kai; hJmei'\", o{te h\\men nhvpioi, uJpo; ta; stoicei'a tou' kovsmou h[meqa\ndedoulwmevnoi:\nGal 4:4 o{te de; h\\lqen to; plhvrwma tou' crovnou, ejxapevsteilen oJ qeo;\" to;n uiJo;n aujtou',\ngenovmenon ejk gunaikov\", genovmenon uJpo; novmon,\n8 Eph 1:23\n22 And he has put all things under his feet and has made him the head over all things for the\nchurch, 23 which is his body, the fullness of him who fills all in all.\nEph 1:22 kai; pavnta uJpevtaxen uJpo; tou;\" povda\" aujtou' kai; aujto;n e[dwken kefalh;n uJpe;r\npavnta th'/ ejkklhsiva/,\nEph 1:23 h{ti\" ejsti;n to; sw'ma aujtou', to; plhvrwma tou' ta; pavnta ejn pa'sin plhroumevnou.\n9 Eph 3:19\nPage 3 of 3\nchristmas2 -Pradis\nplhvrwma\n18 I pray that you may have the power to comprehend, with all the saints, what is the breadth\nand length and height and depth, 19 and to know the love of Christ that surpasses knowledge,\nso that you may be filled with all the fullness of God.\nEph 3:18 i{na ejxiscuvshte katalabevsqai su;n pa'sin toi'\" aJgivoi\" tiv to; plavto\" kai; mh'ko\" kai;\nu{yo\" kai; bavqo\",\nEph 3:19 gnw'naiv te th;n uJperbavllousan th'\" gnwvsew\" ajgavphn tou' Cristou', i{na plhrwqh'te eij\"\npa'n to; plhvrwma tou' qeou'.\n10 Col 1:19\n18 He is the head of the body, the church; he is the beginning, the firstborn from the dead, so\nthat he might come to have first place in everything. 19 For in him all the fullness of God was\npleased to dwell, 20 and through him God was pleased to reconcile to himself all things, whether\non earth or in heaven, by making peace through the blood of his cross.\nCol 1:18 kai; aujtov\" ejstin hJ kefalh; tou' swvmato\" th'\" ejkklhsiva\": o{\" ejstin ajrchv, prwtovtoko\" ejk\ntw'n nekrw'n, i{na gevnhtai ejn pa'sin aujto;\" prwteuvwn,\nCol 1:19 o{ti ejn aujtw'/ eujdovkhsen pa'n to; plhvrwma katoikh'sai\nCol 1:20 kai; di j aujtou' ajpokatallavxai ta; pavnta eij\" aujtovn, eijrhnopoihvsa\" dia; tou' ai{mato\" tou'\nstaurou' aujtou', ªdi j aujtou'º ei[te ta; ejpi; th'\" gh'\" ei[te ta; ejn toi'\" oujranoi'\".\n11 Col 2:9.\n9 For in him the whole fullness of deity dwells bodily, 10 and you have come to fullness in him,\nwho is the head of every ruler and authority.\nCol 2:9 o{ti ejn aujtw'/ katoikei' pa'n to; plhvrwma th'\" qeovthto\" swmatikw'\",\nCol 2:10 kai; ejste; ejn aujtw'/ peplhrwmevnoi, o{\" ejstin hJ kefalh;"
    }
}