{
    "title": "Emmanuel, God with Us",
    "date": "2011-12-25",
    "blurb": "In this sermon, Kevin reflects on the concept of 'Emmanuel', meaning 'God with us', and how it resonates especially during the Christmas season. He discusses the idea of encountering God in others and allowing others to encounter God in us. Despite the challenges and uncertainties of the new year, he emphasizes the presence of God in our lives and the hope it brings.",
    "raw_text": "Christmas is coming and the goose is getting fat – let’s put a penny in the old man’s hat. So runs the old nursery rhyme. At this stage the goose, or whatever graced our Christmas table, is long since picked bare and there are few enough pennies to put in to anyone’s hat. The post Christmas days of my childhood were days of picking over the Christmas dinner as Mum tried varied ways to use up the last of the turkey – turkey sandwiches, salads, curries – the carcass boiled for soup. Then there was the sitting around the fire, cracking Brazil nuts, watching old films on the TV, eating the selection boxes and other treats that had filled out the Christmas stocking. There was, if you like, a continuing savouring of the feast that we had enjoyed on Christmas Day. Here in Church these Sundays after Christmas represent an opportunity to continue to savour the gift we celebrate at Christmas, the birth of our Lord Jesus Christ.\n\nThis year I have found myself continuing to savour the title Emmanuel, God with us. While I have always loved that opening chapter of John’s Gospel, I found a particular resonance this year as I continued to savour that word Emmanuel.\n\nIn both our communions over Christmas Eve and Christmas Day and this morning we have heard those words:\n\n> 14And the Word became flesh and lived among us, and we have seen his glory, the glory as of a father’s only son, full of grace and truth.\n\nOn Christmas morning in the Family Service we reflected on:\n\n> 4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\nThen in today’s Gospel reading:\n\n> 16 From his fullness we have all received, grace upon grace.\n\nThere is something extraordinarily ordinary in the whole idea of Incarnation, of God present among us; expressed in a delightful simplicity by the late Archbishop Trevor Huddlestone, one of the early giants in the struggle against apartheid, in words we have returned to a number of times over the Christmas season.\n\n> ‘The Christian Faith’, he argues, ‘is based on an infinite respect for human dignity and human rights because of the fact that God himself has taken human nature and therefore endowed it with an infinite purpose and meaning which transcend the barriers of colour, race and creed.’\n\nAs we were thinking on Christmas Eve, that is a statement not only about my status but also the status of the other, the one with whom I will meet in my home and beyond, with friend and with stranger, the insider and the outsider. I think of not just encountering God in the other but also to what extent do I allow the other to encounter God in me, to what extent am I willing, in my own life, to be a sign of God’s living presence, to make God present in the world in which I live and move and have my being.\n\nWe contemplate this idea of encountering God in others, others encountering God in me in the context of the harsh realities of a new year. Whatever stage in life we are at, this year is going to be crucial. As individuals, as families, we each face our own challenges. For some they will be the ordinary, yet nonetheless vital, challenges of new school, getting married, having children. For many there is the additional uncertainty of our employment, paying the mortgage, school and university fees. As a society this coming year is crucial as we wonder what else, what extra sacrifices are going to be necessary for us to come through this crisis and at what expense in terms of our care for the weak and the marginalised. As I remarked last Sunday, we are facing into two crucial elections, to Dail Eireann and to the Presidency. The results of each of these elections will in their own way say a great deal about how we see ourselves. Do we retreat back into sectional politics, each sector of society seeking to preserve its own interests, or seek the greater good of our whole society? Are we going to choose leaders, choose a President, who will inspire, who will speak the word of truth, albeit an uncomfortable truth, who will have a vision for our society at this particular time.\n\nThese are all serious issues but they need not be a source of despair. As I remarked on Christmas morning, it is easy to get sucked into hopelessness. The writer of the Fourth Gospel, as he speaks of the Word becoming flesh, expresses a fundamental optimism as he declares:\n\n> 4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\nThe light shines in the darkness and the darkness has not overcome it. God present in the world, as I worry over employment, over home, over my children. I face none of these situations alone. This point is brought out in a poem that was used by the late King George 6th :\n\n> At the Gate of the Year\nI said to the man who stood at the gate of the year\n'Give me a light that I may tread safely into the unknown.'\nAnd he replied,\n'Go into the darkness and put your hand into the hand of God\nThat shall be to you better than light and safer than a known way!'\nSo I went forth and finding the Hand of God\nTrod gladly into the night\nHe led me towards the hills\nAnd the breaking of day in the lone east.\nSo heart be still!\nWhat need our human life to know\nIf God hath comprehension?\nIn all the dizzy strife of things\nBoth high and low,\nGod hideth his intention.\"\nby Minnie Louise Harkins 1875-1957\nIncluded in King George V1 broadcast 1939\n\nHow do we see that hand? Is that a hand that will drag us kicking and screaming where we do not want to go – or is it the hand of the one who promised he would be with always, to the very end of time.\n\nThis ‘better than light and safer than any known way’ leads me to think of the generosity of God’s provision. Our Gospel writer declares:\n\n> 16 From his fullness we have all received, grace upon grace.\n\nThat word ‘fullness’, a translation of the Greek word pleroma,, occurs over and over again in the New Testament, and denotes a generosity of God’s provision that makes up for all shortcomings – the fullness of Christ, the fullness of time, the fullness of God. There is nothing lacking in God’s gracious provision. God grant us the grace to lay hold of it at this time. We have celebrated the coming of Emmanuel, ‘God with us’; he, who in the midst of the storm, said, ‘Peace, be still.’; who walked the road to Emmaus, speaking to the fears and disillusionment of dispirited followers; who stood in the midst of his disciples, showing them his hands and his side and greeting them, ‘Peace be with you’. May we know his presence alongside us in whatever lies ahead in this coming year.\n\nCollect of 2nd Sunday of Christmas\n\nAlmighty God,\nin the birth of your Son\nyou have poured on us the new light of your incarnate Word,\nand shown us the fullness of your love:\nhelp us to walk in his light and dwell in his love\nthat we may know the fullness of his joy;\nwho is alive and reigns with you,\nin the unity of the Holy Spirit,\none God, now and for ever.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Christmas/year A/christmas22011.txt",
        "raw_ocr_content": "Page 1 of 4\nChristmas 2 – 2011 – year A\n‘Christmas is coming and the goose is getting fat – let’s put a penny in the old man’s hat.’\nSo runs the old nursery rhyme. At this stage the goose, or whatever graced our Christmas\ntable, is long since picked bare and there are few enough pennies to put in to anyone’s hat.\nThe post Christmas days of my childhood were days of picking over the Christmas dinner\nas Mum tried varied ways to use up the last of the turkey – turkey sandwiches, salads,\ncurries – the carcass boiled for soup. Then there was the sitting around the fire, cracking\nBrazil nuts, watching old films on the TV, eating the selection boxes and other treats that\nhad filled out the Christmas stocking. There was, if you like, a continuing savouring of\nthe feast that we had enjoyed on Christmas Day. Here in Church these Sundays after\nChristmas represent an opportunity to continue to savour the gift we celebrate at\nChristmas, the birth of our Lord Jesus Christ.\nThis year I have found myself continuing to savour the title Emmanuel, God with us.\nWhile I have always loved that opening chapter of John’s Gospel, I found a particular\nresonance this year as I continued to savour that word Emmanuel.\nIn both our communions over Christmas Eve and Christmas Day and this morning we\nhave heard those words:\n14And the Word became flesh and lived among us, and we have seen\nhis glory, the glory as of a father’s only son, full of grace and truth.\nOn Christmas morning in the Family Service we reflected on:\n4What has come into being in him was life, and the life was the light\nof all people. 5The light shines in the darkness, and the darkness did\nnot overcome it.\nThen in today’s Gospel reading:\n16 From his fullness we have all received, grace upon grace.\nPage 2 of 4\nChristmas 2 – 2011 – year A\nThere is something extraordinarily ordinary in the whole idea of Incarnation, of God\npresent among us; expressed in a delightful simplicity by the late Archbishop Trevor\nHuddlestone, one of the early giants in the struggle against apartheid, in words we have\nreturned to a number of times over the Christmas season.\n‘The Christian Faith’, he argues, ‘is based on an infinite respect for\nhuman dignity and human rights because of the fact that God\nhimself has taken human nature and therefore endowed it with an\ninfinite purpose and meaning which transcend the barriers of colour,\nrace and creed.’\nAs we were thinking on Christmas Eve, that is a statement not only about my status but\nalso the status of the other, the one with whom I will meet in my home and beyond, with\nfriend and with stranger, the insider and the outsider. I think of not just encountering God\nin the other but also to what extent do I allow the other to encounter God in me, to what\nextent am I willing, in my own life, to be a sign of God’s living presence, to make God\npresent in the world in which I live and move and have my being.\nWe contemplate this idea of encountering God in others, others encountering God in me in\nthe context of the harsh realities of a new year. Whatever stage in life we are at, this year\nis going to be crucial. As individuals, as families, we each face our own challenges. For\nsome they will be the ordinary, yet nonetheless vital, challenges of new school, getting\nmarried, having children. For many there is the additional uncertainty of our employment,\npaying the mortgage, school and university fees. As a society this coming year is crucial\nas we wonder what else, what extra sacrifices are going to be necessary for us to come\nthrough this crisis and at what expense in terms of our care for the weak and the\nmarginalised. As I remarked last Sunday, we are facing into two crucial elections, to Dail\nEireann and to the Presidency. The results of each of these elections will in their own way\nsay a great deal about how we see ourselves. Do we retreat back into sectional politics,\neach sector of society seeking to preserve its own interests, or seek the greater good of our\nwhole society? Are we going to choose leaders, choose a President, who will inspire, who\nPage 3 of 4\nChristmas 2 – 2011 – year A\nwill speak the word of truth, albeit an uncomfortable truth, who will have a vision for our\nsociety at this particular time.\nThese are all serious issues but they need not be a source of despair. As I remarked on\nChristmas morning, it is easy to get sucked into hopelessness. The writer of the Fourth\nGospel, as he speaks of the Word becoming flesh, expresses a fundamental optimism as he\ndeclares:\n4What has come into being in him was life, and the life was the light\nof all people. 5The light shines in the darkness, and the darkness did\nnot overcome it.\nThe light shines in the darkness and the darkness has not overcome it. God present in the\nworld, as I worry over employment, over home, over my children. I face none of these\nsituations alone. This point is brought out in a poem that was used by the late King\nGeorge 6th :\nAt the Gate of the Year\nI said to the man who stood at the gate of the year\n'Give me a light that I may tread safely into the unknown.'\nAnd he replied,\n'Go into the darkness and put your hand into the hand of God\nThat shall be to you better than light and safer than a known way!'\nSo I went forth and finding the Hand of God\nTrod gladly into the night\nHe led me towards the hills\nAnd the breaking of day in the lone east.\nSo heart be still!\nWhat need our human life to know\nIf God hath comprehension?\nIn all the dizzy strife of things\nBoth high and low,\nGod hideth his intention.\"\nby Minnie Louise Harkins 1875-1957\nIncluded in King George V1 broadcast 1939\nHow do we see that hand? Is that a hand that will drag us kicking and screaming where\nwe do not want to go – or is it the hand of the one who promised he would be with always,\nto the very end of time.\nPage 4 of 4\nChristmas 2 – 2011 – year A\nThis ‘better than light and safer than any known way’ leads me to think of the generosity\nof God’s provision. Our Gospel writer declares:\n16 From his fullness we have all received, grace upon grace.\nThat word ‘fullness’, a translation of the Greek word pleroma,, occurs over and over again\nin the New Testament, and denotes a generosity of God’s provision that makes up for all\nshortcomings – the fullness of Christ, the fullness of time, the fullness of God. There is\nnothing lacking in God’s gracious provision. God grant us the grace to lay hold of it at\nthis time. We have celebrated the coming of Emmanuel, ‘God with us’; he, who in the\nmidst of the storm, said, ‘Peace, be still.’; who walked the road to Emmaus, speaking to\nthe fears and disillusionment of dispirited followers; who stood in the midst of his\ndisciples, showing them his hands and his side and greeting them, ‘Peace be with you’.\nMay we know his presence alongside us in whatever lies ahead in this coming year.\nCollect of 2nd Sunday of Christmas\nAlmighty God,\nin the birth of your Son\nyou have poured on us the new light of your incarnate Word,\nand shown us the fullness of your love:\nhelp us to walk in his light and dwell in his love\nthat we may know the fullness of his joy;\nwho is alive and reigns with you,\nin the unity of the Holy Spirit,\none God, now and for ever."
    }
}