{
    "title": "Celebrating Life Amidst Death",
    "date": "Unknown",
    "blurb": "This sermon, delivered at the funeral of Denis Murphy, emphasizes the celebration of life even in the face of death. It highlights Denis's life, his work in the building industry, his love for golf and outdoors, and his devotion to his family. The sermon also celebrates the life Denis shared with his wife Barbara, their shared experience of loss, and their 23 years of marriage. It concludes with the message of hope and life in Christ, even in the face of death.",
    "raw_text": "Funeral of Denis Murphy – Church of the Resurrection, Bayside. One of the options for prayers in the Church of Ireland funeral Liturgy contains the words, ‘In the midst of life, we are in death, of whom may we seek for succour.’ As we gather for the funeral of Denis Murphy, I just want to reverse that. ‘In the midst of death, we are in life.’ In the face of death, accepting our mortality, we come in Christian hope to celebrate life.\n\nWe come to celebrate the life of Denis Murphy. Denis spent all his working life in the building industry. In the early days working conditions were not good and workers were not always treated fairly. It was out of a personal experience of injustice that saw him out of work following the early death of his father, that Denis resolved to treat those who worked alongside him with justice and fairness. He loved wood and working with wood, he was a craftsman, setting high standards for himself, expecting high standards of those who worked under his direction – but all through that, that same spirit of fairness. Of course he loved his golf, he kept it up as long as he could. He loved the outdoors, the walk along the pier in Howth. He would have said he did a lot of his thinking and praying walking that pier. All of us would have been struck by the quiet courage and determination he brought to his illness.\n\nWe come to celebrate the life that Denis and Barbara shared together. They were drawn together by a shared experience of loss, as each was mourning the death of spouses they loved. At that time, Denis was in charge of the building project in the CRC and Barbara was helping with swimming at the CRC. Denis’ construction team had taken over the section of the car park that the swimmers were using and Barbara had been asked by the group to go and talk to him. The rest is history as they found in each other someone who could understand the pain of loss and they went on to share 23 years of marriage.\n\nIn the face of death we come to celebrate life in Christ. I don’t think I could talk of Denis this morning without making any reference to his beard. At this time of year, the beard began to grow in preparation for Denis’ trademark appearances as Santa Claus in any number of Christmas parties around this area. Denis got great satisfaction from these appearances and the thrill and excitement of the youngsters – and sometimes the not so young. Christmas was a season he really enjoyed, both in the community and in the life of the Church. One of the Gospel passages associated with Christmas is those wonderful opening verses of St John’s Gospel. They speak of God among us in the person of Jesus Christ. We will hear those lovely words:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nThe light shines in the darkness and the darkness did not overcome it. Darkness has not had the last word in the life of Denis Murphy. Sickness, weakness has not had the final say. In fellowship with Denis, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nTo return to the beginning, in the midst of death we are in life. In the face of death we celebrate the life of Denis Murphy, the life he shard with Barbara and the rest of the family. In word and in the sacrament of the Eucharist we celebrate the life we have in Christ, crucified, risen and ascended, victorious over death. We do so conscious of the loss of those who will miss Denis most, his wife Barbara, his sons Ken, Terry, Denny, his sister Alice and all those who have loved him. And so as we commend Denis to God we pray for those who feel the pain of his passing. May we be signs of Christ’s presence with them in the days and weeks to come, shedding something of his light in the darkness of their loss.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Denis Murphy.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Denis Murphy – Church of the Resurrection, Bayside.\nOne of the options for prayers in the Church of Ireland funeral Liturgy contains\nthe words, ‘In the midst of life, we are in death, of whom may we seek for\nsuccour.’\nAs we gather for the funeral of Denis Murphy, I just want to reverse that. ‘In\nthe midst of death, we are in life.’ In the face of death, accepting our mortality,\nwe come in Christian hope to celebrate life.\nWe come to celebrate the life of Denis Murphy. Denis spent all his working\nlife in the building industry. In the early days working conditions were not\ngood and workers were not always treated fairly. It was out of a personal\nexperience of injustice that saw him out of work following the early death of\nhis father, that Denis resolved to treat those who worked alongside him with\njustice and fairness. He loved wood and working with wood, he was a\ncraftsman, setting high standards for himself, expecting high standards of those\nwho worked under his direction – but all through that, that same spirit of\nfairness. Of course he loved his golf, he kept it up as long as he could. He\nloved the outdoors, the walk along the pier in Howth. He would have said he\ndid a lot of his thinking and praying walking that pier. All of us would have\nbeen struck by the quiet courage and determination he brought to his illness.\nOn one level he fought it, keeping up his golf, keeping up his walking. On\nanother level there was a quiet acceptance; in the hospital he would have\ntalked of mortality. The sacrament of reconciliation was for him an important\nstep on that journey. He was of course a family man and maintained a quiet\npride in his sons Ken, Terry and Denny – his devotion to Denny and those with\nsimilar needs was a source of inspiration to many.\nPage 2 of 3\nFuneral of Denis Murphy – Church of the Resurrection, Bayside.\nWe come to celebrate the life that Denis and Barbara shared together. They\nwere drawn together by a shared experience of loss, as each was mourning the\ndeath of spouses they loved. At that time, Denis was in charge of the building\nproject in the CRC and Barbara was helping with swimming at the CRC.\nDenis’ construction team had taken over the section of the car park that the\nswimmers were using and Barbara had been asked by the group to go and talk\nto him. The rest is history as they found in each other someone who could\nunderstand the pain of loss and they went on to share 23 years of marriage.\nThey came to that marriage out of different life experiences, different\ntraditions. We often talk of inter church marriage in terms of difficulty, in\nterms of problems. Couples like Barbara and Denis show us the other side.\nThere are differences between us but folk like Denis and Barbara show us an\necumenism that is lived out 24/7 in the nuts and bolts of daily living; in a\nshared life, lived out in love, built on respect and understanding for one\nanother. So as we celebrate their life together, I offer it as a sign of hope in the\nlife of the Church as we seek that unity that is Christ’s will for us all.\nIn the face of death we come to celebrate life in Christ. I don’t think I could\ntalk of Denis this morning without making any reference to his beard. At this\ntime of year, the beard began to grow in preparation for Denis’ trademark\nappearances as Santa Claus in any number of Christmas parties around this\narea. Denis got great satisfaction from these appearances and the thrill and\nexcitement of the youngsters – and sometimes the not so young. Christmas\nwas a season he really enjoyed, both in the community and in the life of the\nChurch. One of the Gospel passages associated with Christmas is those\nPage 3 of 3\nFuneral of Denis Murphy – Church of the Resurrection, Bayside.\nwonderful opening verses of St John’s Gospel. They speak of God among us\nin the person of Jesus Christ. We will hear those lovely words:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nThe light shines in the darkness and the darkness did not overcome it. Darkness\nhas not had the last word in the life of Denis Murphy. Sickness, weakness has\nnot had the final say. In fellowship with Denis, we follow a Lord who knows\nwhat death, what suffering, what loss is all about; one who knew what it was\nlike to weep at the grave of his friend Lazarus. Not only that, he is the one who\nwas raised triumphant over death, breaking the power of death itself. Knowing\nin his own person what it was all about, I find in him one to whom I cam come\nin my own time of suffering and find real comfort, real strength and real hope.\nTo return to the beginning, in the midst of death we are in life. In the face of\ndeath we celebrate the life of Denis Murphy, the life he shard with Barbara and\nthe rest of the family. In word and in the sacrament of the Eucharist we\ncelebrate the life we have in Christ, crucified, risen and ascended, victorious\nover death. We do so conscious of the loss of those who will miss Denis most,\nhis wife Barbara, his sons Ken, Terry, Denny, his sister Alice and all those who\nhave loved him. And so as we commend Denis to God we pray for those who\nfeel the pain of his passing. May we be signs of Christ’s presence with them in\nthe days and weeks to come, shedding something of his light in the darkness of\ntheir loss."
    }
}