{
    "title": "Funeral of Mr Des Meredith",
    "date": "2015-07-15",
    "blurb": "This sermon is a tribute to Mr Des Meredith, who passed away peacefully in St Francis Hospice. It highlights his life, his love for his family, and his zest for life. It also touches on his interests in sports and bridge. The sermon offers comfort and hope, reminding the congregation of the promise of a new Jerusalem, where there will be no more death, mourning, crying, or pain.",
    "raw_text": "This morning we have gathered in All Saints Church for the funeral of Mr Des Meredith. Des died peacefully last Sunday in St Francis Hospice here in Raheny with his wife and family at his side. Over the last couple of days there has been sorrow as they begin to come to terms with their loss. There has been remembering and thankfulness – some tears and some laughter.\n\nThey remember a family man, a man with a love and zest for life. He grew up near Carlow and went to National School in Carlow town before heading on to Kilkenny College and Mountjoy School. He may have been brought up on a farm but, as the family have remembered with some amusement, farming was not for Des and he came to Dublin, working for 40 years in General Accident Insurance Company, where he was highly respected, eventually becoming Motor Superintendant.\n\nThey remember a father to Mark and Carol, a loving husband to his wife Thyra of some 47 years. Des and Thyra had stood alongside Carol on the death of her own husband some 6 years ago and her own subsequent illness. While he had lived with diabetes for a number of years, his health had deteriorated from last November – this has been hard for Des, hard for the family to watch.\n\nDes was one who took a great interest in life, in people. An accomplished in his day, playing hockey and cricket and in later years taking up golf., he retained a lively interest in sport all his day. In latter years he loved to go over to watch cricket at Lords with his son Mark.\n\nWe read as our first lesson from the very end of the Book Revelation. After all the visions experienced by the writer, he tells of his final vision of a new Jerusalem, a place of hope and healing in the presence of God:\n\n> 3 And I heard a loud voice from the throne saying,\n> \"See, the home of God is among mortals.\n> He will dwell with them as their God;\n> they will be his peoples,\n> and God himself will be with them;\n> 4 he will wipe every tear from their eyes.\n> Death will be no more;\n> mourning and crying and pain will be no more,\n> for the first things have passed away.\"\n\nThose of us outside the family circle have come to offer our love and support to his wife Thyra, their children Mark and Carol, his brother Leslie and sisters Doris and Iris.\n\nWe gather this morning to commend Des, as husband, as father, as brother, as friend, the one who stood by others, who listened, who understood, the one whose friendship and love we valued and enjoyed to his heavenly Father. As we do so we set our own lives in the context of eternity, our hopes and our fears, in the context of the God and Father of our Lord Jesus Christ, praying that he may watch over us and keep until the day of our own departure from this life.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Des Meredith.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mr Des Meredith – All Saints – 15th July 2015\nThis morning we have gathered in All Saints Church for the funeral of Mr Des\nMeredith.. Des died peacefully last Sunday in St Francis Hospice here in\nRaheny with his wife and family at his side. Over the last couple of days there\nhas been sorrow as they begin to come to terms with their loss. There has been\nremembering and thankfulness – some tears and some laughter.\nThey remember a family man, a man with a love and zest for life. he grew up\nnear Carlow and went to National School in Carlow town before heading on to\nKilkenny College and Mountjoy School He may have been brought up on a\nfarm but, as the family have remembered with some amusement, farming was\nnot for Des and he came to Dublin, working for 40 years in General Accident\nInsurance Company, where he was highly respected, eventually becoming\nMotor Superintendant.\nThey remember a father to Mark and Carol, a loving husband to his wife Thyra\nof some 47 years. Des and Thyra had stood alongside Carol on the death of her\nown husband some 6 years ago and her own subsequent illness. While he had\nlived with diabetes for a number of years, his health had deteriorated from last\nNovember – this has been hard for Des, hard for the family to watch. I\nthought of words from the 2nd Letter to Timothy as Paul proclaims, ‘I have\nfought the good fight, I have finished the race, I have kept the faith.’ Today is\na day for you to come before God with your own particular memories of Des\nand give thanks to God for all that he has meant to you as husband, as father, as\nbrother and friend, to thank God for all that was good and true in his life, his\ncourage in the face of adversity, his love and friendship.\nDes was one who took a great interest in life, in people. An accomplished in\nhis day, playing hockey and cricket and in later years taking up golf., he\nretained a lively interest in sport all his day. In latter years he loved to go over\nto watch cricket iat Lords with his son Mark Reared in the Midlands, the\nPage 2 of 3\nFuneral of Mr Des Meredith – All Saints – 15th July 2015\nParish Whistdrives would have featured in the social calendar. Des developed\na passion for bridge and at one stage was a member of three clubs – as well as\nfitting in the odd game of poker.\nWe read as our first lesson from the very end of the Book Revelation. After all\nthe visions experienced by the writer, he tells of his final vision of a new\nJerusalem, a place of hope and healing in the presence of God:\n. 3 And I heard a loud voice from the throne saying,\n\"See, the home of God is among mortals.\nHe will dwell with them as their God;\nthey will be his peoples,\nand God himself will be with them;\n4 he will wipe every tear from their eyes.\nDeath will be no more;\nmourning and crying and pain will be no more,\nfor the first things have passed away.\"\nThe home of God is among mortals. That for me is one of the fundamental\nmessages of the Gospel. In the person of Jesus Christ, God entered into our\nhumanity; he experienced in himself what it was to be human, to know\nsuffering, to know fear, to know loss. He not only has experienced it, he has\nconquered it in his resurrection from the dead.\nDeath will be no more;\nmourning and crying and pain will be no more,\nThose of us outside the family circle have come to offer our love and support\nto his wife Thyra, their children Mark and Carol, is brother Leslie and sisters\nDoris and Iris.\nWe gather this morning to commend Des, as husband, as father, as brother, as\nfriend, the one who stood by others, who listened, who understood, the one\nPage 3 of 3\nFuneral of Mr Des Meredith – All Saints – 15th July 2015\nwhose friendship and love we valued and enjoyed to his heavenly Father. As\nwe do so we set our own lives in the context of eternity, our hopes and our\nfears, in the context of the God and Father of our Lord Jesus Christ, praying\nthat he may watch over us and keep until the day of our own departure from\nthis life.\nWe give them back to thee, dear Lord, who gavest them to us.\nYet as thou didst not lose them in giving, so we have not lost\nthem by their return. What thou gavest thou takest not away,\nO Lover of souls; for what is thine is ours also if we are thine.\nAnd life is eternal and love is immortal, and death is only an\nhorizon, and an horizon is nothing save the limit of our sight.\nLift us up, strong Son of God, that we may see further; cleanse\nour eyes that we may see more clearly; and draw us closer to\nthyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us,\nprepare us also for that happy place, that where they are and\nthou art, we too may be for evermore."
    }
}