{
    "title": "Reflections on Parish Anniversaries",
    "date": "2016-10-13",
    "blurb": "Kevin reflects on the dual anniversary of the Parish of Howth, marking 200 years since the old church and 150 years of the new church. He emphasizes the importance of embracing change while honoring the past, and addresses the challenges of declining attendance and financial contributions. He calls for unity and innovation in the face of necessary maintenance and the intimate nature of upcoming worship during church repairs.",
    "raw_text": "EASTER GENERAL VESTRY 2016\n\n200 years ago this year a new Church was consecrated on this site and became the place of worship of the local Church of Ireland community, replacing one, the ruins of which still stand, in the grounds of Howth Castle. As a building it received mixed reviews. Then 150 years later it was replaced by the present Church of St Mary’s. It was interesting that the old one was not completely demolished; the tower was incorporated into the spire of the present Church. In other words, part of what had gone before was incorporated into the new and the new was built on the foundations of the old.\n\n2016 is a significant year for the Parish of Howth, representing as it does a double anniversary, the 200th anniversary of the old Church and the 150th anniversary of the new. In connection with this we will be welcoming the Archbishop of Armagh to Howth on Sunday 13th October, which is close to the anniversary of the consecration of the old Church.\n\nIn the meantime next Friday we will be launching the new Parish history which has been produced by a team lead by Daphne Henly. Daphne would be the first to say that there has been a huge amount of work done by many other people but I would still want to say a particular thank you to Daphne who has spent hours researching documents in the RCB Library and contemporary news reports and without whom this project would not have got off the ground.\n\nA building of this age obviously needs maintenance. This year a large amount of background work has gone into laying the foundations for work on the roof. Since last year’s Easter General Vestry a team consisting of Derek Fennell, Stephen Shaw and Ian Malcolm have been entrusted by the Select Vestry with the task of selecting a Project Manager, conducting a survey on the roof, overseeing the production of tender documents, selection of firms from whom tenders will be sought. This group has reported back to the Select Vestry on a regular basis to report on progress and to seek ratification of recommendations by the project management team. We have already been awarded a grant by Fingal County Council and other sources of grants are being pursued. Once tenders are received, the Select Vestry will shortly be in a position to decide whether we have the finances to proceed this year or whether we would defer till next year.\n\nBuildings need maintenance. Part of that process is looking out for warning signs and responding to them. The Church of course is more than the building – it is primarily the community that gathers to worship – we need to look out for warning signs and respond to them. There are two warning signs that we would be foolish to ignore. Our numbers attending services are declining. With the exception of Family Service and to a lesser extent the Family Communion, our numbers have dropped – the 9:30 is down to 20 – 25 from 30 – 35 five years ago. the11:00 services of MP and Parish Communion are down to 55-60 compared to 80 five years ago.\n\nAlongside this the number of people making regular contributions through the envelope scheme or through standing order is declining (though there have been a small number of people taking out standing orders since the last appeal in the Newsletter and by email).\n\nThe issues of numbers will have to be addressed. It is not just a matter of retaining children. As Bishop Kenneth Kearon pointed out at his first Synod as Bishop of Limerick, we have lost our own generation. We are about to move into the third century of Christian worship on this site. Let us embrace the challenge that is before us. Change can be painful but to refuse to change only stores up problems for the future. When the work on the roof is being done, be it this year or next year, we will be worshipping for at least two months in this Hall. Worship in this space, if it is to work, cannot be simply as it is in the Church – particularly for the celebration of Holy Communion. It is, by the very nature of the smaller space available to us, going to be more intimate. We have a horrible tendency, when change is suggested, to immediately react ‘No way!’- I think of that time I moved the communion table and I notice the ropes for the pews have gone ‘missing’. Could we use the weeks that we are in here to open our minds, to reflect on what we could be doing in the third century of worship in this beautiful Church that we have inherited and that we hold in trust for generations to come.\n\nRemember at the outset I said of the replacement of the old Church by the new: It was interesting that the old one was not completely demolished; the tower was incorporated into the spire of the present Church. In other words, part of what had gone before was incorporated into the new and the new was built on the foundations of the old.\n\nI am sure there were those who mourned the destruction of the old Church – this was the place where people had been married, children had been baptised; the place where funerals of loved ones had been held. But they moved forwards and we have benefited from their vision. And changes have been made to the current building – you will remember the font being moved. But long before that the chancel steps, which were once just past the Vestry door were moved to their present position – in memory of a former Sexton. These changes were all undertaken to reflect the changing liturgical needs of their generation.\n\nAs is customary, I want to thank a number of people who have served the Parish over the last year. I thank the outgoing Church Wardens, Mr Garret Wren, who has served as Rector’s Church Warden, and Mrs Jane Caldwell, who has served as People’s Church Warden.\n\nI would like to thank the outgoing Select Vestry for their continued commitment. I would like to thank two individuals for their particular ongoing contribution. I speak of Garrett Wren who took over as Secretary of our Select Vestry. I want to pay a special tribute to Tadhg in his continuing stewardship of our finances as Treasurer. A Treasurer is more than just a book keeper, he has the task of planning for the future. In the midst of very heavy professional commitments Tadhg has continued to provide very clear and professional advice as we have sought to steer ourselves through these troubled financial times.\n\nI have already spoken of the considerable work undertaken by the Roof Project Group. This year Frank Macnamara has not been in a position to do much of the work he has done in the past. Stephen, in addition to the work he has done on the roof project has continued in his usual quiet and unobtrusive way to attend to those many jobs that people often do not notice.\n\nI would like to thank Randal Henly for his continued service as both Organist and Editor of the Parish Newsletter. I would like to thank him and the choir for the lead they give us in our Sunday worship and also the work that goes into our special services at Harvest, Christmas and Easter. I would at the same time like to thank the team of helpers who assemble and distribute the magazine.\n\nI would also like to thank Bill Snodgrass, Rachel and Linda Rowden for their work in developing the music for the Family Service and the singers who help give a lead..\n\nI would also like to thank Elke, our Youth Worker, for her contribution to our Family Services – she has a particular gift with prayer and some of her ideas with shadow puppets have been appreciated by all ages. I would also like to thank her for her work with the children out in the Hall during the Family Communion. All this is in addition to her other work in her role as Youth Worker with us in our Youth Clubs. I would want to pay particular tribute to Louise Fuller in the work she has done in coordinating the Youth Work Project since its inception. This work has really been fundamental to our continued success in this whole project.\n\nJackie Lawless has now taken on the running of the Parent and Toddler Group which meets every Thursday from 9:30 till 12 and there is also a lovely atmosphere in the Joshua Room.\n\nAt the other end of the age spectrum, our very successful Social Group continues to meet on alternate Tuesday afternoons. One Tuesday a month the activities are based here in the Parish Centre and on the other Tuesday the group have organised a trip. Different people have offered their services in organising the events in the programme.\n\nOn the last Saturday of each month the men of the Parish meet in the Marine Hotel to solve the issues of the day over a breakfast that would send shivers down any dietician’s spine. Thank you to Stan McMullen, Denis Headon and Fred Spendlove for their continued coordination of this.\n\nThe Garden Gang continues to thrive under the leadership, or should I saw command, of Lorna Hopkins. The wonderful teas that Mary used to provide are now privded by Gowan Bryce and Susan Massey. The next meeting of the Group is next Saturday – new faces very welcome. Thank you also for Derek Fennell and the team for mowing the grass. Again new faces welcome.\n\nThen there are those groupings that meet in the Parish, that involve members of the Parish and enhance the life of the Parish. There is the Mafeking Scout Group that meet here in the Parish Centre, to which so many of our young people belong, and who provide wonderful help at the time of the Fete. There is the Bridge Club that meets here on a Wednesday night that has its own unique friendly atmosphere and makes significant annual contribution to our Parish Funds. There is the St Mary’s Golf Society that over the years has organised three competitions a year, a wonderful camaraderie and over the years has contributed to the finances of the Parish. Then there is the Art Group that meets on a Friday morning. Iris has a most wonderful knack of teaching. Thank you Iris for your encouragement and the contribution the group makes to Parish Funds.\n\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will Offering Envelopes – he is always ready to respond to requests for new sets of envelopes. I would also like to take this opportunity of thanking those who contribute through this scheme or through standing order.\n\nI would like to thank Carolyn O’Laoire for her work as Administrator of the Garden of Remembrance.\n\nI would like to thank Cathy Fennell for her continued work in managing our Parish Centre. She has been very proactive in securing tenants so we have maintained our income from bookings. I would also like to thank Jane Caldwell for the quiet efficiency with which she maintains all the necessary supplies for the Parish Centre\n\nThe Fete, that wonderful community event in our annual calendar, is now drawing closer. This year this is being organised by Carolyn O’Laoire, Stephen Shaw and Kay O’Neill. I would like to thank them for the huge amount of work that has already been done in preparation and ask everyone to pull in behind them as the day of the Fete approaches.\n\nAn important aspect of our life is fellowship, whether in Church or out of Church. I would like to thank some people in particular. I would like to thank those who have been organising our coffee with the midweek service, in particular Hazel Reamsbottom, Eileen Geaney and Jane O’Hara – this is a lovely opportunity for people to get together for worship and fellowship and chat over a cup of coffee. The coffee after Church each Sunday has been particularly appreciated by those new to the Parish, providing as it does a chance to meet and establish contact with people in a way you cannot do on your way out of the Church door. Thank you to Valerie for coordinating this and to the ladies who have taken on the job of serving it each Sunday. On the odd Sunday we have missed it due to the absence of volunteers, which I think has brought home to us how valuable this meeting after Church has become.\n\nOur thanks are also due to Mr Stan McMullen for his continued work as distributor of the Church Review and to Eddie Kerr, who continues to look after the Church of Ireland Gazette. Both would welcome new subscribers.\n\nFinally, thank you to one and all for your continue support of the Parish, in your attendance at worship, in your financial support and the many and varied ways, seen and unseen, in which you each enhance the life of the Parish of Howth.\n\nIn the past twelve months I have performed 6 Baptisms and I officiated at 3 weddings. This year there were the following funerals: Betty Skelton, Gwen Holmes, Cecil Jermyn, Daphne Anderson, Jennifer Guinness Booth, Elsie Currie.\n\nI am pleased to announce that Eileen Geaney has agreed to act as Rector’s Church Warden for the coming year and that Mr Stephen Shaw has kindly agreed to continue to act as Rector’s Glebe Warden.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/Easter Vestry 2016.txt",
        "raw_ocr_content": "Page 1 of 8\nEASTER GENERAL VESTRY 2016\n200 years ago this year a new Church was consecrated on this site and became\nthe place of worship of the local Church of Ireland community, replacing one,\nthe ruins of which still stand, in the grounds of Howth Castle. As a building it\nreceived mixed reviews. In one Diocesan report it was described as in\nexcellent condition, in another later on it was said to be in poor condition. A\nformer Provost of Trinity described it as an ugly white washed house. Then\n150 years later it was replaced by the present Church of St Mary’s. It was\ninteresting that the old one was not completely demolished; the tower was\nincorporated into the spire of the present Church. In other words, part of what\nhad gone before was incorporated into the new and the new was built on the\nfoundations of the old. I’ll just leave that thought with you for the moment.\n2016 is a significant year for the Parish of Howth, representing as it does a\ndouble anniversary, the 200th anniversary of the old Church and the 150th\nanniversary of the new. In connection with this we will be welcoming the\nArchbishop of Armagh to Howth on Sunday 13th October, which is close to the\nanniversary of the consecration of the old Church.\nIn the meantime next Friday we will be launching the new Parish history which\nhas been produced by a team lead by Daphne Henly. Daphne would be the\nfirst to say that there has been a huge amount of work done by many other\npeople but I would still want to say a particular thank you to Daphne who has\nspent hours researching documents in the RCB Library and contemporary news\nreports and without whom this project would not have got off the ground.\nCome along on Friday for what promises to be a lovely evening. We will be\njoined by Cecil Hyland who will formally launch the book and there will be an\nopportunity to see old cinefilm of Burrow School sports in the 60’s and 70’s\nand other archive material that has been unearthed during the process.\nPage 2 of 8\nEASTER GENERAL VESTRY 2016\nA building of this age obviously needs maintenance. This year a large amount\nof background work has gone into laying the foundations for work on the roof.\nSince last year’s Easter General Vestry a team consisting of Derek Fennell,\nStephen Shaw and Ian Malcolm have been entrusted by the Select Vestry with\nthe task of selecting a Project Manager, conducting a survey on the roof,\noverseeing the production of tender documents, selection of firms from whom\ntenders will be sought. This group has reported back to the Select Vestry on a\nregular basis to report on progress and to seek ratification of recommendations\nby the project management team. We have already been awarded a grant by\nFingal County Council and other sources of grants are being pursued. Once\ntenders are received, the Select Vestry will shortly be in a position to decide\nwhether we have the finances to proceed this year or whether we would defer\ntill next year.\nBuildings need maintenance. Part of that process is looking out for warning\nsigns and responding to them. The Church of course is more than the building\n– it is primarily the community that gathers to worship – we need to look out\nfor warning signs and respond to them. There are two warning signs that we\nwould be foolish to ignore.\nOur numbers attending services are declining. With the exception of Family\nService and to a lesser extent the Family Communion, our numbers have\ndropped – the 9:30 is down to 20 – 25 from 30 – 35 five years ago.\nthe11:00 services of MP and Parish Communion are down to 55-60\ncompared to 80 five years ago.\nAlong side this the number of people making regular contributions through the\nenvelope scheme or through standing order is declining (though there have\nPage 3 of 8\nEASTER GENERAL VESTRY 2016\nbeen a small number of people taking out standing orders since the last appeal\nin the Newsletter and by email).\nThe issues of numbers will have to be addressed. It is not just a matter of\nretaining children. As Bishop Kenneth Kearon pointed out at his first Synod as\nBishop of Limerick, we have lost our own generation. We are about to move\ninto the third century of Christian worship on this site. Let us embrace the\nchallenge that is before us. Change can be painful but to refuse to change only\nstores up problems for the future. When the work on the roof is being done, be\nit this year or next year, we will be worshipping for at least two months in this\nHall. Worship in this space, if it is to work, cannot be simply as it is in the\nChurch – particularly for the celebration of Holy Communion. It is, by the\nvery nature of the smaller space available to us, going to be more intimate. We\nhave a horrible tendency, when change is suggested, to immediately react ‘No\nway!’- I think of that time I moved the communion table and I notice the ropes\nfor the pews have gone ‘missing’. Could we use the weeks that we are in here\nto open our minds, to reflect on what we could be doing in the third century of\nworship in this beautiful Church that we have inherited and that we hold in\ntrust for generations to come.\nRemember at the outset I said of the replacement of the old Church by the new:\nIt was interesting that the old one was not completely demolished; the tower\nwas incorporated into the spire of the present Church. In other words, part of\nwhat had gone before was incorporated into the new and the new was built on\nthe foundations of the old.\nI am sure there were those who mourned the destruction of the old Church –\nthis was the place where people had been married, children had been baptised;\nthe place where funerals of loved ones had been held. But they moved\nPage 4 of 8\nEASTER GENERAL VESTRY 2016\nforwards and we have benefited from their vision. And changes have been\nmade to the current building – you will remember the font being moved. But\nlong before that the chancel steps, which were once just past the Vestry door\nwere moved to their present position – in memory of a former Sexton. These\nchanges were all undertaken to reflect the changing liturgical needs of their\ngeneration.\nAs is customary, I want to thank a number of people who have served the\nParish over the last year. I thank the outgoing Church Wardens, Mr Garret\nWren, who has served as Rector’s Church Warden, and Mrs Jane Caldwell,\nwho has served as People’s Church Warden.\nI would like to thank the outgoing Select Vestry for their continued\ncommitment. I would like to thank two individuals for their particular ongoing\ncontribution. I speak of Garrett Wren who took over as Secretary of our Select\nVestry. I want to pay a special tribute to Tadhg in his continuing stewardship\nof our finances as Treasurer. A Treasurer is more than just a book keeper, he\nhas the task of planning for the future. In the midst of very heavy professional\ncommitments Tadhg has continued to provide very clear and professional\nadvice as we have sought to steer ourselves through these troubled financial\ntimes.\nI have already spoken of the considerable work undertaken by the Roof Project\nGroup. This year Frank Macnamara has not been in a position to do much of\nthe work he has done in the past. Stephen, in addition to the work he has done\non the roof project has continued in his usual quiet and unobtrusive way to\nattend to those many jobs that people often do not notice.\nPage 5 of 8\nEASTER GENERAL VESTRY 2016\nI would like to thank Randal Henly for his continued service as both Organist\nand Editor of the Parish Newsletter. I would like to thank him and the choir for\nthe lead they give us in our Sunday worship and also the work that goes into\nour special services at Harvest, Christmas and Easter. I would at the same time\nlike to thank the team of helpers who assemble and distribute the magazine.\nI would also like to thank Bill Snodgrass, Rachel and Linda Rowden for their\nwork in developing the music for the Family Service and the singers who help\ngive a lead..\nI would also like to thank Elke, our Youth Worker, for her contribution to our\nFamily Services – she has a particular gift with prayer and some of her ideas\nwith shadow puppets have been appreciated by all ages. I would also like to\nthank her for her work with the children out in the Hall during the Family\nCommunion. All this is in addition to her other work in her role as Youth\nWorker with us in our Youth Clubs. I would want to pay particular tribute to\nLouise Fuller in the work she has done in coordinating the Youth Work Project\nsince its inception. This work has really been fundamental to our continued\nsuccess in this whole project.\nJackie Lawless has now taken on the running of the Parent and Toddler Group\nwhich meets every Thursday from 9:30 till 12 and there is also a lovely\natmosphere in the Joshua Room.\nAt the other end of the age spectrum, our very successful Social Group\ncontinues to meet on alternate Tuesday afternoons. One Tuesday a month the\nactivities are based here in the Parish Centre and on the other Tuesday the\nPage 6 of 8\nEASTER GENERAL VESTRY 2016\ngroup have organised a trip. Different people have offered their services in\norganising the events in the programme.\nOn the last Saturday of each month the men of the Parish meet in the Marine\nHotel to solve the issues of the day over a breakfast that would send shivers\ndown any dietician’s spine. Thank you to Stan McMullen, Denis Headon and\nFred Spendlove for their continued coordination of this.\nThe Garden Gang continues to thrive under the leadership, or should I saw\ncommand, of Lorna Hopkins. The wonderful teas that Mary used to provide are\nnow privded by Gowan Bryce and Susan Massey. The next meeting of the\nGroup is next Saturday – new faces very welcome. Thank you also for Derek\nFennell and the team for mowing the grass. Again new faces welcome.\nThen there are those groupings that meet in the Parish, that involve members of\nthe Parish and enhance the life of the Parish. There is the Mafeking Scout\nGroup that meet here in the Parish Centre, to which so many of our young\npeople belong, and who provide wonderful help at the time of the Fete. There\nis the Bridge Club that meets here on a Wednesday night that has its own\nunique friendly atmosphere and makes significant annual contribution to our\nParish Funds. There is the St Mary’s Golf Society that over the years has\norganised three competitions a year, a wonderful camaraderie and over the\nyears has contributed to the finances of the Parish. Then there is the Art Group\nthat meets on a Friday morning. Iris has a most wonderful knack of teaching.\nThank you Iris for your encouragement and the contribution the group makes\nto Parish Funds.\nPage 7 of 8\nEASTER GENERAL VESTRY 2016\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will\nOffering Envelopes – he is always ready to respond to requests for new sets of\nenvelopes. I would also like to take this opportunity of thanking those who\ncontribute through this scheme or through standing order.\nI would like to thank Carolyn O’Laoire for her work as Administrator of the\nGarden of Remembrance.\nI would like to thank Cathy Fennell for her continued work in managing our\nParish Centre. She has been very proactive in securing tenants so we have\nmaintained our income from bookings. I would also like to thank Jane\nCaldwell for the quiet efficiency with which she maintains all the necessary\nsupplies for the Parish Centre\nThe Fete, that wonderful community event in our annual calendar, is now\ndrawing closer. This year this is being organised by Carolyn O’Laoire,\nStephen Shaw and Kay O’Neill. I would like to thank them for the huge\namount of work that has already been done in preparation and ask everyone to\npull in behind them as the day of the Fete approaches.\nAn important aspect of our life is fellowship, whether in Church or out of\nChurch. I would like to thank some people in particular. I would like to thank\nthose who have been organising our coffee with the midweek service, in\nparticular Hazel Reamsbottom, Eileen Geaney and Jane O’Hara – this is a\nlovely opportunity for people to get together for worship and fellowship and\nchat over a cup of coffee. The coffee after Church each Sunday has been\nparticularly appreciated by those new to the Parish, providing as it does a\nchance to meet and establish contact with people in a way you cannot do on\nPage 8 of 8\nEASTER GENERAL VESTRY 2016\nyour way out of the Church door. Thank you to Valerie for coordinating this\nand to the ladies who have taken on the job of serving it each Sunday. On the\nodd Sunday we have missed it due to the absence of volunteers, which I think\nhas brought home to us how valuable this meeting after Church has become.\nOur thanks are also due to Mr Stan McMullen for his continued work as\ndistributor of the Church Review and to Eddie Kerr, who continues to look\nafter the Church of Ireland Gazette. Both would welcome new subscribers.\nFinally, thank you to one and all for your continue support of the Parish, in\nyour attendance at worship, in your financial support and the many and varied\nways, seen and unseen, in which you each enhance the life of the Parish of\nHowth.\nIn the past twelve months I have performed 6 Baptisms and\nI officiated at 3 weddings.\nThis year there were the following funerals:\nBetty Skelton\nGwen Holmes\nCecil Jermyn\nDaphne Anderson\nJennifer Guinness Booth\nElsie Currie\nI am pleased to announce that Eileen Geaney has agreed to act as Rector’s\nChurch Warden for the coming year and that Mr Stephen Shaw has kindly\nagreed to continue to act as Rector’s Glebe Warden."
    }
}