{
    "title": "Tradition and Flexibility",
    "date": "2011-04-24",
    "blurb": "The sermon reflects on the importance of tradition within the Church of Ireland, emphasizing the need for flexibility to adapt to changing times. It discusses the balance between respecting inherited traditions and broadening them to remain relevant. The sermon also highlights the Church's efforts to engage with contemporary issues and maintain its relevance in modern society.",
    "raw_text": "Easter General Vestry 2011\n\nLast Sunday afternoon, Christchurch Cathedral was filled to capacity for the Enthronement of Archbishop Michel Jackson. At the beginning of the Service, in a ceremony that dates back to medieval times, the new Archbishop approaches the Cathedral and knocks on the door. Archbishop Michael veritably struck the door of Christchurch Cathedral with his pastoral staff and the sound reverberated around the Cathedral. I turned to Rev Martha Waller, Curate of Raheny and remarked, 'That sounds like a man who means business.' That sense of purpose ran through the whole of that service: in his invitation to Archbishop Martin not only to attend but also to read the Gospel; his decision not just to invite the representatives of other Christian Churches but also leaders of the Jewish and Islamic communities in Dublin. It also came through in the sermon he preached that day.\n\nIn a ceremony firmly rooted in the traditions of the Church of Ireland, the Archbishop began:\n\n> Flexibility is the companion of tradition, although it does not often come across like that. We must, of course, show appropriate respect for the good things which become ours through inheritance. Yet we cannot simply maintain those things as if their very maintenance is an end in itself and, therefore, constitutes a job well done. In each generation, it is our responsibility to bring the tradition forward to a new place, to make of it a fresh expression of God's presence and God's power, living and working with quite different people and in quite new situations. In this way, the tradition develops the confidence to act in ways appropriate to changed and changing circumstances. This it must do with sure confidence if it is to be a tradition for our time.\n\nThe tradition of the Church of Ireland is a living plant, with its roots in our history, growing and developing towards the future. As a young Bishop of Derry & Raphoe, the then Bishop Robin Eames said, in the Priorities Report, 'Tradition is the servant of the Church not its master.'\n\nEach generation of the Church both receives the tradition and puts its own stamp on that tradition. This is a process that every generation engages in. We see it in the line of editions of the Prayer Book from the original Prayer Book of 1549 down to our current Prayer Book of 2004. We see it in our development of hymnody from the first hymnbooks down to our current hymn book. But these are all continuing processes of taking the best of the past and combining it with the best of each generation. The Liturgical Committee of the Church of Ireland has for example produced a new order for Holy Communion for use when there are a number of children present which we used for the first time on Easter Day. The Church has also announced the beginning of a process of producing a supplement for our current hymn book, whose content was finalised over ten years ago that will reflect some of the developments since that date.\n\nThe Archbishop while stressing the need for the tradition to speak to each generation also warns against ignoring the riches of that tradition. So later on in his sermon he says:\n\n> St John's Gospel shows us something else, that tradition does not and cannot perpetuate itself on its own terms. It must be subjected to changing circumstances and give an account of itself for the greater good. Kicking over the tradition indiscriminately and uncritically, however, is far from helpful – to yourself or indeed to anyone else. It leads to repetitive immaturity.\n\nAnd so I have often said that I have never seen myself as changing the tradition of any Parish I have been in as broadening it.\n\nThe Parish Development Programme in which we participated sees as one of its functions as encouraging this dialogue between the tradition and our contemporary situation. How do we communicate, how do we express the unchanging values of the Gospel in our own generation? In a very different social context, how do we express and experience community in an era of 24 hour news, in an era when the work place (for those who have one) is far more stressed, in an era of social networks such as Facebook that have made community a far more fragile and ill defined concept. This is the era in which young families are raising their children, in which our children are growing up. The Church ignores these developments at its peril.\n\nIn five years we will be celebrating the 150th Anniversary of the Consecration of our Parish Church of St Mary. It was a Church built for its time, reflecting many of the social, theological and liturgical norms of its day. It predated the Disestablishment of the Church of Ireland, the foundation of this State. When it was built the wife was legally a chatel of her husband, women had no role in politics, in the Church, in medicine and the other professions. It was an age of deference. We would have sung the words of Mrs Alexander, 'the rich man in his castle the poor man at his gate, God gave them each their station and ordered their estate.' The side door of the Church did not access a Parish Centre but was rather the door through which the family of the Earl of Howth entered and left the Church. Your Rector would have been a member of the gentry, not the son of an engineering apprentice in the Austin car works in Birmingham.\n\nAs we approach that date we need to not only look at the external fabric of our Church building but, of even greater importance, we need to reflect on the very nature of the Church itself, how we use our building, how we express our worship, how we develop our sense of community, community with each other, community with God.\n\nI would ask you to share with me between now and 2016 in this dialogue between the tradition we have inherited and the evolving situation in which we find ourselves called to witness to the Gospel in the time and place in which God has placed us.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/eastervestry2011.txt",
        "raw_ocr_content": "Page 1 of 10\nEaster General Vestry 2011\nLast Sunday afternoon, Christchurch Cathedral was filled to capacity for the\nEnthronement of Archbishop Michel Jackson . At the beginning of the\nService, in a ceremony that dates back to medieval times the new Archbishop\napproaches the Cathedral and knocks on the door. Archbishop Michael\nveritably struck the door of Christchurch Cathedral with his pastoral staff and\nthe sound reverberated around the Cathedral. I turned to Rev Martha Waller,\nCurate of Raheny and remarked, ‘That sounds like a man who means business.’\nThat sense of purpose ran through the whole of that service: in his invitation to\nArchbishop Martin not only to attend but also to read the Gospel; his decision\nnot just to invite the representatives of other Christian Churches but also\nleaders of the Jewish and Islamic communities in Dublin. It also came through\nin the sermon he preached that day.\nIn a ceremony firmly rooted in the traditions of the Church of Ireland, the\nArchbishop began:\nFlexibility is the companion of tradition, although it does not\noften come across like that. We must, of course, show\nappropriate respect for the good things which become ours\nthrough inheritance. Yet we cannot simply maintain those\nthings as if their very maintenance is an end in itself and,\ntherefore, constitutes a job well done. In each generation, it is\nour responsibility to bring the tradition forward to a new place,\nto make of it a fresh expression of God’s presence and God’s\npower, living and working with quite different people and in\nquite new situations. In this way, the tradition develops the\nconfidence to act in ways appropriate to changed and\nchanging circumstances. This it must do with sure confidence\nif it is to be a tradition for our time.\nThe tradition of the Church of Ireland is a living plant, with its roots in our\nhistory, growing and developing towards the future. As a young Bishop of\nDerry & Raphoe, the then Bishop Robin Eames said, in the Priorities Report,\nPage 2 of 10\nEaster General Vestry 2011\npublished by the General Synod in the late 1970’s: ‘Tradition is the servant of\nthe Church not its master’.\nEach generation of the Church both receives the tradition and puts its own\nstamp on that tradition. This is a process that every generation engages in. We\nsee it in the line of editions of the Prayer Book from the original Prayer Book\nof 1549 down to our current Prayer Book of 2004. We see it in our\ndevelopment of hymnody from the first hymnbooks down to our current hymn\nbook. But these are all continuing processes of taking the best of the past and\ncombining it with the best of each generation. The Liturgical Committee of the\nChurch of Ireland has for example produced a new order for Holy Communion\nfor use when there are a number of children present which we used for the first\ntime on Easter Day. The Church has also announced the beginning of a\nprocess of producing a supplement for our current hymn book, whose content\nwas finalised over ten years ago that will reflect some of the developments\nsince that date. Those of you who attended the workshop conducted by John\nBell will have experienced some of the new material he produced. It is also\nrecognised that the current hymn book does not have reflect the wealth of good\nquality material that has been produced for young children such as is used in\nthe Burrow National School Assemblies.\nThe Archbishop while stressing the need for the tradition to speak to each\ngeneration also warns against ignoring the riches of that tradition. So later on\nin his sermon he says:\nSt John’s Gospel shows us something else, that tradition\ndoes not and cannot perpetuate itself on its own terms. It\nmust be subjected to changing circumstances and give an\nPage 3 of 10\nEaster General Vestry 2011\naccount of itself for the greater good. …….Kicking over\nthe tradition indiscriminately and uncritically, however, is\nfar from helpful – to yourself or indeed to anyone else. It\nleads to repetitive immaturity.\nAnd so I have often said that I have never seen myself as changing the tradition\nof any Parish I have been in as broadening it.\nThe Parish Development Programme in which we participated sees as one of its\nfunctions as encouraging this dialogue between the tradition and our\ncontemporary situation. How do we communicate, how do we express the\nunchanging values of the Gospel in our own generation? In a very different\nsocial context, how do we express and experience community in an era of 24\nhour news, in an era when the work place (for those who have one) is far more\nstressed, in an era of social networks such as Facebook that have made\ncommunity a far more fragile and ill defined concept. This is the era in which\nyoung families are raising their children, in which our children are growing up.\nThe Church ignores these developments at its peril.\nIn five years we will be celebrating the 150th Anniversary of the Consecration of\nour Parish Church of St Mary. It was a Church built for its time, reflecting\nmany of the social, theological and liturgical norms of its day. It predated the\nDisestablishment of the Church of Ireland, the foundation of this State. When it\nwas built the wife was legally a chatel of her husband, women had no role in\npolitics, in the Church, in medicine and the other professions. It was an age of\ndeference. We would have sung the words of Mrs Alexander, ‘the rich man in\nhis castle the poor man at his gate, God gave them each their station and ordered\nPage 4 of 10\nEaster General Vestry 2011\ntheir estate’. The side door of the Church did not access a Parish Centre but was\nrather the door through which the family of the Earl of Howth entered and left\nthe Church. Your Rector would have been a member of the gentry, not the son\nof an engineering apprentice in the Austin car works in Birmingham.\nAs we approach that date we need to not only look at the external fabric of our\nChurch building but, of even greater importance, we need to reflect on the very\nnature of the Church itself, how we use our building, how we express our\nworship, how we develop our sense of community, community with each other,\ncommunity with God.\nI would ask you to share with me between now and 2016 in this dialogue\nbetween the tradition we have inherited and the evolving situation in which we\nfind ourselves called to witness to the Gospel in the time and place in which\nGod has placed us.\nAs is customary, I want to thank a number of people who have served the\nParish over the last year. I thank the outgoing Church Wardens, Mrs Irene\nCollier, who has served for two years as Rector’s Church Warden, and Mrs\nFinola Young, who has served as People’s Church Warden, a position she has\nfilled this position for two years.\nI would like to thank the outgoing Select Vestry for their continued\ncommitment. I would like to thank two individuals for their particular ongoing\ncontribution. I speak of Carolyn for her continuing service as Secretary of our\nSelect Vestry and Tadhg for his services as Treasurer. In the midst of very\nPage 5 of 10\nEaster General Vestry 2011\nheavy professional commitments Tadhg has continued to provide very clear\nand professional advice as we have sought to steer ourselves through these\ntroubled financial times. Carolyn has filled the position of Secretary for a\nnumber of years and has been on the Select Vestry since the time of Canon\nBlennerhassett. She has indicated to me that she would value a chance to step\nback from both these positions for a while. We will have an opportunity to\nexpress our gratitude but I want to take this opportunity to express my own\nthanks for all the hard work and total commitment to everything she has\nundertaken in service of the Parish and the wider Church.\nConcerns regarding fabric have now shifted from the Rectory to our Church\nbuilding. We have been seeing a regular slippage of slates which is to be\nanticipated in a building of this age. Before undertaking a major\nrefurbishment, the Vestry decided to begin the process of making financial\npreparations for this project. Over this last year we have established a specific\nRoof Fund and several people have already begun to make regular\ncontributions in addition to a number of generous lump sum donations. The\nwhole process was kicked off by Finola completing the women’s mini\nmarathon. There has since been a concert organised by Brenda Alexander and\nher team. Shirley Moon has secured the services for a concert by 3rd Day\nChorale in November and we will shortly see stationary designed by Herbert\nAlexander being offered for sale. Donations at Baptisms and Weddings now go\nto the Church Roof Fund.\nThis year our Glebe Wardens, Frank Macnamara and Eddie Kerr have been\nheavily committed to a programme of redecoration of the interior of the\nPage 6 of 10\nEaster General Vestry 2011\nChurch. Beginning with a replacement of the ceilings of the side aisles they\nhave overseen the repainting of the interior and all would agree that the Church\nis now a lot warmer and looks in better shape than it has for a long time.\nI would like to thank Randal Henly for his continued service as both Organist\nand Editor of the Parish Magazine. I would like to thank him and the choir for\nthe lead they give us in our Sunday worship and also the work that goes into\nour special services at Harvest, Christmas and Easter. Randal continues to put\na great deal of energy into the production of the Parish Magazine. I would at\nthe same time like to thank the team of helpers who assemble and distribute the\nmagazine. This year has seen the launching of the Parish Website. I would\nlike to thank Naimh Hopkins for the work she put into designing the website\nand Adele Sleator for overseeing this project on behalf of the Vestry.\nI want to pay a particular tribute to the Sunday School Team. Cathy Fennell\nand Ellen Lennon have given tremendous service over the last three years in\nproviding a programme of activities for our Sunday School and of course two\nremarkable Nativity Plays as well as a development in our Family Services.\nTheir level of commitment, their enthusiasm and simple ‘can do’ attitude has\nbeen wonderful to see. They have indicated that they now wished to step back\nfrom this work and I want to take this opportunity of thanking them for all that\nthey have contributed to the Parish and to the young people over this period.\nSince the last Easter Vestry, we have seen the appointment of Stephen Byford\nas our Youth Worker in succession to Shaz Basdeo. We have been fortunate to\nsecure the services of two such talented individuals as our first two youth\nPage 7 of 10\nEaster General Vestry 2011\nworkers. Stephen has come to us with his own wealth of experience in 3 Rock,\nthe Dublin Diocesan Youth Organisation and has been heavily involved in the\nestablishment of Youth Clubs in the Parish. It has been a real joy to see these\nclubs developing as the young people have responded to his leadership He has\nalso offered assistance in the work of the Sunday School and in the delivery of\nFamily Services. I have really enjoyed working with him in the delivery of our\nConfirmation Classes. He deserves our continued support and encouragement\nin all that he is doing with our young people. I would want to pay particular\ntribute to Louise Fuller in the work she has done in overseeing and\nencouraging Stephen in this work. The establishment of a post of Youth\nWorker has long been a dream for Louise and she has put a huge commitment\ninto ensuring that it yields results. Louise has also been responsible for the\nestablishment and running of our Parent and Toddler Group which meets every\nThursday from 9:30 till 12 and there is also a lovely atmosphere in the Joshua\nRoom.\nAt the other end of the age spectrum we have witnessed the establishment of a\nvery successful Social Group that meets on alternate Tuesday afternoons. One\nTuesday a month the activities are based here in the Parish Centre and on the\nother Tuesday the group have organised a trip. These trips have included visits\nto Dail Eireann, the National Gallery, the Abbey Theatre and the cinema.\nBarbara Sargent has been very active in the establishment and the running of\nthis group. She would now like to step back so we are looking for someone to\nstep forward.\nPage 8 of 10\nEaster General Vestry 2011\nFor a number of years Tom Stanley has faithful operated the Free Will\nOffering Scheme. He has now taken a well earned retirement and he has been\nsucceeded by Mr Denis Headon.\nI would like to thank Cathy Fennell for her continued work in managing our\nParish Centre. She has been very proactive in securing tenants so we have\nmaintained our income from bookings. I would also like to thank Jane\nCaldwell for the quiet efficiency with which she maintains all the necessary\nsupplies for the Parish Centre\nFor the last three years the Parish Fete has been under the very capable\nstewardship of Mrs Helen McVeigh and she has kindly agreed to take\nresponsibility for it this year. Derek Fennell has again been working alongside\nher.\nAn important aspect of our life is fellowship, whether in Church or out of\nChurch. I would like to thank some people in particular. I would like to thank\nDorothy MacCann for her continued work with the midweek coffee – this is a\nlovely opportunity for people to get together for worship and fellowship and\nchat over a cup of coffee. The coffee after Church each Sunday has been\nparticularly appreciated by those new to the Parish, providing as it does a\nchance to meet and establish contact with people in a way you cannot do on\nyour way out of the Church door. Thankyou to Valerie for coordinating this\nand to the ladies who have taken on the job of serving it each Sunday.\nPage 9 of 10\nEaster General Vestry 2011\nEach Sunday as you come into Church, apart from Advent and Lent, you will\nsee floral arrangements in the sanctuary. At Harvest, Christmas and Easter the\nflowers flow over into the main body of the Church. This does not happen by\naccident. I want to thank all who provide flowers in the Church, but I would\nwant to pay particular thanks to Fiona Henderson for work in coordinating all\nthis.\nFor a number of years the Garden of Remembrance was administered by Mr\nAlistair MacMillan who sadly died very suddenly earlier this year. I would\nhope to be able to announce a successor in the near future. Thanks also to my\nStanley McMullen for coordinating the distribution of the Diocesan Review\nand also to Mr Eddie Kerr for looking after the Church of Ireland Gazette.\nAnyone who visits St Mary’s will comment on the beauty of our grounds. I\nwould like to thank two people in particular in this regard. Derek Fennell, in\nhis usual cheerful manner, oversees the cutting of the grass. Then there is Mary\nDownes who coordinates a group who assemble once a month fro two hours on\na Saturday morning to tidy up flower beds etc. There is a great atmosphere at\nthis and Mary provides wonderful home baking and flasks of tea and coffee.\nI would like to take this opportunity to acknowledge the wonderful work done\nby our cleaner, Marita. She really is a gem and we are very fortunate to have\nher.\nIn the past twelve months I have conducted …13 Baptisms and 2 marriages. I\nalso conducted 12 funerals I am pleased to announce that Mrs Shirely Moon\nPage 10 of 10\nEaster General Vestry 2011\nhas kindly agreed to act as my Church Warden for the coming year. Mr Eddie\nKerr has also agreed to continue to act as Rector’s Glebe Warden"
    }
}