{
    "title": "Easter Day 2023",
    "date": "2023-04-09",
    "blurb": "This sermon from Easter Day 2023 reflects on the despair and confusion Mary felt when she found Jesus' tomb empty, and her joy when she realized He had risen. It draws parallels between her journey and our own journeys through doubt, fear, and ultimately faith. The sermon emphasizes the living presence of Christ in our lives, who knows our human experiences and offers hope and purpose.",
    "raw_text": "EASTER DAY – 2023 – St Patrick’s Jordanstown\n\n'Woman, why are you weeping?' Words of an angel, words of a gardener to a woman weeping at a graveside.\n\nIn churches across the land will be singing that triumphant hymn:\n\n> Jesus Christ is risen today, Alleluia!\n> Our triumphant hold day, Alleluia!\n> Who did once upon the cross, Alleluia!\n> Suffer to redeem our loss. Alleluia!\n\nThe Cross is a thing of the past; the work is done, 'It is finished', the task complete, the job is done.\n\nOf course, for Mary coming to the tomb that first Easter morning, the cross was anything but a thing of the past. The memories of watching Jesus die were still raw. She has come to mourn the death of a dear friend, to pay her respects; to be there, as folk often are when they go to a grave, with her memories; memories of acceptance, of inspiration, of friendship; memories of someone who had touched the hearts of those on the margins, who had sat down with sinners, who had touched the leper; who had spoken words of healing and liberation, 'Your sins are forgiven, go and sin no more.'\n\nFinding the tomb open and empty is not at that point a source of joy or hope or celebration, it is an occasion of deep despair and desolation. She now rushes back to the others – you can imagine the panic, the tears. She bursts into the room – 'The grave is empty!!' 'What do you mean, the grave is empty?' 'The grave is empty. The body is gone.'\n\nThe rush back to the tomb; they rush in past Mary. They have a look round then they rush back past her, back to the security of the Upper Room to work out what has happened, what to do next – Mary is left by herself, with her confusion, her despair and her tears.\n\nJohn tells us she looked in the tomb. The body is gone, two angels are sitting where he had been. 'woman, why are you weeping?' 'The body is gone – I don’t know where it is!' And she leaves.\n\nAgain, this time a stranger askes; 'Woman, why are you weeping?' Thinking he was a gardener, she demands; 'Look, if you know where the body is, just tell me and I will take it somewhere else.'\n\nThen she hears her name; 'Mary'. She experiences the presence, a living, personal presence of the one she had followed, had loved, had served, had mourned and wept over. Not just an abstract presence but an awareness of him speaking, comforting, relating to her. Now there is one final journey back to the Upper Room – not in the earlier despair and confusion but one marked by joy and purpose and she declares to the disciples 'I have seen the Lord'\n\nWe’ve thought of those journeys that took place that first Easter morning between the Upper Room and the Tomb. There is another underlying journey – one from despair, through confusion and on into faith. This is where the first Easter experience impinges on my experience, on my life, my concerns, my doubts and fears.\n\nResurrection is about far more than mere resuscitation of a corpse. It is, as Paul will declare to the Corinthians, about a far more glorious life. It is about a living presence of Christ, who knows what it is to be human, what it is to be hurt, to be lonely, to be scared; what it is to die.\n\nWho knows what lies ahead for us in these coming months? There will be those among us who will know sickness, bereavement; who will know what it is to lose the security of employment, of relationship. The Easter faith is about the Christ who comes to us in the garden of our doubt and despair and reveals his presence; it is about the Christ who travels the road of our disappointment and confusion and speaks to us of purpose and hope; it is about the Christ who comes to us when our best efforts have come to nothing and urges us to cast the net one more time into the resources of his plenty. It is about Christ living and present in our lives.\n\nI’ll just close with words from St Patrick’s breastplate as rendered in Hymn 611\n\n> 1 Christ be beside me,\n> Christ be before me,\n> Christ be behind me,\n> King of my heart.\n> Christ be within me,\n> Christ be below me,\n> Christ be above me,\n> never to part.\n\n> 3 Christ be in all hearts thinking about me,\n> Christ be on all tongues telling of me.\n> Christ be the vision in eyes that see me,\n> in ears that hear me,\n> Christ ever be. Hymn 611",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/easter2023.txt",
        "raw_ocr_content": "Page 1 of 3\nEASTER DAY – 2023 – St Patrick’s Jordanstown\n‘Woman, why are you weeping?’ Words of an angel, words of a gardener to a\nwoman weeping at a graveside.\nIn churches across the land will be singing that triumphant hymn:\nJesus Christ is risen today, Alleluia!\nOur triumphant hold day, Alleluia!\nWho did once upon the cross, Alleluia!\nSuffer to redeem our loss. Alleluia!\nThe Cross is a thing of the past; the work is done, ‘It is finished’, the task\ncomplete, the job is done.\nOf course, for Mary coming to the tomb that first Easter morning, the cross was\nanything but a thing of the past. The memories of watching Jesus die were still\nraw. She has come to mourn the death of a dear friend, to pay her respects; to\nbe there, as folk often are when they go to a grave, with her memories;\nmemories of acceptance, of inspiration, of friendship; memories of someone\nwho had touched the hearts of those on the margins, who had sat down with\nsinners, who had touched the leper; who had spoken words of healing and\nliberation, ‘Your sins are forgiven, go and sin no more.’\nFinding the tomb open and empty is not at that point a source of joy or hope or\ncelebration, it is an occasion of deep despair and desolation. She now rushes\nback to the others – you can imagine the panic, the tears. She bursts into the\nroom – ‘The grave is empty!!’ ‘What do you mean, the grave is empty?’ ‘The\ngrave is empty. The body is gone.’\nPage 2 of 3\nEASTER DAY – 2023 – St Patrick’s Jordanstown\nThe rush back to the tomb; they rush in past Mary. They have a look round\nthen they rush back past her, back to the security of the Upper Room to work\nout what has happened, what to do next – Mary is left by herself, with her\nconfusion, her despair and her tears.\nJohn tells us she looked in the tomb. The body is gone, two angels are sitting\nwhere he had been. ‘woman, why are you weeping?’ ‘The body is gone – I\ndon’t know where it is!’ And she leaves.\nAgain, this time a stranger askes; ‘Woman, why are you weeping?’ Thinking\nhe was a gardener, she demands; ‘Look, if you know where the body is, just\ntell me and I will take it somewhere else.’\nThen she hears her name; ‘Mary’. She experiences the presence, a living,\npersonal presence of the one she had followed, had loved, had served, had\nmourned and wept over. Not just an abstract presence but an awareness of him\nspeaking, comforting, relating to her. Now there is one final journey back to the\nUpper Room – not in the earlier despair and confusion but one marked by joy\nand purpose and she declares to the disciples ‘I have seen the Lord’\nWe’ve thought of those journeys that took place that first Easter morning\nbetween the Upper Room and the Tomb. There is another underlying journey –\none from despair, through confusion and on into faith. This is where the first\nEaster experience impinges on my experience, on my life, my concerns, my\ndoubts and fears.\nPage 3 of 3\nEASTER DAY – 2023 – St Patrick’s Jordanstown\nResurrection is about far more than mere resuscitation of a corpse. It is, as\nPaul will declare to the Corinthians, about a far more glorious life. It is about a\nliving presence of Christ, who knows what it is to be human, what it is to be\nhurt, to be lonely, to be scared; what it is to die.\nWho knows what lies ahead for us in these coming months? There will be\nthose among us who will know sickness, bereavement; who will know what it\nis to lose the security of employment, of relationship. The Easter faith is about\nthe Christ who comes to us in the garden of our doubt and despair and reveals\nhis presence; it is about the Christ who travels the road of our disappointment\nand confusion and speaks to us of purpose and hope; it is about the Christ who\ncomes to us when our best efforts have come to nothing and urges us to cast the\nnet one more time into the resources of his plenty. It is about Christ living and\npresent in our lives.\nI’ll just close with words from St Patrick’s breastplate as rendered in Hymn 611\n1 Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part.\n……………………………………\n3 Christ be in all hearts\nthinking about me,\nChrist be on all tongues\ntelling of me.\nChrist be the vision\nin eyes that see me,\nin ears that hear me,\nChrist ever be. Hymn 611"
    }
}