{
    "title": "Reflecting on Change and Faith",
    "date": "2019-04-21",
    "blurb": "In the Easter General Vestry of 2019, Kevin reflects on the past achievements and challenges faced by the church, emphasizing the need for a forward-looking approach. He discusses the decline in church attendance and the rapid societal changes, urging the community to embrace faith and adapt to serve the evolving needs of the parish. Kevin highlights the importance of engaging with the youth, reevaluating worship practices, and being open to change while maintaining the core values of faith and community.",
    "raw_text": "EASTER GENERAL VESTRY – 2019\n\nThis time last year, as we gathered for our Easter General Vestry, we had recently completed the work on the roof of St Mary’s and associated works. We were quite justifiably feeling good about ourselves, with a very positive outcome from our fundraising efforts, and we were back in the Church. Kevin emphasized the need to focus on the future and what lies ahead for us as a Church and as a society.\n\nBefore we embarked on the work on the roof, there was a detailed examination of the structure and a scheme of works drawn up. Resources were identified, and decisions were made to ensure the project's successful conclusion. Kevin often reminds us, 'Fixing the roof has been the easy bit. What goes on under the roof is going to be a harder problem.' As we prepare to tackle that problem, we need an honest appraisal of the issues facing us in the coming years both as a Church and as a society.\n\nKevin points out the changing demographics in the parish, with declining attendance at services and the challenges of maintaining Sunday School. He also notes the societal changes in Ireland, with referenda on marriage equality and abortion signaling massive shifts. The last Census showed that 48% of those aged 25-29 in the Dublin Metropolitan area have no religious affiliation.\n\nThe Parish of Howth is on the brink of a significant population increase, with large apartment developments planned. Kevin asks if the community that comes to Churches seeking meaning will find a welcoming community that embraces their differences. He quotes, 'The times they are a changing,' and asks what resources we bring to these identified issues.\n\nKevin speaks of the faith that God has a purpose for this place and the need to discern God's purposes afresh in every generation. He acknowledges the contributions of the parishioners, the youth, and the building itself, which has stood since 1866. He recounts the history of the church and the adaptability of the community to serve the needs of the time.\n\nThe Select Vestry has decided to merge two separate Sunday services into one at 10:30, continuing past the end of August until December, when the situation will be reviewed. This change aims to respond to varying worship needs and the new population settling in the area.\n\nKevin concludes by thanking various members of the Parish for their service and contributions over the past year. He expresses gratitude to those who have served as Church Wardens, the Select Vestry, the Treasurer, and those involved in music, youth work, the Parish Newsletter, the Fete, and various community groups. He acknowledges the challenges ahead but remains hopeful, stating that the future of the Parish will be different because the world we are moving into is very different, and the Church must speak to that world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/Easter Vestry 2019.txt",
        "raw_ocr_content": "Page 1 of 8\nEASTER GENERAL VESTRY – 2019\nThis time last year, as we gathered for our Easter General Vestry, we had recently\ncompleted the work on the roof of St Mary’s and associated works. We were quite\njustifiably feeling good about ourselves, There had been a very positive outcome\nfrom our fundraising efforts, we had received grant aid from a number of both\nChurch and State bodies and we were back in the Church.\nAs I said at the time, we need to focus on the future and what lies ahead for us as a\nChurch and as a society.\nBefore we embarked on the work on the roof, we spent a great deal of time and\nenergy identifying the nature of the problem that lay before us. So there was a\ndetailed examination of the structure and a scheme of works drawn up, laying out\nthe work that was required and how it would be carried out.\nWe then had to identify what resources were available to us in terms of monies\nalready raised, grants for which we qualified and what was the shortfall. To meet\nthis shortfall, we had to decide would we make a further appeal, would we liquify\nassets, would we seek further borrowing facilities. It was on the basis of all this\npreparatory work, that we were able to bring the project to a successful conclusion.\nAs you are probably tired of me saying, ‘Fixing the roof has been the easy bit. What\ngoes on under the roof is going to be a harder problem.’\nAs we prepare to tackle that problem (and tackle it we must) we need a similarly\nhonest appraisal of the nature of the issues that are facing us in the coming years\nboth as a Church and as a society.\nBeginning with our own Parish. Again I have said a number of times over the years,\n‘Take a look around you in Church and add 10 years to everyone’s age.’ It’s not a\npretty picture. When I first arrived here in 2005, the attendance at the 9:30 was\nconsistently over 40. It would now be 20-25, frequently dipping lower. The\nattendance at the 11:00 would have been 95-100 (with more at the Family Service).\nPage 2 of 8\nEASTER GENERAL VESTRY – 2019\nIt is now down to 50-55 (with Family Service generally drawing in 70-75). Sunday\nSchool is becoming increasing difficult to maintain – not helped by sports clubs\noffering very attractive training programmes for 6 year olds and over on a Sunday\nmorning.\nThe society in which we live is changing rapidly. Since me arrival in 2005, we have\nseen referenda on marriage equality and abortion (with one more coming up on\nFriday) that have signalled massive changes in Irish society that few would have\nforecast even 20 years ago. The last Census returns yield some sobering statistics.\nIn the Dublin Metropolitan area 48% of those in the age range 25-29 returned\nthemselves as having no religious affiliation.\nWe are standing on the brink of a significant increase in the population of both the\nPeninsula and the Baldoyle area of the area covered by this Parish. There are going\nto be large apartment developments in both the Techrete site and in the village. We\nare also seeing an acceleration of construction on the Baldoyle Racecourse site. In\ncommon with other areas people will come to Churches looking for community,\nlooking for meaning in life. Many will have little or no recent experience of Church\nlife. Will they find a community that welcomes them in their difference?\nIn the words of the song of my own youth; ‘The times they are a changing.’\nSo what are the resources that we bring to these issues that we have identified. As\nwe were embarking on our fundraising, one senior member of this Parish, regular in\nworship with a long history of service to this Parish, asked me a fundamental\nquestion. ‘With numbers the way they are going, should we even be doing this?’\nUncomfortable questions do need to be asked. We proceeded on the basis of faith,\nof a conviction that God does have a purpose for this place. So the first resource we\nbring to this is that conviction that God does have a purpose for this place. God’s\npurposes are not static – they need to be discerned afresh in every generation. We\nhave people. We have the people who worship faithfully and we also have people\nwho still want to express an association with this place – people seek baptism for\nPage 3 of 8\nEASTER GENERAL VESTRY – 2019\ntheir children, burial for their loved ones and Christian marriage. It is easy to write\nthem off as ‘four wheel Christians’. When I meet with people in advance of these\nlife marking events, I recognise people who are living very pressurised, exhausting\nlives who are looking for meaning beyond themselves. I never cease to be amazed\nby some of our young people presenting themselves for Confirmation, the questions\nthey ask, their honesty, their zest for life. This year’s group, as part of their\npreparation took on board the problems faced by refugees, organising a coffee\nmorning to raise funds for Tearfund. Last weekend, on Saturday night, a number of\nyoung families who engage with the Church, invited a number of their\ncontemporaries, who have disengaged from the Church to a simple meal in Church\ngrounds – 40 responded and completed a simple survey currently being analysed.\nWe have our faith, we have our people. We also have our building which has stood\nsince 1866. I want to go back to the years before that, to around 1860. The\ncommunity at that time made a decision – they decided to demolish the building\nthey had worshipped in, in which loved ones had been baptised, married and buried\nand build a new one, better suited to the needs of the community. No one is\nsuggesting demolishing St Mary’s! The point I am making is that the community in\n1860 saw the building as serving the community rather that the community serving\nthe building, The community that has worshipped in the present church have made\nchanges since 1866. The present layout of the Chancel area is not the same as in\n1866 – it was changed in memory of a former Sexton. There is of course the\ninstallation of the glass screen to separate off the porch. Then there was the moving\nof the font to the front of the Church enabling the establishment of the side chapel.\nSo we have identified our problems and we have identified our resources. What I\nhave been trying to do is to initiate a conversation within the Parish as to how we\nmove into the future.\nI have spoken of our ongoing decline in numbers at our services. The Select Vestry\nhave, in the light of this continuing decline of numbers, come to the conclusion that\nthe maintenance of two separate, essentially identical, services on a Sunday morning\nPage 4 of 8\nEASTER GENERAL VESTRY – 2019\nwill soon cease to be viable. It has decided that the summer schedule of one service\nat 10:30 will continue past the end of August until December, when the situation\nwill be reviewed. St Ann’s in Dawson Street had a similar schedule of two main\nservices in the morning when I was in training but long ago decided that that was no\nlonger sustainable. I have been holding the Family Service in the Parish Centre. I\nappreciate that there have been some misgivings, but it has been a monthly reminder\nof how nice it was sitting closer together and it has, by far, been our best attended\nservice. In the autumn that service will return to the Church but the distinctive\ncharacter and musical style of that service that has evolved in recent times will be\nmaintained in full. The single service actually gives us the flexibility to respond to\nwhat may be the very varying worship needs of not only those who have disengaged\nfrom Church but who still wish to maintain engagement and also the new, and very\npossibly different, population that is settling on our doorstep.\nThe Select Vestry will also be giving consideration to possible changes in the layout\nof the front of the Church which would enable a degree of flexibility in the use of\nthe Church for different styles of worship a well as for musical events.\n150 years ago, the Church of Ireland faced a fundamental challenge in the\nDisestablishment of our Church, involving loss of wealth, loss of privilege. We\nwere allowed to keep our Churches but had to buy back our Rectories. Many feared\nthat it spelled the end of our Church. There is a table in the See House that came out\nof Gladstone’s house in London bearing the inscription, ‘Around this table\nGladstone and his associates plotted the destruction of the Church of Ireland.’ Our\nChurch responded in faith. There was a huge collection of funds that insured the\nfinancial viability of the Church and we adopted a constitution embodying for its\ntime revolutionary levels of lay involvement in the governance of the Church.\nWe are at a crucial stage in the history of the Parish of Howth. We face into the\nfuture with either faith or fear. There are younger families coming through who will\nensure the future of this Parish. That future will be different because the world into\nPage 5 of 8\nEASTER GENERAL VESTRY – 2019\nwhich we are moving will be very different and the Church, if it is to be faithful to\nthe mission to go into all the world, must speak to that world.\nAs is customary, I want to thank a number of people who have served the Parish\nover the last year. I thank the outgoing Church Wardens, Mr Garrett Wren, who has\nserved as People’s Church Warden, and Mr Derek Robertson, who has served as\nRector’s Church Warden. Derek has acted as a coordinator of a group who have\nacted as Wardens each Sunday\nI would like to thank the outgoing Select Vestry for their continued commitment.\nAs I said this has been a significant year. Issues have been debated thoroughly, all\noptions considered and decisions arrived at after mature reflection – and we still\nmanage to smile! Those who have served on the Select Vestry over the last two\nyears in particular deserve the sincere gratitude of the whole Parish. I would like to\nthank two individuals for their particular ongoing contribution. I speak of Garrett\nWren who has continued to act as Secretary of our Select Vestry. I want to pay a\nspecial tribute to Tadhg in his continuing stewardship of our finances as Treasurer.\nA Treasurer is more than just a book keeper, he has the task of planning for the\nfuture. In the midst of very heavy professional commitments Tadhg has given very\nclear leadership in guiding us through the decision making process, at all times\nensuring the long term financial stability of the Parish.\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will\nOffering Envelopes – he is always ready to respond to requests for new sets of\nenvelopes. I would also like to take this opportunity of thanking those who\ncontribute through this scheme or through standing order. Details of how you can\nparticipate in this are to be found on the small cards in the pews.\nI would like to thank Randal Henly for his continued service as organist. I would\nlike to thank him and the choir for the lead they give us in our Sunday worship and\nalso the work that goes into our special services at Harvest, Christmas and Easter.\nThis year of course we had the RTE broadcast into which Randal and the Choir put\nPage 6 of 8\nEASTER GENERAL VESTRY – 2019\nin a large amount of work – which was much appreciated both inside and outside the\nParish.\nFor this year I have been acting as Editor of the Parish Newsletter, while we review\nthe role and direction of the Newsletter. I would like to thank the team of helpers\nwho assemble and distribute the magazine. That group is getting smaller and there\nis a question over the long term sustainability of continuing the present model of\nproducing the Newsletter. While on the subject of communications, I would like to\nthank Sarah Robertson for continued work on the website. This contains up to date\nnews and items of interest.\nI would also like to thank Rachel and Brenda Alexander for their work in developing\nthe music for the Family Service and the singers who help give a lead. We are\nalways on the look out for further musicians. This service continues to develop and\nI would like to thank those who have made their own contribution in the form of\npuppets etc.\nLouise will be speaking of the wonderful work that is being done by Elke our Youth\nworker in our youth group, confirmation preparation and Sunday Special. I would\nwant to pay particular tribute to Louise Fuller in the work she has done in\ncoordinating the Youth Work Project since its inception. This work has really been\nfundamental to our continued success in this whole project.\nApproaching the month of May means the Fete is nearly upon us. All the\npreparation necessary for this is well under way under the wonderful stewardship of\nCarolyn O’Laoire and Stephen Shaw. This event is not only a major fund raiser for\nthe Parish but is also keenly anticipated as a social event in the Parish and wider\nlocality. All that is now needed is for everyone to gather round in support.\nJackie Lawless continues to organise the Parent and Toddler Group which meets\nevery Thursday from 9:30 till 12. There is also a lovely atmosphere in the Joshua\nRoom. This is a real service being offered to the community at large.\nPage 7 of 8\nEASTER GENERAL VESTRY – 2019\nAt the other end of the age spectrum, our very successful Social Group continues to\nmeet on alternate Tuesday afternoons. One Tuesday a month the activities are based\nhere in the Parish Centre and on the other Tuesday the group have organised a trip.\nDifferent people have offered their services in organising the events in the\nprogramme.\nOn the last Saturday of each month the men of the Parish meet to solve the issues of\nthe day over a breakfast that would send shivers down any dietician’s spine.\nThe Garden Gang continues to thrive under the leadership, or should I say\ncommand, of Lorna Hopkins – new faces very welcome. Thank you also for Derek\nFennell and the team for mowing the grass. Again new faces welcome.\nThen there are those groupings that meet in the Parish, that involve members of the\nParish and enhance the life of the Parish. There is the Mafeking Scout Group that\nmeet here in the Parish Centre, to which so many of our young people belong, and\nwho provide wonderful help at the time of the Fete. There is the Bridge Club that\nmeets here on a Wednesday night that has its own unique friendly atmosphere and\nmakes significant annual contribution to our Parish Funds. There is the St Mary’s\nGolf Society that over the years has organised three competitions a year, a\nwonderful camaraderie and over the years has contributed to the finances of the\nParish. Then there is the Art Group that meets on a Friday morning.\nRector’s Church Warden Mr Derek Robertson\nRector’s Glebe Warden: Mr Ian Malcolm\nBaptisms 7\nMarriages None\nPage 8 of 8\nEASTER GENERAL VESTRY – 2019\nDeaths Tim Callan, Norman Green, Eileen Holland, Adrienne Cox, Pat Trayer"
    }
}