{
    "title": "Easter Day 2021",
    "date": "2021-04-04",
    "blurb": "This sermon reflects on the meaning of Easter and the concept of resurrection. It emphasizes that resurrection is not just an event that happened to Jesus, but also an event that happened to his disciples. The sermon also discusses the sacrament of Baptism and its close relation to the death and resurrection of Jesus.",
    "raw_text": "I remember one Easter when I was in Mountmellick going to visit a retired priest in hospital. We had established a friendship early in my time there. He had left Clonaslee (a village that formed part of my Parish) and spent his entire ministry in Birmingham, finishing up as Parish Priest of a Church not far from the part of Birmingham I came from. I had left Birmingham and found myself as Rector of the village of Clonaslee.\n\nThis was the first Easter Sunday since his ordination that he had not celebrated the Eucharist. In the course of our chat he came out with an expression that has stayed with me. ' We are,' he said, 'an Easter people.' I have often reflected upon that since. Today we celebrate the Resurrection of our Lord Jesus Christ.\n\nThe Church is a fellowship that is shaped, that has its very origins in the death and resurrection of Jesus. Resurrection is not just an event that happened to Jesus, it is an event that happened to his disciples.\n\nThis morning in the sacrament of Baptism we join with Sharon on this the day of her Baptism. In the New Testament Baptism is very closely related to the death and resurrection of Jesus.\n\nPaul, writing to the Church at Rome, declared:\n\n> 3 Do you not know that all of us who have been baptised into Christ Jesus were baptised into his death? 4 Therefore we have been buried with him by baptism into death, so that, just as Christ was raised from the dead by the glory of the Father, so we too might walk in newness of life. Romans 6:3\n\nAs I often remark, resurrection is not just something that happened to Jesus, it was something that happened to his disciples. What are we saying when we say that resurrection was something that happened to the disciples? First of all, the experience of resurrection, their meeting with the risen Jesus changed them, motivated them, empowered them to go and spread the Good news.\n\nBut there was more to it than that. The disciples came to understand the resurrection not just in terms of new life for Jesus but new life for them. Just as death no longer had ultimate power over Jesus, death no longer had ultimate power over them. In the resurrection new life is released into the world. For Paul, his own experience of encounter with the risen Christ meant nothing less than a new beginning. In writing to the Galatians he declares:\n\n> 'I have been crucified with Christ and it is no longer I who live but it is Christ who lives in me. And the life I live now in the flesh I live by faith in the Son of God, who loved me and gave himself for me.' (Gal 2: 19-20)\n\nThis journey from death to life is the journey of a lifetime, a Journey of drawing closer to Christ, who loved me and gave himself for me.\n\nOur Gospel reading closes with the Risen Jesus sending Mary Magdalene back to the disciples to share the news of the resurrection. She had gone once to the disciples with news of the Empty Tomb - she now returns with news of resurrection. That has been the primary purpose of the Church - to be a community with a message - 'Christ is risen'; to be the Body of Christ, a people through whom and in whom the risen Christ lives and acts in the world of today.\n\nThis is what we are called to in Baptism. May Sharon come to fulfill that in her own life in whatever situation God places her. May she join with us in living out the words of Teresa of Avila:\n\n> \"He has no hands but ours ... He has no feet but ours .. ,\nHe has no lips but ours to speak his word in the world of today ... '\n\nMay we be truly an Easter people - showing something of the life and power of the risen Christ in the world of today.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/easterday2021.txt",
        "raw_ocr_content": "Page 1 of 2\nEASTER DAY 2021\nI remember one Easter when I was in Mountmellick going to visit a retired\npriest in hospital. We had established a friendship early in my time there. He\nhad left Clonaslee (a village that formed part of my Parish) and spent his entire\nministry in Birmingham, finishing up as Parish Priest of a Church not far from\nthe part of Birmingham I came from. I had left Birmingham and found myself\nas Rector of the village of Clonaslee.\nThis was the first Easter Sunday since his ordination that he had not celebrated\nthe Eucharist. In the course of our chat he came out with an expression that has\nstayed with me. ' We are,' he said, 'an Easter people.' I have often reflected\nupon that since. Today we celebrate the Resurrection of our Lord Jesus Christ.\nThe Church is a fellowship that is shaped, that has its very origins in the death\nand resurrection of Jesus. Resurrection is not just an event that happened to\nJesus, it is an event that happened to his disciples.\nThis morning in the sacrament of Baptism we join with Sharon on this the day\nof her Baptism. In the New Testament Baptism is very closely related to the\ndeath and resurrection of Jesus.\nPaul, writing to the Church at Rome, writing to the Church at Rome, declared:\n3 Do you not know that all of us who have been baptised into Christ\nJesus were baptised into his death? 4 Therefore we have been buried\nwith him by baptism into death, so that, just as Christ was raised from\nthe dead by the glory of the Father, so we too might walk in newness\nof life. Romans 6:3\nAs I often remark, resurrection is not just something that happened to Jesus, it\nwas something that happened to his disciples. What are we saying when we say\nthat resurrection was something that happened to the disciples? First of all, the\nexperience of resurrection, their meeting with the risen Jesus changed them,\nPage 2 of 2\nEASTER DAY 2021\nmotivated them, empowered them to go and spread the Good news.\nBut there was more to it than that. The disciples came to understand the\nresurrection not just in terms of new life for Jesus but new life for them. Just as\ndeath no longer had ultimate power over Jesus, death no longer had ultimate\npower over them. In the resurrection new life is released into the world. For\nPaul, his own experience of encounter with the risen Christ meant nothing less\nthan a new beginning. In writing to the Galatians he declares:\n'I have been crucified with Christ and it is no longer I who live but it is Christ\nwho lives in me. And the life I live now in the flesh I live by faith in the Son of\nGod, who loved me and gave himself for me.' (Gal 2: 19-20)\nThis journey from death to life is the journey of a lifetime, a Journey of\ndrawing closer to Christ, who loved me and gave himself for me.\nOur Gospel reading closes with the Risen Jesus sending Mary Magdalene back\nto the disciples to share the news of the resurrection. She had gone once to the\ndisciples with news of the Empty Tomb - she now returns with news of\nresurrection. That has been the primary purpose of the Church - to be a\ncommunity with a message - 'Christ is risen'; to be the Body of Christ, a people\nthrough whom and in whom the risen Christ lives and acts in the world of\ntoday.\nThis is what we are called to in Baptism. May Sharon come to fulfill that in her\nown life in whatever situation God places her. May she join with us in living\nout the words of Teresa of Avila:\n\"He has no hands but ours ... He has no feet but ours .. ,\nHe has no lips but ours to speak his word in the world of today ... '\nMay we be truly an Easter people - showing something of the life and power of\nthe risen Christ in the world of today."
    }
}