{
    "title": "Transition and Engagement",
    "date": "2015-04-05",
    "blurb": "The Rector's address at the Easter Vestry 2015 reflected on the Parish's period of transition as it approached its 150th anniversary. He acknowledged the loss of faithful members and a decline in attendance and income. However, he highlighted the strength of the Youth Worker Programme and the reintroduction of the Sunday School. He emphasized the importance of younger families engaging in parish roles and concluded by appointing new wardens for the year.",
    "raw_text": "Rector's Address\n\nIn his address, the Rector reviewed the recent past of the Parish. He noted that the Parish, as it approaches the 150th Anniversary of the Consecration of St Mary's, is in a period of transition. In the past year, the Parish had mourned the passing of several faithful members and had experienced a decline in attendance at some of our morning services and reduction in our income. The continued strength of the Youth Worker Programme under the leadership of Elke Koker was noted. The development of the Family Service and the role of the singing group were welcomed, as they enabled a wider range of music at this service. The reintroduction of the Sunday School under the leadership of Elke Koker, assisted by parents, and the level of support it received was also highlighted.\n\nAs we move into the next era in the history of our parish, the need for younger families to engage and take up the roles played by the older generation was emphasized. The Rector thanked the various people who have worked so hard in a voluntary capacity in the service of the Parish. He concluded his address by announcing that Mr Denis Headon had agreed to act as Rector's Church Warden for the coming year and that Stephen Shaw had agreed to act as Rector's Glebe Warden.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/Easter Vestry 2015 - summary.txt",
        "raw_ocr_content": "Rector’s Address\nIn his address, which is attached as an addendum to these minutes, the Rector reviewed the recent past of\nthe Parish. He noted that the Parish, as it approaches the 150th Anniversary of the Consecration of St\nMary’s, is in a period of transition. In the past year the Parish had mourned the passing of several faithful\nmembers and had experienced a decline in attendance at some of our morning services and reduction in\nour income. We have seen the continued strength of the Youth Worker Programme under the leadership\nof our current Youth Worker, Elke Koker. He welcomed the continued development of the Family\nService and the role of the singing group that has enabled us to widen the range of music played at this\nservice. He also welcomed the reintroduction of the Sunday School under the leadership of Elke Koker,\nassisted by parents and the level of support this has received. As we move into the next era in the history\nof our parish he spoke of the need for younger families to engage and take up the roles played the older\ngeneration.\nHe then thanked the various people who have worked so hard in a voluntary capacity in the service of the\nParish.\nHe concluded his address in announcing that Mr Denis Headon had agreed to act as Rector’s Church\nWarden for the coming year and that Stephen Shaw had agreed to act as Rector’s Glebe Warden."
    }
}