{
    "title": "Easter Vestry 2020",
    "date": "2020-04-12",
    "blurb": "The sermon discusses the impact of the Covid-19 pandemic on the church and the community. It highlights the changes in worship, education, social development, and business. The sermon also pays tribute to individuals who have served the Parish over the last year and discusses the future of the church in these challenging times.",
    "raw_text": "Welcome to a very different Easter General Vestry Meeting. So much has changed since the initial lockdown on 15th March in the way we have had to manage our life as a Parish, as a Church.\n\nIn fact Covid 19 is the overarching issue that is determining everything else – how to live through it, with it, protect ourselves against it. We have seen the impact it has had on the life of whole communities. The impact on our young people, their education, their social development, their physical and mental well being.\n\nWe have seen the impact it has had on the older generation. We are still seeing the negative effects of cocooning on those living alone, their isolation has been intensified leaving lost lasting impact on physical and mental well being.\n\nWe have also seen the impact all this has had on business and commercial life. It has gone on for much longer than anticipated so some of the changes we have seen are going to be long lasting. More people are going to work from home – there are going to be plus and minuses in that calculation on the impact it could have on work life balance. There has been a knock on effect on the hospitality sector with city centre offices now empty.\n\nOur Schools have suffered a huge impact. The issue of Leaving Cert results, progression on to 3rd level still playing itself out. Children in National School have lost out on those great moments marking end of school activities and Confirmation. Though in the last few days we have heard of arrangements the Archbishop is putting in place to hold Confirmation Services on a reduced scale.\n\nI want to pay particular tribute to how the Burrow School, staff, parents, pupils navigated the period of closure and home schooling, the imaginative way in which online technology was used to maintain our children’s education. The return to School, which was faced with a mixture of anticipation and anxiety, has gone well, again thanks to the cooperation of staff, parents and pupils but in particular the in depth preparation by the staff over the summer months.\n\nAnd of course, Church itself has been very different. I have been very encouraged in which people have looked after each other, from helping with shopping to simply keeping in touch. But we have lost the informal coming together over coffee after Church, the Wednesday service, the Men’s Breakfast, the Tuesday Social Group, our Youth Group that provided places, occasions for simple conversations and mutual support and encouragement. This emphasises the importance of keeping an eye out for each other.\n\nOf course, worship as we knew it came to a sudden halt with the lockdown on March 15th. At a stroke, we lost our Sunday Services with their diet of word, music and prayer – simply being together for worship. We lost our traditional Holy Week and Easter Services We all had to learn new skills – and fast. Most of us had never heard of Zoom – it became the only opportunity for live, corporate worship. YouTube became our other platform for worship, with simple acts of worship recorded and posted on our own YouTube channel, ‘Howth Parish’ But it never was, and indeed never could be the same.\n\nThen on July 5th, our Church re-opened for public worship. There was a great deal of nervousness around this – could it be safe, could we ever celebrate Holy Communion in the present crisis? We received detailed advice from both national and church authorities. The Select Vestry, meeting on Zoom, gave a great deal of thought to all this. I would want to pay a particular tribute to Denis Headon for the thoroughness with which he thought all this through, his procurement of signage. Then, along with Garrett Wren, the Church was prepared for our first service. They offered a warm and sensitive welcome, directing people to their places and putting them at their eaze. Once we were back a couple of weeks, we tackled the issue of Holy Communion – boy, is it different to what we have been used to – no kneeling at the rails, use of wafers instead of bread; we decided that it was important to maintain receiving the wine as well as the bread – again it is wonderful what the imagination and sensitivity of the team made possible. I would want to thank the congregation for their total cooperation with these new arrangements.\n\nWe lost Easter. Harvest and Christmas are going to be very different and we are already trying to work out how this can be managed. Just as society is probably never going to quite the same for some considerable time, Church is going to be different. In society the move towards a greater number of people working from home has undoubtedly been accelerated. Over these past few months we have of necessity learned new skills that we were going to have to learn anyway as the Church responds to the very different circumstances of the 21st Century. The way we worship, the way we communicate the Gospel has changed. I have been encouraged by the wide variety of people both inside and outside the Parish have responded to what we have put up on Facebook and YouTube. Whatever normal we return to it will certainly be different to the normal we left behind on the 15th March.\n\nAs is customary, I want to thank a number of people who have served the Parish over the last year. I thank the outgoing Church Wardens, Mr Garrett Wren, who has served as People’s Church Warden, and Mr Denis Headon, who took over as Rector’s Church Warden.\n\nI would like to thank the outgoing Select Vestry for their continued commitment. This has been a very challenging year. We have navigated ourselves through to the end of the roof restoration project – including the archaeology. I want at this stage to say a profound thank you to Mr Paul McMahon who gave us detailed legal advice at no cost to the Parish. As a result the a very heavy financial obligation that the State tried to impose on us has been recognised as fundamentally unjust. It has been my experience of all Select Vestries during my time that issues have been debated thoroughly, all options considered and decisions arrived at after mature reflection – and we still manage to smile! Of course once lock down happened to had to move onto Zoom – where would we have been without Zoom. Those who have served on the Select Vestry over the last two years in particular deserve the sincere gratitude of the whole Parish. I would like to thank two individuals for their particular ongoing contribution. I speak of Garrett Wren who has continued to act as Secretary of our Select Vestry. This year Garrett took on the task of arranging our voting procedures for a time when the maximum attendance at any indoor meeting was 6. His attention to detail in setting up the procedures and the thoroughness and sensitivity with which they were operated is a testimony to the cheerful efficiency he brings to both his professional life and his service of the Church. I want to pay a special tribute to Tadhg in his continuing stewardship of our finances as Treasurer. A Treasurer is more than just a book keeper, he has the task of planning for the future. In the midst of very heavy professional commitments Tadhg has given very clear leadership in guiding us through the very difficult and challenging decisions that both the outgoing and incoming Select Vestries have and will have to make to ensure both the long term mission and the long term financial stability of the Parish.\n\nFor the last number of years, Ian Malcolm has served as Glebe Warden. During this time he has had oversight of the maintenance 37 St Fintans Park. A role he has fulfilled with his characteristic self effacing humour and attention to detail.\n\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will Offering Envelopes. I would also like to take this opportunity of thanking those who contribute through this scheme or through standing order. Details of how you can participate in this are to be found at the foot of any email you receive from the Parish.\n\nI would like to thank Randal Henly for his continued service as organist. Randal, I know, really missed the organ during the lock down and we are grateful for his provision of reflective music to accompany our services since the resumption of public worship.\n\nThe Newsletter is at something of a cross roads. Since the lock down, it has not been possible to produce our normal style of newsletter. Even before the lockdown we were having increasing difficulty in bringing the group to assemble it. Fred Spendlove, after many years of organising the advertising, has indicated that he wishes to relinquish this role. He is very keen that the contribution of our advertisers over the years is acknowledged. So one of the issues facing the new Select Vestry will be that of communication in these very different times.\n\nI would like to thank our Youth Worker Elke for all her work as Youth Worker in our Parish. She has been an invaluable help in preparing our young people for Confirmation. Assisted by Sarah Stanley, she has developed our Youth Group into a wonderful place in which our young people can enjoy themselves and reflect on issues of life and faith. She has brought her wonderful gifts to bear on using modern technology to help our young people stay connected and to participate in our online and YouTube worship.\n\nI would want to pay particular tribute to Louise Fuller in the work she has done in coordinating the Youth Work Project since its inception. Louise has indicated that she would like to begin to step back from this. She has shown remarkable resilience through these last 15 years, I’ve seen her in tears, I have seen her laugh, I have seen her rueful smile – we all have benefited from her vision and clarity of thought.\n\nOver this last year Hyewon McMurtry has organised the Parent and Toddler Group which meets every Thursday from 9:30 till 12. There is also a lovely atmosphere in the Joshua Room. This is a real service being offered to the community at large which unfortunately has had to be put into abeyance.\n\nThe Garden Gang continues to thrive under the leadership, or should I say command, of Lorna Hopkins – new faces very welcome. Thank you also for Derek Fennell and the team for mowing the grass. Again, new faces welcome.\n\nCathy Fennell continues to look after our Parish Centre. Denis Headon has brought his Covid skills, honed to perfection in the Church to bear on preparing the Centre for the new season. Most of the activities, the Bridge Club, the different activities for young people are simply not able to happen. Cathy has a wonderful can-do approach and I know that she is trying to think of ways in which, in full compliance with regulations, at least some groups may resume activities.\n\nBaptisms 6\nMarriages 2\nDeaths Anna Kay, Sheila Morrison, Mary Smeed, Elsie Campbell.\nA memorial service was held for Christopher Wren.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/Easter Vestry 2020.txt",
        "raw_ocr_content": "Page 1 of 6\nEASTER GENERAL VESTRY – online reports - 2020\nWelcome to a very different Easter General Vestry Meeting. So much has\nchanged since the initial lockdown on 15th March in the way we have had to\nmanage our life as a Parish, as a Church.\nIn fact Covid 19 is the overarching issue that is determining everything else –\nhow to live through it, with it, protect ourselves against it.\nWe have seen the impact it has had on the life of whole communities. The\nimpact on our young people, their education, their social development, their\nphysical and mental well being.\nWe have seen the impact it has had on the older generation. We are still seeing\nthe negative effects of cocooning on those living alone, their isolation has been\nintensified leaving lost lasting impact on physical and mental well being.\nWe have also seen the impact all this has had on business and commercial life.\nIt has gone on for much longer than anticipated so some of the changes we\nhave seen are going to be long lasting. More people are going to work from\nhome – there are going to be plus and minuses in that calculation on the impact\nit could have on work life balance. There has been a knock on effect on the\nhospitality sector with city centre offices now empty.\nOur Schools have suffered a huge impact. The issue of Leaving Cert results,\nprogression on to 3rd level still playing itself out. Children in National School\nhave lost out on those great moments marking end of school activities and\nConfirmation. Though in the last few days we have heard of arrangements the\nArchbishop is putting in place to hold Confirmation Services on a reduced\nscale.\nPage 2 of 6\nEASTER GENERAL VESTRY – online reports - 2020\nI want to pay particular tribute to how the Burrow School, staff, parents, pupils\nnavigated the period of closure and home schooling, the imaginative way in\nwhich online technology was used to maintain our children’s education. The\nreturn to School, which was faced with a mixture of anticipation and anxiety,\nhas gone well, again thanks to the cooperation of staff, parents and pupils but\nin particular the in depth preparation by the staff over the summer months.\nAnd of course, Church itself has been very different. I have been very\nencouraged in which people have looked after each other, from helping with\nshopping to simply keeping in touch. But we have lost the informal coming\ntogether over coffee after Church, the Wednesday service, the Men’s\nBreakfast, the Tuesday Social Group, our Youth Group that provided places,\noccasions for simple conversations and mutual support and encouragement.\nThis emphasises the importance of keeping an eye out for each other.\nOf course, worship as we knew it came to a sudden halt with the lockdown on\nMarch 15th. At a stroke, we lost our Sunday Services with their diet of word,\nmusic and prayer – simply being together for worship. We lost our traditional\nHoly Week and Easter Services We all had to learn new skills – and fast. Most\nof us had never heard of Zoom – it became the only opportunity for live,\ncorporate worship. YouTube became our other platform for worship, with\nsimple acts of worship recorded and posted on our own YouTube channel,\n‘Howth Parish’ But it never was, and indeed never could be the same.\nThen on July 5th, our Church re-opened for public worship. There was a great\ndeal of nervousness around this – could it be safe, could we ever celebrate\nHoly Communion in the present crisis? We received detailed advice from both\nnational and church authorities. The Select Vestry, meeting on Zoom, gave a\ngreat deal of thought to all this. I would want to pay a particular tribute to\nDenis Headon for the thoroughness with which he thought all this through, his\nPage 3 of 6\nEASTER GENERAL VESTRY – online reports - 2020\nprocurement of signage. Then, along with Garrett Wren, the Church was\nprepared for our first service. They offered a warm and sensitive welcome,\ndirecting people to their places and putting them at their eaze. Once we were\nback a couple of weeks, we tackled the issue of Holy Communion – boy, is it\ndifferent to what we have been used to – no kneeling at the rails, use of wafers\ninstead of bread; we decided that it was important to maintain receiving the\nwine as well as the bread – again it is wonderful what the imagination and\nsensitivity of the team made possible. I would want to thank the congregation\nfor their total cooperation with these new arrangements.\nWe lost Easter. Harvest and Christmas are going to be very different and we\nare already trying to work out how this can be managed. Just as society is\nprobably never going to quite the same for some considerable time, Church is\ngoing to be different. In society the move towards a greater number of people\nworking from home has undoubtedly been accelerated. Over these past few\nmonths we have of necessity learned new skills that we were going to have to\nlearn anyway as the Church responds to the very different circumstances of the\n21st Century. The way we worship, the way we communicate the Gospel has\nchanged. I have been encouraged by the wide variety of people both inside and\noutside the Parish have responded to what we have put up on Facebook and\nYouTube. Whatever normal we return to it will certainly be different to the\nnormal we left behind on the 15th March.\nAs is customary, I want to thank a number of people who have served the\nParish over the last year. I thank the outgoing Church Wardens, Mr Garrett\nWren, who has served as People’s Church Warden, and Mr Denis Headon, who\ntook over as Rector’s Church Warden.\nI would like to thank the outgoing Select Vestry for their continued\ncommitment. This has been a very challenging year. We have navigated\nPage 4 of 6\nEASTER GENERAL VESTRY – online reports - 2020\nourselves through to the end of the roof restoration project – including the\narchaeology. I want at this stage to say a profound thank you to Mr Paul\nMcMahon who gave us detailed legal advice at no cost to the Parish. As a\nresult the a very heavy financial obligation that the State tried to impose on us\nhas been recognised as fundamentally unjust. It has been my experience of all\nSelect Vestries during my time that issues have been debated thoroughly, all\noptions considered and decisions arrived at after mature reflection – and we\nstill manage to smile! Of course once lock down happened to had to move onto\nZoom – where would we have been without Zoom. Those who have served on\nthe Select Vestry over the last two years in particular deserve the sincere\ngratitude of the whole Parish. I would like to thank two individuals for their\nparticular ongoing contribution. I speak of Garrett Wren who has continued to\nact as Secretary of our Select Vestry. This year Garrett took on the task of\narranging our voting procedures for a time when the maximum attendance at\nany indoor meeting was 6. His attention to detail in setting up the procedures\nand the thoroughness and sensitivity with which they were operated is a\ntestimony to the cheerful efficiency he brings to both his professional life and\nhis service of the Church. I want to pay a special tribute to Tadhg in his\ncontinuing stewardship of our finances as Treasurer. A Treasurer is more than\njust a book keeper, he has the task of planning for the future. In the midst of\nvery heavy professional commitments Tadhg has given very clear leadership in\nguiding us through the very difficult and challenging decisions that both the\noutgoing and incoming Select Vestries have and will have to make to ensure\nboth the long term mission and the long term financial stability of the Parish.\nFor the last number of years, Ian Malcolm has served as Glebe Warden.\nDuring this time he has had oversight of the maintenance 37 St Fintans Park.\nA role he has fulfilled with his characteristic self effacing humour and attention\nto detail.\nPage 5 of 6\nEASTER GENERAL VESTRY – online reports - 2020\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will\nOffering Envelopes. I would also like to take this opportunity of thanking\nthose who contribute through this scheme or through standing order. Details of\nhow you can participate in this are to be found at the foot of any email you\nreceive from the Parish.\nI would like to thank Randal Henly for his continued service as organist.\nRandal, I know, really missed the organ during the lock down and we are\ngrateful for his provision of reflective music to accompany our services since\nthe resumption of public worship.\nThe Newsletter is at something of a cross roads. Since the lock down, it has\nnot been possible to produce our normal style of newsletter. Even before the\nlockdown we were having increasing difficulty in bringing the group to\nassemble it. Fred Spendlove, after many years of organising the advertising,\nhas indicated that he wishes to relinquish this role. He is very keen that the\ncontribution of our advertisers over the years is acknowledged. So one of the\nissues facing the new Select Vestry will be that of communication in these very\ndifferent times.\nI would like to thank our Youth Worker Elke for all her work as Youth Worker\nin our Parish. She has been an invaluable help in preparing our young people\nfor Confirmation. Assisted by Sarah Stanley, she has developed our Youth\nGroup into a wonderful place in which our young people can enjoy themselves\nand reflect on issues of life and faith. She has brought her wonderful gifts to\nbear on using modern technology to help our young people stay connected and\nto participate in our online and YouTube worship.\nI would want to pay particular tribute to Louise Fuller in the work she has done\nin coordinating the Youth Work Project since its inception. Louise has\nPage 6 of 6\nEASTER GENERAL VESTRY – online reports - 2020\nindicated that she would like to begin to step back from this. She has shown\nremarkable resilience through these last 15 years, I’ve seen her in tears, I have\nseen her laugh, I have seen her rueful smile – we all have benefited from her\nvision and clarity of thought.\nOver this last year Hyewon McMurtry has organised the Parent and Toddler\nGroup which meets every Thursday from 9:30 till 12. There is also a lovely\natmosphere in the Joshua Room. This is a real service being offered to the\ncommunity at large which unfortunately has had to be put into abeyance.\nThe Garden Gang continues to thrive under the leadership, or should I say\ncommand, of Lorna Hopkins – new faces very welcome. Thank you also for\nDerek Fennell and the team for mowing the grass. Again, new faces welcome.\nCathy Fennell continues to look after our Parish Centre. Denis Headon has\nbrought his Covid skills, honed to perfection in the Church to bear on preparing\nthe Centre for the new season. Most of the activities, the Bridge Club, the\ndifferent activities for young people are simply not able to happen. Cathy has a\nwonderful can-do approach and I know that she is trying to think of ways in\nwhich, in full compliance with regulations, at least some groups may resume\nactivities.\nBaptisms 6\nMarriages 2\nDeaths Anna Kay, Sheila Morrison, Mary Smeed, Elsie Campbell.\nA memorial service was held for Christopher Wren."
    }
}