{
    "title": "Gratitude and Parish Development",
    "date": "2010-04-04",
    "blurb": "Kevin reflects on the contributions of various parish members and the progress of the parish over the past year. He expresses gratitude to those who have served in different capacities and highlights the importance of youth engagement and parish development. The sermon also touches on the economic downturn's impact on the community and the church's response to provide support.",
    "raw_text": "## Easter General Vestry – 2010\n\nAs is customary, I want to begin my address with a number of thank you's to people who have served the Parish over the last year. I thank the outgoing Church Wardens, Mrs Shirley Moon, and Mrs Finola Young. Last year, when no one came forward to take on these positions, they very generously undertook to serve a second year – for that I have been extremely grateful.\n\nI would like to thank the outgoing Select Vestry for their continued commitment. This has been the first year for some time when the Rectory project has not dominated our business and we have been free to begin reflecting on wider issues such as Parish development and our ministry to young people. I would like to thank two individuals for their particular ongoing contribution. I speak of Carolyn for her continuing service as Secretary of our Select Vestry and Tadhg for his services as Treasurer.\n\nIn September 2005 the then Select Vestry asked Mr Denis Henderson to coordinate the Rectory Project. As I have already said this project has now come to a conclusion. I would want again to take this opportunity to thank Denis for the huge commitment of time and energy he has brought to this project.\n\nI would like to thank Randal Henly for his continued service as both Organist and Editor of the Parish Magazine. I would like to thank him and the choir for the lead they give us in our Sunday worship and also the work that goes into our special services at Harvest, Christmas and Easter.\n\nI want to pay a particular tribute to the Sunday School Team. This year we have been blessed by the presence of Shaz Basdeo, our Youth Worker among us. She not only brought her own skills and energy but has that particular gift of being able to energise others and we have seen the fruits of that in the Family Services and of course the Nativity. Unfortunately, Shaz is having to leave us to resume her studies in Trinity but in the short time she was with us she has made a huge contribution to the life of this Parish.\n\nI would also like to thank Mr Tom Stanley who has faithfully operated the Free Will Offering Scheme for several years. Tom has reached a point where he would like to stand down from this. I have mentioned this before and no one has come forward – please think again.\n\nAnyone who visits St Mary’s will comment on the beauty of our grounds. I would like to thank two people in particular in this regard. Derek Fennell has now taken over from Troy the job of coordinating the cutting of the grass from Troy Hopkins. Our thanks are due to Troy for the work he has put into this in the past.\n\nEarlier in these comments I mentioned that among the issues being addressed by the Select Vestry has been the issue of parish Development. This arose out of our participation in a Church of Ireland Parish development Conference last September. You may recall a series of meetings that were held around Lent and Easter last year in which groups were invited to look at different areas of Parish life and reflect on our strengths and areas of need.\n\nOne other issue I want to address before I finish concerns the recent economic downturn that has impacted on every aspect of Irish society. All of us know families that have been affected in terms of salary cuts, unemployment, negative equity, reduced income from investments.\n\nIn the past twelve months I have conducted 17 Baptisms but no marriages. I also conducted 5 funerals. This year we mourn the passing of Pamela Blandford, Rosemary Walton, Jenny Newell, Peter Holmes and Jack Maguinness. We also mourn the recent passing of Derek McCullough, formally very active in the life of this Parish.\n\nI am pleased to announce that Mrs Irene Collier has kindly agreed to act as my Church Warden for the coming year. Mr Ian Malcolm has indicated that he would like to stand down as Rector’s Glebe Warden – I have not as yet managed to secure a replacement.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/eastervestry2010.txt",
        "raw_ocr_content": "Page 1 of 6\nEaster General Vestry – 2010\nAs is customary, I want to begin my address with a number of thankyou’s to people who\nhave served the Parish over the last year. I thank the outgoing Church Wardens, Mrs\nShirley Moon, who has served for two years as Rector’s Church Warden, and Mrs Finola\nYoung, who has served as People’s Church Warden. Last year, when no one came\nforward to take on these positions, they very generously undertook to serve a second year\n– for that I have been extremely grateful.\nI would like to thank the outgoing Select Vestry for their continued commitment. This has\nbeen the first year for some time when the Rectory project has not dominated our business\nand we have been free to begin reflecting on wider issues such as Parish development and\nour ministry to young people. I would like to thank two individuals for their particular\nongoing contribution. I speak of Carolyn for her continuing service as Secretary of our\nSelect Vestry and Tadhg for his services as Treasurer. This has been a particularly heavy\nyear for Tadhg as much has fallen on him as he has sought to guide the Vestry through\nthese difficult financial times.\nIn September 2005 the then Select Vestry asked Mr Denis Henderson to coordinate the\nRectory Project. As I have already said this project has now come to a conclusion. I\nwould want again to take this opportunity to thank Denis for the huge commitment of time\nand energy he has brought to this project. At some stage in the not too distant future we\nare going to have to turn our attention to the condition of the Church building itself. Some\nremedial work has been carried out (I would want to thank Ian Malcolm for overseeing\nthis) but there is no point spending large sums until the root cause of the problems is\ntackled.\nI would like to thank Randal Henly for his continued service as both Organist and Editor\nof the Parish Magazine. I would like to thank him and the choir for the lead they give us\nin our Sunday worship and also the work that goes into our special services at Harvest,\nChristmas and Easter. Randal continues to put a great deal of energy into the production\nPage 2 of 6\nEaster General Vestry – 2010\nof the Parish Magazine. I would at the same time like to thank the team of helpers who\nassemble and distribute the magazine.\nI want to pay a particular tribute to the Sunday School Team. This year we have been\nblessed by the presence of Shaz Basdeo, our Youth Worker among us. She not only\nbrought her own skills and energy but has that particular gift of being able to energise\nothers and we have seen the fruits of that in the Family Services and of course the\nNativity. Unfortunately Shaz is having to leave us to resume her studies in Trinity but in\nthe short time she was with us she has made a huge contribution to the life of this Parish.\nIt is for us to build on what she has started among us. The Select Vestry made the decision\nthat this post will continue and the position of part time Youth Worker has been advertised\nand candidates have already been interviewed. This year, following representation from\nparents, we took the step of preparing youngsters for Confirmation during their final year\nin the Burrow School and this groups is now continuing to meet as a Youth Club on\nTuesday evenings. We would anticipate a similar size group being presented for\nConfirmation next year which gives us a good size core group for future youth work in the\nParish. In this regard the continuation of the post of youth worker is crucial and I would\nwant to thank the Select Vestry for continuing to see this as a priority. We are blessed in\nthe number of children we have in the Parish and the parents who are keen to see their\nchildren involved in the life of the Parish. Another lovely development this year has been\nthe establishment of a Mother & Toddler Group within the Parish. This meets every\nThursday between 10 and 12. Depending on the level of support we would hop that this\nwould continue next year. I am always encouraged by the numbers who come out to the\nChildren’s Nativity, the Family Service on Christmas Day as well as those who come out\non Easter Day. We must however realise that the presence of a Youth Worker does not\nmean that we do not need volunteers to continue to work with our children.\nI would also like to thank Mr Tom Stanley who has faithfully operated the Free Will\nOffering Scheme for several years. Tom has reached a point where he would like to stand\nPage 3 of 6\nEaster General Vestry – 2010\ndown from this. I have mentioned this before and no one has come forward – please think\nagain.\nI would like to thank Cathy Fennell has now taken up this position and I would like to\nthank Cathy the work she has already put into managing our Parish Centre. She has been\nvery proactive in securing tenants so we have maintained our income from bookings I\nwould also like to thank Jane Caldwell for the quiet efficiency with which she maintains\nall the necessary supplies for the Parish Centre\nFor the last two years the Parish Fete has been under the very capable stewardship of Mrs\nHelen McVeigh and she has kindly agreed to take responsibility for it this year. Derek\nFennell is working alongside her this year but we will need a new organiser for next year.\nAn important aspect of our life is fellowship, whether in Church or out of Church. I would\nlike to thank some people in particular. I would like to thank Dorothy MacCann for her\ncontinued work with the midweek coffee – this is a lovely opportunity for people to get\ntogether for worship and fellowship and chat over a cup of coffee. We are now serving\ncoffee after Church every Sunday. This has been particularly appreciated by those new to\nthe Parish, providing as it does a chance to meet and establish contact with people in a way\nyou cannot do on your way out of the Church door. Thankyou to Valerie for coordinating\nthis and to the ladies who have taken on the job of serving it each Sunday.\nEach Sunday as you come into Church, apart from Advent and Lent, you will see floral\narrangements in the sanctuary. At Harvest, Christmas and Easter the flowers flow over\ninto the main body of the Church. This does not happen by accident. I want to thank all\nwho provide flowers in the Church, but I would want to pay particular thanks to Fiona\nHenderson for work in coordinating all this.\nI would like also to thank Mr Alistair Macmillan for his stewardship of the records of the\nGarden of Remembrance. Thanks also to my Stanley McMullen for coordinating the\nPage 4 of 6\nEaster General Vestry – 2010\ndistribution of the Diocesan Review and also to Mr Eddie Kerr for looking after the\nChurch of Ireland Gazette.\nAnyone who visits St Mary’s will comment on the beauty of our grounds. I would like to\nthank two people in particular in this regard. Derek Fennell has now taken over from Troy\nthe job of coordinating the cutting of the grass from Troy Hopkins. Our thanks are due to\nTroy for the work he has put into this in the past. We have recently obtained a container\nwhich has been placed in Church grounds. The purpose of this is to store the mowers and\nother equipment for maintaining the grounds. This will make the whole job of maintaing\nthe grounds easier and hopefully encourage more people to volunteer their time. Then\nthere is Mary Downes who coordinates a group who assemble once a month fro two hours\non a Saturday morning to tidy up flower beds etc. There is a great atmosphere at this and\nMary provides wonderful home baking and flasks of tea and coffee.\nI would like to take this opportunity to acknowledge the wonderful work done by our\ncleaner, Marita. She really is a gem and we are very fortunate to have her.\nEarlier in these comments I mentioned that among the issues being addressed by the Select\nVestry has been the issue of parish Development. This arose out of our participation in a\nChurch of Ireland Parish development Conference last September. You may recall a series\nof meetings that were held around Lent and Easter last year in which groups were invited\nto look at different areas of Parish life and reflect on our strengths and areas of need. We\nrecognised as one of our strengths that this is a warm and welcoming community. in the\ncontext of that we recognised a number of areas that would need attention. We recognised\nthat we did have a problem engaging with the younger generation and this is reflected in\nour worshipping congregation. We also recognised that while we are a welcoming\ncommunity we provide few opportunities for people to meet and socialise on an informal\nbasis. We have the facilities here – we need to think how we can use them. People also\nexpressed a desire for opportunities for to their faith in the context of groups. There was\nPage 5 of 6\nEaster General Vestry – 2010\nalso a desire to provide ways in which people could offer service both within and outside\nthe Parish community.\nWe have made a good start on our work with young people. The year Shaz has spent with\nus has energised our whole approach in this area. We now need to apply our minds and\nenergies to those other needs we have identified. Over the last number of years a number\nof meeting points within the Parish have gone. We used to have a Mothers’ Union. The\nBurrow Players have ceased to operate. The monthly Whist Drive is currently in\nabeyance. These in the past have helped provide the glue that keeps a community\ntogether, providing opportunities of fellowship – in a increasingly disjointed society\nfellowship, community is one of the gifts we can offer. A number of people are currently\nlooking at ways in which we re-develop this glue I was talking about. A number of\nsuggestions have already been made, regular social dances, walking group – other people\nwill have their own suggestions.\nAnother area currently under exploration in the area of service. The Burrow School has a\ncomputer suite – possibility of computer classes.\nIn the area of spirituality. We are considering running a Network Course in the autumn –\nan avenue within which people can explore their own particular gifting within the life of\nthe Church.\nPlace within the life of the Church for a variety of groups to explore ideas.\nTroy and a group of others are keen to explore the whole area of prayer support.\nOne other issue I want to address before I finish concerns the recent economic downturn\nthat has impacted on every aspect of Irish society. All of us know families that have been\naffected in terms of salary cuts, unemployment, negative equity, reduced income from\ninvestments.\nPage 6 of 6\nEaster General Vestry – 2010\nArchbishops will shortly be announcing a major appeal being organised through Protestant\nAid to provide funds for the increased calls that have been made and are likely to be made.\nDetails will be distributed through the next issue of the Newsletter.\nIn the past twelve months I have conducted 17 Baptisms but no marriages. I also\nconducted 5 funerals, This year we mourn the passing of Pamela Blandford, Rosemary\nWalton, Jenny Newell, Peter Holmes and Jack Maguinness. We also mourn the recent\npassing of Derek McCullough, formally very active in the life of this Parish.\nI am pleased to announce that Mrs Irene Collier has kindly agreed to act as my Church\nWarden for the coming year. Mr Ian Malcolm has indicated that he would like to stand\ndown as Rector’s Glebe Warden – I have not as yet managed to secure a replacement."
    }
}