{
    "title": "Cycle of Life",
    "date": "2021-01-26",
    "blurb": "This sermon, delivered at the funeral of Mrs Susan Magan, reflects on the cycle of life, drawing parallels between the rhythms of gardening and human existence. It emphasizes the importance of letting go, and the hope of a fuller life beyond death. The sermon also pays tribute to Susan's quiet and reserved nature, her love for her garden, and her special memories of summers in Kerry.",
    "raw_text": "We gather here today in Dardistown for the Funeral of Susan Magan. But for Covid 19, this service would have taken place in St Mary’s where Susan worshipped. True to her nature as a very private person she would have slipped in and out. Here may friends would have joined you her family to thank God for Susan and to support you, her immediate family, in your loss.\n\nFunerals are always occasions of parting, so there is a sadness that one who we loved, who loved us has now died. So today we remember Jane and Arthur and the wider family.\n\nWe gather with our memories of Sarah, as mother, grandmother, friend. We gather also to set her life, her death, our hopes for her in the context of our faith, her faith. We remember. You her immediate family will have your own very special memories of her and I invite you to just hold them before God.\n\nSusan had been born in Hampshire; her father was based in Portsmouth during his service in the Navy. The family finally settled in Howth in 1976 and it is here the Susan and her husband made their home.\n\nShe is remembered as a quiet and reserved person. She would often speak of the summers spent down in the cottage in Kerry with the family – that was clearly a special place for her. One group she did enjoy was Iris Seymour’s art group, only stopping in recent times. Though I gather that the family saw very little of her work.\n\nShe did enjoy her garden. One of the features of a garden is the whole matter of seasonality. There is a time to plant, a time for harvesting, a time for pruning, for digging something out.\n\nWe have just read that passage from Ecclesiastes that talks of the cycle of life:\n\n> For everything there is a season, and a time for every matter under heaven:\n> a time to be born, and a time to die;\n> a time to plant, and a time to pluck up what is planted;\n\nThis cycle is part of the rhythm of life. I think one of the biggest lessons in life is coming to terms with this cycle that is our mortality, feeling in tune with that, at ease in that cycle.\n\nAs she worked in her garden, Susan will have understood the lesson of the seed. The seed, seemingly so insignificant, so vulnerable, contains within it all the potential of the magnificent plant. But before that can happen, we have to let go of the seed, bury it in the earth, before the full potential of the seed can be realised.\n\nIn John’s Gospel reading, Jesus spoke of this same process of seed, of planting, of letting go.\n\n> 24Very truly, I tell you, unless a grain of wheat falls into the earth and dies, it remains just a single grain; but if it dies, it bears much fruit.\n> 25Those who love their life lose it, and those who hate their life in this world will keep it for eternal life. John 12:24,25\n\nIt is in this process of losing and finding, of letting go that we find our true selves.\n\nYou as a family are having to let go. It is our hope and prayer and trust that the one we have let go has entered into that fuller life that God has prepared for us all, where there is no more sorrow, no more separation from those who have gone before – only peace in the closer presence of God.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Elsie Campbell.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mrs Susan Magan – 26th January 2021 - Dardistown\nWe gather here today in Dardistown for the Funeral of Susan Magan. But for\nCovid 19, this service would have taken place in St Mary’s where Susan\nworshipped. True to her nature as a very private person she would have\nslipped in and out. Here may friends would have joined you her family to\nthank God for Susan and to support you, her immediate family, in your loss.\nFunerals are always occasions of parting, so there is a sadness that one who we\nloved, who loved us has now died. So today we remember Jane and Arthur\nand the wider family.\nWe gather with our memories of Sarah, as mother, grandmother, friend. We\ngather also to set her life, her death, our hopes for her in the context of our\nfaith, her faith. We remember. You her immediate family will have your own\nvery special memories of her and I invite you to just hold them before God\nSusan had been born in Hampshire; her father was based in Portsmouth during\nhis service in the Navy. The family finally settled in Howth in 1976 and it is\nhere the Susan and her husband made their home.\nShe is remembered as a quiet and reserved person. She would often speak of\nthe summers spent down in the cottage in Kerry with the family – that was\nclearly a special place for her. One group she did enjoy was Iris Seymour’s art\ngroup, only stopping in recent times. Though I gather that the family saw very\nlittle of her work.\nShe did enjoy her garden. One of the features of a garden is the whole matter\nof seasonality. There is a time to plant, a time for harvesting, a time for\npruning, for digging something out.\nPage 2 of 3\nFuneral of Mrs Susan Magan – 26th January 2021 - Dardistown\nWe have just read that passage from Ecclesiastes that talks of the cycle of life:\nFor everything there is a season, and a time for every\nmatter under heaven:\na time to be born, and a time to die;\na time to plant, and a time to pluck up what is planted;\nThis cycle is part of the rhythm of life. I think one of the biggest lessons in life\nis coming to terms with this cycle that is our mortality, feeling in tune with\nthat, at ease in that cycle.\nAs she worked in her garden, Susan will have understood the lesson of the\nseed. The seed, seemingly so insignificant, so vulnerable, contains within it all\nthe potential of the magnificent plant. But before that can happen, we have to\nlet go of the seed, bury it in the earth, before the full potential of the seed can\nbe realised\nIn John’s Gospel reading, Jesus spoke of this same process of seed, of planting,\nof letting go.\n24Very truly, I tell you, unless a grain of wheat falls into the earth and\ndies, it remains just a single grain; but if it dies, it bears much fruit.\n25Those who love their life lose it, and those who hate their life in this\nworld will keep it for eternal life. John 12:24,25\nIt is in this process of losing and finding, of letting go that we find our true\nselves.\nYou as a family are having to let go. It is our hope and prayer and trust that the\none we have let go has entered into that fuller life that God has prepared for us\nall, where there is no more sorrow, no more separation from those who have\ngone before – only peace in the closer presence of God.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nPage 3 of 3\nFuneral of Mrs Susan Magan – 26th January 2021 - Dardistown\nwhat is thine is ours also if we are thine. And life is eternal and love\nis immortal, and death is only an horizon, and an horizon is nothing\nsave the limit of our sight. Lift us up, strong Son of God, that we\nmay see further; cleanse our eyes that we may see more clearly; and\ndraw us closer to thyself that we may know ourselves to be nearer to\nour loved ones who are with thee. And while thou dost prepare for\nus, prepare us also for that happy place, that where they are and thou\nart, we too may be for evermore."
    }
}