{
    "title": "The Transformation of Simon",
    "date": "2012-01-22",
    "blurb": "This sermon explores the transformation of Simon into Peter, as told in the Gospel of Mark. It uses the metaphor of an egg hatching into a swan to illustrate the potential for change and growth within each individual. The sermon emphasizes that God sees beyond our external appearances and values the inherent goodness within us.",
    "raw_text": "Epiphany 3 - 2012 – Year B - Family Eucharist\n\n'You are Simon – you will be called Peter.' This is from John’s account of the calling of Simon that we read from Mark’s Gospel. What was the difference between the Simon that Jesus first encountered and the Peter at the end of the story.\n\nTo set our thoughts on their way; take a look at this egg. If you were to find something like this in a nest (and you are never, ever to take a egg out of a nest), what do you think would be inside it? Let us have a look at this short video clip.\n\nShow video of hatching swan\n\nI am now just going to ask a couple of people a question so could I have a couple of volunteers:\n\nAsk each of them what they want to be when they are older\n\nDo they now look like a ………….\n\nMaybe not – but there is a ………. lurking inside them waiting to come out\n\nDoes anyone remember their Baptism? (Someone may say yes)\n\nAt your Baptism, either Canon Hyland or myself will have said this prayer for you as your parents and godparents stood around this font holding you in their arms:\n\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\n\nThere is something special about each one of you – I am not talking about the fact you are pretty, or clever, or good at sport. The Bible says that we are all made in the image of God – what that is saying is that there is a bit of God in each one of us – we can hide it at times selfishness, pride, greed – but that bit of God is still there - and God sees it.\n\nWhen Samuel was choosing a new King of Israel from among the sons of Jesse he was going to go for the tallest, the strongest but, in the story in the Old Testament, he hears God saying to him, ‘Man looks at the outside – God looks at the heart.’\n\nIn our Old Testament Lesson we have the story of Jonah preaching to the people of Nineveh. Nineveh was a pretty grim place – in truth Jonah probably liked the idea of God punishing them. The story tells us that Nineveh had a change of heart and they were not punished – God saw beyond the disobedience to something that was good. Jonah was confused, even angry with God.\n\nAs Simon came towards Jesus that day, other people would have seen a big fisherman, not the most important on the social scale of that day, probably a rough manner and accent. But Jesus looked beyond that – he saw the Peter inside, the Peter he knew he could be, would be. The rest of Simon’s life was a process of changing from the Simon he was into the Peter God intended him to be.\n\nThere is something special to God about each person here. A big part of the Christian life is discovering that, building on that, becoming the person God wants us to be.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany32012fameuch.txt",
        "raw_ocr_content": "Page 1 of 3\nEpiphany 3 - 2012 – Year B - Family Eucharist\nNeed in advance – an egg; video clip of hatching swan/ ; hand held microphone\n‘You are Simon – you will be called Peter.’ This is from John’s account of the\ncalling of Simon that we read from Mark’s Gospel. What was the difference\nbetween the Simon that Jesus first encountered and the Peter at the end of the\nstory.\nTo set our thoughts on their way; take a look at this egg. If you were to find\nsomething like this in a nest (and you are never, ever to take a egg out of a\nnest), what do you think would be inside it? Let us have a look at this short\nvideo clip.\nShow video of hatching swan\nI am now just going to ask a couple of people a question so could I have a\ncouple of volunteers:\nAsk each of them what they want to be when they are older\nDo they now look like a ………….\nMaybe not – but there is a ………. lurking inside them\nwaiting to come out\nDoes anyone remember their Baptism? (Someone may say yes)\nAt your Baptism, either Canon Hyland or myself will have said this prayer for\nyou as your parents and godparents stood around this font holding you in their\narms:\nPage 2 of 3\nEpiphany 3 - 2012 – Year B - Family Eucharist\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\nThere is something special about each one of you – I am not talking about the\nfact you are pretty, or clever, or good at sport. The Bible says that we are all\nmade in the image of God – what that is saying is that there is a bit of God in\neach one of us – we can hide it at times selfishness, pride, greed – but that bit\nof God is still there - and God sees it.\nWhen Samuel was choosing a new King of Israel from among the sons of Jesse\nhe was going to go for the tallest, the strongest but, in the story in the Old\nTestament, he hears God saying to him, ‘Man looks at the outside – God looks\nat the heart.’\nIn our Old Testament Lesson we have the story of Jonah preaching to the\npeople of Nineveh. Nineveh was a pretty grim place – in truth Jonah probably\nliked the idea of God punishing them. The story tells us that Nineveh had a\nchange of heart and they were not punished – God saw beyond the\ndisobedience to something that was good. Jonah was confused, even angry\nwith God.\nAs Simon came towards Jesus that day, other people would have seen a big\nfisherman, not the most important on the social scale of that day, probably a\nrough manner and accent. But Jesus looked beyond that – he saw the Peter\ninside, the Peter he knew he could be, would be. The rest of Simon’s life was\na process of changing from the Simon he was into the Peter God intended him\nto be.\nPage 3 of 3\nEpiphany 3 - 2012 – Year B - Family Eucharist\nThere is something special to God about each person here. A big part of the\nChristian life is discovering that, building on that, becoming the person God\nwants us to be."
    }
}