{
    "title": "The Gift of Prophecy",
    "date": "2010-01-31",
    "blurb": "This sermon discusses the spiritual gift of prophecy, often misunderstood as foretelling the future. It emphasizes that prophecy is about seeing events and people as God sees them, recognizing the significance of events, and declaring this to those who listen. It also highlights the importance of love in the Christian faith, without which all other gifts are meaningless.",
    "raw_text": "Over the last two weeks we have been reflecting on spiritual gifts, their variety and place within the life of the Church. One of those that frequently appears in the lists of spiritual gifts is that of prophecy.\n\nThis must be one of the most misunderstood words in the biblical vocabulary. In fundamentalist circles it is often seen in term of foretelling the future, reducing the scriptures to a sort of spiritual Old Moore’s Almanac. Following this line of thought obscure texts, taken out of their context are deemed to refer to specific events, often implying that the world is about to come to a speedy and dramatic end – generally to the detriment of a group other than your own.\n\nProphecy is much more about seeing events, seeing people differently. Seeing events, seeing situations as God sees them. It is about recognising, recognising significance of events. The prophets not only recognises, he or she then declares this to those who care to listen. The role of the prophet is often a lonely one, very often not a particularly welcome one.\n\nIn our Old Testament lesson the prophet Ezekiel speaks of a vision of the glory of the Lord filling the Temple. This is in the context of an earlier vision of the glory of the Lord leaving the Temple in Jerusalem. This is all part of a powerful reflection by the prophet on the rapidly deteriorating social and religious fabric of Jerusalem in the period leading up to the fall of the city to the invading Babylonians and the subsequent exile.\n\nGoing to our Gospel reading, approaching as we are the Feast of the presentation of Christ in the Temple, is that delightful account in St Luke’s Gospel of Mary and Joseph bringing their first born child to dedicate him to the Lord, and with that the response of Simeon and Anna when they see the child.\n\nI want to hang to this fundamental vocation of the prophet, this idea of seeing situations, people, circumstances as they really are, sensing God present and active in the world and calling on others to do the same.\n\nOver the last couple of weeks we have been reading chapter 12 of Paul’s 1st Letter to the Church at Corinth in which he has reflected on various gifts of the Spirit and their place within the life of the Church. He then goes on to urge his readers to strive for the greatest gift – we have before us Paul’s wonderful exposition of Christian love. Love, without which all other gifts are meaningless, noisy gongs or clanging cymbals.\n\nIt is through and in love that we get a deeper insight into ourselves; it is a gift of spiritual growth as Paul uses that image of seeing in a mirror, dimly.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/Epiphany 4 - 2010.txt",
        "raw_ocr_content": "Page 1 of 3\n4th Sunday of Epiphany – 2010 – year C\nOver the last two weeks we have been reflecting on spiritual gifts, their variety and place\nwithin the life of the Church. One of those that frequently appears in the lists of spiritual\ngifts is that of prophecy.\nThis must be one fo the most misunderstood words in the biblical vocabulary. In\nfundamentalist circles it is often seen in term of foretelling the future, reducing the\nscriptures to a sort of spiritual Old Moore’s Almanac. Following this line of thought\nobscure texts, taken out of their context are deemed to refer to specific events, often\nimplying that the world is about to come to a speedy and dramatic end – generally to the\ndetriment of a group other than your own.\nProphecy is much more about seeing events, seeing people differently. Seeing events,\nseeing situations as God sees them. It is about recognising, recognising significance of\nevents. The prophets not only recognises, he or she then declares this to those who care to\nlisten. The role of the prophet is often a lonely one, very often not a particularly welcome\none. In this regard, I often think back on words of a former member of Ahoghill Parish,\nthe late Terrence O’Neill, prior to the last election he fought as Prime Minister of Northern\nIreland. ‘Ulster stands at a cross roads and Ulster will have to choose.’ His society was\nnot ready to listen and thousands have reaped the consequences.\nin our Old Testament lesson the prophet Ezekiel speaks of a vision of the glory of the Lord\nfilling the Temple. This is in the context of an earlier vision of the glory of the Lord\nleaving the Temple in Jerusalem. This is all part of a powerful reflection by the prophet\non the rapidly deteriorating social and religious fabric of Jerusalem in the period leading\nup to the fall of the city to the invading Babylonians and the subsequent exile. The\ndeparture of God’s glory, leaving the city to the consequences of apostasy, is a picture of\ndivine judgement on a broken and failing society. The corresponding vision of the glory\nof God returning to the Temple is an affirmation that God’s purposes, even in judgement\nare for the ultimate redemption and healing.\nPage 2 of 3\n4th Sunday of Epiphany – 2010 – year C\nGoing to our Gospel reading, approaching as we are the Feast of the presentation of Christ\nin the Temple, is that delightful account in St Luke’s Gospel of Mary and Joseph bringing\ntheir first born child to dedicate him to the Lord, and with that the response of Simeon and\nAnna when they see the child. In the context of the scene they would not have been the\nonly ones in the Temple that day when May and Joseph appeared with their new born son.\nSome, wrapped up in their own concerns, will not have noticed them, others may have\npaused to admire. But Simeon and Anna, alone among the crowd, see not just a child but\nthe child, sensing in this child the fulfilment of all their expectations. In a way that defied\ndefinition, they sensed that God was in this child – they had a sense of the glory of the\nLord entering the Temple.\n“Sovereign Lord, as you have promised,\nyou now dismiss your servant in peace.\nFor my eyes have seen your salvation,\nwhich you have prepared in the sight of all people,\na light for revelation to the Gentiles\nand for glory to your people Israel.”\nI want to hang to this fundamental vocation of the prophet, this idea of seeing situations,\npeople, circumstances as they really are, sensing God present and active in the world and\ncalling on others to do the same. I then want to move on to the portion set for the 2nd\nLesson today on our lesson sheets. Over the last couple of weeks we have been reading\nchapter 12 of Paul’s 1st Letter to the Church at Corinth in which he has reflected on\nvarious gifts of the Spirit and their place within the life of the Church. He then goes on to\nurge his readers to strive for the greatest gift – we have before us Paul’s wonderful\nexposition of Christian love. Love, without which all other gifts are meaningless, noisy\ngongs or clanging cymbals.\nI recall a woman in Ahoghill whose marriage I had celebrated a couple of years\npreviously, telling me how on occasion she would go into what she called her huffing\ncorner and reflect on this passage that had been read at her wedding. ‘Love is patient,\nlove is kind, love never takes offence ..’\nPage 3 of 3\n4th Sunday of Epiphany – 2010 – year C\nIt is through and in love that we get a deeper insight into ourselves; it is a gift of spiritual\ngrowth as\nPaul uses that image of seeing in a mirror, dimly"
    }
}