{
    "title": "Power of the Spirit",
    "date": "2013-01-06",
    "blurb": "This sermon, delivered on the 1st Sunday after the Epiphany in 2013, discusses the power of the Holy Spirit and its role in the world. The sermon draws parallels between the power of natural phenomena like lightning and the power of the Holy Spirit, emphasizing the Spirit's unpredictability and potential for massive impact. It also highlights the role of the Church in pointing to Christ and the Spirit's role in guiding and empowering the Church.",
    "raw_text": "1st Sunday after the Epiphany – 2013 – year C\n\nAs I was reading through the Irish Times on Friday, I came across an article speculating as to whether this coming year is going to be one of the hottest on record. We have an endless fascination with the weather. Of course if you lived in Australia or the south west of England such interest in future trends is only too understandable in the face of the extremes of the weather. Our Psalm this morning is obviously inspired by the whole phenomenon of lightening, the sudden flash of lightening, the clap of thunder that seems to come out of the blue. There is something really impressive about lightening – the electrical energy released is massive and can cause huge damage to trees and buildings. This sort of power is obviously on the mind of the writer of Psalm 29.\n\nOur Old Testament and Gospel passages each in their own way speak of a power, simmering below the surface, waiting to be released into the world. The writer of our passage from Isaiah speaks of God’s coming act of liberation, of redemption, of a people released from captivity returning to the land of their forefathers. In our Gospel reading, as the crowds who came out to see him speculate as to whether John is the expected Messiah, John himself speaks of the one who will come. John baptised with water; the one who will follow will baptise with the Holy Spirit and with fire. Our Psalm and lessons speak each in their own idiom of latent power ready to be released.\n\nIn the Sundays of Advent, we heard much of the ministry of John the Baptist, as one sent to prepare the way for the coming of the Messiah. Today, the first Sunday after the Epiphany marks something of a transition as John slips into the background and Jesus comes to the fore. As part of that transition John points to Jesus, making the distinction, ‘I baptise with water, the one who is coming, … he will baptise with the Holy Spirit and with fire.’ He points to Jesus as one through whom God is acting in the world. And a specific aspect of that is the Spirit.\n\n'Spirit’ is a word we use to translate the Hebrew word ‘ruach’ and Greek word ‘pneuma’. Both has connotations of wind. Wind, by definition, is hard to define – where does it come from, where is it going. The wind is something to be harnessed, something to be followed but never to be controlled or constrained. Sometimes it is powerful, sometimes it is gentle – always elusive.\n\nThis is very much the tone of the New Testament references to this Holy Spirit with which Jesus is to baptise. The Spirit descends on Jesus as a dove. The disciples receive it as the breath of the risen Christ yet it comes with wind and flame at Pentecost. The Spirit is to lead the disciples into all truth, will give them the power to witness. The Spirit is the Spirit of life, of truth. The Spirit is promised as Advocate and Guide. The Spirit, like the wind is not to be constrained, controlled by any categories we may seek to place upon it.\n\nAs John in his own day was to point his contemporaries to Jesus, so the Church, in our own day, is to point to Christ. Just as John pointed to one greater than himself so the Church must always remember that the Church, her traditions, her heritage are never greater than the Christ she proclaims. The One John was pointing to was not a ‘gentle Jesus, meek and mild’ but one who was coming to cleanse, to challenge, to redeem, to reclaim for God the world into which he was born. The Church is the Body of Christ, the Servant of Christ, the hands, the feet, the lips of Christ in the world of today. As such it is a community empowered and directed by the Spirit, a community open to and responsive to the Spirit, called to proclaim Christ afresh to each generation.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany12013.txt",
        "raw_ocr_content": "Page 1 of 3\n1st Sunday after the Epiphany – 2013 – year C\nAs I was reading through the Irish Times on Friday, I came across an\narticle speculating as to whether this coming year is going to be one of\nthe hottest on record. We have an endless fascination with the\nweather. Of course if you lived in Australia or the south west of\nEngland such interest in future trends is only too understandable in the\nface of the extremes of the weather. Our Psalm this morning is\nobviously inspired by the whole phenomenon of lightening, the\nsudden flash of lightening, the clap of thunder that seems to come out\nof the blue. There is something really impressive about lightening –\nthe electrical energy released is massive and can cause huge damage\nto trees and buildings. This sort of power is obviously on the mind of\nthe writer of Psalm 29\nthe God of | glory | thunders; @\n5 The voice of the Lord | breaks the | cedar trees; @\n7 The voice of the Lord splits the flash of lightning;\n8. The voice of the Lord makes the oak trees writhe\nand strips the | forests | bare; @\nOur Old Testament and Gospel passages each in their own way speak\nof a power, simmering below the surface, waiting to be released into\nthe world. The writer of our passage from Isaiah speaks of God’s\ncoming act of liberation, of redemption, of a people released from\ncaptivity returning to the land of their forefathers. In our Gospel\nreading, as the crowds who came out to see him speculate as to\nwhether John is the expected Messiah, John himself speaks of the one\nPage 2 of 3\n1st Sunday after the Epiphany – 2013 – year C\nwho will come. John baptised with water; the one who will follow\nwill baptise with the Holy Spirit and with fire. Our Psalm and lessons\nspeak each in their own idiom of latent power ready to be released.\nIn the Sundays of Advent, we heard much of the ministry of John the\nBaptist, as one sent to prepare the way for the coming of the Messiah.\nToday, the first Sunday after the Epiphany marks something of a\ntransition as John slips into the background and Jesus comes to the\nfore. As part of that transition John points to Jesus, making the\ndistinction, ‘I baptise with water, the one who is coming, … he will\nbaptise with the Holy Spirit and with fire.’ He points to Jesus as one\nthrough whom God is acting in the world. And a specific aspect of\nthat is the Spirit.\n‘Spirit’ is a word we use to translate the Hebrew word ‘ruach’ and\nGreek word ‘pneuma’. Both has connotations of wind. Wind, by\ndefinition, is hard to define – where does it come from, where is it\ngoing. The wind is something to be harnessed, something to be\nfollowed but never to be controlled or constrained. Sometimes it is\npowerful, sometimes it is gentle – always elusive.\nThis is very much the tone of the New Testament references to this\nHoly Spirit with which Jesus is to baptise. The Spirit descends on\nPage 3 of 3\n1st Sunday after the Epiphany – 2013 – year C\nJesus as a dove. The disciples receive it as the breath of the risen\nChrist yet it comes with wind and flame at Pentecost. The Spirit is to\nlead the disciples into all truth, will give them the power to witness.\nThe Spirit is the Spirit of life, of truth. The Spirit is promised as\nAdvocate and Guide. The Spirit, like the wind is not to be\nconstrained, controlled by any categories we may seek to place upon\nit.\nAs John in his own day was to point his contemporaries to Jesus, so\nthe Church, in our own day, is to point to Christ. Just as John pointed\nto one greater than himself so the Church must always remember that\nthe Church, her traditions, her heritage are never greater than the\nChrist she proclaims. The One John was pointing to was not a ‘gentle\nJesus, meek and mild’ but one who was coming to cleanse, to\nchallenge, to redeem, to reclaim for God the world into which he was\nborn. The Church is the Body of Christ, the Servant of Christ, the\nhands, the feet, the lips of Christ in the world of today. As such it is a\ncommunity empowered and directed by the Spirit, a community open\nto and responsive to the Spirit, called to proclaim Christ afresh to each\ngeneration."
    }
}