{
    "title": "Understanding Prophecy",
    "date": "2010-01-31",
    "blurb": "The sermon explores the concept of prophecy, often misunderstood as foretelling the future. Instead, it's about seeing events and people as God does, recognizing the significance of events, and declaring it to those who listen. The sermon also reflects on the vision of the glory of the Lord filling the Temple, a symbol of divine judgement and ultimate redemption.",
    "raw_text": "Over the last two weeks we have been reflecting on spiritual gifts, their variety and place within the life of the Church. One of those that frequently appears in the lists of spiritual gifts is that of prophecy.\n\nThis must be one of the most misunderstood words in the biblical vocabulary. In fundamentalist circles it is often seen in term of foretelling the future, reducing the scriptures to a sort of spiritual Old Moore’s Almanac. Following this line of thought obscure texts, taken out of their context are deemed to refer to specific events, often implying that the world is about to come to a speedy and dramatic end – generally to the detriment of a group other than your own.\n\nProphecy is much more about seeing events, seeing people differently. Seeing events, seeing situations as God sees them. It is about recognising, recognising significance of events. The prophets not only recognises, he or she then declares this to those who care to listen. The role of the prophet is often a lonely one, very often not a particularly welcome one. In this regard, I often think back on words of a former member of Ahoghill Parish, the late Terrence O’Neill, prior to the last election he fought as Prime Minister of Northern Ireland. ‘Ulster stands at a cross roads and Ulster will have to choose.’ His society was not ready to listen and thousands have reaped the consequences.\n\nIn our Old Testament lesson the prophet Ezekiel speaks of a vision of the glory of the Lord filling the Temple. This is in the context of an earlier vision of the glory of the Lord leaving the Temple in Jerusalem. This is all part of a powerful reflection by the prophet on the rapidly deteriorating social and religious fabric of Jerusalem in the period leading up to the fall of the city to the invading Babylonians and the subsequent exile. The departure of God’s glory, leaving the city to the consequences of apostasy, is a picture of divine judgement on a broken and failing society. The corresponding vision of the glory of God returning to the Temple is an affirmation that God’s purposes, even in judgement are for the ultimate redemption and healing.\n\nGoing to our Gospel reading, approaching as we are the Feast of the presentation of Christ in the Temple, is that delightful account in St Luke’s Gospel of Mary and Joseph bringing their first born child to dedicate him to the Lord, and with that the response of Simeon and Anna when they see the child. In the context of the scene they would not have been the only ones in the Temple that day when Mary and Joseph appeared with their new born son. Some, wrapped up in their own concerns, will not have noticed them, others may have paused to admire. But Simeon and Anna, alone among the crowd, see not just a child but the child.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/Epiphany - 2010.txt",
        "raw_ocr_content": "Page 1 of 2\n4th Sunday of Epiphany – 2010 – year C\nOver the last two weeks we have been reflecting on spiritual gifts, their variety and place\nwithin the life of the Church. One of those that frequently appears in the lists of spiritual\ngifts is that of prophecy.\nThis must be one fo the most misunderstood words in the biblical vocabulary. In\nfundamentalist circles it is often seen in term of foretelling the future, reducing the\nscriptures to a sort of spiritual Old Moore’s Almanac. Following this line of thought\nobscure texts, taken out of their context are deemed to refer to specific events, often\nimplying that the world is about to come to a speedy and dramatic end – generally to the\ndetriment of a group other than your own.\nProphecy is much more about seeing events, seeing people differently. Seeing events,\nseeing situations as God sees them. It is about recognising, recognising significance of\nevents. The prophets not only recognises, he or she then declares this to those who care to\nlisten. The role of the prophet is often a lonely one, very often not a particularly welcome\none. In this regard, I often think back on words of a former member of Ahoghill Parish,\nthe late Terrence O’Neill, prior to the last election he fought as Prime Minister of Northern\nIreland. ‘Ulster stands at a cross roads and Ulster will have to choose.’ His society was\nnot ready to listen and thousands have reaped the consequences.\nin our Old Testament lesson the prophet Ezekiel speaks of a vision of the glory of the Lord\nfilling the Temple. This is in the context of an earlier vision of the glory of the Lord\nleaving the Temple in Jerusalem. This is all part of a powerful reflection by the prophet\non the rapidly deteriorating social and religious fabric of Jerusalem in the period leading\nup to the fall of the city to the invading Babylonians and the subsequent exile. The\ndeparture of God’s glory, leaving the city to the consequences of apostasy, is a picture of\ndivine judgement on a broken and failing society. The corresponding vision of the glory\nof God returning to the Temple is an affirmation that God’s purposes, even in judgement\nare for the ultimate redemption and healing.\nPage 2 of 2\n4th Sunday of Epiphany – 2010 – year C\nGoing to our Gospel reading, approaching as we are the Feast of the presentation of Christ\nin the Temple, is that delightful account in St Luke’s Gospel of Mary and Joseph bringing\ntheir first born child to dedicate him to the Lord, and with that the response of Simeon and\nAnna when they see the child. In the context of the scene they would not have been the\nonly ones in the Temple that day when May and Joseph appeared with their new born son.\nSome, wrapped up in their own concerns, will not have noticed them, others may have\npaused to admire. But Simeon and Anna, alone among the crowd, see not just a child but\nthe child."
    }
}