{
    "title": "Epiphany 2015",
    "date": "2015-01-04",
    "blurb": "The sermon discusses the significance of the Epiphany, the visit of the Magi, and the paradoxes of Christmas. It emphasizes the journey of faith, the impact of Jesus' teachings, and the importance of recognizing Jesus in our lives and in others. The sermon concludes with the challenge of allowing God's authority in our lives, thereby reflecting the life and love of Jesus Christ in the world.",
    "raw_text": "The season of Christmas is finally drawing to a close. The decorations will soon be down and put away for another year. Trips to family or their visits to us are now just memories. This Sunday, the closest to the Feast of the Epiphany, we read as our Gospel reading the last of the Christmas events, the visit of the Magi (as told to us by St Matthew). The Gospel writer tells us very little, who they were, where precisely they came from – simply that they had come from the East. The East carries connotations of mystery, of difference. These men came not just from beyond Judaism, they came from beyond the boundary of the known world. They came bearing magnificent gifts that seem strangely out of place in a bare stable.\n\nChristmas is a season of contrasts, even of contradictions, of paradox. At the heart of it lies the ultimate paradox – beautifully expressed in the words of a hymn by Graham Kendrick (No 228)\n\n> Hymn 228\n> 1 Meekness and majesty,\n> manhood and deity,\n> in perfect harmony –\n> the man who is God:\n> Lord of infinity,\n> stooping so tenderly,\n> lifts our humanity\nto the heights of his throne.\n\nAs we move from Christmas and on into the season of Epiphany we think of God’s revelation of himself in Christ moving out beyond the barriers of race, of culture, of class.\n\nAs I said, our Gospel account is very short on detail, giving us just the barest outline of what prompted the journey of the Magi. “We saw his star in the east and have come to worship.’ Why that particular star? We find them on a journey of faith – we have a picture of men of culture, of some sophistication, worshipping a child, in a cattle shed, in a town they had never heard of. It is a story of contrasts, of contradictions yet one driven by an inner conviction that drove them, that guided them – an inner star, an inner light as important, as real as any they saw in the night sky.\n\nWe find ourselves on a journey of faith which to the outsider seems just as incongruous, just as illogical as that undertaken by the Magi. What has lead us to put our faith in a Galilean preacher, born into the home of a carpenter, executed by the Romans nearly 2000 years ago?\n\nAt one level it doesn’t make sense – and yet we meet here Sunday by Sunday because that same Jesus has touched our lives. There is that inner conviction, that inner light as real as any star in the night sky, which prompts that same question ‘Where is he that is born king of the Jews?’ For some of us that is so clear – for others it starts as an irritation that will not go away – whatever it is we have to respond, to follow the light that shines, or maybe just flickers in our hearts.\n\nHow is it that Christ has made himself known – what is it that has drawn people to him across barriers of time and culture? In his days on earth he was clearly someone who made an impression on those who heard him. We read later in St Matthew’s Gospel ‘The crowd were so amazed at his teaching, because he taught as one who had authority, and not as their teachers of the Law.’ (Matt 7:28,29)\n\nBut it is on the Cross, that sign of apparent defeat and humiliation, where Jesus made his most profound impact. As Jesus died, the Roman centurion at the foot of the cross declaring, ‘Truly this man was the Son of God.’ Moments of encounter, moments of meeting, of revelation, of Epiphany. The meeting with Mary Magdalene in the Garden that turned sadness into joy. The meeting on the Emmaus Road that transformed two men in total despair, sending them back to Jerusalem. Maybe you can think of your own moments of encounter, when God seemed particularly close, when his love for you in Christ has really struck a chord in your heart – or just when the sheer wonder of God has broken through.\n\nHe comes to us of course as we gather for worship, fulfilling his promise that when ‘two or three are gathered together in my name, there am I in the midst of them.’ He is here – even when in the dullness of my heart, my preoccupation with other things, or just in my worry or anxiety I may not recognise him – but he is here, ministering to my needs.\n\n> Jesu, Jesu, I thee adore.\n> Help me love thee more and more.\n\nHe is of course not confined to any building or liturgy; he is not confined in my thoughts or my feelings. He is also present in, as we are reminded in the Parable of the Sheep and the Goats, in the poor and the marginalised, in the lonely.\n\n> I was hungry and you gave me something to eat; I was sick and you cared for me; I was in prison and you visited me.’\n> Lord, when did we see you hungry, or sick, or in prison …?’\n> ‘As much as you did ti for the least of these, you did it for me?’\n\nAs we think about this Parable of the Sheep and the Goats, the point we often miss is not that the sheep recognised the Lord in the poor and the marginalised and the goats did not – the real point is that neither of them did for both protest, ‘Lord when did we see you hungry, or sick, or in prison…..?’ Whereas the goats imply that if only they had realised that it was the Lord and not just some worthless ‘bum in the gutter’ then of course they would have helped; the sheep on the other hand did the right thing not for the sake of any reward or recognition but simply because it was the right thing to do. As they act in the name of Christ, they discover that they meet that same Christ in the one they serve.\n\nNow I have been talking so far of how does Christ make himself known – all my thoughts have been on how can I experience him. Now this is all right up to a point but it can lead to a slightly selfish , self-centred approach as I look for more and more ways of ME meeting Jesus, ME experiencing Jesus, ME developing a deeper spirituality, a deeper prayer life.\n\nThere is nothing wrong in any of these things in themselves so long as the focus remains on God and not on my experience of God. For the Parable of the Sheep and the Goats begs the fundamental question, not of ‘How can I experience Jesus?’ rather that of ‘How can others experience Jesus in me?’\n\nAgain I find myself going to one of our hymns (636). These poems set to music so often encapsulate in a few words deep spiritual truths – the combination of word and music means they stay in our minds long after the preacher has left the pulpit.\n\n> May the mind of Christ my saviour\n> live in me from day to day;\n> by his love and power controlling\n> all I do and say.\n\nAllowing the God I meet in worship, in other people, in those moments of encounter, the still small voice, when God breaks through in the ordinary things of life. Allowing that same God more and more authority in my life – until my life, your life, in all its limitations and inadequacies, shows forth something of the life and love of the Lord Jesus Christ in the world he came to save.\n\nThat is Epiphany – that is God making himself known in the world.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany2015.txt",
        "raw_ocr_content": "Page 1 of 5\nEpiphany 2014\nThe season of Christmas is finally drawing to a close. The decorations will\nsoon be down and put away for another year. Trips to family or their visits to\nus are now just memories.\nThis Sunday, the closest to the Feast of the Epiphany, we read as our Gospel\nreading the last of the Christmas events, the visit of the Magi (as told to us by\nSt Matthew). The Gospel writer tells us very little, who they were, where\nprecisely they came from – simply that they had come from the East. The East\ncarries connotations of mystery, of difference. These men came not just from\nbeyond Judaism, they came from beyond the boundary of the known world.\nThey came bearing magnificent gifts that seem strangely out of place in a bare\nstable.\nChristmas is a season of contrasts, even of contradictions, of paradox. At the\nheart of it lies the ultimate paradox – beautifully expressed in the words of a\nhymn by Graham Kendrick (No 228)\nHymn 228\n1 Meekness and majesty,\nmanhood and deity,\nin perfect harmony –\nthe man who is God:\n………………………………….\nLord of infinity,\nstooping so tenderly,\nlifts our humanity\nto the heights of his throne.\nPage 2 of 5\nEpiphany 2014\nAs we move from Christmas and on into the season of Epiphany we think of\nGod’s revelation of himself in Christ moving out beyond the barriers of race, of\nculture, of class.\nAs I said, our Gospel account is very short on detail, giving us just the barest\noutline of what prompted the journey of the Magi. “We saw his star in the east\nand have come to worship.’ Why that particular star? We find them on a\njourney of faith – we have a picture of men of culture, of some sophistication,\nworshipping a child, in a cattle shed, in a town they had never heard of. It is a\nstory of contrasts, of contradictions yet one driven by an inner conviction that\ndrove them, that guided them – an inner star, an inner light as important, as real\nas any they saw in the night sky.\nWe find ourselves on a journey of faith which to the outsider seems just as\nincongruous, just as illogical as that undertaken by the Magi. What has lead us\nto put our faith in a Galilean preacher, born into the home of a carpenter,\nexecuted by the Romans nearly 2000 years ago?\nAt one level it doesn’t make sense – and yet we meet here Sunday by Sunday\nbecause that same Jesus has touched our lives. There is that inner conviction,\nthat inner light as real as any star in the night sky, which prompts that same\nquestion ‘Where is he that is born king of the Jews?’ For some of us that is so\nclear – for others it starts as an irritation that will not go away – whatever it is\nwe have to respond, to follow the light that shines, or maybe just flickers in our\nhearts.\nPage 3 of 5\nEpiphany 2014\nHow is it that Christ has made himself known – what is it that has drawn\npeople to him across barriers of time and culture? In his days on earth he was\nclearly someone who made an impression on those who heard him. We read\nlater in St Matthew’s Gospel ‘The crowd were so amazed at his teaching,\nbecause he taught as one who had authority, and not as their teachers of the\nLaw.’ (Matt 7:28,29)\nBut it is on the Cross, that sign of apparent defeat and humiliation, where Jesus\nmade his most profound impact. As Jesus died, the Roman centurion at the\nfoot of the cross declaring, ‘Truly this man was the Son of God.’ Moments of\nencounter, moments of meeting, of revelation, of Epiphany. The meeting with\nMary Magdalene in the Garden that turned sadness into joy. The meeting on\nthe Emmaus Road that transformed two men in total despair, sending them\nback to Jerusalem. Maybe you can think of your own moments of encounter,\nwhen God seemed particularly close, when his love for you in Christ has really\nstruck a chord in your heart – or just when the sheer wonder of God has broken\nthrough.\nHe comes to us of course as we gather for worship, fulfilling his promise that\nwhen ‘two or three are gathered together in my name, there am I in the midst of\nthem.’ He is here – even when in the dullness of my heart, my preoccupation\nwith other things, or just in my worry or anxiety I may not recognise him – but\nhe is here, ministering to my needs.\nJesu, Jesu, I thee adore.\nHelp me love thee more and more.\nPage 4 of 5\nEpiphany 2014\nHe is of course not confined to any building or liturgy; he is not confined in my\nthoughts or my feelings. He is also present in, as we are reminded in the\nParable of the Sheep and the Goats, in the poor and the marginalised, in the\nlonely.\nI was hungry and you gave me something to eat; I was sick and you cared for\nme; I was in prison and you visited me.’\nLord, when did we see you hungry, or sick, or in prison …?’\n‘As much as you did ti for the least of these, you did it for me?’\nAs we think about this Parable of the Sheep and the Goats, the point we often\nmiss is not that the sheep recognised the Lord in the poor and the marginalised\nand the goats did not – the real point is that neither of them did for both protest,\n‘Lord when did we see you hungry, or sick, or in prison…..?’ Whereas the\ngoats imply that if only they had realised that it was the Lord and not just some\nworthless ‘bum in the gutter’ then of course they would have helped; the sheep\non the other hand did the right thing not for the sake of any reward or\nrecognition but simply because it was the right thing to do. As they act in the\nname of Christ, they discover that they meet that same Christ in the one they\nserve.\nNow I have been talking so far of how does Christ make himself known – all\nmy thoughts have been on how can I experience him. Now this is all right up\nto a point but it can lead to a slightly selfish , self-centred approach as I look\nfor more and more ways of ME meeting Jesus, ME experiencing Jesus, ME\ndeveloping a deeper spirituality, a deeper prayer life.\nPage 5 of 5\nEpiphany 2014\nThere is nothing wrong in any of these things in themselves so long as the\nfocus remains on God and not on my experience of God. For the Parable of the\nSheep and the Goats begs the fundamental question, not of ‘How can I\nexperience Jesus?’ rather that of ‘How can others experience Jesus in me?’\nAgain I find myself going to one of our hymns (636). These poems set to\nmusic so often encapsulate in a few words deep spiritual truths – the\ncombination of word and music means they stay in our minds long after the\npreacher has left the pulpit.\nMay the mind of Christ my saviour\nlive in me from day to day;\nby his love and power controlling\nall I do and say.\nAllowing the God I meet in worship, in other people, in those moments of\nencounter, the still small voice, when God breaks through in the ordinary\nthings of life. Allowing that same God more and more authority in my life –\nuntil my life, your life, in all its limitations and inadequacies, shows forth\nsomething of the life and love of the Lord Jesus Christ in the world he came to\nsave.\nThat is Epiphany – that is God making himself known in theworld."
    }
}