{
    "title": "Epiphany 1 - Baptism of Jesus",
    "date": "2021-01-10",
    "blurb": "In this sermon, Kevin discusses the concept of 'Epiphany' and its significance in the Christian calendar. He explores the idea of moments when God breaks through and seems very real, using the example of the Baptism of Jesus. Kevin also emphasizes the importance of understanding Jesus from his angle, not ours, and recognizing him as both powerful and gentle, the Son of God and Saviour.",
    "raw_text": "Coming as I did from a non Church background, one of the things that intrigued me slightly when I first started going to Church were some of the names of Sundays and seasons in the Church year. There is the name of the season we have just entered, that of Epiphany. Starting on the 6th January it marks the end of Christmas, associated with the arrival of the wise men in Bethlehem.\n\nEpiphany - it rolls off the tongue – but what does it mean. I looked it up in my dictionary – ‘a moment of manifestation of divine reality’. Maybe another way of putting it might be ‘moments when God breaks through’, moments when God seems very real. You see this in the Psalms. Psalm 8, for example;\n\n> When I look at your heavens, the work of your fingers,\n> the moon and the stars that you have established;\n> what are human beings that you are mindful of them,\n> mortals that you care for them? Ps 8:3,4\n\nMoments when heaven and earth seem to meet. Our Gospel reading, which tells of the Baptism of Jesus by John in the River Jordan. Mark says:\n\n> And just as he was coming up out of the water, he saw the heavens torn apart and the Spirit descending like a dove on him. And a voice came from heaven, “You are my Son, the Beloved; with you I am well pleased. John 1:10,11\n\nA moment of clarity, a moment of realisation when God breaks through. Our journey in the Christian life is a journey of realisation, of understanding the true significance of things; the significance of ourselves, the significance of Jesus, the place of God in the order of things.\n\nBefore we go any further on this one, I just want to stay with this whole idea of how we come to advances in our understanding in general.\n\nFor much of the time, such as when we were in school, understanding comes with a patient study and learning of facts as they are presented to us. But that only takes us so far. Many of the most significant breakthroughs in science for example have come from moments of inspiration, when a scientist has been prepared to look at things form a different angle.\n\nAlbert Einstein is probably one of the most famous scientists of all time. His theories of relativity and the equation E=mc2 are well known even if few understand them. He produced these theories in the early years of the 20th century. At that time there were many puzzling and seemingly contradictory results coming out of experiments that current theories could not explain. Einstein’s insight was a simple assumption that nothing could travel faster than the speed of light. On that basis he built up his mathematical theories that accounted for many of those puzzling experimental results of the day.\n\nIn making that assumption, that nothing could travel faster than the speed of light, he was looking at things from a different angle. From that proceeded an enhanced understanding of our world and the universe in which we are set.\n\nLet’s take this idea of looking at things from a different angle back into our Gospel reading: the Baptism of Jesus marked the beginning of Jesus’ public ministry. The early Church came to recognise in that a fulfilment of the hopes and promises of the Old Covenant in the coming of God’s Messiah. Yet for the people of Jesus’ day, their hopes for a Messiah were very much couched in military and nationalist terms – a strong ruler who would throw off Roman rule and restore the greatness of Jerusalem. This was not to be the way of Jesus – his ministry was one of lowliness, of suffering and ultimately death. Viewed from the Jewish perspective of his day, this did not make sense. But take the passages of the Book of the Prophet Isaiah referring to the Suffering Servant and place them alongside the ministry of Jesus, they illuminate each other. They are seen from a new perspective, a different angle and the significance of both in the purposes of God become clear.\n\nWe are told in our Gospel passage that, as he came out of the water, he saw heaven being torn open. Other translations speak of heaven opening and this translation may seem to grate upon us. But if we go back to the Greek in which the Gospel was written, the word used, σχιζομένους, does indeed have the implication of tearing, opening up a chasm. There is the implication of a decisive, powerful act of God in which the Spirit manifests itself in the gentleness of a dove coming down and settling on him.\n\nThe next time we come across this word σχιζειν, in Mark’s Gospel is, as Jesus dies, the veil of the Temple is torn top to bottom. That veil symbolised the separation of God and man. The tearing is God breaking through that separation. That decisive and powerful act of God is combined with that moment of ultimate weakness and self-sacrifice, the death of Jesus on the cross.\n\nThere were many in his day who tried to put their own interpretations on Jesus. The figure Judas Iscariot probably saw him as the great national liberator and in his disappointment betrayed him. The religious authorities saw him as a dangerous heretic, others as maybe just an interesting and attractive teacher. We can put our own interpretations on him in our own day. A good man, a revolutionary, a pacifist, left wing, right wing. But we need to come to see him not from our angle – but from his angle; in power and gentleness fulfilling his vocation as Son of God and Saviour. In the words of the hymn by Graham Kendrick:\n\n> O what a mystery –\n> meekness and majesty;\n> bow down and worship,\n> for this is your God,\n\nBetween now and Easter, as we read the unfolding story of Jesus, may God by his Holy Spirit, open our hearts that we may see him in his power and in his gentleness, in his meekness and majesty, as Son of God and Saviour. And find in him the path that leads to life.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany12021.txt",
        "raw_ocr_content": "Page 1 of 4\nEPIPHANY 1 – Year B – Baptism of Jesus – 2021\nComing as I did from a non Church background, one of the things that\nintrigued me slightly when I first started going to Church were some of the\nnames of Sundays and seasons in the Church year. There is the name of the\nseason we have just entered, that of Epiphany. Starting on the 6th January it\nmarks the end of Christmas, associated with the arrival of the wise men in\nBethlehem.\nEpiphany - it rolls off the tongue – but what does it mean. I looked it up in my\ndictionary – ‘a moment of manifestation of divine reality’. Maybe another way\nof putting it might be ‘moments when God breaks through’, moments when\nGod seems very real. You see this in the Psalms. Psalm 8, for example;\nWhen I look at your heavens, the work of your fingers,\nthe moon and the stars that you have established;\nwhat are human beings that you are mindful of them,\nmortals that you care for them? Ps 8:3,4\nMoments when heaven and earth seem to meet. Our Gospel reading, which\ntells of the Baptism of Jesus by John in the River Jordan. Mark says:\nAnd just as he was coming up out of the water, he saw the heavens\ntorn apart and the Spirit descending like a dove on him. And a voice\ncame from heaven, “You are my Son, the Beloved; with you I am well\npleased. John 1:10,11\nA moment of clarity, a moment of realisation when God breaks through. Our\njourney in the Christian life is a journey of realisation, of understanding the\ntrue significance of things; the significance of ourselves, the significance of\nJesus, the place of God in the order of things.\nBefore we go any further on this one, I just want to stay with this whole idea of\nhow we come to advances in our understanding in general.\nPage 2 of 4\nEPIPHANY 1 – Year B – Baptism of Jesus – 2021\nFor much of the time, such as when we were in school, understanding comes\nwith a patient study and learning of facts as they are presented to us. But that\nonly takes us so far. Many of the most significant breakthroughs in science for\nexample have come from moments of inspiration, when a scientist has been\nprepared to look at things form a different angle.\nAlbert Einstein is probably one of the most famous scientists of all time. His\ntheories of relativity and the equation E=mc2 are well known even if few\nunderstand them. He produced these theories in the early years of the 20th\ncentury. At that time there were many puzzling and seemingly contradictory\nresults coming out of experiments that current theories could not explain.\nEinstein’s insight was a simple assumption that nothing could travel faster than\nthe speed of light. On that basis he built up his mathematical theories that\naccounted for many of those puzzling experimental results of the day.\nIn making that assumption, that nothing could travel faster than the speed of\nlight, he was looking at things from a different angle. From that proceeded an\nenhanced understanding of our world and the universe in which we are set.\nLet’s take this idea of looking at things from a different angle back into our\nGospel reading: the Baptism of Jesus marked the beginning of Jesus’ public\nministry. The early Church came to recognise in that a fulfilment of the hopes\nand promises of the Old Covenant in the coming of God’s Messiah. Yet for the\npeople of Jesus’ day, their hopes for a Messiah were very much couched in\nmilitary and nationalist terms – a strong ruler who would throw off Roman rule\nPage 3 of 4\nEPIPHANY 1 – Year B – Baptism of Jesus – 2021\nand restore the greatness of Jerusalem. This was not to be the way of Jesus –\nhis ministry was one of lowliness, of suffering and ultimately death. Viewed\nfrom the Jewish perspective of his day, this did not make sense. But take the\npassages of the Book of the Prophet Isaiah referring to the Suffering Servant\nand place them alongside the ministry of Jesus, they illuminate each other.\nThey are seen from a new perspective, a different angle and the significance of\nboth in the purposes of God become clear.\nWe are told in our Gospel passage that, as he came out of the water, he saw\nheaven being torn open. Other translations speak of heaven opening and this\ntranslation may seem to grate upon us. But if we go back to the Greek in\nwhich the Gospel was written, the word used, σχιζομένους, does indeed have\nthe implication of tearing, opening up a chasm. There is the implication of a\ndecisive, powerful act of God in which the Spirit manifests itself in the\ngentleness of a dove coming down and settling on him.\nThe next time we come across this word σχιζέιν, in Mark’s Gospel is, as Jesus\ndies, the veil of the Temple is torn top to bottom. That veil symbolised the\nseparation of God and man. The tearing is God breaking through that\nseparation. That decisive and powerful act of God is combined with that\nmoment of ultimate weakness and self-sacrifice, the death of Jesus on the\ncross.\nThere were many in his day who tried to put their own interpretations on Jesus.\nThe figure Judas Iscariot probably saw him as the great national liberator and\nPage 4 of 4\nEPIPHANY 1 – Year B – Baptism of Jesus – 2021\nin his disappointment betrayed him. The religious authorities saw him as a\ndangerous heretic, others as maybe just an interesting and attractive teacher.\nWe can put our own interpretations on him in our own day. A good man, a\nrevolutionary, a pacifist, left wing, right wing. But we need to come to see\nhim not from our angle – but from his angle; in power and gentleness fulfilling\nhis vocation as Son of God and Saviour. In the words of the hymn by Graham\nKendrick:\nO what a mystery –\nmeekness and majesty;\nbow down and worship,\nfor this is your God,\nBetween now and Easter, as we read the unfolding story of Jesus, may God by\nhis Holy Spirit, open our hearts that we may see him in his power and in his\ngentleness, in his meekness and majesty, as Son of God and Saviour. And find\nin him the path that leads to life."
    }
}