{
    "title": "Light in the Darkness",
    "date": "2014-01-05",
    "blurb": "In this sermon, Kevin uses the metaphor of fluorescent stars in the darkness to illustrate the theme of light in the Bible. He explores how light is not only a symbol of God's presence and guidance, but also a call for us to become channels of light ourselves. The sermon emphasizes the importance of receiving God's light in our lives and sharing it with others.",
    "raw_text": "One night before Christmas, Rachel and I were over in our son’s house in Donnybrook putting the children to bed. As we turned out the lights, Ryan pointed to the ceiling and said, ‘Look, Grandpa. Look!’ On the ceiling there were fluorescent stars. We hadn’t noticed them when the lights were on but as the lights went out they glowed in the dark. They reminded me of those toys you used to get in your Cornflakes when I was growing up. The principle behind these things is quite simple – when light shines on these things, the energy is absorbed and then released as that greenish fluorescent light – a phenomenon that has delighted youngsters down through the years.\n\nThis image of the stars on that bedroom ceiling fluorescing in the darkness came to me as I reflected on our Lesson from Isaiah and the whole theme of light that runs through from those words we read on Christmas Eve from John’s Gospel:\n\n> 4 in him was life, and the life was the light of all people. 5 The light shines in the darkness, and the darkness did not overcome it. Jn 1:4\n\nAs I sit down to reflect on a theme, I often find it instructive to follow how a particular word or theme is used in Scripture. So earlier this week I followed the word ‘light’ through the Old Testament, its poetry and prophetic books and on into the New Testament.\n\nLight is one of the great themes of the Creation story as we are presented with that wonderful image of God declaring over the swirling darkness of nothingness, ‘Let there be light’ – and there was light. There is the pillar of fire that illuminates the way as Moses leads the people out of the darkness of slavery in Egypt. Running through the Old Testament is this sense of an illuminating, empowering presence of God with his people; in the still small voice experienced by Elijah in the wilderness, the shaking of the pillars of the Temple in Isaiah. In the Psalms this is often expressed in terms of light:\n\n> Ps 18:28 It is you who light my lamp; the LORD, my God, lights up my darkness.\n\n> Ps 27:1 The LORD is my light and my salvation; whom shall I fear?\n\nIt is a presence in and through which we begin to make sense of the world around us\n\n> Ps 36:9 For with you is the fountain of life; in your light we see light.\n\nBut there is another strand running through in which we are to be not just recipients of light but channels of light. So we read in our Old Testament Lesson this morning:\n\n> “Arise, shine, for your light has come, and the glory of the LORD rises upon you. Nations will come to your light, and kings to the brightness of your dawn.\n\nReceivers of light must be ones who shed light on others – this is where the thought of those fluorescent stars on the ceiling of our grandsons’ bedroom came to my mind. From the very outset of Israel’s pilgrimage before God, there was the realisation that God’s blessing was given so that they might be a blessing to the wider world. As Abram is called to leave his homeland and journey to the land that God will show him, as he hears the promise of descendants, he and his descendants are given their vocation before God:\n\n> Now the LORD said to Abram, \"Go from your country and your kindred and your father's house to the land that I will show you. 2 I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing. Gen 12:1,2\n\nI will bless you …… so that you will be a blessing. The blessing is given so that it might be shared – but we can only be a blessing to the extent that we are prepared to appropriate that blessing. It is here that my thoughts turn once more to those fluorescent stars on our grandsons’ bedroom ceiling. As the night goes by, the stars on the ceiling fade as the energy absorbed when the bedroom light was on is exhausted. They will not shine again until they are exposed to the light.\n\nIn the Gospels we read of Jesus speaking of himself, ‘I am the light of the world.’ and of his disciples in terms of light;\n\n> 14 \"You are the light of the world. … 15 No one after lighting a lamp puts it under the bushel basket, but on the lampstand, and it gives light to all in the house. 16 In the same way, let your light shine before others, so that they may see your good works and give glory to your Father in heaven. Matt 5:14ff\n\nOur ability to shed God’s light in the world, depends on our willingness to receive that light in our own lives, the time we are prepared to give to reflection, to prayer, to meeting together for worship.\n\nAs we move from Christmas into the new Year, on into Epiphany and on into the future, we will be thinking more and more about how we see ourselves as a Parish, as a community, how we relate to those on the edges, those, who whatever reason, are not here in our midst. At the heart of it all must be an understanding of who we are – not an organisation seeking our own preservation but an integral part of the Body of Christ called to shed something of the light of the Christ we encounter and worship in this place.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany2014.txt",
        "raw_ocr_content": "Page 1 of 3\nEPIPHANY 2014\nOne night before Christmas, Rachel and I were over in our son’s house in\nDonnybrook putting the children to bed. As we turned out the lights, Ryan\npointed to the ceiling and said, ‘Look, Grandpa. Look!’ On the ceiling there\nwere fluorescent stars. We hadn’t noticed them when the lights were on but as\nthe lights went out they glowed in the dark. They reminded me of those toys\nyou used to get in your Cornflakes when I was growing up. The principle\nbehind these things is quite simple – when light shines on these things, the\nenergy is absorbed and then released as that greenish fluorescent light – a\nphenomenon that has delighted youngsters down through the years.\nThis image of the stars on that bedroom ceiling fluorescing in the darkness\ncame to me as I reflected on our Lesson from Isaiah and the whole theme of\nlight that runs through from those words we read on Christmas Eve from\nJohn’s Gospel:\n4 in him was life, and the life was the light of all people. 5 The light\nshines in the darkness, and the darkness did not overcome it. Jn 1:4\nto the image from the Gospel reading we have read today, the Gospel\nappointed for the Feast of the Epiphany, of the star that lead the wise men from\nthe East to worship the Christ child.\nAs I sit down to reflect on a theme, I often find it instructive to follow how a\nparticular word or theme is used in Scripture. So earlier this week I followed\nthe word ‘light’ through the Old Testament, its poetry and prophetic books and\non into the New Testament.\nLight is one of the great themes of the Creation story as we are presented with\nthat wonderful image of God declaring over the swirling darkness of\nnothingness, ‘Let there be light’ – and there was light. There is the pillar of\nfire that illuminates the way as Moses leads the people out of the darkness of\nslavery in Egypt. Running through the Old Testament is this sense of an\nPage 2 of 3\nEPIPHANY 2014\nilluminating, empowering presence of God with his people; in the still small\nvoice experienced by Elijah in the wilderness, the shaking of the pillars of the\nTemple in Isaiah. In the Psalms this is often expressed in terms of light:\nPs 18:28 It is you who light my lamp;\nthe LORD, my God, lights up my darkness.\nPs 27:1 The LORD is my light and my salvation;\nwhom shall I fear?\nIt is a presence in and through which we begin to make sense of the world\naround us\nPs 36:9 For with you is the fountain of life;\nin your light we see light.\nBut there is another strand running through in which we are to be not just\nrecipients of light but channels of light. So we read in our Old Testament\nLesson this morning:\n“Arise, shine, for your light has come,\nand the glory of the LORD rises upon you.\n………………………………………..\nNations will come to your light,\nand kings to the brightness of your dawn.\nReceivers of light must be ones who shed light on others – this is where the\nthought of those fluorescent stars on the ceiling of our grandsons’ bedroom\ncame to my mind. From the very outset of Israel’s pilgrimage before God,\nthere was the realisation that God’s blessing was given so that they might be a\nblessing to the wider world. As Abram is called to leave his homeland and\njourney to the land that God will show him, as he hears the promise of\ndescendants, he and his descendants are given their vocation before God:\nNow the LORD said to Abram, \"Go from your country and your\nkindred and your father's house to the land that I will show you. 2 I\nwill make of you a great nation, and I will bless you, and make your\nname great, so that you will be a blessing. Gen 12:1,2\nPage 3 of 3\nEPIPHANY 2014\nI will bless you ……… so that you will be a blessing. The blessing is given so\nthat it might be shared – but we can only be a blessing to the extent that we are\nprepared to appropriate that blessing. It is here that my thoughts turn once\nmore to those fluorescent stars on our grandsons’ bedroom ceiling. As the\nnight goes by, the stars on the ceiling fade as the energy absorbed when the\nbedroom light was on is exhausted. They will not shine again until they are\nexposed to the light.\nIn the Gospels we read of Jesus speaking of himself, ‘I am the light of the\nworld.’ and of his disciples in terms of light;\n14 \"You are the light of the world. …. 15 No one after lighting a lamp\nputs it under the bushel basket, but on the lampstand, and it gives light\nto all in the house. 16 In the same way, let your light shine before\nothers, so that they may see your good works and give glory to your\nFather in heaven. Matt 5:14ff\nOur ability to shed God’s light in the world, depends on our willingness to\nreceive that light in our own lives, the time we are prepared to give to\nreflection, to prayer, to meeting together for worship.\nAs we move from Christmas into the new Year, on into Epiphany and on into\nthe future, we will be thinking more and more about how we see ourselves as a\nParish, as a community, how we relate to those on the edges, those, who\nwhatever reason, are not here in our midst. At the heart of it all must be an\nunderstanding of who we are – not an organisation seeking our own\npreservation but an integral part of the Body of Christ called to shed something\nof the light of the Christ we encounter and worship in this place."
    }
}