{
    "title": "Being Different",
    "date": "2014-01-05",
    "blurb": "This sermon, delivered on the first Sunday of Epiphany in 2014, discusses the concept of being different and standing out in a crowd. The sermon emphasizes the importance of choosing to follow Christ, which means dying to sin and rising to new life with him. It also highlights the concept of repentance, using the Greek word 'metanoia', which means to turn around, change direction, and take a different journey through life.",
    "raw_text": "Can anyone tell me where this place is? St Andrew’s – home ground of Birmingham City Football Club. There can be some pretty scary supporters. In recent years we haven’t had much to cheer about. We did win the League Cup back in 2008. I won’t gloat about one side that was knocked out of the League Cup. There aren’t many supporters here in Howth – Maurice Bishop and I used to console each other on a Sunday morning. In fact you could say that to be a supporter of Birmingham City is to stand out as different from everyone else.\n\nThis morning I want to talk of ways of being different, of standing out in a crowd. Some people dress differently and do their hair differently. Then we are all different. God loves us all, no matter where we come from, how old we are – even how we dress. The difference we are talking about this morning is who we follow.\n\nLesson told of Baptism of Jesus – I want to think about our own Baptism. When we have a Baptism, at one point in the service I will say: In baptism, God calls us from darkness into his marvellous light. To follow Christ means dying to sin and rising to new life with him. That means very consciously choosing – choosing different attitudes, different behaviours, different priorities in life in the sort of people we choose to be.\n\nBible talks about repentance – it uses a Greek word: metanoia. That’s what John and Jesus meant when they told people to ‘repent’. Turn around, change direction, take a different journey through life.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany12014famserv.txt",
        "raw_ocr_content": "Page 1 of 3\nEpiphany 1 – 2014 – year A – Family Service\nUse powerpoint ‘Family Service – Jan 2014’\nSlide 1 – St Andrew’s Football Ground\nCan anyone tell me where this place is?\nShow Birmingham City scarf\nSt Andrew’s – home ground of Birmingham City Football Club.\nShow picture of mascot\nThere can be some pretty scary supporters. In recent years we haven’t\nhad much to cheer about.\nWe did win the League Cup back in 2008\nShow picture of League Cup win\nI won’t gloat about one side that was knocked out of the League Cup.\nThere aren’t many supporters here in Howth – Maurice Bishop and I\nused to console each other on a Sunday morning. In fact you could\nsay that to be a supporter of Birmingham City is to stand out as\ndifferent from everyone else.\nThis morning I want to talk of ways of being different, of standing out\nin a crowd\nShow slide of two punks\nPage 2 of 3\nEpiphany 1 – 2014 – year A – Family Service\nSome people dress differently and do their hair differently.\nThen we are all different\nGo through slides of black, Asian, old and young\nGod loves us all, no matter where we come from, how old we are –\neven how we dress.\nShow slide of two punks\nThe difference we are talking about this morning is who we follow\nShow slide of follow me\nLesson told of Baptism of Jesus – I want to think about our own\nBaptism. When we have a Baptism, at one point in the service I will\nsay:\nIn baptism, God calls us from darkness into his marvellous light.\nTo follow Christ means dying to sin and rising to new life with him.\nThat means very consciously choosing – choosing different attitudes,\ndifferent behaviours, different priorities in life in the sort of people we\nchoose to be.\nBible talks about repentance – it uses a Greek word:\nshow slide ‘metanoia’\nPage 3 of 3\nEpiphany 1 – 2014 – year A – Family Service\nThat’s what John and Jesus meant when they told people to ‘repent’\nTurn around, change direction, take a different journey through life\nShow slide of follow me"
    }
}