{
    "title": "Light set on a hill",
    "date": "2020-02-16",
    "blurb": "In this sermon, Kevin discusses the metaphor of a lighthouse as a guiding light, and how Jesus encourages his followers to be like lights. The sermon emphasizes the importance of embodying the fruits of the spirit, and how this can sometimes be challenging. The ultimate goal is to become more like Jesus, shining as lights in the world.",
    "raw_text": "3rd before Lent – Year A – 2020 – Family Service\n\nLight set on a hill – can anyone think of one near here – Baily light house\n\n- It is there to guide ships out at sea\n\nForty years ago we did something that you should never do – we went for a walk along the cliff path – nothing wrong with that – except that it was dark and getting darker. Couldn’t see the path in front – couldn’t see the path behind.\n\nLight house also warns of danger – warns ships to stay off the rocks. Sometimes people set false lights to draw ships onto rocks and then plunder the ship.\n\nImportant that the light house keeps shining in all weathers.\n\nIn our bible reading Jesus says that those who follow him should be like lights – shouldn’t be afraid to hide our light. Jesus said ‘I am the light of the world’ He also said that if we follow him, he will live in us and we will live in him.\n\nWe are the ones through whom Jesus shines as a light in the world today.\n\nWhat does that mean? Last Friday, in Assembly in the Burrow, 2nd Class led us through a lovely assembly based on the fruits of the spirit, love, joy, peace, longsuffering, kindness, goodness, faithfulness, gentleness, self-control.\n\nThey thought about the difference this can make – it is not always easy. It’s easy to love someone you like – but Jesus tells us to love our enemy. Kindness is all very well – but some people can be very annoying.\n\nAs I listened to all this I thought of one of the definitions of the Holy Spirit that has always appealed to me\n\nThe Holy Spirit enables me to become more like Jesus.\n\nYou and me becoming more like Jesus, you and me shining as lights in the world.\n\nMay God enable each one of us to shine this week, to show something of the love of God in all that we do, all that we say, all that we are.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany32020famserv.txt",
        "raw_ocr_content": "Page 1 of 2\n3rd before Lent – Year A – 2020 – Family Service\nLight set on a hill – can anyone think of one near here – Baily\nlight house\n- It is there to guide ships out at sea\n-\nForty years ago we did something that you should never do –\nwe went for a walk along the cliff path – nothing wrong with\nthat – except that it was dark and getting darker.\nCouldn’t see the path in front – couldn’t see the path behind.\nLight house also warns of danger – warns ships to stay off the\nrocks. Sometimes people set false lights to draw ships onto\nrocks and then plunder the ship.\nImportant that the light house keeps shining in all weathers.\nIn our bible reading Jesus says that those who follow him\nshould be like lights – shouldn’t be afraid to hide our light.\nJesus said ‘I am the light of the world’ He also said that if we\nfollow him, he will live in us and we will live in him.\nWe are the ones through whom Jesus shines as a light in the\nworld today.\nPage 2 of 2\n3rd before Lent – Year A – 2020 – Family Service\nWhat does that mean? Last Friday, in Assembly in the\nBurrow, 2nd Class led us through a lovely assembly based on\nthe fruits of the spirit, love, joy, peace, longsuffering,\nkindness, goodness, faithfulness, 23[g]gentleness, self-control.\nThey thought about the difference this can make – it is not\nalways easy. It’s easy to love someone you like – but Jesus\ntells us to love our enemy. Kindness is all very well – but\nsome people can be very annoying.\nAs I listened to all this I thought of one of the definitions of\nthe Holy Spirit that has always appealed to me\nThe Holy Spirit enables me to become more like Jesus.\nYou and me becoming more like Jesus, you and me shining as\nlights in the world.\nMay God enable each one of us to shine this week, to show\nsomething of the love of God in all that we do, all that we say,\nall that we are."
    }
}