{
    "title": "Seeking and Finding",
    "date": "2014-01-19",
    "blurb": "In this sermon, Kevin explores the theme of seeking and finding in our spiritual journey. He discusses the resonance of familiar scripture passages and the questions Jesus asks of those who approach him. Drawing on the words of philosophers and theologians, he reflects on the human yearning for God and the restlessness of the heart until it finds rest in God.",
    "raw_text": "Every Sunday here in Church, in the course of our worship we read from the Scriptures. Over the years, in our regular hearing and reading, these become familiar passages. That very familiarity can on the one hand almost insulate us from the passage we are reading. But on another, if we are prepared to allow it, the very familiarity can have a resonance in our hearts and minds and we are drawn into the passage, the characters in the passage and it speaks to us afresh.\n\nThere is much in the passage we have read as our Gospel reading today. It is one that I have read or heard many times, one that I have preached on several times over the years. This week, as I read over and began to reflect on the passage, my mind was drawn towards the question that lies in the middle of this passage, as John the Baptist begins to slip into the background, as John’s disciples move towards Jesus.\n\nTurning round, Jesus saw them following and asked, “What do you want? What do you want?’ Literally, ‘What are you seeking, what are you looking for?’ The Jesus we encounter in the Gospels is often one who will ask questions of those who approach him. After the imprisonment of John the Baptist, crowds come to Jesus and he asks of them, ‘What did you go out into the wilderness to look at?’ ‘What did you go out into the wilderness to see?’ Matt 11:7,8,9\n\nAs we have embarked upon this season of Epiphany we have followed the early stages in the life of Jesus, his Baptism by John, his gathering around him of a group of disciples. John in our Gospel reading gives us a picture of them seeking out Jesus rather than Jesus seeking out them.\n\nAt one point in St John’s Gospel, people are starting to fall away from following Jesus, as his teaching becomes more challenging. 67 So Jesus asked the twelve, \"Do you also wish to go away?\" 68 Simon Peter answered him, \"Lord, to whom can we go? You have the words of eternal life. John 6:67-68\n\nLord, to whom can we go? There is a sense here in which Peter is almost inexplicably drawn towards this figure of Jesus. He doesn’t understand everything. There will be much to trouble and confuse him in the days that lie ahead – but he can do no other than follow in the steps of him who called him.\n\nI don’t know about the rest of you, but there is something here that strikes a chord with my own spiritual pilgrimage. I recall times of prayer, not knowing who or to what I was praying yet still feeling drawn to prayer. As I thought back over that during the week, I recalled an expression that I had not heard for a long time, that of a ‘God shaped hole’ within each one of us, an expression that has its origins is words of the French philosopher, Blaise Pascal:\n\n> There is a God-shaped vacuum in the heart of every person, and it can never be filled by any created thing. It can only be filled by God, made known through Jesus Christ.” - Blaise Pascal, Pensee\n\nIt is a metaphor for the yearning in the human soul which drives us on our spiritual quest, that sense of the other. We can try to fill it in many other ways, in career, in hobbies, in pleasure – but nothing seems to totally satisfy.\n\nThis was very much the experience of one of the key thinkers in the early Church, Augustine, as he wrestled with faith. His words inspired one of my favourite collects in our Prayer Book, the Collect of the 17th Sunday after Trinity\n\n> Almighty God,\n> you have made us for yourself,\n> and our hearts are restless till they find their rest in you:\n> Teach us to offer ourselves to your service,\n> that here we may have your peace,\n> and in the world to come may see you face to face;\n> through Jesus Christ our Lord.\n\nI go back to the words of Jesus to those disciples of John who came after him: ‘What do you want?’ ‘What are you looking for? What are you seeking?’ Augustine comes to realise that what he wants more than anything else is to rest in the presence of the God he has been avoiding for years, who waits patiently and lovingly for his response. So Augustine prays:\n\n> The house of my soul is too small for you to come in to me; let it be enlarged by you. It is in ruins, but I ask you to remake it. It contains much that you will not be pleased to see; this I confess to you and do not hide it.\n> I do not quarrel with you about your judgments, for you are Truth Itself; and I have not wished to be dishonest with myself, or it would be my wrongdoing lying to itself.\n\nArchbishop Henry McAdoo, who was Archbishop of Dublin when I was first ordained, used to speak of the Christian life in terms of ‘becoming who we are.’ In the language of the 2nd Lesson appointed for today from 1st Corinthians, we are called to be saints. Not by any virtue of our own – but by virtue of our response to that question that he places in all our hearts; ‘What do you want? What are you looking for?’ - in our life, in our hearts, in ourselves – as he invites us, as he did those first disciples, to come and follow him.\n\n> Almighty God,\n> you have made us for yourself,\n> and our hearts are restless till they find their rest in you:\n> Teach us to offer ourselves to your service,\n> that here we may have your peace,\n> and in the world to come may see you face to face;\n> through Jesus Christ our Lord.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany22014.txt",
        "raw_ocr_content": "Page 1 of 3\nEpiphany 2 – 2014 – Year A\nEvery Sunday here in Church, in the course of our worship we read from the\nScriptures. Over the years, in our regular hearing and reading, these become\nfamiliar passages. That very familiarity can on the one hand almost insulate us\nfrom the passage we are reading. But on another, if we are prepared to allow\nit, the very familiarity can have a resonance in our hearts and minds and we are\ndrawn into the passage, the characters in the passage and it speaks to us afresh.\nThere is much in the passage we have read as our Gospel reading today. It is\none that I have read or heard many times, one that I have preached on several\ntimes over the years. This week, as I read over and began to reflect on the\npassage, my mind was drawn towards the question that lies in the middle of\nthis passage, as John the Baptist begins to slip into the background, as John’s\ndisciples move towards Jesus.\nTurning round, Jesus saw them following and asked, “What do you want?\n‘What do you want?’ Literally, ‘What are you seeking, what are you looking\nfor?’ The Jesus we encounter in the Gospels is often one who will ask\nquestions of those who approach him. After the imprisonment of John the\nBaptist, crowds come to Jesus and he asks of them,\n‘What did you go out into the wilderness to look at?’ ‘What did you\ngo out into the wilderness to see?’ Matt 11:7,8,9\nAs we have embarked upon this season of Epiphany we have followed the\nearly stages in the life of Jesus, his Baptism by John, his gathering around him\nof a group of disciples. John in our Gospel reading gives us a picture of them\nseeking out Jesus rather than Jesus seeking out them.\nAt one point in St John’s Gospel, people are starting to fall away from\nfollowing Jesus, as his teaching becomes more challenging.\n67 So Jesus asked the twelve, \"Do you also wish to go away?\" 68\nSimon Peter answered him, \"Lord, to whom can we go? You have\nthe words of eternal life. John 6:67-68\nPage 2 of 3\nEpiphany 2 – 2014 – Year A\nLord, to whom can we go? There is a sense here in which Peter is almost\ninexplicably drawn towards this figure of Jesus. He doesn’t understand\neverything. There will be much to trouble and confuse him in the days that lie\nahead – but he can do no other than follow in the steps of him who called him.\nI don’t know about the rest of you, but there is something here that strikes a\nchord with my own spiritual pilgrimage. I recall times of prayer, not knowing\nwho or to what I was praying yet still feeling drawn to prayer. As I thought\nback over that during the week, I recalled an expression that I had not heard for\na long time, that of a ‘God shaped hole’ within each one of us, an expression\nthat has its origins is words of the French philosopher, Blaise Pascal:\nThere is a God-shaped vacuum in the heart of every person, and it\ncan never be filled by any created thing. It can only be filled by God,\nmade known through Jesus Christ.” - Blaise Pascal, Pensee\nIt is a metaphor for the yearning in the human soul which drives us on our\nspiritual quest, that sense of the other. We can try to fill it in many other ways,\nin career, in hobbies, in pleasure – but nothing seems to totally satisfy.\nThis was very much the experience of one of the key thinkers in the early\nChurch, Augustine, as he wrestled with faith. His words inspired one of my\nfavourite collects in our Prayer Book, the Collect of the 17th Sunday after\nTrinity\nAlmighty God,\nyou have made us for yourself,\nand our hearts are restless till they find their rest in you:\nTeach us to offer ourselves to your service,\nthat here we may have your peace,\nand in the world to come may see you face to face;\nthrough Jesus Christ our Lord.\nPage 3 of 3\nEpiphany 2 – 2014 – Year A\nI go back to the words of Jesus to those disciples of John who came after him:\n‘What do you want?’ ‘What are you looking for? What are you seeking?’\nAugustine comes to realise that what he wants more than anything else is to\nrest in the presence of the God he has been avoiding for years, who waits\npatiently and lovingly for his response. So Augustine prays:\nThe house of my soul is too small for you to come in to me; let it be\nenlarged by you. It is in ruins, but I ask you to remake it. It contains\nmuch that you will not be pleased to see; this I confess to you and do\nnot hide it.\nI do not quarrel with you about your judgments, for you are Truth\nItself; and I have not wished to be dishonest with myself, or it would\nbe my wrongdoing lying to itself.\nArchbishop Henry McAdoo, who was Archbishop of Dublin when I was first\nordained, used to speak of the Christian life in terms of ‘becoming who we\nare.’ In the language of the 2nd Lesson appointed for today from 1st\nCorinthians, we are called to be saints. Not by any virtue of our own – but by\nvirtue of our response to that question that he places in all our hearts; ‘What do\nyou want? What are you looking for?’ - in our life, in our hearts, in ourselves\n– as he invites us, as he did those first disciples, to come and follow him.\nAlmighty God,\nyou have made us for yourself,\nand our hearts are restless till they find their rest in you:\nTeach us to offer ourselves to your service,\nthat here we may have your peace,\nand in the world to come may see you face to face;\nthrough Jesus Christ our Lord."
    }
}