{
    "title": "Emerging Into Light",
    "date": "2015-01-25",
    "blurb": "This sermon, delivered on the 3rd Sunday of Epiphany in 2015, discusses the transformation of Simon into Peter as per the teachings of Jesus. It draws a parallel between this transformation and the metamorphosis of a moth, emphasizing the idea that there is something divine in each one of us, waiting to emerge. The sermon also touches upon the importance of names and the significance of their change in biblical times.",
    "raw_text": "3rd Sunday of Epiphany – Year B – 2015\n\nHe brought Simon to Jesus, who looked at him and said, \"You are Simon son of John. You are to be called Cephas\" (which is translated Peter). John 1:42\n\nOn the computer at home, I have a file containing short video clips that I have often found to be useful in introducing ideas at the start of a sermon. One of these is a short clip of a moth emerging from a chrysalis.\n\nI always think that that is an amazing process. From the outside the chrysalis looks so lifeless – you would not suspect what lies inside waiting to burst out. Then little by little the moth emerges – so different, so much more magnificent that the caterpillar that a short while before wrapped itself in silk.\n\nThe moth was always there, waiting to emerge into the light.\n\nAs we have continued in our reading of Mark’s Gospel we have come to the account given by Mark of the calling of Simon. I want to set alongside that the account given by John in which Jesus says to Simon; ‘You are Simon, you shall be called Peter.’\n\nNames in that culture were very important – a change in name was very significant, represented a deep rooted change.\n\nSaul the Pharisee, the persecutor of the early Church, becomes in the light of his meeting with the risen Jesus on the Damascus Road, Paul the evangelist, the great missioner of the Church.\n\nGoing back to Simon, the rest of his life was to be a process of turning the Simon he was into the Peter Jesus intended to be.\n\nAs you are well aware by now, I am very fond of Peter; I can very much identify with this Galilean fisherman. He so wanted to serve, he so wanted to get it right – so enthusiastic, so willing, so frail.\n\nIt was after all Peter who was the first to confess Jesus as the Christ but when Jesus started to talk of his vocation of suffering, Peter jumped in to say ‘That will never happen to you’ only to receive the rebuke, ‘Get behind me Satan, you think as men think not how God thinks.’ It was Peter, when the rest had fled, who followed Jesus to the High Priest’s house but the one who, when challenged by a servant girl, denied he ever knew Jesus. But then John presents us with that wonderful scene of reconciliation as the risen Jesus asks Peter three times, ‘Do you love me?’ receives that wonderful affirmation, ‘Feed my sheep’.\n\nThat day when Jesus met Simon, others would have seen a big fisherman, not the most important on the social scale of that day, probably a rough manner and accent. But Jesus looked beyond that – he saw the Peter inside, the Peter he knew he could be, would be. As I say, the rest of Simon’s life was a process of turning the Simon he was into the Peter God intended him to be.\n\nGod looks at each one of us and sees us as we are, in our strengths and our weaknesses, our virtues and our failings; sees the person we are, sees the person we can be. in the service of Baptism, as I make the sign of the cross on the head of the child the following prayer is said:\n\nMay almighty God deliver you from the powers of darkness, restore in you the image of his glory, and lead you in the light and obedience of Christ. Amen.\n\nThere is something special, something unique about each one of us – I am not talking about outward appearance, our IQ or our sporting abilities. The Bible says that we are all made in the image of God – what that is saying is that there is something of the divine in each one of us. We can hide it at times in our pride, our selfishness, our greed – but that something special, that something of the image of God is still there and God sees it.\n\nIn our Old Testament Lesson we have the story of Jonah preaching to the people of Nineveh. Nineveh was a pretty grim place – in truth Jonah probably liked the idea of God punishing them. The story tells us that Nineveh had a change of heart and they were not punished – God saw beyond the disobedience to something that was good. Jonah was confused, even angry with God.\n\nAs I remarked, as Simon came towards Jesus that day, other people would have seen a big fisherman, probably a rough manner and accent. But Jesus looked beyond that – he saw the Peter inside, the Peter he knew he could be, would be. The rest of Simon’s life was a process of changing from the Simon he was into the Peter God intended him to be.\n\nI began with that image of the moth emerging from the chrysalis, something beautiful emerging from the apparently lifeless cocoon.\n\nThere is something special to God about each person here. A big part of the Christian life is discovering that, building on that, becoming the person God wants us to be.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany32015.txt",
        "raw_ocr_content": "Page 1 of 4\n3rd Sunday of Epiphany – Year B – 2015\nneed video clip of moth emerging form a chrysalis\n42 He brought Simon to Jesus, who looked at him and said, \"You are Simon son\nof John. You are to be called Cephas\" (which is translated Peter). John 1:42\n(9:30) On the computer at home, I have a file containing short video clips that I\nhave often found to be useful in introducing ideas at the start of a sermon. One\nof these is a short clip of a moth emerging from a chrysalis.\n(11:00) Show video clip of a moth emerging from a chrysalis.\nI always think that that is an amazing process. From the outside the chrysalis\nlooks so lifeless – you would not suspect what lies inside waiting to burst out.\nThen little by little the moth emerges – so different, so much more magnificent\nthat the caterpillar that a short while before wrapped itself in silk.\nThe moth was always there, waiting to emerge into the light.\nAs we have continued in our reading of Mark’s Gospel we have come to the\naccount given by Mark of the calling of Simon. I want to set alongside that the\naccount given by John in which Jesus says to Simon; ‘You are Simon, you\nshall be called Peter.’\nNames in that culture were very important – a change in name was very\nsignificant, represented a deep rooted change.\nPage 2 of 4\n3rd Sunday of Epiphany – Year B – 2015\nneed video clip of moth emerging form a chrysalis\nSaul the Pharisee, the persecutor of the early Church, becomes in the light of\nhis meeting with the risen Jesus on the Damascus Road, Paul the evangelist,\nthe great missioner of the Church.\nGoing back to Simon, the rest of his life was to be a process of turning the\nSimon he was into the Peter Jesus intended to be.\nAs you are well aware by now, I am very fond of Peter; I can very much\nidentify with this Galilean fisherman. He so wanted to serve, he so wanted to\nget it right – so enthusiastic, so willing, so frail.\nIt was after all Peter who was the first to confess Jesus as the Christ but when\nJesus started to talk of his vocation of suffering, Peter jumped in to say ‘That\nwill never happen to you’ only to receive the rebuke, ‘Get behind me Satan,\nyou think as men think not how God thinks.’ It was Peter, when the rest had\nfled, who followed Jesus to the High Priest’s house but the one who, when\nchallenged by a servant girl, denied he ever knew Jesus. But then John\npresents us with that wonderful scene of reconciliation as the risen Jesus asks\nPeter three times, ‘Do you love me?’ receives that wonderful affirmation,\n‘Feed my sheep’.\nThat day when Jesus met Simon, others would have seen a big fisherman, not\nthe most important on the social scale of that day, probably a rough manner\nand accent. But Jesus looked beyond that – he saw the Peter inside, the Peter\nPage 3 of 4\n3rd Sunday of Epiphany – Year B – 2015\nneed video clip of moth emerging form a chrysalis\nhe knew he could be, would be. As I say, the rest of Simon’s life was a process\nof turning the Simon he was into the Peter God intended him to be.\nGod looks at each one of us and sees us as we are, in our strengths and our\nweaknesses, our virtues and our failings; sees the person we are, sees the\nperson we can be. in the service of Baptism, as I make the sign of the cross on\nthe head of the child the following prayer is said:\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\nThere is something special, something unique about each one of us – I am not\ntalking about outward appearance, our IQ or our sporting abilities. The Bible\nsays that we are all made in the image of God – what that is saying is that there\nis something of the divine in each one of us. We can hide it at times in our\npride, our selfishness, our greed – but that something special, that something of\nthe image of God is still there and God sees it.\nIn our Old Testament Lesson we have the story of Jonah preaching to the\npeople of Nineveh. Nineveh was a pretty grim place – in truth Jonah probably\nliked the idea of God punishing them. The story tells us that Nineveh had a\nchange of heart and they were not punished – God saw beyond the\ndisobedience to something that was good. Jonah was confused, even angry\nwith God.\nAs I remarked, as Simon came towards Jesus that day, other people would have\nseen a big fisherman, probably a rough manner and accent. But Jesus looked\nPage 4 of 4\n3rd Sunday of Epiphany – Year B – 2015\nneed video clip of moth emerging form a chrysalis\nbeyond that – he saw the Peter inside, the Peter he knew he could be, would\nbe. The rest of Simon’s life was a process of changing from the Simon he was\ninto the Peter God intended him to be.\nI began with that image of the moth emerging from the chrysalis, something\nbeautiful emerging from the apparently lifeless cocoon.\nThere is something special to God about each person here. A big part of the\nChristian life is discovering that, building on that, becoming the person God\nwants us to be."
    }
}