{
    "title": "Epiphany 2013",
    "date": "2013-01-06",
    "blurb": "This sermon discusses the Feast of Epiphany, marking the end of the Christmas season. It emphasizes the profound change brought about by the birth of Jesus, breaking down barriers between clean and unclean, Jew and Gentile. The sermon encourages listeners to not just be spectators, but participants in the ongoing manifestation of Christ to the world.",
    "raw_text": "FEAST OF THE EPIPHANY – 2019 – YEAR C\n\nToday, the 6th January, the Feast of Epiphany falls on a Sunday. So we have read as our Gospel lesson the account given to us in St Matthew of the coming of the Wise Men. Epiphany marks the end of the season of Christmas. The story of the visitation of the Magi completes in our minds eye the scene around the manger. Everyone is now in place, shepherds, wise men, camels, sheep, angelic voices, all focussed intently on the child in the manger and his parents. It is the stuff of Christmas cards. Now the decorations can come down and be packed away for another year, the schools will be back, family routines will be back and life returns to normal.\n\nEpiphany unfortunately is not about life returning to normal because the central message of the Christmas story, the breaking in of God into the world in the person of Jesus means that the world can never be the same. Even the cosy scene around the manger reminds us just how profound this change is meant to be. The shepherds were certainly not the cream of society. The very nature of their work meant that they were often ritually unclean and therefore often excluded from central acts of worship. The wise men, whoever they were and wherever they came from, would have been Gentiles.\n\nAs I would often remark, the very way the Gospel writers select their material, the way they place it in the wider story, tells its own story, conveys its own message. So even in the way in which Matthew and Luke present us with the story of Jesus’ birth they are planting ideas in our head; that in the worship of the child around the manger, barriers between clean and unclean, Jew and Gentile begin to break down, a foretaste of the Gospel that is to unfold in the life and witness of the man this child is to become.\n\nSo Epiphany is not about back to normal, it is about new beginnings Last week as we reflected on the remains of our Christmas dinner, the wonderful chaos of the coming together of family and friends, I remarked that we often find ourselves asking ‘What is all this for?’ Why do we put ourselves through all this? It is, as I remarked last week, a question we might ask about the arrival of Jesus into the world. ‘Who is this child?’ Between now and Easter, in our worship Sunday by Sunday, we will be following the developing story of the public ministry of Jesus. It is in truth a question of a lifetime.\n\nI want to pose another question this week as we continue on our reflection on the life of the child whose birth we have celebrated; whose birth, in the Gospel accounts, attracted the attention of shepherd and wise man, clean and unclean, Jew and Gentile. Where do I fit in? Am I simply to be a spectator or a participant in the ongoing story of the manifestation of Christ to the Gentiles?\n\nIt is at this point that I found myself turning to the portion appointed for the Epistle, from the letter to the Ephesians. Paul is talking of his own vocation to preach the Gospel to the Gentiles. While he has a very strong sense of his own particular vocation, the story does not end with him. For he goes on:\n\n> His intent was that now, through the church, the manifold wisdom of God should be made known to the rulers and authorities in the heavenly realms,\n\nThat now, through the Church, the manifold wisdom of God should be made known. All through the Biblical history, God reveals himself, God blesses, in order that those whom he has blessed may in themselves be a blessing to others. When Abram hears God’s call to leave him homeland, when in his old age he is promised descendants, the call is given, the promise is given so that Abram may fulfil a wider vocation:\n\n> Now the LORD said to Abram, \"Go from your country and your kindred and your father's house to the land that I will show you. 2 I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing. Gen 12:1ff\n\nI come back to that question, ‘Am I to be a spectator or participant in the ongoing story of the manifestation of Christ to the world?’ Again and again I find myself coming back to that prayer of Teresa of Avila:\n\n> Christ has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\n\nHow can I show Christ to, how can I be Christ in the world this coming week, as I go in and out of the shops, as I sit at my desk in work, as I drive the car, in school, at home, wherever I find myself this week? In the face of the serious moral and political issues that face our country at this time, how can we as a Church community, both on national and local level bring some of our own understanding of the Gospel of Christ to bear on this world in which we live. For he has no lips, no feet, no hands but ours.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany2013.txt",
        "raw_ocr_content": "Page 1 of 3\nFEAST OF THE EPIPHANY – 2019 – YEAR C\nToday, the 6th January, the Feast of Epiphany falls on a Sunday. So we have\nread as our Gospel lesson the account given to us in St Matthew of the coming\nof the Wise Men. Epiphany marks the end of the season of Christmas. The\nstory of the visitation of the Magi completes in our minds eye the scene around\nthe manger. Everyone is now in place, shepherds, wise men, camels, sheep,\nangelic voices, all focussed intently on the child in the manger and his parents.\nIt is the stuff of Christmas cards. Now the decorations can come down and be\npacked away for another year, the schools will be back, family routines will be\nback and life returns to normal.\nEpiphany unfortunately is not about life returning to normal because the central\nmessage of the Christmas story, the breaking in of God into the world in the\nperson of Jesus means that the world can never be the same. Even the cosy\nscene around the manger reminds us just how profound this change is meant to\nbe. The shepherds were certainly not the cream of society. The very nature of\ntheir work meant that they were often ritually unclean and therefore often\nexcluded from central acts of worship. The wise men, whoever they were and\nwherever they came from, would have been Gentiles.\nAs I would often remark, the very way the Gospel writers select their material,\nthe way they place it in the wider story, tells its own story, conveys its own\nmessage. So even in the way in which Matthew and Luke present us with the\nstory of Jesus’ birth they are planting ideas in our head; that in the worship of\nthe child around the manger, barriers between clean and unclean, Jew and\nGentile begin to break down, a foretaste of the Gospel that is to unfold in the\nlife and witness of the man this child is to become.\nPage 2 of 3\nFEAST OF THE EPIPHANY – 2019 – YEAR C\nSo Epiphany is not about back to normal, it is about new beginnings\nLast week as we reflected on the remains of our Christmas dinner, the\nwonderful chaos of the coming together of family and friends, I remarked that\nwe often find ourselves asking ‘What is all this for?’ Why do we put ourselves\nthrough all this? It is, as I remarked last week, a question we might ask about\nthe arrival of Jesus into the world. ‘Who is this child?’ Between now and\nEaster, in our worship Sunday by Sunday, we will be following the developing\nstory of the public ministry of Jesus. It is in truth a question of a lifetime.\nI want to pose another question this week as we continue on our reflection on\nthe life of the child whose birth we have celebrated; whose birth, in the Gospel\naccounts, attracted the attention of shepherd and wise man, clean and unclean,\nJew and Gentile. Where do I fit in? Am I simply to be a spectator or a\nparticipant in the ongoing story of the manifestation of Christ to the Gentiles?\nIt is at this point that I found myself turning to the portion appointed for the\nEpistle, from the letter to the Ephesians. Paul is talking of his own vocation to\npreach the Gospel to the Gentiles. While he has a very strong sense of his own\nparticular vocation, the story does not end with him. For he goes on:\nHis intent was that now, through the church, the manifold wisdom of\nGod should be made known to the rulers and authorities in the\nheavenly realms,\nThat now, through the Church, the manifold wisdom of God should be made\nknown. All through the Biblical history, God reveals himself, God blesses, in\nPage 3 of 3\nFEAST OF THE EPIPHANY – 2019 – YEAR C\norder that those whom he has blessed may in themselves be a blessing to\nothers. When Abram hears God’s call to leave him homeland, when in his old\nage he is promised descendants, the call is given, the promise is given so that\nAbram may fulfil a wider vocation:\nNow the LORD said to Abram, \"Go from your country and your\nkindred and your father's house to the land that I will show you. 2 I\nwill make of you a great nation, and I will bless you, and make your\nname great, so that you will be a blessing. Gen 12:1ff\nI come back to that question, ‘Am I to be a spectator or participant in the\nongoing story of the manifestation of Christ to the world?’ Again and again I\nfind myself coming back to that prayer of Teresa of Avila:\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nHow can I show Christ to, how can I be Christ in the world this coming week,\nas I go in and out of the shops, as I sit at my desk in work, as I drive the car, in\nschool, at home, wherever I find myself this week? In the face of the serious\nmoral and political issues that face our country at this time, how can we as a\nChurch community, both on national and local level bring some of our own\nunderstanding of the Gospel of Christ to bear on this world in which we live.\nFor he has no lips, no feet, no hands but ours."
    }
}