{
    "title": "Prayers of Epiphany",
    "date": "2023-01-15",
    "blurb": "This sermon is a series of prayers, voicing concerns and seeking guidance from God. The prayers cover a range of topics, from the mission of the Church to global crises, to personal struggles and losses. The sermon emphasizes the importance of faith, encouragement, and the pursuit of what is right and just.",
    "raw_text": "January 15th 2023 – Epiphany 2\nSt Mark’s Ballysillan\n\nLet us voice our cares and concerns, knowing that God is listening to us.\n\n> Lord make yourself known to people who come into our Churches, or who pass by and sometimes wonder, but have not yet come in. So we pray for the mission of the Church, for this Diocese and for George our Bishop. We pray for ourselves, help us to take more seriously our responsibility of encouraging one another forward into faith, as brothers and sisters. Lord in your mercy: hear our prayer.\n\n> Lord God, the world lurches from crisis to crisis, and there is so much misleading and misdirection. We continue to pray for the people of Ukraine, for all those entrusted with leadership, those who minister to injured, the bereaved, the frightened. We pray for this Province, for Charles our King, and for all those called to leadership at this time. Help us to recover the natural sense of what is right and just, honest and good, so that our hearts are inclined to hear the voice of your leading and respond to it. Lord in your mercy: hear our prayer.\n\n> Lord God, there are some who are going through very distressing and worrying times. We pray for all who are sick, remembering especially those known to us; those anxious for themselves or for loved ones. In a few moments of silence, we stand alongside them now and ask for them your comfort, reassurance, healing and peace of mind. Lord in your mercy: hear our prayer.\n\n> We pray for all who mourn. We give thanks for all those who have gone before us in the faith, those in whom we have seen something of the light of Christ; we pray that we may share with them the joys of your perfect Kingdom. Lord in your mercy: hear our prayer.\n\nMerciful Father, accept these our prayers for the sake of your Son, our Saviour Jesus Christ. Amen",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany22023 - Prayers.txt",
        "raw_ocr_content": "January 15th 2023 – Epiphany 2\nSt Mark’s Ballysillan\nLet us voice our cares and concerns,\nknowing that Glod is listening to us.\nLord make yourself known\nto people who come into our Churches,\nor who pass by and sometimes wonder,\nbut have not yet come in.\nSo we pray for the mission of the Church,\nfor this Diocese and for George our Bishop.\nWe pray for ourselves, help us to take more seriously\nour responsibility of encouraging one another\nforward into faith, as brothers and sisters.\nLord in your mercy:\nhear our prayer.\nLord God, the world lurches from crisis to crisis,\nand there is so much misleading and misdirecting.\nWe continue to pray for the people of Ukraine,\nfor all those entrusted with leadership,\nthose who minister to injured, the bereaved, the frightened.\nWe pray for this Province,\nfor Charles our King, and for all those called to leadership at this time.\nHelp us to recover the natural sense\nof what is right and just, honest and good,\nso that our hearts are inclined\nto hear the voice of your leading and respond to it.\nLord in your mercy:\nhear our prayer.\nLord God, there are some who are going through\nvery distressing and worrying times.\nWe pray for all who are sick, remembering especially those known to us.;\nthose anxious for themselves or for loved ones.\nIn a few moments of silence, we stand alongside them now\n…………………………………………………..\nand ask for them your comfort, reassurance,\nhealing and peace of mind.\nLord in your mercy:\nhear our prayer.\nWe pray for all who mourn …………………….\nWe give thanks for all those who have gone before us in the faith,\nthose in whom we have seen something of the light of Christ;\nwe pray that we may share with them the joys of your perfect Kingdom.\nLord in your mercy:\nhear our prayer.\nMerciful Father,\naccept these our prayers\nfor the sake of your Son,\nour Saviour Jesus Christ.\nAmen"
    }
}