{
    "title": "Journey of Faith",
    "date": "2017-01-15",
    "blurb": "This sermon reflects on the journey of faith, beginning with Jesus' baptism and his calling of the disciples. It emphasizes the idea that faith is a lifelong journey and that God calls individuals in all their humanity, strengths, and weaknesses. The sermon also encourages the faithful to be instruments of God in their everyday lives, bearing a rich harvest of love, integrity, justice, and peace.",
    "raw_text": "Last Sunday, the first Sunday after Epiphany, our Lessons were grouped under the heading of 'The Baptism of Jesus'. We have left behind the stable, the child in the manger, the shepherds, the wise men, Joseph and Mary. We have leapt forward some thirty years or so. Last Sunday we heard of the Baptism of Jesus by John in the river Jordan.\n\nSpeaking of our own baptism, the Pastoral Introduction to the Service of Baptism in our Prayer Book begins: 'Baptism marks the beginning of a journey with God which continues for the rest of our lives, the first step in response to God's love'\n\nThis morning I want to reflect on journeys, the beginnings of journeys for Jesus himself, for the disciples, for us. For Jesus, his Baptism by John the Baptist marked the beginning of his public ministry, the beginning of a journey from the Jordan, through Galilee and ultimately to Jerusalem, the drama of conflict, of trial, of Cross and Resurrection.\n\nAs he set out on that journey, he called others to follow him. In our Gospel reading we heard John’s account of the beginning of that process. It begins with the Baptist pointing his two of his disciples to Jesus. We are simply told that they followed Jesus. The word used in the original Greek of the Gospel carries with it the mean of 'following as a disciple'. There is awkwardness to what follows as Jesus asks them 'What are you looking for?' Well, what are they looking for? At that point they don’t know and so they just ask 'Where are you staying?' The response is the invitation 'Come and see.'\n\nWe have that lovely meeting of Simon with Jesus: 'You are Simon son of John. You will be called Cephas' (which, when translated, is Peter). Simon didn’t know what his brother Andrew’s strange new friend was talking about, but there was something, something he could not put his finger on, that kept him there. And, as I often say, the rest of his life, the rest of his journey, was a process of the Simon he was becoming the Peter Jesus called him to be.\n\nAs I look back on the start of my own haphazard spiritual journey, I find myself facing that same question Jesus asked of those two men, 'What are you looking for?' I certainly didn’t know then. I’ve recalled my physics master, fabulous teacher, delightfully eccentric, deeply devout, having just expounded on the incredible order of the created universe, demanding of his sceptical 6th form 'A' Level class – 'Don’t tell me its all an accident'.\n\nJesus called those early disciples as they were in all their humanity, in all their strengths and weaknesses, and worked in and through this most unlikely collection of men and women bringing the Gospel to the far corners of the then known world.\n\nWe are chosen not because we are especially virtuous, especially talented, especially anything – we are chosen, called to be saints, as we are in all our strengths, our weaknesses, our talents and our failures. And worship, in its broadest sense, is about offering our whole selves to God – our talents, our laughter and our love, our failure and our brokenness. The God we worship, the God who has called us and to whom we seek to respond, he will take us and use us to be his instruments wherever he has placed us – in the streets and the homes, the schools and the business, the shops, the pubs, the clubs, the meetings, the casual conservations, places where people are hurting, where people are being ignored.\n\nThis is the vocation, the calling of the Church as individuals and as a community in our country at this time.\n\nAs we continue on our journey of faith, may we be faithful to his call, may we in our own individual and community life bear a rich harvest of love, of integrity, of justice and peace, that his Kingdom may be upheld, his Kingdom advanced in this time and place in which we find ourselves.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany22017.txt",
        "raw_ocr_content": "Page 1 of 4\nEPIPHANY 2 – 2017 – Year A\nLast Sunday, the first Sunday after Epiphany, our Lessons were grouped under\nthe heading of ‘The Baptism of Jesus’. We have left behind the stable, the\nchild in the manger, the shepherds, the wise men, Joseph and Mary. We have\nleapt forward some thirty years or so. Last Sunday we heard of the Baptism of\nJesus by John in the river Jordan.\nSpeaking of our own baptism, the Pastoral Introduction to the Service of\nBaptism in our Prayer Book begins:\n‘Baptism marks the beginning of a journey with God which continues\nfor the rest of our lives, the first step in response to God's love’\nThe beginning of a journey for us with God and into God which continues for\nthe rest of our lives.\nThis morning I want to reflect on journeys, the beginnings of journeys for Jesus\nhimself, for the disciples, for us. For Jesus, his Baptism by John the Baptist\nmarked the beginning of his public ministry, the beginning of a journey from\nthe Jordan, through Galilee and ultimately to Jerusalem, the drama of conflict,\nof trial, of Cross and Resurrection.\nAs he set out on that journey, he called others to follow him. In our Gospel\nreading we heard John’s account of the beginning of that process. It begins\nwith the Baptist pointing his two of his disciples to Jesus. We are simply told\nthat they followed Jesus. The word used in the original Greek of the Gospel\ncarries with it the mean of ‘following as a disciple’. There is awkwardness to\nwhat follows as Jesus asks them ‘What are you looking for?’ Well, what are\nthey looking for? At that point they don’t know and so they just ask ‘Where\nPage 2 of 4\nEPIPHANY 2 – 2017 – Year A\nare you staying?’ The response is the invitation ‘Come and see.’ As I’ve said\nbefore, the Greek in which the Gospel is written has a number of words that we\ntranslate as the single English word ‘see’. There is the casual, ‘I see’, as ‘I see\nthe cat on the wall’. Then there is ‘I see’ as I notice. And finally I see, I\nunderstand, I see this is significant. It is this last word that is used in Jesus’\nwords of invitation in the Gospel ‘Come and see.’\nGoing back to the start of this, their following, their discipleship begins before\nthey have any personal knowledge or experience of Jesus – there is little more\nthan an instinctive response to the prompting of John. But there is something\nabout Jesus that draws them in, to discover more, to get a deeper understanding\nof him and his message. And so they accept the invitation, they go to see\nwhere he is staying and they spend the day with him. We know nothing of\nwhat was said, nothing of what was done but whatever it was, Andrew just has\nto go and find his brother Simon and tell him all about it. ‘We have found the\nMessiah.’ It all sounds so definite but as we shall realise as we follow the\nsubsequent story, they didn’t fully understand what Jesus was all about. But\nthey knew enough that they wanted to share it, wanted to share this journey of\ndiscovery with others.\nWe have that lovely meeting of Simon with Jesus: “You are Simon son of\nJohn. You will be called Cephas” (which, when translated, is Peter). Simon\ndidn’t know what his brother Andrew’s strange new friend was talking about,\nbut there was something, something he could not put his finger on, that kept\nhim there. And, as I often say, the rest of his life, the rest of his journey, was a\nprocess of the Simon he was becoming the Peter Jesus called him to be.\nPage 3 of 4\nEPIPHANY 2 – 2017 – Year A\nAs I look back on the start of my own haphazard spiritual journey, I find\nmyself facing that same question Jesus asked of those two men, ‘What are you\nlooking for?’ I certainly didn’t know then. I’ve recalled my physics master,\nfabulous teacher, delightfully eccentric, deeply devout, having just expounded\non the incredible order of the created universe, demanding of his sceptical 6th\nform ‘A’ Level class – ‘Don’t tell me its all an accident’.\nThat was the beginning of my journey. I remember being moved to pray not\nknowing who or what I was praying to. I recall going to Church, not having\nmuch of a clue as to what was going on but deeply impressed by the people\nwho gathered there so much so that I felt I wanted to go back to be a part of\nwhatever was going on there. Understanding of doctrine, knowledge of Bible\ncame later along the line. These random thoughts came together as I read our\nGospel passage and a passage in a book I’m reading at the moment.\nGod likes us so much that he has, over time, made available to us in\nour midst a way to disentangle us from the mess we inhabit, before we\neven knew it was a mess, and instead has invited us to share with God,\nat the same level as ourselves, in making something entirely different,\ntogether.\nJames Alison ‘Undergoing God’ p34\nJesus coming to disentangle us from the mess we inhabit, before we even knew\nit was a mess, inviting us to share with him in making something entirely\ndifferent together.\nJesus called those early disciples as they were in all their humanity, in all their\nstrengths and weaknesses, and worked in and through this most unlikely\nPage 4 of 4\nEPIPHANY 2 – 2017 – Year A\ncollection of men and women bringing the Gospel to the far corners of the then\nknown world.\nI often reflect on the text the Bishop of Aston took for his sermon at my own\nConfirmation, just before I came away to College.\n16 You did not choose me but I chose you. John 15:16\nWe are chosen not because we are especially virtuous, especially talented,\nespecially anything – we are chosen, called to be saints, as we are in all our\nstrengths, our weaknesses, our talents and our failures. And worship, in its\nbroadest sense, is about offering our whole selves to God – our talents, our\nlaughter and our love, our failure and our brokenness. The God we worship,\nthe God who has called us and to whom we seek to respond, he will take us\nand use us to be his instruments wherever he has placed us – in the streets and\nthe homes, the schools and the business, the shops, the pubs, the clubs, the\nmeetings, the casual conservations, places where people are hurting, where\npeople are being ignored.\nThis is the vocation, the calling of the Church as individuals and as a\ncommunity in our country at this time.\n16 You did not choose me but I chose you. And I\nappointed you to go and bear fruit, fruit that will last,\nJohn 15:16\nAs we continue on our journey of faith, may we be faithful to his call, may we\nin our own individual and community life bear a rich harvest of love, of\nintegrity, of justice and peace, that his Kingdom may be upheld, his Kingdom\nadvanced in this time and place in which we find ourselves.."
    }
}