{
    "title": "Openness to Truth",
    "date": "2015-01-18",
    "blurb": "Kevin delivers a sermon on the 2nd Sunday of Epiphany, Year B, 2015, focusing on the themes of openness to truth and recognizing personal biases. He uses the story of the blind men and the elephant to illustrate the importance of being receptive to different perspectives. He also discusses the significance of the Week of Prayer for Christian Unity and the need for ecumenism.",
    "raw_text": "I recall when I was Bishop’s Curate in Finglas and we were out socialising on the south side of the city, I used to get innocent amusement watching people’s reactions, when they asked me what part of the city I was living in. I would reply brightly 'Finglas' or, even better, 'Finglas West' – or if I was feeling really mischievous, 'the bottom of the Cappagh Road'. People from Dublin 4 had their own particular mental picture of Finglas that coloured their reaction to people.\n\nBut of course it is always someone else who has prejudices, isn’t it? As the character Bernard Wooley in the TV series 'Yes, Prime Minister' once remarked: 'It’s one of those irregular verbs isn’t it? I have strong opinions, you are prejudiced, he is being prosecuted under the Race Relations Act.'\n\nOne of the themes of this season of Epiphany is that of God making himself known; God revealing himself in man, in the person of Jesus, revealing himself in and through the Church. This morning I want to continue my thoughts along these lines. Here I am not thinking of any revelation I may impart. Instead I want to reflect on my response to the witness of others.\n\nTurning to our Gospel reading, we know very little about Nathaniel but one thing is very clear. Whatever expectations he may have had of the Messiah, he most certainly did not expect him to come from Nazareth. One suspects that Nazareth was to Nathaniel what Finglas is to someone from Dublin 4. In our Old Testament Lesson, one senses a certain tetchiness on the part of Eli towards young Samuel’s repeated appearances at his bedside in the middle of the night.\n\nThat is until the truth dawns that something remarkable is happening; that child though he is, Samuel is being called by God.\n\nI suppose what I am getting around to here is openness to truth, being attentive, being honest about my own personal blind spots, recognising my own personal Nazareth’s..\n\nAn illustration you will have often heard me use is a story that comes from India. It is of a group of blind men who are lead up to an elephant and asked to describe it. One grasps the trunk and says, 'An elephant is like a big rubbery hose.' Meanwhile another is running his hand over one of the tusks and says, 'No, an elephant is hard and smooth, it is like a big shiny spike.' As these two are arguing, a third man has his arms around one of its legs. 'No, you are both wrong. an elephant is like a tree trunk. All to the disgust of a fourth man who has his hands on the poor animal’s ear. 'Can you not all realise that an elephant is like a big floppy, leathery leaf.'\n\nThe one thing that they were all agreed on is that the others were all wrong. But in truth, they each had part of the picture. If they had been prepared to listen to each other, to learn from each other, then together they could have got a fuller picture of the reality that was the elephant.\n\nWe are about to enter the Week of Prayer for Christian Unity. In truth Ecumenism, since its heyday in the 70’s and 80’s, is viewed with a mixture of frustration and boredom. A sort of mixture between, 'We’ve done all that.' and 'We’re getting nowhere.' Ecumenism for me still has its fundamental challenges. It is about an openness to each other, a willingness to share my understanding with others, a willingness to listen as others share their understanding.' Archbishop McAdoo used to sum it up as saying, 'This is my faith. Please tell me yours.' Because none of us have a monopoly on truth, none of us have the full picture; all of us have insights to offer, to receive that all of us may grow in our faith and discipleship. Ecumenism challenges me to examine my own personal Nazareth’s, whether they be other cultures, other Churches, or just people who differ form in outlook, in preferred style of worship.\n\nIt is good on occasion to move out of our own personal comfort zones. Over the years I have made it my business to attend conferences and events organised by a wide range of spiritual groupings. I have rarely come away without learning something fresh. One of the privileges of my job is that it has enabled me to share in the life of very different parish and social communities. Finglas in the early 1980’s, the farming community in Mountmellick, Ahoghill and mid Antrim in the troubled era of the 1990’s, then over the last ten years this village of Howth; these are all very different places. Each have their own strengths, each have their own particular blind spots. In each of them I have it said that I must have found it very hard living in my previous Parish. In each of these situations I have learned, I have grown in my faith and as a person.\n\nMy late father in law would often refer to the Westminster Confession of Faith of the Presbyterian Church as it spoke of the importance of receiving light from whichever quarter it may come. may god grant to each of us the humility to recognise our own particular blind spots, our own particular Nazareth’s. May he make each one of us attentive to his truth, from whichever quarter he may choose to reveal it; that each in our own hearts may say, 'Speak Lord, for your servant is listening.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany22015.txt",
        "raw_ocr_content": "Page 1 of 3\n2nd Sunday of Epiphany – Year B – 2015\nI recall when I was Bishop’s Curate in Finglas and we were out socialising on\nthe south side of the city, I used to get innocent amusement watching people’s\nreactions, when they asked me what part of the city I was living in. I would\nreply bightly ‘Finglas’ or, even better, ‘Finglas West’ – or if I was feeling\nreally mischievous, ‘the bottom of the Cappagh Road’. People from Dublin 4\nhad their own particular mental picture of Finglas that coloured their reaction\nto people.\nBut of course it is always someone else who has prejudices, isn’t it? As the\ncharacter Bernard Wooley in the TV series ‘Yes, Prime Minister’ once\nremarked: ‘It’s one of those irregular verbs isn’t it? I have strong opinions,\nyou are prejudiced, he is being prosecuted under the Race Relations Act.’\nOne of the themes of this season of Epiphany is that of God making himself\nknown; God revealing himself in man, in the person of Jesus, revealing\nhimself in and through the Church. This morning I want to continue my\nthoughts along these lines. Here I am not thinking of any revelation I may\nimpart. Instead I want to reflect on my response to the witness of others.\nTurning to our Gospel reading, we know very little about Nathaniel but one\nthing is very clear. Whatever expectations he may have had of the Messiah, he\nmost certainly did not expect him to come from Nazareth. One suspects that\nNazareth was to Nathaniel what Finglas is to someone from Dublin 4. In our\nOld Testament Lesson, one senses a certain tetchiness on the part of Eli twards\nyoung Samuel’s repeated appearances at his bedside in the middle of the night.\nPage 2 of 3\n2nd Sunday of Epiphany – Year B – 2015\nThat is until the truth dawns that something remarkable is happening; that child\nthough he is, Samuel is being called by God.\nI suppose what I am getting around to here is openness to truth, being attentive,\nbeing honest about my own personal blind spots, recognising my own personal\nNazareth’s..\nAn illustration you will have often heard me use is a story that comes from\nIndia. It is of a group of blind men who are lead up to an elephant and asked to\ndescribe it. One graps the trunk and says, ‘An elephant is like a big rubbery\nhose.’ Meanwhile another is running his hand over one of the tusks and says,\n‘No, an elephant is hard and smooth, it is like a big shiny spike.’ As these two\nare arguing, a third man has his arms around one of its legs. ‘No, your are both\nwrong. an elephant is like a tree trunk. All to the disgust of a fourth man who\nhas his hands on the poor animal’s ear. ‘Can you not all realise that an\nelephant is like a big floppy, leathery leaf.’\nThe one thing theat they were all agreed on is that the others were all wrong.\nBut in truth, they each had part of the picture. If they had been prepared to\nlisten to each other, to learn from each other, then together they could have got\na fuller picture of the reality that was the elephant.\nWe are about to enter the Week of Prayer for Christian Unity. In truth\nEcumenism, since its heyday in the 70’s and 80’s, is viewed with a mixture of\nfrustration and boredom. A sort of mixture between, ‘We’ve done all that.’ and\n‘We’re getting nowhere.’ Ecumenism for me still has its fundamental\nchallenges. It is about an openness to each other, a willingness to share my\nunderstanding with others, a willingness to listen as others share their\nPage 3 of 3\n2nd Sunday of Epiphany – Year B – 2015\nunderstanding.’ Archbishop McAdoo used to sum it up as saying, ‘This is my\nfaith. Please tell me yours.’ Because none of us have a monopoly on truth,\nnone of us have the full picture; all of us have insights to offer, to receive that\nall of us may grow in our faith and discipleship. Ecumenism challenges me to\nexamine my own personal Nazareth’s, whether they be other cultures, other\nChurches, or just people who differ form in outlook, in preferred style of\nworship.\nIt is good on occasion to move out of our own personal comfort zones. Over\nthe years I have made it my business to attend conferences and events\norganised by a wide range of spiritual groupings. I have rarely come away\nwithout learning something fresh. One of the privileges of my job is that it has\nenabled me to share in the life of very different parish and social communities.\nFinglas in the early 1980’s, the faming community in Mountmellick, Ahoghill\nand mid Antrim in the troubled era of the 1990’s, then over the last ten years\nthis village of Howth; these are all very different places. Each have their own\nstrengths, each have their own particular blind spots. In each of them I have it\nsaid that I must have found it very hard living in my previous Parish. In each\nof these situations I have learned, I have grown in my fiath and as a person.\nMy late father in law would often refer to the Westminster Confession of Faith\nof the Presbyterian Church as it spoke of the importance of receiving light from\nwhichever quarter it may come. may god grant to each of us the humility to\nrecognise our own particular blind spots, our own particular Nazareth’s. May\nhe make each one of us attentive to his truth, from whichever quarter he may\nchoose to reveal it; that each in our own hearts may say, ‘Speak Lord, for your\nservant is listening.’"
    }
}