{
    "title": "Moments of Epiphany",
    "date": "2014-01-05",
    "blurb": "This sermon explores the concept of Epiphany, moments when God breaks through and seems very real. It discusses how God makes himself known through creation, how humans are created in God's image and are called to reveal God in their daily lives, and the mystery of the incarnation. It also touches on the vocation that flows from baptism.",
    "raw_text": "1st Sunday of Epiphany – 2014\n\nDon’t we use some strange terms in Church? Some of those old names for the Sundays before Lent – Septuagesima, Sexagesima, Quinquagesima – they roll off the tongue; there was a history to their usage. The season of the Church’s year that we have just entered – Epiphany. Starting on the 6th January it marks the end of Christmas, associated with the arrival of the Magi at the stable. Epiphany – again it rolls off the tongue; but what does it mean? So I looked it up in my dictionary – “a moment of manifestation of divine reality” Maybe a simpler way of putting it would be “moments when God breaks through”, those moments of revelation, realisation, when God seems very real.\n\nYou see it in the psalms. Psalm 8 for example: “When I see the heavens, the works of your fingers, the moon and the stars that you have put in place, what is man that you are mindful of him, the son of man that you care for him?” These moments when heaven and earth seem to meet. Our Gospel passage, which tells of the Baptism of Jesus by John in the Jordan; We read from Matthew. Mark puts it a bit differently, “as Jesus was coming out of the water he saw ‘the heavens torn apart’ and the Spirit descending like a dove on him.” A moment of clarity, of realisation.\n\nThis morning I just want to think a bit around this whole topic of epiphany, of God making himself known. There is that little verse you often see in gardens, ‘you are nearer to God in the garden than anywhere else on earth.’ Not being a great gardener, I have never fully identified with that one. But there is that sense that God is revealed, that we encounter God in his creation – whether it be the enormity of the heavens as we see them in the night sky – the stars we see millions and millions of miles away – the beauty of the rainbow, the changing colours of an evening sky as the sun dips below the horizon – or the amazing order of the atomic and subatomic world. The sheer order of creation, from the expanses of the galaxies to the interaction of the smallest subatomic particles, all expressed in mathematical models has never ceased to inspire me, to move me to wonder, to worship. Well may we say with the psalmist, when I consider the work of your fingers – what is man that you are mindful of him?\n\nThe Bible not only talks of God as creator; in the first of the Creation narratives in Genesis we read of God creating man in his own image, male and female he created them. What does it mean to say that you and I are created in the image of God? To be an image of something always means letting that something appear, involves revealing it.\n\nYou and I, in all our brokenness and frailty, bearers of God’s image, called in our own daily life not just to bear an external witness to God, but to reveal God, to bring something of the divine to bear upon the world in which we find ourselves. To treat every other human being with a respect and a reverence; to recognise in every other human being, however different, however awkward or abrasive or difficult, something of the divine.\n\nThen of course, as we are reminded in the Christmas Gospel, there is the mystery of the incarnation. “The Word became flesh and lived for a while among us. We have seen his glory, the glory of the one and only Son who came from the Father, full of grace and truth.” (John 1:14)\n\nIn the Incarnation, in his divinity and his humanity Jesus reveals God, reveals what we are called to be in our humanity. And so St Paul tells the Christians in Philippi, ‘Your attitude should be the same as that of Christ Jesus.’ As ones made in the image of God, we are called to reflect in our own lives, as individuals and as a community, something of the self giving, self emptying love of Christ.\n\nIn our Family Service, as we think of the Baptism of Jesus by John, I am going to be thinking a bit about our own Baptism and the vocation that flows from our baptism. As we are reminded in the service itself, it is nothing less that to ‘live as disciples of Christ’, in our work and in our family life, in our relaxation. Called in fact, as ones made in the image of God, to be instruments of epiphany, that through us God’s presence may be felt.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany12014 -930.txt",
        "raw_ocr_content": "Page 1 of 3\n1st Sunday of Epiphany – 2014\nDon’t we use some strange terms in Church? Some of those old names for the\nSundays before Lent – Septuagesima, Sexagesima, Quinquagesima – they roll\noff the tongue; there was a history to their usage. The season of the Church’s\nyear that we have just entered – Epiphany. Starting on the 6th January it marks\nthe end of Christmas, associated with the arrival of the Magi at the stable.\nEpiphany – again it rolls off the tongue; but what does it mean? So I looked it\nup in my dictionary – “a moment of manifestation of divine reality” Maybe a\nsimpler way of putting it would be “moments when God breaks through”, those\nmoments of revelation, realisation, when God seems very real.\nYou see it in the psalms. Psalm 8 for example: “When I see the heavens, the\nworks of your fingers, the moon and the stars that you have put in place, what\nis man that you are mindful of him, the son of man that you care for him?”\nThese moments when heaven and earth seem to meet. Our Gospel passage,\nwhich tells of the Baptism of Jesus by John in the Jordan; We read from\nMatthew. Mark puts it a bit differently, “as Jesus was coming out of the water\nhe saw ‘the heavens torn apart’ and the Spirit descending like a dove on him.”\nA moment of clarity, of realisation.\nThis morning I just want to think a bit around this whole topic of epiphany, of\nGod making himself known. There is that little verse you often see in gardens,\n‘you are nearer to God in the garden than anywhere else on earth.’ Not being a\ngreat gardener, I have never fully identified with that one. But there is that\nsense that God is revealed, that we encounter God in his creation – whether it\nPage 2 of 3\n1st Sunday of Epiphany – 2014\nbe the enormity of the heavens as we see them in the night sky – the stars we\nsee millions and millions of miles away – the beauty of the rainbow, the\nchanging colours of an evening sky as the sun dips below the horizon – or the\namazing order of the atomic and subatomic world. The sheer order of creation,\nfrom the expanses of the galaxies to the interaction of the smallest subatomic\nparticles, all expressed in mathematical models has never ceased to inspire me,\nto move me to wonder, to worship. Well may we say with the psalmist, when I\nconsider the work of your fingers – what is man that you are mindful of him?\nThe Bible not only talks of God as creator; in the first of the Creation\nnarratives in Genesis we read of God creating man in his own image, male and\nfemale he created them. What does it mean to say that you and I are created in\nthe image of God? To be an image of something always means letting that\nsomething appear, involves revealing it.\nYou and I, in all our brokenness and frailty, bearers of God’s image, called in\nour own daily life not just to bear an external witness to God, but to reveal\nGod, to bring something of the divine to bear upon the world in which we find\nourselves. To treat every other human being with a respect and a reverence; to\nrecognise in every other human being, however different, however awkward or\nabrasive or difficult, something of the divine.\nThen of course, as we are reminded in the Christmas Gospel, there is the\nmystery of the incarnation. “The Word became flesh and lived for a while\namong us. We have seen his glory, the glory of the one and only Son who\ncame from the Father, full of grace and truth.” (John 1:14)\nPage 3 of 3\n1st Sunday of Epiphany – 2014\nIn the Incarnation, in his divinity and his humanity Jesus reveals God, reveals\nwhat we are called to be in our humanity. And so St Paul tells the Christians in\nPhilippi, ‘Your attitude should be the same as that of Christ Jesus.’ As ones\nmade in the image of God, we are called to reflect in our own lives, as\nindividuals and as a community, something of the self giving, self emptying\nlove of Christ.\nIn our Family Service, as we think of the Baptism of Jesus by John, I am going\nto be thinking a bit about our own Baptism and the vocation that flows from\nour baptism. As we are reminded in the service itself, it is nothing less that to\n‘live as disciples of Christ’, in our work and in our family life, in our\nrelaxation. Called in fact, as ones made in the image of God, to be instruments\nof epiphany, that through us God’s presence may be felt."
    }
}