{
    "title": "Grace and Transformation",
    "date": "2013-01-20",
    "blurb": "In this sermon, Kevin discusses the concept of grace and the transformative power of Christ. Drawing from the story of the wedding at Cana and Paul's letter to the Corinthians, he explores how God's grace can empower, inspire, and work through our strengths and weaknesses. He also reflects on the role of the Church in a rapidly changing society and the importance of embodying Christ's healing and reconciling presence in the world.",
    "raw_text": "With weddings in the air, at this time of year I will often find myself meeting with couples planning their marriage service. One of the choices to be made of course will be the lessons that are to be read. Very often the Gospel appointed for today, the account given to us by St John of the wedding at Cana in Galilee, will feature on the list. It is a story that can be read on a number of levels.\n\nThere is the extravagance of the provision, huge amounts of high quality wine, far superior to what would normally be provided on such an occasion. There is the symbolism of the six water jars, one short of the number seven. One theme I will often explore with a couple either in the lead up to the service or in the context of the service itself is the idea that here we have a situation that has gone horribly wrong, the wine has run out, the embarrassment to the family, the loss of face in front of the community. A situation, moreover, that is transformed by the presence of Christ. I go on to suggest that there is no situation, no crisis in life, in marriage, in relationships that is not open to the transforming, healing presence of Christ.\n\nAs I reflected on that during the week, the words of an old prayer came to my mind, that God may ‘correct what is amiss and supply what is lacking …’. It is in fact from that lovely old prayer for Ireland that we find in our prayer books.\n\n> Almighty and merciful God, who in days of old didst give to this land the benediction of thy holy Church; Withdraw not, we pray thee, thy favour from us, but so correct what is amiss, and supply what is lacking, that we may more and more bring forth fruit to thy glory; through Jesus Christ our Lord. (BCP 2004, p 145)\n\nAs I thought on that, the word that came to me was ‘grace’ that for me draws together the concepts of empowerment, of inspiration, of God working in and through my strengths, my weaknesses, my faithfulness and my failure.\n\nIt is with that in mind I turn to the portion appointed as the second lesson for this 2nd Sunday after the Epiphany, from Paul’s 1st Letter to the Corinthians. The Corinthian Church in many ways mirrors the Church in our own day. It was a very diverse community, different groups identifying very strongly with particular charismatic figures, Peter, Paul, Appolos. Different factions held very strong divergent views on the place and importance of different spiritual gifts. This diversity was manifesting itself in divisiveness. In this passage Paul appeals for a unity based on the recognition that God is working in and through all the varied gifts and talents of the Church.\n\nAs Paul talks of the nature and inspiration of the varied gifts and talents of this troubled and troubling Church he uses language that is very much rooted in this whole concept of grace.\n\n> 4 Now there are varieties of gifts, but the same Spirit; 5and there are varieties of services, but the same Lord; 6and there are varieties of activities, but it is the same God who activates all of them in everyone. 1 Cor 12:4-6\n\nEven his choice of words serves to emphasise his message. The piece we have translated as; ‘there are varieties of activities, but it is the same God who activates all of them’; In the original Greek in which he was writing, the words we have rendered as ‘activities’ and ‘activates’ have their root in the Greek word ejnerghein , from which we of course derive our words ‘energy’, ‘energise’. So, ‘there are varieties of energies, but it is the same God who energises all of them’. This calls to mind the teaching of the Revised Catechism of the Church of Ireland on the work of the Holy Spirit, ‘The Holy Spirit inspires all that is good in mankind.’ God, through the Spirit, energising, inspiring.\n\nI go back to that prayer for Ireland in our Prayer Book:\n\n> Almighty and merciful God, who in days of old didst give to this land the benediction of thy holy Church; Withdraw not, we pray thee, thy favour from us, but so correct what is amiss, and supply what is lacking, that we may more and more bring forth fruit to thy glory; through Jesus Christ our Lord. (BCP 2004, p 145)\n\nThis prayer for Ireland, this prayer for the Church, is a prayer that God may work in and through the imperfection of our life and witness, that God may energise our energies. The Ireland I arrived in as a young student in 1968 is a very different Ireland to the Ireland of today. The Church of today faces very different pressures to the Church in which I was ordained in 1978. Issues of human sexuality were hardly mentioned; Ireland was still in transition from a largely rural to urban society; our entry into the European Union, the arrival of people from all parts of the world to live and work among us has made our society more varied and cosmopolitan. Our legislators and judiciary are having to engage with issues of human sexuality, issues surrounding the beginning and end of life, abortion and assisted suicide that have been avoided or swept under the carpet until now. The aftermath of the Celtic Tiger has presented our society with issues of justice, of fairness; what sort of economy, what sort of society do we want to see emerging from our present crisis? The recent re-emergence of unrest on the streets of Belfast, of paramilitary groupings on both sides of the divide, all bear witness to the fact that there are still deep, unhealed divisions in society in the North. What place does the Church have in a rapidly changing society? It is I would argue to be the Body of Christ in the world of today, to embody in its individual and corporate life something of the healing, reconciling, transforming presence of Christ in the world of today, to answer in our own lives the Prayer of St Francis:\n\n> Lord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nGrant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\n\nO Lord ‘so correct what is amiss, and supply what is lacking, that we may more and more bring forth fruit to thy glory;’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany22013.txt",
        "raw_ocr_content": "Page 1 of 4\nEpiphany 2 – Year C – 2013\nWith weddings in the air, at this time of year I will often find myself meeting\nwith couples planning their marriage service. One of the choices to be made of\ncourse will be the lessons that are to be read. Very often the Gospel appointed\nfor today, the account given to us by St John of the wedding at Cana in Galilee,\nwill feature on the list. It is a story that can be read on a number of levels.\nThere is the extravagance of the provision, huge amounts of high quality wine,\nfar superior to what would normally be provided on such an occasion. There is\nthe symbolism of the six water jars, one short of the number seven. One theme\nI will often explore with a couple either in the lead up to the service or in the\ncontext of the service itself is the idea that here we have a situation that has\ngone horribly wrong, the wine has run out, the embarrassment to the family,\nthe loss of face in front of the community. A situation, moreover, that is\ntransformed by the presence of Christ. I go on to suggest that there is no\nsituation, no crisis in life, in marriage, in relationships that is not open to the\ntransforming, healing presence of Christ.\nAs I reflected on that during the week, the words of an old prayer came to my\nmind, that God may ‘correct what is amiss and supply what is lacking …’. It is\nin fact from that lovely old prayer for Ireland that we find in our prayer books.\nAlmighty and merciful God, who in days of old didst give to this land\nthe benediction of thy holy Church; Withdraw not, we pray thee, thy\nfavour from us, but so correct what is amiss, and supply what is\nlacking, that we may more and more bring forth fruit to thy glory;\nthrough Jesus Christ our Lord. (BCP 2004, p 145)\nAs I thought on that, the word that came to me was ‘grace’ that for me draws\ntogether the concepts of empowerment, of inspiration, of God working in and\nthrough my strengths, my weaknesses, my faithfulness and my failure.\nPage 2 of 4\nEpiphany 2 – Year C – 2013\nIt is with that in mind I turn to the portion appointed as the second lesson for\nthis 2nd Sunday after the Epiphany, from Paul’s 1st Letter to the Corinthians.\nThe Corinthian Church in many ways mirrors the Church in our own day. It\nwas a very diverse community, different groups identifying very strongly with\nparticular charismatic figures, Peter, Paul, Appolos. Different factions held\nvery strong divergent views on the place and importance of different spiritual\ngifts. This diversity was manifesting itself in divisiveness. In this passage\nPaul appeals for a unity based on the recognition that God is working in and\nthrough all the varied gifts and talents of the Church.\nAs Paul talks of the nature and inspiration of the varied gifts and talents of this\ntroubled and troubling Church he uses language that is very much rooted in this\nwhole concept of grace.\n4 Now there are varieties of gifts, but the same Spirit; 5and there\nare varieties of services, but the same Lord; 6and there are\nvarieties of activities, but it is the same God who activates all of\nthem in everyone. 1 Cor 12:4-6\nEven his choice of words serves to emphasise his message. The piece we have\ntranslated as; ‘there are varieties of activities, but it is the same God who\nactivates all of them’; In the original Greek in which he was writing, the words\nwe have rendered as ‘activities’ and ‘activates’ have their root in the Greek\nword ejnerghein , from which we of course derive our words ‘energy’,\n‘energise’. So, ‘there are varieties of energies, but it is the same God who\nenergises all of them’. This calls to mind the teaching of the Revised\nCatechism of the Church of Ireland on the work of the Holy Spirit, ‘The Holy\nPage 3 of 4\nEpiphany 2 – Year C – 2013\nSpirit inspires all that is good in mankind.’ God, through the Spirit, energising,\ninspiring.\nI go back to that prayer for Ireland in our Prayer Book:\nAlmighty and merciful God, who in days of old didst give to this land\nthe benediction of thy holy Church; Withdraw not, we pray thee, thy\nfavour from us, but so correct what is amiss, and supply what is\nlacking, that we may more and more bring forth fruit to thy glory;\nthrough Jesus Christ our Lord. (BCP 2004, p 145)\nThis prayer for Ireland, this prayer for the Church, is a prayer that God may\nwork in and through the imperfection of our life and witness, that God may\nenergise our energies. The Ireland I arrived in as a young student in 1968 is a\nvery different Ireland to the Ireland of today. The Church of today faces very\ndifferent pressures to the Church in which I was ordained in 1978. Issues of\nhuman sexuality were hardly mentioned; Ireland was still in transition from a\nlargely rural to urban society; our entry into the European Union, the arrival of\npeople from all parts of the world to live and work among us has made our\nsociety more varied and cosmopolitan. Our legislators and judiciary are having\nto engage with issues of human sexuality, issues surrounding the beginning and\nend of life, abortion and assisted suicide that have been avoided or swept under\nthe carpet until now. The aftermath of the Celtic Tiger has presented our\nsociety with issues of justice, of fairness; what sort of economy, what sort of\nsociety do we want to see emerging from our present crisis? The recent re-\nemergence of unrest on the streets of Belfast, of paramilitary groupings on both\nsides of the divide, all bear witness to the fact that there are still deep, unhealed\ndivisions in society in the North. What place does the Church have in a rapidly\nPage 4 of 4\nEpiphany 2 – Year C – 2013\nchanging society? It is I would argue to be the Body of Christ in the world of\ntoday, to embody in its individual and corporate life something of the healing,\nreconciling, transforming presence of Christ in the world of today, to answer in\nour own lives the Prayer of St Francis:\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nGrant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\nO Lord ‘so correct what is amiss, and supply what is lacking, that we may\nmore and more bring forth fruit to thy glory;’"
    }
}