{
    "title": "The Body of Christ",
    "date": "2012-01-22",
    "blurb": "This sermon, delivered on the 3rd Sunday of Epiphany in 2012, discusses the diversity of the Church and the unique gifts each member brings. Using the analogy of the human body, it emphasizes the importance of each member's contribution to the well-being and functioning of the Church. It also reminds us that the Church exists not for its own benefit, but for the advancement of God's Kingdom.",
    "raw_text": "Anyone coming to the end of their school or college career goes through a process of Careers Advice. A part of this process involves a series of aptitude tests. The idea of this is to enable the individual to identify his or her particular strengths or weaknesses; to identify characteristics that make them suited to particular types of career.\n\nWhen a vacancy occurs in an organisation or business, part of the recruitment process involves seeking to identify particular skills or talents that may be required of any candidate. Then in a process or interview, references and maybe yet more aptitude tests, a particular candidate with the required set of skills and aptitudes is eventually chosen. The idea is that, in taking the trouble to produce the best possible match between the vacant post and the candidate, the organisation will work more effectively and the chosen candidate will find job satisfaction. Get this wrong and both can suffer.\n\nOur Gospel reading this morning tells of the call of those first disciples. They were a very diverse group, fishermen, tax collector, couple of zealots. Each of them brought their own particular gifts, their strengths and weaknesses to the group. Of course every Christian community, every parish or congregation is a very diverse group, each with their own particular gift, each with their own particular contribution. Paul, in his letters, when he talks of the Church does not use a business model, he uses the model of the human body to develop his own understanding of the Church, the Body of Christ.\n\nIf we look at the Church along the Biblical lines of the Body rather than a business organisation, we draw a number of distinctions. First of all, we are already in; we are all members of the Church by virtue of our Baptism, by virtue of our faith in Christ. Paul takes the human body as his model for the Church. As he does this he reflects not only on the diversity of the various elements that make up the body but also the importance of each in the contribution it makes to the total well-being and functioning of the body. We know from experience of our own deficiencies how these can impact on our own well being. I am very short sighted and don't have a great sense of balance or hand to eye coordination – that places limitations on some of the things I can do – the family has always derived great amusement from my attempts at ice-skating.\n\nThe way Paul develops his argument and his use of the analogy of the body provides a balance to the hierarchical understanding of the Church that is so much part of our thinking. Prominence is not to be confused with importance or significance. There are people called to particular positions within the Church. Archbishop Michael has been called to be our Archbishop at this particular point in our spiritual pilgrimage as a diocesan family. At this time of year men and women who feel that God is calling them to the ordained ministry are going through the selection process. But all of this can only be seen in the context of service, primarily the model that Christ himself provides in his example of washing his disciples feet, of his life of self giving, - and all for the building up of the whole body of Christ. Within the life of any Parish there are those with particular gifts, of music, of administrative skills, of teaching – again these can only be seen in terms of service, the building up of the whole body.\n\nEveryone has their own particular gift to offer, gifts of compassion, of encouragement, of listening that each in their own indispensable way supports and sustains the whole body. People can be very diffident about the value and worth of their own particular contribution to the life of the Christian community. Paul's use of the analogy of the body emphasises the point that every part is valuable, every part has a purpose. If anyone is not here, our worship is the less; if anyone holds back their gift the vitality of the Church is diminished.\n\nAs week by week we reflect in our Gospel readings on Jesus' ministry to bring good news, sight to the blind, freedom for the oppressed, a ministry of reconciliation, of healing, we do so as members of the Body of Christ, called to continue his ministry in the world of today. Which in itself is a reminder that the Church does not exist for its own benefit, but for the advancement of God's Kingdom in the world in which it is set.\n\nWe go from this place, with our many and varied gifts into the many and varied situations God places us this week. We go in the name of Christ, as disciples of Christ in this particular place and at this particular time, as members of the Body of Christ to bring something of Christ – that his name may be glorified, his Kingdom advanced.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany32012.txt",
        "raw_ocr_content": "Page 1 of 3\n3rd Sunday of Epiphany – 2012 – Year B\nAnyone coming to the end of their school or college career goes through a\nprocess of Careers Advice. A part of this process involves a series of aptitude\ntests. The idea of this is to enable the individual to identify his or her particular\nstrengths or weaknesses; to identify characteristics that make them suited to\nparticular types of career.\nWhen a vacancy occurs in an organisation or business, part of the recruitment\nprocess involves seeking to identify particular skills or talents that may be\nrequired of any candidate. Then in a process or interview, references and\nmaybe yet more aptitude tests, a particular candidate with the required set of\nskills and aptitudes is eventually chosen. The idea is that, in taking the trouble\nto produce the best possible match between the vacant post and the candidate,\nthe organisation will work more effectively and the chosen candidate will find\njob satisfaction. Get this wrong and both can suffer.\nOur Gospel reading this morning tells of the call of those first disciples. They\nwere a very diverse group, fishermen, tax collector, couple of zealots. Each of\nthem brought their own particular gifts, their strengths and weaknesses to the\ngroup. Of course every Christian community, every parish or congregation is a\nvery diverse group, each with their own particular gift, each with their own\nparticular contribution. Paul, in his letters, when he talks of the Church does\nnot use a business model, he uses the model of the human body to develop his\nown understanding of the Church, the Body of Christ.\nIf we look at the Church along the Biblical lines of the Body rather than a\nbusiness organisation, we draw a number of distinctions. First of all, we are\nPage 2 of 3\n3rd Sunday of Epiphany – 2012 – Year B\nalready in; we are all members of the Church by virtue of our Baptism, by\nvirtue of our faith in Christ. Paul takes the human body as his model for the\nChurch. As he does this he reflects not only on the diversity of the various\nelements that make up the body but also the importance of each in the\ncontribution it makes to the total well-being and functioning of the body. We\nknow from experience of our own deficiencies how these can impact on our\nown well being. I am very short sighted and don’t have a great sense of\nbalance or hand to eye coordination – that places limitations on some of the\nthings I can do – the family has always derived great amusement from my\nattempts at ice-skating.\nThe way Paul develops his argument and his use of the analogy of the body\nprovides a balance to the hierarchical understanding of the Church that is so\nmuch part of our thinking. Prominence is not to be confused with importance\nor significance. There are people called to particular positions within the\nChurch. Archbishop Michael has been called to be our Archbishop at this\nparticular point in our spiritual pilgrimage as a diocesan family. At this time of\nyear men and women who feel that God is calling them to the ordained\nministry are going through the selection process. But all of this can only be\nseen in the context of service, primarily the model that Christ himself provides\nin his example of washing his disciples feet, of his life of self giving, - and all\nfor the building up of the whole body of Christ. Within the life of any Parish\nthere are those with particular gifts, of music, of administrative skills, of\nteaching – again these can only be seen in terms of service, the building up of\nthe whole body.\nPage 3 of 3\n3rd Sunday of Epiphany – 2012 – Year B\nEveryone has their own particular gift to offer, gifts of compassion, of\nencouragement, of listening that each in their own indispensable way supports\nand sustains the whole body. People can be very diffident about the value and\nworth of their own particular contribution to the life of the Christian\ncommunity. Paul’s use of the analogy of the body emphasises the point that\nevery part is valuable, every part has a purpose. If anyone is not here, our\nworship is the less; if anyone holds back their gift the vitality of the Church is\ndiminished.\nAs week by week we reflect in our Gospel readings on Jesus’ ministry to bring\ngood news, sight to the blind, freedom for the oppressed, a ministry of\nreconciliation, of healing, we do so as members of the Body of Christ, called to\ncontinue his ministry in the world of today. Which in itself is a reminder that\nthe Church does not exist for its own benefit, but for the advancement of God’s\nKingdom in the world in which it is set.\nWe go from this place, with our many and varied gifts into the many and varied\nsituations God places us this week. We go in the name of Christ, as disciples\nof Christ in this particular place and at this particular time, as members of the\nBody of Christ to bring something of Christ – that his name may be glorified,\nhis Kingdom advanced."
    }
}