{
    "title": "Understanding Prayer",
    "date": "2011-11-13",
    "blurb": "Kevin's sermon on the 13th of November, 2011, delves into the nature of prayer, encouraging us to view God as a friend rather than a distant figure. He emphasizes the importance of communication in prayer, not just asking for things but also listening and understanding God's will. The sermon also touches on the significance of praying for others, including the new President and those affected by wars.",
    "raw_text": "## Family Service – 13th November 2011\n\nThis morning reflecting on the whole subject of prayer. 'Prayer is something you do with your eyes shut!' What do we do when we pray? Who is it we are praying to? God – what is your idea of God? Jesus taught us to call God 'Father' – the word Jesus would have used is the word 'Abba' – Daddy. What sort of things do you ask your Dad, or your Mum for that matter, to do?\n\nSt John’s Gospel tells us something else Jesus said when he was at supper with his disciples on the night before he died – 'I am not calling you servants anymore, I am calling you friends.' If the disciples are to be the friends of Jesus, then Jesus is also the friend of the disciples.\n\nA friend is someone who really knows us. We’ve thought about what we ask our Mum or Dad, what do we talk to our friends about. We talk about the things that excite us, that worry us. Sometimes, if we fall in love with our friends, we will tell them how much they mean to us – how much their friendship means to us. With a friend, we don’t talk all the time – we will listen to them, we will think about what pleases them. That sort of friendship begins to change us as what our friend wants becomes as important to us as what we want.\n\nSo when we pray – we are going to ask God to do things, to look after the sick, to watch over people who are sad – this morning we are thinking of our new President, we are also thinking of people who have suffered in wars, those who look after the injured. But prayer is also about listening, trying to understand what God wants of us and then seeking to live our lives in his service and the service of others.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/familyservicenov2011.txt",
        "raw_ocr_content": "Page 1 of 2\nFamily Service – 13th November 2011\nThis morning reflecting on the whole subject of prayer.\n‘Prayer is something you do with your eyes shut!’\nWhat do we do when we pray?\nWho is it we are praying to?\nGod – what is your idea of God?\nJesus taught us to call God ‘Father’\nThe word Jesus would have used is the word ‘Abba’ – Daddy\nWhat sort of things do you ask your Dad, or your Mum for that matter,\nto do?\nSt John’s Gospel tells us something else Jesus said when he was at\nsuper with his disciples on the night before he died. – ‘I am not\ncalling you servants anymore, I am calling you friends.’\nIf the disciples are to be the friends of Jesus, then Jesus is also the\nfriend of the disciples.\nPage 2 of 2\nFamily Service – 13th November 2011\nA friend is someone who really knows us.\nWe’ve thought about what we ask our Mum or Dad, what do we talk\nto our friends about.\nWe talk about the things that excite us, that worry us. Sometimes, if\nwe fall in love with our friends, we will tell them how much they\nmean to us – how much their friendship means to us.\nWith a friend, we don’t talk all the time – we will listen to them, we\nwill think about what pleases them.\nThat sort of friendship begins to change us as what our friend wants\nbecomes as important to us as what we want.\nSo when we pray – we are going to ask God to do things, to look after\nthe sick, to watch over people who are sad – this morning we are\nthinking of our new President, we are also thinking of people who\nhave suffered in wars, those who look after the injured.\nBut prayer is also about listening, trying to understand what God\nwants of us and then seeking to live our lives in his service and the\nservice of others."
    }
}