{
    "title": "From Cheers to Jeers",
    "date": "2014-04-14",
    "blurb": "This sermon reflects on the change in mood during the week before Passover, from Jesus' enthusiastic entry into Jerusalem to his death on Calvary. It follows the journey through the eyes of St John, beginning six days before the Passover in the house of Lazarus. The sermon highlights the extravagant expressions of gratitude and love shown by Mary and the acceptance of Jesus, emphasizing the importance of sincerity, gratitude, and love in our offerings of worship and service.",
    "raw_text": "HOLY WEEK 2014 – From Cheers to Jeers\n\nJohannine readings for Holy Week – Monday – Anointing at Bethany\n\nYesterday our Family Service was brought together under the theme ‘From Cheers to Jeers’. In reading and song and drama we reflected on the change in mood that week before Passover. It began with Jesus’ entry into Jerusalem, enthusiastically greeted by the crowds and ended with him being paraded through the streets of Jerusalem, bearing his own cross, to his death on Calvary.\n\nThis week in our Holy Week reflections we are going to be following that same journey through the eyes of St John. We begin six days before the Passover in the house of Lazarus, whom Jesus had raised from the dead. Jesus comes as a friend of long standing. John has told us of the details of the raising of Lazarus, his delay in coming, the reactions of his sisters Martha and Mary. Luke, in his Gospel has previously picked up on a pair of sisters named Martha and Mary. Martha so practical, ensuring meals were ready on time, the house was prepared for guests. Mary just relished being in the presence of Jesus – details of housekeeping of no concern. I have always thought that there needs to be something of Martha and Mary in all of us.\n\nHere in the home of Lazarus, we come across Martha and Mary once more. Martha is doing what Martha does best. She is there looking after everyone, seeing that everyone is comfortable, that they have enough to eat. And Mary …. What is Mary doing this time? Previously we heard of her simply sitting at Jesus’ feet, lost in her own thoughts as she listens to the Master.\n\nThis time she appears with an elaborate, ridiculously extravagant gift, a gift of fine perfume. Then without thought of what anyone might think she pours it all over his feet, and proceeds to wipe his feet with her hair – an almost scandalous action.\n\nAs the perfume fills the room, those around look on – Judas, perhaps voicing the thoughts of others, pours scorn on the waste – this could have been sold and money given to the poor. And if we are honest, part of us would share the thoughts of Judas. People don’t behave like that in public, it is not seemly, it is not right.\n\nAnd Jesus breaks through their muttered surprise and disapproval – she has done a beautiful thing – the perfume that filled the house spoke of gratitude for the restoration of their brother Lazarus, gratitude for the peace she had found in and through her fellowship with Jesus – and Jesus accepts that as he begins to speak of coming death – let her keep it for the day of my burial.\n\nMary has given extravagant expressions of gratitude and love – and Jesus has given to her in the very act of receiving. Early on in my ministry, I recall discussing with Archbishop McAdoo a lovely service rendered to me by a family in Raheny. He said, ‘Yes, we are so used to be the ones who are giving – and we say that it is more blessed to give than to receive. But sometimes the most valuable gift we can give someone is to give them a chance to give to us.’\n\nJesus accepted the gift that Mary poured upon his feet that day, accepting not so much the gift as the love and gratitude that lay behind it.\n\nHe accepts our offering of worship, of service, in all its imperfection, in all its inadequacy. We offer him our best – it is not that it is not good enough. God looks beyond the imperfection of even our best and looks for sincerity, for gratitude, for love.\n\nAlmost as an after thought, John turns from the group gathered around the table in Lazarus’s house to another group. In the house of Lazarus Jesus was a welcome guest, one who brought life and hope into their midst. On the margins, in the background there are the High Priests – to them Jesus is a dangerous radical, who is gathering support, who is leading the people astray – and he must be stopped.\n\nThe road to Calvary has begun.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2014/From Cheeers to Jeers - Monday - annointing.txt",
        "raw_ocr_content": "Page 1 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week –\nMonday – Anointing at Bethany\nYesterday our Family Service was brought together under the theme ‘From\nCheers to Jeers’. In reading and song and drama we reflected on the change in\nmood that week before Passover. It began with Jesus’ entry into Jerusalem,\nenthusiastically greeted by the crowds and ended with him being paraded\nthrough the streets of Jerusalem, bearing his own cross, to his death on\nCalvary.\nThis week in our Holy Week reflections we are going to be following that same\njourney through the eyes of St John.\nWe begin six days before the Passover in the house of Lazarus, whom Jesus\nhad raised from the dead. Jesus comes as a friend of long standing. John has\ntold us of the details of the raising of Lazarus, his delay in coming, the\nreactions of his sisters Martha and Mary. Luke, in his Gospel has previously\npicked up on a pair of sisters named Martha and Mary. Martha so practical,\nensuring meals were ready on time, the house was prepared for guests. Mary\njust relished being in the presence of Jesus – details of housekeeping of no\nconcern. I have always thought that there needs to be something of Martha and\nMary in all of us.\nHere in the home of Lazarus, we come across Martha and Mary once more.\nMartha is doing what Martha does best. She is there looking after everyone,\nseeing that everyone is comfortable, that they have enough to eat. And Mary\n…. What is Mary doing this time? Previously we heard of her simply sitting at\nJesus’ feet, lost in her own thoughts as she listens to the Master.\nPage 2 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week –\nMonday – Anointing at Bethany\nThis time she appears with an elaborate, ridiculously extravagant gift, a gift of\nfine perfume. Then without thought of what anyone might think she pours it\nall over his feet, and proceeds to wipe his feet with her hair – an almost\nscandalous action.\nAs the perfume fills the room, those around look on – Judas, perhaps voicing\nthe thoughts of others, pours scorn on the waste – this could have been sold and\nmoney given to the poor. And if we are honest, part of us would share the\nthoughts of Judas. People don’t behave like that in public, it is not seemly, it is\nnot right.\nAnd Jesus breaks through their muttered surprise and disapproval – she has\ndone a beautiful thing – the perfume that filled the house spoke of gratitude for\nthe restoration of their brother Lazarus, gratitude for the peace she had found in\nand through her fellowship with Jesus – and Jesus accepts that as he begins to\nspeak of coming death – let her keep it for the day of my burial.\nMary has given extravagant expressions of gratitude and love – and Jesus has\ngiven to her in the very act of receiving. Early on in my ministry, I recall\ndiscussing with Archbishop McAdoo a lovely service rendered to me by a\nfamily in Raheny. He said, ‘Yes, we are so used to be the ones who are giving\n– and we say that it is more blessed to give than to receive. But sometimes the\nmost valuable gift we can give someone is to give them a chance to give to us.’\nPage 3 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week –\nMonday – Anointing at Bethany\nJesus accepted the gift that Mary poured upon his feet that day, accepting not\nso much the gift as the love and gratitude that lay behind it.\nHe accepts our offering of worship, of service, in all its imperfection, in all its\ninadequacy. We offer him our best – it is not that it is not good enough. God\nlooks beyond the imperfection of even our best and looks for sincerity, for\ngratitude, for love.\nAlmost as an after thought, John turns from the group gathered around the table\nin Lazarus’s house to another group. In the house of Lazarus Jesus was a\nwelcome guest, one who brought life and hope into their midst. On the\nmargins, in the background there are the High Priests – to them Jesus is a\ndangerous radical, who is gathering support, who is leading the people astray –\nand he must be stopped.\nThe road to Calvary has begun."
    }
}