{
    "title": "From Cheers to Jeers",
    "date": "2014-04-15",
    "blurb": "This sermon focuses on the concept of crisis and judgement, using the metaphor of a seed that must be buried before it can come to life. It emphasizes the importance of self-surrender to find our true selves and God. The sermon also highlights the impending crisis that Jesus faces and the judgement that comes with it.",
    "raw_text": "HOLY WEEK 2014 – From Cheers to Jeers\n\nJohannine readings for Holy Week – Tuesday – Approaching Crisis\n\nOver recent times we have heard the word ‘crisis’ used over and over again in the news. There is the crisis in the Ukraine, the crisis in the Crimea, and the financial crisis in Ireland from which we are only now beginning to emerge.\n\nWhat is the nature of crisis? We can have a series of events spinning out of control. We can have a series of events coming to a head. Crisis can bring a sense of panic – people rush to hasty decisions, or like rabbits stuck in the headlights of an approaching car nothing is done as disaster approaches. In a sense that disaster stands as a judgement on the mistakes, the missed opportunities, the greed that went before.\n\nOr, if we are fortunate, we arrive at a point when it is recognised that a decision has to be made, a problem has to be grasped, What we are looking for in a situation such as this is someone with clear judgement.\n\nJudgement - crisis\nCrisis - judgement.\n\nI just want to leave those words, those thoughts in your mind as we turn to our Gospel reading. Jesus has moved out form the house of Lazarus, a place where he was welcome and honoured among friends. Last night we reflected on that wonderful act of extravagant devotion as Mary poured expensive ointment on the feet of Jesus. There were those who ridiculed the gift, those who felt uncomfortable with the gift, but Jesus accepted the devotion, the love, the honour that lay behind it. As we were reflecting last night, he accepts the best that we offer (and it should be the best); accepts our worship, our service, ourselves, warts and all – seeing not the imperfection but our sincerity, our love, our devotion.\n\nNow he goes outside. There are still some, like the Greeks who come to Philip, “Sir, we want to see Jesus”. There are others who seek him out - not to worship and admire, rather to undermine, to trip him up and ultimately to destroy him.\n\nAnd Jesus’ language begins to reflect the crisis that is coming. He talks of the seed that has to be buried before it can come to life; of losing life if we are to gain it; the call to serve, to follow. It is in losing, in letting go, in surrender of self that we find – find our true self, find God.\n\n\"The hour has come for the Son of Man to be glorified.\n31 Now is the judgment of this world; now the ruler of this world will be driven out. 32 And I, when I am lifted up from the earth, will draw all people to myself.\"\n\nThat word judgement – we are not always comfortable with it. We talk of people being judgemental, on passing judgement on people. But let us look a little closer at the passage and the Greek in which this passage is written in the original text. The word the evangelist uses, that we translate as ‘judgement’ is the word krivsi\". I come back to those words we used at the beginning Judgement – crisis: crisis – judgement.\n\nNow is the judgement, the krivsi\" of this world. The time is coming when the world will have to choose. There is judgement in the very act of choosing. Just as Pilate will present the crowd with a choice – Jesus or Barabbas, so the world, so we are presented with a choice, a decision, a krivsi\", with judgement. Judgement not as something in the distant future but as something to be faced in the present.\n\nAs the Son prepares to give himself, totally and unreservedly for the word so we are invited to give ourselves to him. In giving, in surrender, in losing, we find life, eternal life, real life in fellowship with the Son.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2014/From Cheeers to Jeers - Tuesday - approaching crisis.txt",
        "raw_ocr_content": "Page 1 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week –\nTuesday – Approaching Crisis\nOver recent times we have heard the word ‘crisis’ used over and over again in\nthe news.\nThere is the crisis in the Ukraine\nThere was the crisis in the Crimea\nThere was the financial crisis in Ireland from which we are only now beginning\nto emerge.\nWhat is the nature of crisis? We can have a series of events spinning out of\ncontrol. We can have a series of events coming to a head. Crisis can bring a\nsense of panic – people rush to hasty decisions, or like rabbits stuck in the\nheadlights of an approaching car nothing is done as disaster approaches. In a\nsense that disaster stands as a judgement on the mistakes, the missed\nopportunities, the greed that went before.\nOr, if we are fortunate, we arrive at a point when it is recognised that a decision\nhas to be made, a problem has to be grasped, What we are looking for in a\nsituation such as this is someone with clear judgement.\nJudgement - crisis\nCrisis - judgement.\nI just want to leave those words, those thoughts in your mind as we turn to our\nGospel reading. Jesus has moved out form the house of Lazarus, a place where\nhe was welcome and honoured among friends. Last night we reflected on that\nPage 2 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week –\nTuesday – Approaching Crisis\nwonderful act of extravagant devotion as Mary poured expensive ointment on\nthe feet of Jesus. There were those who ridiculed the gift, those who felt\nuncomfortable with the gift, but Jesus accepted the devotion, the love, the\nhonour that lay behind it. As we were reflecting last night, he accepts the best\nthat we offer (and it should be the best); accepts our worship, our service,\nourselves, warts and all – seeing not the imperfection but our sincerity, our\nlove, our devotion.\nNow he goes outside. There are still some, like the Greeks who come to Philip,\n“Sir, we want to see Jesus”. There are others who seek him out - not to\nworship and admire, rather to undermine, to trip him up and ultimately to\ndestroy him.\nAnd Jesus’ language begins to reflect the crisis that is coming. He talks of the\nseed that has to be buried before it can come to life; of losing life if we are to\ngain it; the call to serve, to follow. It is in losing, in letting go, in surrender of\nself that we find – find our true self, find God.\n\"The hour has come for the Son of Man to be glorified.\n31 Now is the judgment of this world; now the ruler of this world\nwill be driven out. 32 And I, when I am lifted up from the earth, will\ndraw all people to myself.\"\nThat word judgement – we are not always comfortable with it. We talk of\npeople being judgemental, on passing judgement on people. But let us look a\nlittle closer at the passage and the Greek in which this passage is written in the\noriginal text. The word the evangelist uses, that we translate as ‘judgement’ is\nPage 3 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week –\nTuesday – Approaching Crisis\nthe word krivsi\". I come back to those words we used at the beginning\nJudgement – crisis: crisis – judgement.\nNow is the judgement, the krivsi\" of this world. The time is coming when the\nworld will have to choose. There is judgement in the very act of choosing.\nJust as Pilate will present the crowd with a choice – Jesus or Barabbas, so the\nworld, so we are presented with a choice, a decision, a krivsi\", with judgement.\nJudgement not as something in the distant future but as something to be faced\nin the present.\nAs the Son prepares to give himself, totally and unreservedly for the word so\nwe are invited to give ourselves to him. In giving, in surrender, in losing, we\nfind life, eternal life, real life in fellowship with the Son."
    }
}