{
    "title": "From Cheers to Jeers",
    "date": "2014-04-18",
    "blurb": "This sermon, delivered on Good Friday, explores the transition from the cheers of Palm Sunday to the jeers of Good Friday. It delves into the raw pain of the Passion, the manipulation, the cynicism, the fear, and the panic, with Jesus at the center of it all. It emphasizes that while the events of Good Friday were unfolding, those watching could only see and feel the pain, but later, they would understand the full significance of Jesus' sacrifice.",
    "raw_text": "From cheers to jeers – Johannine readings\n\nFriday – It is finished\n\nJesus answered, \"You do not know now what I am doing, but later you will understand.\" John 13.7\n\nWords of Jesus to Peter as Peter resists the idea of Jesus washing his feet. Words that could apply to whole of the story of the Passion. \"You do not know now what I am doing, but later you will understand.\"\n\nLast Sunday, in our Family Service for Palm Sunday, we followed the story of Holy Week from the enthusiastic welcome given to our Lord as he entered Jerusalem on Palm Sunday to his being paraded through the streets of Jerusalem to his death on the Cross, to the jeers and taunts of his enemies - a journey from cheers to jeers.\n\nTonight as our Gospel reading we read the Passion according to John. It is a passage that never ceases to enthrall me. The Gospel writer presents us with the raw pain of the passion, the manipulation, the cynicism, the fear, the panic. At the heart of it all stands the figure of Jesus.\n\nWe read of the panic of the disciples as Jesus is arrested; Peter, caught off guard by the questioning of a servant girl denies any knowledge of Jesus – a memory that will haunt him. The cynical interplay between the high priests and Pilate – the religious establishment, so set on getting rid of Jesus, will even acknowledge the emperor as King. Pilate, knowing full well the motives of the establishment, that Jesus is innocent – still hands him over to be killed to satisfy the mob. The soldiers, at the bottom of the socio political heap that day, brutalise the strange prisoner handed over to them that day. His mother and beloved disciple watch helplessly as all their hopes and dreams end in a nasty, painful death on a hill without the city wall.\n\nIt is here I pick up on the words John tells of Jesus saying to Peter as he prepared to wash his feet. \"You do not know now what I am doing, but later you will understand.\"\n\nAs the events of that first Good Friday unfolded, those watching could only see and feel the pain as they watched Jesus’ life ebb away. They could not know, they could not understand what was going on. John tells the story in the light of the resurrection, of Pentecost. He and the community he represents have had an opportunity to step back from the events of that day and put them in a wider perspective. I think of Luke’s account of the disillusioned disciples slipping out of Jerusalem to pick up the threads of life. As they find themselves walking with a stranger, they listen as he puts the suffering and death of a few days before in the context of the wider hopes and expectations of the Scriptures until, at the end of the day, as the stranger breaks bread, they recognize the risen Christ in their midst, recalling how earlier their hearts had burned within them as he talked with them on the road.\n\nAnd so as the events unfold, John in his account sets them in the context of scripture – they cast lots for my clothing, they will look on him whom they have pierced. There is also a lesson in the way John chooses to tell this story. This is not a series of events that happen to Jesus; John gives us a picture of Jesus as very much in control as the story unfolds. In the Garden, it is the guards who step back in awe as Jesus says ‘I am he.’ As he stands before Annas, it is Jesus who is asking the questions; when the guard strikes him for showing disrespect, it is Jesus who challenges him as to what he is doing. When Jesus is dragged before Pilate, it is Jesus who seems to set the agenda for their exchanges. Pilate at one stage seeks to remind Jesus of his power to release him or crucify him, only to be reminded who gave him this power. Even on the Cross, we have a picture of Jesus still in command of things. He entrusts his mother to the care of the beloved disciple. There is that final triumphant cry: ‘It is finished’ There is even a message in the way in which the Greek text of John’s Gospel conveys this final cry: tetevlestai\n\nIt is finished, the job is accomplished. The writer uses the perfect tense. In Greek this is used to convey them meaning of an event in the past that has a lasting significance. Then as he dies, John tells us, ‘he gave up his spirit. This was not life taken, wrenched from his grasp. This was life freely given, a sovereign act, a fulfillment of all he came to do. As we read on Christmas Day, as we celebrate the Incarnation, God coming into the world in the person of Jesus:\n\nHe was in the world, and the world came into being through him; yet the world did not know him. He came to what was his own, and his own people did not accept him. But to all who received him, who believed in his name, he gave power to become children of God, who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nAs I recalled on Wednesday, I remember Professor Vokes, who lectured us in St John’s Gospel declaring that John presents us with a picture of Jesus reigning from the Cross. So this night we leave our King, lifted up, reigning from the Cross – his task accomplished, his victory won.\n\nAs we will be reminded in our Communion on Easter Day:\n\ndying he destroyed our death;\n\nby rising he restored our life\n\nOur closing hymn tonight will end with those majestic words:\n\nCrown him the Lord of years,\n\nthe potentate of time,\n\ncreator of the rolling spheres,\n\nineffably sublime.\n\nall hail, redeemer, hail!\n\nfor thou hast died for me\n\nthy praise shall never, never fail\n\nthroughout eternity\n\n\"You do not know now what I am doing, but later you will understand.\"",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2014/From Cheeers to Jeers - Friday - It is finished.txt",
        "raw_ocr_content": "Page 1 of 4\nHOLY WEEK 2014\nFrom cheers to jeers – Johannine readings\nFriday – It is finished\n7 Jesus answered, \"You do not know now what I am doing, but later you will\nunderstand.\" John 13.7\nWords of Jesus to Peter as Peter resists the idea of Jesus washing his feet.\nWords that could apply to whole of the story of the Passion. \"You do not know\nnow what I am doing, but later you will understand.\"\nLast Sunday, in our Family Service for Palm Sunday, we followed the story of\nHoly Week from the enthusiastic welcome given to our Lord as he entered\nJerusalem on Palm Sunday to his being paraded through the streets of\nJerusalem to his death on the Cross, to the jeers and taunts of his enemies - a\njourney from cheers to jeers.\nTonight as our Gospel reading we read the Passion according to John. It is a\npassage that never ceases to enthrall me. The Gospel writer presents us with\nthe raw pain of the passion, the manipulation, the cynicism, the fear, the panic.\nAt the heart of it all stands the figure of Jesus.\nWe read of the panic of the disciples as Jesus is arrested; Peter, caught off\nguard by the questioning of a servant girl denies any knowledge of Jesus – a\nmemory that will haunt him. The cynical interplay between the high priests and\nPilate – the religious establishment, so set on getting rid of Jesus, will even\nacknowledge the emperor as King. Pilate, knowing full well the motives of the\nestablishment, that Jesus is innocent – still hands him over to be killed to\nsatisfy the mob. The soldiers, at the bottom of the socio political heap that day,\nPage 2 of 4\nHOLY WEEK 2014\nFrom cheers to jeers – Johannine readings\nFriday – It is finished\nbrutalise the strange prisoner handed over to them that day. His mother and\nbeloved disciple watch helplessly as all their hopes and dreams end in a nasty,\npainful death on a hill without the city wall.\nIt is here I pick up on the words John tells of Jesus saying to Peter as he\nprepared to wash his feet. \"You do not know now what I am doing, but later\nyou will understand.\"\nAs the events of that first Good Friday unfolded, those watching could only see\nand feel the pain as they watched Jesus’ life ebb away. They could not know,\nthey could not understand what was going on. John tells the story in the light\nof the resurrection, of Pentecost. He and the community he represents have\nhad an opportunity to step back from the events of that day and put them in a\nwider perspective. I think of Luke’s account of the disillusioned disciples\nslipping out of Jerusalem to pick up the threads of life. As they find\nthemselves walking with a stranger, they listen as he puts the suffering and\ndeath of a few days before in the context of the wider hopes and expectations\nof the Scriptures until, at the end of the day, as the stranger breaks bread, they\nrecognize the risen Christ in their midst, recalling how earlier their hearts had\nburned within them as he talked with them on the road.\nAnd so as the events unfold, John in his account sets them in the context of\nscripture – they cast lots for my clothing, they will look on him whom they\nhave pierced. There is also a lesson in the way John chooses to tell this story.\nThis is not a series of events that happen to Jesus; John gives us a picture of\nPage 3 of 4\nHOLY WEEK 2014\nFrom cheers to jeers – Johannine readings\nFriday – It is finished\nJesus as very much in control as the story unfolds. In the Garden, it is the\nguards who step back in awe as Jesus says ‘I am he.’ As he stands before\nAnnas, it is Jesus who is asking the questions; when the guard strikes him for\nshowing disrespect, it is Jesus who challenges him as to what he is doing.\nWhen Jesus is dragged before Pilate, it is Jesus who seems to set the agenda for\ntheir exchanges. Pilate at one stage seeks to remind Jesus of his power to\nrelease him or crucify him, only to be reminded who gave him this power.\nEven on the Cross, we have a picture of Jesus still in command of things. He\nentrusts his mother to the care of the beloved disciple. There is that final\ntriumphant cry: ‘It is finished’ There is even a message in the way in which\nthe Greek text of John’s Gospel conveys this final cry: tetevlestai\nIt is finished, the job is accomplished. The writer uses the perfect tense. In\nGreek this is used to convey them meaning of an event in the past that has a\nlasting significance. Then as he dies, John tells us, ‘he gave up his spirit. This\nwas not life taken, wrenched from his grasp. This was life freely given, a\nsovereign act, a fulfillment of all he came to do. As we read on Christmas\nDay, as we celebrate the Incarnation, God coming into the world in the person\nof Jesus:\n10 He was in the world, and the world came into being through\nhim; yet the world did not know him. 11 He came to what was his\nown, and his own people did not accept him. 12 But to all who\nreceived him, who believed in his name, he gave power to\nbecome children of God, 13 who were born, not of blood or of the\nwill of the flesh or of the will of man, but of God.\nPage 4 of 4\nHOLY WEEK 2014\nFrom cheers to jeers – Johannine readings\nFriday – It is finished\nAs I recalled on Wednsday, I remember Professor Vokes, who lectured us in St\nJohn’s Gospel declaring that John presents us with a picture of Jesus reigning\nfrom the Cross. So this night we leave our King, lifted up, reigning from the\nCross – his task accomplished, his victory won.\nAs we will be reminded in our Communion on Easter Day:\ndying he destroyed our death;\nby rising he restored our life\nOur closing hymn tonight will end with those majestic words:\n5 Crown him the Lord of years,\nthe potentate of time,\ncreator of the rolling spheres,\nineffably sublime.\nall hail, redeemer, hail!\nfor thou hast died for me\nthy praise shall never, never fail\nthroughout eternity\n\"You do not know now what I am doing, but later you will understand.\""
    }
}