{
    "title": "Memorial Service for Geoff Rowden",
    "date": "2013-11-16",
    "blurb": "This sermon is a tribute to Geoff Rowden, a man who loved the outdoors and was deeply committed to issues of justice and care for those in need. The sermon reflects on Geoff's life, his love for his family, and his work with children and young people in care. It draws parallels between Geoff's values and the teachings of Jesus, particularly the parable of the sheep and the goats.",
    "raw_text": "Three weeks ago Geoff Rowden was planning to do what he loved doing, planning to walk and camp in the mountains, this time the ridge walk on Mweelrea Mountain in Mayo. He loved the open air, the solitude, the peace. An experienced walker, he had left a route and was well equipped for the climb. On the Wednesday it was clear he was missing. Over three days Geoff’s family and friends knew the agony of waiting, of hoping, of dreading as Mayo Mountain Rescue Unit assisted by volunteers and friends from clubs all over the country searched the hills until, on Saturday morning, Geoff was found where he had fallen.\n\nToday, a week after his funeral in Mount Jerome, family and friends gather to give thanks for Geoff Rowden as husband and father, as son and brother, as uncle and friend. This part of the world is where Geoff grew up, where he went to School, was baptised and confirmed. Those of us outside the immediate circle of family and close friends come to show our love to Anne Marie and Chloe, to Ken and Eileen, to David, Linda and Alison and their families and assure them of that our love and support in the days that lie ahead.\n\nOver the last couple of weeks it has been my privilege to listen as family have spoken of Geoff, with tears and laughter, with love, with pride, with a deep gratitude. I heard of a young man who got up to the usual mischief any healthy teenager does. I heard of a young man who thought deeply about life, about people, about issues of justice, of right and wrong both home and abroad – a bit of a radical.\n\nI heard of a young man for whom family was central in his life. The family he grew up in, the family life he shared with Anne Marie and their daughter Chloe.\n\nOver the last number of years he had worked with children and young people in care. This was clearly more than just a job for Geoff. Totally professional in his approach, he had a real personal commitment and empathy with those in his care, many of whom experienced the results of family breakdown, domestic violence, drug and alcohol abuse. Here is part of a message sent by a work colleague to Linda after his funeral last week.\n\n> He was known for his kind, sparky, lovable and devoted ways to his colleagues as well as the children he worked with. He always had their best interests at heart and did what he could in his role to make a difference in their lives...he made a difference and they all loved him for that...Be so proud of your brother, he was truly a star in the darkness and know that in his short life he was powerfully respected by the work people that knew the man Geoff Rowden.\n\nAt his Funeral in Mount Jerome, as he reflected on Geoff’s love of the outdoors, of the mountains and his radical views on issues, the Celebrant recalled another radical who lived 2000 years ago, who would take himself off into the hills, who died on a hill outside the city. One, he suggested, with whom Geoff could have had interesting conversations. As I thought about that and thought of some of the things said about Geoff, I thought of a parable told by Jesus - the parable of the sheep and the goats.\n\n> 32 All the nations will be gathered before him, and he will separate people one from another as a shepherd separates the sheep from the goats, 33 and he will put the sheep at his right hand and the goats at the left. 34 Then the king will say to those at his right hand, 'Come, you that are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world; 35 for I was hungry and you gave me food, I was thirsty and you gave me something to drink, I was a stranger and you welcomed me, 36 I was naked and you gave me clothing, I was sick and you took care of me, I was in prison and you visited me.' 37 Then the righteous will answer him, 'Lord, when was it that we saw you hungry and gave you food, or thirsty and gave you something to drink? 38 And when was it that we saw you a stranger and welcomed you, or naked and gave you clothing? 39 And when was it that we saw you sick or in prison and visited you?' 40 And the king will answer them, 'Truly I tell you, just as you did it to one of the least of these who are members of my family, you did it to me.' Matt 25:32-40\n\nThe sheep in that story did not help because it was a religious or holy thing to do, because God was expecting it of them – they did it because it was simply the right thing to do and in so doing discover that they encounter the Lord. Geoff’s concern for justice, for what was right, for those for whom life was hard, was just part of who he was and the values he had absorbed in the Rowden home.\n\nKen has read from Paul’s 1st Letter to the Corinthians. It is a passage we would usually hear at a wedding but as soon as Ken and Eileen suggested it, it just seemed to fit Geoff.\n\n> Love is patient, love is kind. It does not envy, it does not boast, it is not proud.\nIt is not rude, it is not self-seeking, it is not easily angered, it keeps no record of wrongs.\nLove does not delight in evil but rejoices with the truth.\nIt always protects, always trusts, always hopes, always perseveres.\n1 Cor 14:4-7\n\nAs Ken and Eileen said the other night, ‘That is Geoff.’\n\nI too can imagine interesting conversations. I also recall at times such as this that the Christ who walked the hills of Galilee, who stood alongside the poor and the leper; knew what it was like to grieve over the death of his friend Lazarus, knew in himself the loneliness of death and suffering. I find in him one who hears my pain and who understands.\n\nGeoff died too soon and the pain of that loss will remain. But Geoff also lived and today we give thanks to God for Geoff Rowden, as husband and father, and son and brother, as a wonderful human being and friend. The love that he had for you, that you have for him, lives on. May that love sustain you in the days that lie ahead. May you know something of the peace and presence of Christ as you continue to treasure the memories you have\n\nToday, in simple trust, we commend Geoff to the loving care of Almighty God, giving thanks to God for all that was good and true in his life, that he might have peace.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Geoff Rowden - Memorial Service.txt",
        "raw_ocr_content": "Page 1 of 4\nMemorial Service for Geoff Rowden – 16th November 2013 – St Mary’s.\nThree weeks ago Geoff Rowden was planning to do what he loved doing,\nplanning to walk and camp in the mountains, this time the ridge walk on\nMweelrea Mountain in Mayo. He loved the open air, the solitude, the peace.\nAn experienced walker, he had left a route and was well equipped for the\nclimb. On the Wednesday it was clear he was missing. Over three days\nGeoff’s family and friends knew the agony of waiting, of hoping, of dreading\nas Mayo Mountain Rescue Unit assisted by volunteers and friends from clubs\nall over the country searched the hills until, on Saturday morning, Geoff was\nfound where he had fallen.\nToday, a week after his funeral in Mount Jerome, family and friends gather to\ngive thanks for Geoff Rowden as husband and father, as son and brother, as\nuncle and friend. This part of the world is where Geoff grew up, where he\nwent to School, was baptised and confirmed. Those of us outside the\nimmediate circle of family and close friends come to show our love to Anne\nMarie and Chloe, to Ken and Eileen, to David, Linda and Alison and their\nfamilies and assure them of that our love and support in the days that lie ahead.\nOver the last couple of weeks it has been my privilege to listen as family have\nspoken of Geoff, with tears and laughter, with love, with pride, with a deep\ngratitude. I heard of a young man who got up to the usual mischief any healthy\nteenager does. I heard of a young man who thought deeply about life, about\npeople, about issues of justice, of right and wrong both home and abroad – a bit\nof a radical.\nPage 2 of 4\nMemorial Service for Geoff Rowden – 16th November 2013 – St Mary’s.\nI heard of a young man for whom family was central in his life. The family he\ngrew up in, the family life he shared with Anne Marie and their daughter\nChloe.\nOver the last number of years he had worked with children and young people\nin care. This was clearly more than just a job for Geoff. Totally professional\nin his approach, he had a real personal commitment and empathy with those in\nhis care, many of whom experienced the results of family breakdown, domestic\nviolence, drug and alcohol abuse. Here is part of a message sent by a work\ncolleague to Linda after his funeral last week.\nHe was known for his kind, sparky, lovable and devoted ways to his\ncolleagues as well as the children he worked with. He always had their\nbest interests at heart and did what he could in his role to make a\ndifference in their lives...he made a difference and they all loved him for\nthat...Be so proud of your brother, he was truly a star in the darkness and\nknow that in his short life he was powerfully respected by the work\npeople that knew the man Geoff Rowden.\nAt his Funeral in Mount Jerome, as he reflected on Geoff’s love of the\noutdoors, of the mountains and his radical views on issues, the Celebrant\nrecalled another radical who lived 2000 years ago, who would take himself off\ninto the hills, who died on a hill outside the city. One, he suggested, with\nwhom Geoff could have had interesting conversations. As I thought about that\nand thought of some of the things said about Geoff, I thought of a parable told\nby Jesus - the parable of the sheep and the goats.\nPage 3 of 4\nMemorial Service for Geoff Rowden – 16th November 2013 – St Mary’s.\n32 All the nations will be gathered before him, and he will separate people one from\nanother as a shepherd separates the sheep from the goats, 33 and he will put the sheep\nat his right hand and the goats at the left. 34 Then the king will say to those at his\nright hand, 'Come, you that are blessed by my Father, inherit the kingdom prepared\nfor you from the foundation of the world; 35 for I was hungry and you gave me food,\nI was thirsty and you gave me something to drink, I was a stranger and you\nwelcomed me, 36 I was naked and you gave me clothing, I was sick and you took\ncare of me, I was in prison and you visited me.' 37 Then the righteous will answer\nhim, 'Lord, when was it that we saw you hungry and gave you food, or thirsty and\ngave you something to drink? 38 And when was it that we saw you a stranger and\nwelcomed you, or naked and gave you clothing? 39 And when was it that we saw you\nsick or in prison and visited you?' 40 And the king will answer them, 'Truly I tell you,\njust as you did it to one of the least of these who are members of my family, you did\nit to me.' Matt 25:32-40\nThe sheep in that story did not help because it was a religious or holy thing to\ndo, because God was expecting it of them – they did it because it was simply\nthe right thing to do and in so doing discover that they encounter the Lord.\nGeoff’s concern for justice, for what was right, for those for whom life was\nhard, was just part of who he was and the values he had absorbed in the\nRowden home.\nKen has read from Paul’s 1st Letter to the Corinthians. It is a passage we would\nusually hear at a wedding but as soon as Ken and Eileen suggested it, it just\nseemed to fit Geoff.\nLove is patient, love is kind. It does not envy, it does not boast, it is not\nproud.\nIt is not rude, it is not self-seeking, it is not easily angered, it keeps no\nrecord of wrongs.\nLove does not delight in evil but rejoices with the truth.\nIt always protects, always trusts, always hopes, always perseveres.\n1 Cor 14:4-7\nAs Ken and Eileen said the other night, ‘That is Geoff.’\nPage 4 of 4\nMemorial Service for Geoff Rowden – 16th November 2013 – St Mary’s.\nI too can imagine interesting conversations. I also recall at times such as this\nthat the Christ who walked the hills of Galilee, who stood alongside the poor\nand the leper; knew what it was like to grieve over the death of his friend\nLazarus, knew in himself the loneliness of death and suffering. I find in him\none who hears my pain and who understands.\nGeoff died too soon and the pain of that loss will remain. But Geoff also lived\nand today we give thanks to God for Geoff Rowden, as husband and father, and\nson and brother, as a wonderful human being and friend. The love that he had\nfor you, that you have for him, lives on. May that love sustain you in the days\nthat lie ahead. May you know something of the peace and presence of Christ\nas you continue to treasure the memories you have\nToday, in simple trust, we commend Geoff to the loving care of Almighty God,\ngiving thanks to God for all that was good and true in his life, that he might\nhave peace."
    }
}