{
    "title": "Gillian Rickard's Funeral",
    "date": "2015-03-06",
    "blurb": "This sermon was delivered during the funeral of Gillian Rickard on 6th March 2015. It reflects on Gillian's life, her interests, and her work, acknowledging her contributions to social issues and her love for nature and literature. The sermon also addresses the shock and sadness of sudden bereavement, offering words of hope and comfort.",
    "raw_text": "Funeral of Gillian Rickard – 6th March 2015 – Mount Jerome\n\nEarlier this week the news broke that has left everyone shocked and saddened, that Gillian had died suddenly in her home in Crumlin. We gather today for her funeral. Those of us outside the immediate family come to offer our love and support to those who will miss her most. Her Mum Audrey, her partner of 14 years Malcolm, her sister Fiona and her family and Leo. We come to give thanks to God for all that we received in Gillian as family, as friend, as colleague.\n\nGillian had grown up in Sutton, attended the Burrow School and lived for a while in Howth with her husband Leo. Things didn’t work out and they parted but they always retained a good relationship. She moved to Crumlin and it is here she found love with Malcolm and he has shared his memories of Gillian.\n\nShe had started work in the Bank – but this was not Gillian – in fact she hated it. She left and for the last number of years has worked in the Markiewitz Centre, a centre offering family support. This was more in tune with her character, as one who always took an interest in social issues, in the homeless and would have been something of an activist. She had a wide range of interest, loving music of all types, so we are finishing off this service with and item from Queen She also loved literature and anything to do with nature. You will all have your own particular memories, your own particular reasons to give thanks to God for Gillian Rickard – just hold them before God this day.\n\nA bereavement, and particularly a sudden bereavement, always carries with it a sense of shock, of loss, of sadness. Someone who has been so much part of our lives is suddenly gone and an aching, agonising gap is left that no one else can fill in quite the same way. It is also a time of a gathering together of memories, the things that made a loved one special, their talents, their weaknesses, their love, their humour. As we gather these memories, our remembering promotes thankfulness, gratitude, to the one we have lost, to God himself. And, as we have seen, there is a lot to be thankful for.\n\nHowever thankful we may be, however strong our faith may be, it is hard, particularly in a time of loss to find meaning; meaning in the loss of a child, meaning in the loss of a parent, a life partner…. Where do we find hope, where do we find meaning? I often think we begin that search with each other, we begin with love in which we support each other in our loss. St Paul, talking of love, writes to the Church in Corinth:\n\n> 4 Love is patient; love is kind; love is not envious or boastful or arrogant 5 or rude. …… 7 It bears all things, believes all things, hopes all things, endures all things. 8 Love never ends.\n> 1 Cor 13.4-8\n\nSo today, Audrey, Malcolm, Fiona, we, your friends and those who love you, come to offer you our love, to assure you of our prayers in the days and weeks to come. On the wall just beside the door of St Mary’s Church in Howth you will see a climbing rose. Even in the midst of winter, there always seems to be signs of life on that bush, a few leaves and buds and even the odd flower. The darkness and cold of the winter can never suppress the life of that rose. Then as spring comes the life within it will burst forth. We are approaching the season of Easter. But before that comes Good Friday and Calvary – a seemingly pointless, savage death of goodness – but love, life triumphs over darkness, over death. It is in that cycle of death and resurrection that I begin my own search for meaning, for hope. Therein lies our hope for Gillian, for all those who have gone before us in the faith as we look to a Lord who knows, really knows in his own person what it was to grieve the death of his friend Lazarus, to know loneliness, suffering, death itself and triumph\n\nSo this day we not only bring our sadness at our loss before God, we also bring our memories and thanks giving for the life of Gillian Rickard and all that she has meant to family and friends down through the years, her love, her friendship, her loyalty. We come to pray for her family and all those she loved; for her mother Audrey, her partner Malcolm, her sister Fiona, for Leo and for all who loved her and to commend Gillian to the love of our heavenly Father.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Gillian Rickard.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Gillian Rickard – 6th march 2015 – Mount Jerome\nEarlier this week the news broke that has left everyone shocked and saddened, that\nGillian had died suddenly in her home in Crumlin. We gather today for her funeral.\nThose of us outside the immediate family come to offer our love and support to\nthose who will miss her most. Her Mum Audrey, her partner of 14 years Malcolm,\nher sister Fiona and her family and Leo. We come to give thanks to God for all that\nwe received in Gillian as family, as friend, as colleague.\nGillian had grown up in Sutton, attended the Burrow School and lived for a while in\nHowth with her husband Leo. Things didn’t work out and they parted but they\nalways retained a good relationship. She moved to Crumlin and it is here she found\nlove with Malcolm and he has shared his memories of Gillian.\nShe had started work in the Bank – but this was not Gillian – in fact she hated it.\nShe left and for the last number of years has worked in the Markiewitz Centre, a\ncentre offering family support. This was more in tune with her character, as one\nwho always took an interest in social issues, in the homeless and would have been\nsomething of an activist. She had a wide range of interest, loving music of all types,\nso we are finishing off this service with and item from Queen She also loved\nliterature and anything to do with nature. You will all have your own particular\nmemories, your own particular reasons to give thanks to God for Gillian Rickard –\njust hold them before God this day.\nA bereavement, and particularly a sudden bereavement, always carries with it a\nsense of shock, of loss, of sadness. Someone who has been so much part of our lives\nis suddenly gone and an aching, agonising gap is left that no one else can fill in\nquite the same way. It is also a time of a gathering together of memories, the things\nthat made a loved one special, their talents, their weaknesses, their love, their\nhumour. As we gather these memories, our remembering promotes thankfulness,\ngratitude, to the one we have lost, to God himself. And, as we have seen, there is a\nlot to be thankful for.\nPage 2 of 2\nFuneral of Gillian Rickard – 6th march 2015 – Mount Jerome\nHowever thankful we may be, however strong our faith may be, it is hard,\nparticularly in a time of loss to find meaning; meaning in the loss of a child,\nmeaning in the loss of a parent, a life partner…. Where do we find hope, where do\nwe find meaning? I often think we begin that search with each other, we begin with\nlove in which we support each other in our loss. St Paul, talking of love, writes to\nthe Church in Corinth:\n4 Love is patient; love is kind; love is not envious or boastful or\narrogant 5 or rude. …… 7 It bears all things, believes all things,\nhopes all things, endures all things. 8 Love never ends.\n1 Cor 13.4-8\nSo today, Audrey, Malcolm, Fiona, we, your friends and those who love you, come\nto offer you our love, to assure you of our prayers in the days and weeks to come.\nOn the wall just beside the door of St Mary’s Church in Howth you will see a\nclimbing rose. Even in the midst of winter, there always seems to be signs of life on\nthat bush, a few leaves and buds and even the odd flower. The darkness and cold of\nthe winter can never suppress the life of that rose. Then as spring comes the life\nwithin it will burst forth. We are approaching the season of Easter. But before that\ncomes Good Friday and Calvary – a seemingly pointless, savage death of goodness\n– but love, life triumphs over darkness, over death. It is in that cycle of death and\nresurrection that I begin my own search for meaning, for hope. Therein lies our hope\nfor Gillian, for all those who have gone before us in the faith as we look to a Lord\nwho knows, really knows in his own person what it was to grieve the death of his\nfriend Lazarus, to know loneliness, suffering, death itself and triumph\nSo this day we not only bring our sadness at our loss before God, we also bring our\nmemories and thanks giving for the life of Gillian Rickard and all that she has meant\nto family and friends down through the years, her love, her friendship, her loyalty.\nWe come to pray for her family and all those she loved; for her mother Audrey, her\npartner Malcolm, her sister Fiona, for Leo and for all who loved her and to\ncommend Gillian to the love of our heavenly Father."
    }
}