{
    "title": "Good Friday - The Two Mary's",
    "date": "2019-04-19",
    "blurb": "This sermon, delivered on Good Friday 2019, takes us to the foot of the Cross, focusing on the two Mary's - Mary the mother of Jesus and Mary Magdalene. The sermon explores the themes of redemption, forgiveness, and the boundless love of God. It emphasizes that Jesus' death is a triumph of God's loving purposes, not a desolation.",
    "raw_text": "This evening, in word and hymn we have taken ourselves to the foot of the Cross. In the Jewish Passover tradition, the worshippers are told to place themselves in the place, the time, the circumstances of that first Passover night. As they eat the bitter herbs, the unleavened bread, the Passover lamb and recite the Passover liturgy, in their hearts and minds they are there. These events represent not just the redemption of their ancestors, these events are for them, for each and every generation.\n\nIn bread and wine of communion we remember the death and resurrection of Jesus Christ. In the words of invitation to come and participate in communion the celebrant will say:\n\n> Draw near with faith.\n> Receive the body of our Lord Jesus Christ which he gave for you,\n> and his blood which he shed for you.\n> Remember that he died for you,\n> and feed on him in your hearts by faith with thanksgiving.\n\nWe remember, we represent the past, we bring the past into the present. As we read the scriptures Sunday by Sunday we read them not just as documents from a dim and distant past, we read them as God’s word for us in our day and in our time. And so as we read, we remember, we bring the past into the present.\n\nThe events we recall this night are events for all time, all people. And so in heart and mind we place ourselves on the hill 'beyond the city wall'. We place ourselves along with Peter and the other disciples who watch from a distance with who knows what fears and regrets. If only... if only we had been more faithful, if only we had listened more closely, if only we had not deserted him in his hour of need. But now they watch, we watch, as they hear the shouts and the taunts.\n\nThere are women there at the foot of the Cross. Some of you may have read the piece in the last issue of the newsletter on the two Mary’s at the foot of the Cross, Mary the mother of Jesus and Mary Magdalene. The Gospels tell us that she had been delivered by Jesus from 'seven devils' – New Testament language for some dark and horrible affliction of body, mind or spirit. As a result, her devotion to Him was total and her grief at His death overwhelming.\n\nIn church history Mary Magdalene became the 'fallen woman' a harlot who was rescued and forgiven by Jesus but there is no evidence to prove she was a 'fallen woman' but the contrast is sublime, Mary the virgin mother, the symbol of purity. Mary Magdalene, the scarlet woman who was saved and forgiven, the symbol of redemption. Surely, we all fall somewhere between those two extremes.\n\nThe dark cloud from which she was delivered may have been sexual, we are not told. What we do know is that the two Marys stood together at the cross, the Blessed Virgin and the woman rescued from who knows what darkness and despair.\n\nAnd out of the desolation of that afternoon 'beyond the city walls'. A cry rings out – It is finished, it is accomplished. We have come to recognise it that cry not a cry of desolation but one of triumph. Nothing, not even death, can triumph over the loving purposes of God.\n\nIn our services on Wednesday and Thursday, beginning with Ivor, the new Methodist Minister in Sutton, as he reflected on Judas, what lead him to do what he did and the utter desolation that followed, challenged us to recognise that no-one, not even Judas is beyond the love of God in Christ.\n\nAt this time of year, I often find myself going back to Michael Ramsey, a wonderful saintly Archbishop of Canterbury when I was a teenager. He once wrote this:\n\n> My Christian faith begins not with anything I can do for Christ, but in what Christ has done for me.\n\nJesus dies for us – there is nothing we can do for him. And if he dies for me, he dies for others – for the one who is different, different creed, different race, different gender, different class; he dies for the person I don’t particularly like, he dies for the person who doesn’t like me, he dies for all our sins.\n\nOne of my favorite hymns in the current hymn book is in fact quite an old hymn that for some reason was left out of earlier books. It is hymn 9,\n\n> There's a wideness in God's mercy\n> like the wideness of the sea;\n> there's a kindness in his justice,\n> which is more than liberty.\n> There is plentiful redemption\n> in the blood that has been shed;\n> there is joy for all the members\n> in the sorrows of the Head\n\nFor the love of God is broader than the measure of our mind; and the heart of the Eternal is most wonderfully kind. But we make his love too narrow by false limits of our own; and we magnify his strictness with a zeal he will not own.\n\nI will leave us with the picture of the two Mary’s; Mary the mother of Jesus, symbol of purity; Mary Magdalene symbol of brokenness and fragility touched by Christ – and ourselves somewhere between those two.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2019/Good Friday.txt",
        "raw_ocr_content": "Page 1 of 4\nGOOD FRIDAY – 2019 – ‘The two Mary’s\nThis evening, in word and hymn we have taken ourselves to the foot of the\nCross. In the Jewish Passover tradition, the worshippers are told to place\nthemselves in the place, the time, the circumstances of that first Passover night.\nAs they eat the bitter herbs, the unleavened bread, the Passover lamb and recite\nthe Passover liturgy, in their hearts and minds they are there. These events\nrepresent not just the redemption of their ancestors, these events are for them,\nfor each and every generation.\nIn bread and wine of communion we remember the death and resurrection of\nJesus Christ. In the words of invitation to come and participate in communion\nthe celebrant will say:\nDraw near with faith.\nReceive the body of our Lord Jesus Christ which he gave for you,\nand his blood which he shed for you.\nRemember that he died for you,\nand feed on him in your hearts by faith with thanksgiving.\nWe remember, we represent the past, we bring the past into the present.\nAs we read the scriptures Sunday by Sunday we read them not just as\ndocuments from a dim and distant past, we read them as God’s word for us in\nour day and in our time. And so as we read, we remember, we bring the past\ninto the present.\nThe events we recall this night are events for all time, all people. And so in\nheart and mind we place ourselves on the hill ‘beyond the city wall’. We place\nourselves along with Peter and the other disciples who watch from a distance\nwith who knows what fears and regrets. If only ….. if only we had been more\nPage 2 of 4\nGOOD FRIDAY – 2019 – ‘The two Mary’s\nfaithful, if only we had listened more closely, if only we had not deserted him\nin his hour of need. But now they watch, we watch, as they hear the shouts and\nthe taunts.\nThere are women there at the foot of the Cross. Some of you may have read\nthe piece in the last issue of the newsletter on the two Mary’s at the foot of the\nCross, Mary the mother of Jesus and Mary Magdalene. The Gospels tell us\nthat she had been delivered by Jesus from ‘seven devils’ – New Testament\nlanguage for some dark and horrible affliction of body, mind or spirit. As a\nresult, her devotion to Him was total and her grief at His death overwhelming.\nIn church history Mary Magdalene became the ‘fallen woman’ a harlot who\nwas rescued and forgiven by Jesus but there is no evidence to prove she was a\n‘fallen woman’ but the contrast is sublime, Mary the virgin mother, the symbol\nof purity. Mary Magdalene, the scarlet woman who was saved and forgiven,\nthe symbol of redemption. Surely, we all fall somewhere between those two\nextremes.\nThe dark cloud from which she was delivered may have been sexual, we are\nnot told. What we do know is that the two Marys stood together at the cross,\nthe Blessed Virgin and the woman rescued from who knows what darkness and\ndespair.\nAnd out of the desolation of that afternoon ‘beyond the city walls’. A cry rings\nout – It is finished, it is accomplished. We have come to recognise it that cry\nPage 3 of 4\nGOOD FRIDAY – 2019 – ‘The two Mary’s\nnot a cry of desolation but one of triumph. Nothing, not even death, can\ntriumph over the loving purposes of God.\nIn our services on Wednesday and Thursday, beginning with Ivor, the new\nMethodist Minister in Sutton, as he reflected on Judas, what lead him to do\nwhat he did and the utter desolation that followed, challenged us to recognise\nthat no-one, not even Judas is beyond the love of God in Christ.\nAt this time of year, I often find myself going back to Michael Ramsey, a\nwonderful saintly Archbishop of Canterbury when I was a teenager. He once\nwrote this:\nMy Christian faith begins not with anything I can do for Christ, but in\nwhat Christ has done for me.\nJesus dies for us – there is nothing we can do for him. And if he dies for me,\nhe dies for others – for the one who is different, different creed, different race,\ndifferent gender, different class; he dies for the person I don’t particularly like,\nhe dies for the person who doesn’t like me, he dies for all our sins.\nOne of my favorite hymns in the current hymn book is in fact quite an old\nhymn that for some reason was left out of earlier books. It is hymn 9,\nThere's a wideness in God's mercy\nlike the wideness of the sea;\nthere's a kindness in his justice,\nwhich is more than liberty.\nThere is plentiful redemption\nin the blood that has been shed;\nthere is joy for all the members\nin the sorrows of the Head\nPage 4 of 4\nGOOD FRIDAY – 2019 – ‘The two Mary’s\nFor the love of God is broader\nthan the measure of our mind;\nand the heart of the Eternal\nis most wonderfully kind.\nBut we make his love too narrow\nby false limits of our own;\nand we magnify his strictness\nwith a zeal he will not own.\nI will leave us with the picture of the two Mary’s; Mary the mother of Jesus,\nsymbol of purity; Mary Magdalene symbol of brokenness and fragility\ntouched by Christ – and ourselves somewhere between those two."
    }
}