{
    "title": "Good Friday 2012 - Beatitudes",
    "date": "2012-04-06",
    "blurb": "This sermon reflects on the Beatitudes, simple affirmations and promises from the Sermon on the Mount. The speaker discusses the true meanings of being 'blessed', suggesting it carries the meaning of being happy or joyful. The sermon emphasizes the importance of humility, service, and self-sacrifice, and the peace and contentment that comes from being one with Christ.",
    "raw_text": "Good Friday 2012 – Beatitudes\nThe Way of the Cross\n\nOver these past few nights in our Holy Week services we have been reflecting on the Beatitudes, that collection of simple affirmations and promises that come at the beginning of Matthew’s account of the Sermon on the Mount. Each one is introduced by the simple ‘Blessed are …’\n\n\"Blessed are the poor in spirit, …\n\"Blessed are those who mourn, …\n\"Blessed are the meek, …\n\"Blessed are those who hunger and thirst for righteousness, …\n\"Blessed are the merciful, …\n“Blessed are the pure in heart, …\n\"Blessed are the peacemakers, …\n\"Blessed are those who are persecuted for righteousness' sake, …\n\"Blessed are you when people revile you and persecute you and utter all kinds of evil against you falsely on my account.\n\nAs I was reflecting earlier in the week, these words are so familiar, their very familiarity can rob them of their force. Also the very process of translation from the original, the choice of word used to convey the meaning of the original can take some of the edge off it.\n\nBlessed – it has become a very ‘churchy’ expression – not the sort of word you would here in the bar in the yacht club or the rugby club. The word in the original Greek in which this passage was written, that we render as ‘blessed’ carries the meaning of happy, joyful.\n\nHappy are the poor in spirit …\nJoyful are those who mourn\nHappy, joyful are the meek …\n\nIt takes the churchiness, the solemnity out of it. But in its place I find a promise of a sense of peace, of contentment in being at one with the Christ who utters these words. That in recognising our poverty in spirit, that we come to God empty handed, we recognise our dependence upon him and get a glimpse of the reality of grace, and discover that he meets our deepest needs of love, of forgiveness, of hope.\n\nBlessed, happy, joyful are the meek. The meek, not the weak or the pliable, but those who, rather than standing on the own dignity, insisting on their own importance, adopt the mind, the manner of Christ. The one, who being their Lord and Master, knelt at the feet of his disciples and washed their feet, who lay aside his majesty and took the nature of a servant and was obedient unto death, even death on a cross – in the process we are promised a peace that no status in this world can confer.\n\nThe way of the Beatitudes is the way of laying aside, of letting go, of service of God and one another. It is to follow him who taught his disciples to turn the other cheek, to go the second mile, to forgive those who wrong us not seven times but seventy times seven. It is the way of the cross. Jesus said to his followers:\n\n\"If any want to become my followers, let them deny themselves and take up their cross and follow me. 25 For those who want to save their life will lose it, and those who lose their life for my sake will find it. 26 For what will it profit them if they gain the whole world but forfeit their life?\n\nThose who save their life will lose it, those who lose their life will find it. It is in this finding and losing and losing and finding that we find our true peace and joy with Christ. So today, in fellowship with Christians all around the world, of different traditions, different nationalities and cultures, in Dublin, in Africa, Asia, Europe, America, in the city of Jerusalem we stop, we look, we watch, we pray, we dedicate ourselves afresh.\n\n1 When my love for Christ grows weak,\nwhen for deeper faith I seek,\nthen in thought I go to thee,\nGarden of Gethsemane.\n\n2 There I walk amid the shades,\nwhile the lingering twilight fades,\nsee that suffering, friendless one,\nweeping, praying there alone.\n\n3 When my love for man grows weak,\nwhen for stronger faith I seek,\nHill of Calvary, I go\nto thy scenes of fear and woe:-\n\n3 there behold his agony,\nsuffered on the bitter tree:\nsee his anguish, see his faith,\nLove triumphant still in death.\n\n4 Then to life I turn again,\nlearning all the worth of pain,\nlearning all the might that lies\nin a full self-sacrifice;\n\n5 and I praise with firmer faith\nChrist, who vanquished pain and death;\nand to Christ enthroned above\nraise my song of selfless love.\n\nJesu, Jesu I thee adore\nhelp me love thee more and more.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2012/goodfriday2012.txt",
        "raw_ocr_content": "Page 1 of 3\nGood Friday 2012 – Beatitudes\nThe Way of the Cross\nOver these past few nights in our Holy Week services we have been reflecting\non the Beatitudes, that collection of simple affirmations and promises that\ncome at the beginning of Matthew’s account of the Sermon on the Mount.\nEach one is introduced by the simple ‘Blessed are …’\n\"Blessed are the poor in spirit, ………..\n\"Blessed are those who mourn, ………..\n\"Blessed are the meek, …………….\n\"Blessed are those who hunger and thirst for righteousness, …….\n\"Blessed are the merciful, ……………\n“Blessed are the pure in heart, ……………\n\"Blessed are the peacemakers, ……………\n\"Blessed are those who are persecuted for righteousness' sake, ……..\n\"Blessed are you when people revile you and persecute you and utter all\nkinds of evil against you falsely on my account.\nAs I was reflecting earlier in the week, these words are so familiar, their very\nfamiliarity can rob them of their force. Also the very process of translation\nfrom the original, the choice of word used to convey the meaning of the\noriginal can take some of the edge off it.\nBlessed – it has become a very ‘churchy’ expression – not the sort of word you\nwould here in the bar in the yacht club or the rugby club. The word in the\noriginal Greek in which this passage was written, that we render as ‘blessed’\ncarries the meaning of happy, joyful.\nHappy are the poor in spirit ….\nJoyful are those who mourn\nHappy, joyful are the meek …..\nIt takes the churchiness, the solemnity out of it. But in its place I find a\npromise of a sense of peace, of contentment in being at one with the Christ\nPage 2 of 3\nGood Friday 2012 – Beatitudes\nThe Way of the Cross\nwho utters these words. That in recognising our poverty in spirit, that we come\nto God empty handed, we recognise our dependence upon him and get a\nglimpse of the reality of grace, and discover that he meets our deepest needs of\nlove, of forgiveness, of hope.\nBlessed, happy, joyful are the meek. The meek, not the weak or the pliable,\nbut those who, rather than standing on the own dignity, insisting on their own\nimportance, adopt the mind, the manner of Christ. The one, who being their\nLord and Master, knelt at the feet of his disciples and washed their feet, who\nlay aside his majesty and took the nature of a servant and was obedient unto\ndeath, even death on a cross – in the process we are promised a peace that no\nstatus in this world can confer.\nThe way of the Beatitudes is the way of laying aside, of letting go, of service of\nGod and one another. It is to follow him who taught his disciples to turn the\nother cheek, to go the second mile, to forgive those who wrong us not seven\ntimes but seventy times seven. It is the way of the cross. Jesus said to his\nfollowers:\n\"If any want to become my followers, let them deny themselves and\ntake up their cross and follow me. 25 For those who want to save\ntheir life will lose it, and those who lose their life for my sake will\nfind it. 26 For what will it profit them if they gain the whole world\nbut forfeit their life?\nThose who save their life will lose it, those who lose their life will find it. It is\nin this finding and losing and losing and finding that we find our true peace and\njoy with Christ. So today, in fellowship with Christians all around the world,\nof different traditions, different nationalities and cultures, in Dublin, in Africa,\nPage 3 of 3\nGood Friday 2012 – Beatitudes\nThe Way of the Cross\nAsia, Europe, America, in the city of Jerusalem we stop, we look, we watch,\nwe pray, we dedicate ourselves afresh.\n1 When my love for Christ grows weak,\nwhen for deeper faith I seek,\nthen in thought I go to thee,\nGarden of Gethsemane.\n2 There I walk amid the shades,\nwhile the lingering twilight fades,\nsee that suffering, friendless one,\nweeping, praying there alone.\n3 When my love for man grows weak,\nwhen for stronger faith I seek,\nHill of Calvary, I go\nto thy scenes of fear and woe:-\n3 there behold his agony,\nsuffered on the bitter tree:\nsee his anguish, see his faith,\nLove triumphant still in death.\n4 Then to life I turn again,\nlearning all the worth of pain,\nlearning all the might that lies\nin a full self-sacrifice;\n5 and I praise with firmer faith\nChrist, who vanquished pain and death;\nand to Christ enthroned above\nraise my song of selfless love.\nJesu, Jesu I thee adore\nhelp me love thee more and more."
    }
}