{
    "title": "Harvest Thanksgiving",
    "date": "2010-10-03",
    "blurb": "The sermon discusses the concept of Harvest Thanksgiving, its origins, and its relevance in the modern world. It emphasizes the importance of stewardship of the Earth and the need for balance between work and rest, drawing from the Biblical concept of Sabbath. The sermon also highlights the responsibility each individual has towards the environment and the choices we make in our daily lives.",
    "raw_text": "HARVEST THANKSGIVING – Howth – 3rd October 2010\n\nGod saw everything that he had made, and indeed, it was very good. And there was evening and there was morning, the sixth day. Thus the heavens and the earth were finished, and all their multitude. And on the seventh day God finished the work that he had done, and he rested on the seventh day from all the work that he had done. So God blessed the seventh day and hallowed it, because on it God rested from all the work that he had done in creation. Genesis 1:31-2:3\n\nHarvest Thanksgiving is one of those well loved festivals in the life of the Church. Our Churches are beautifully decorated; we enjoy singing the traditional harvest hymns – there is a ‘feel good’ factor to our worship.\n\nIt is a tradition that is relatively modern. It evolved in a very different age to ours, in Victorian England. Agriculture was far more precarious. The failure of harvest through adverse weather or disease could have a catastrophic impact on a farming community involving real hardship. The Irish Potato Famine of the mid 19th century is a case in point. For rural parishes in Ireland, Harvest Thanksgiving is still directly related to their livelihood. I recall years in Mountmellick when the hymn ‘All is safely gathered in’ was sung with a sense of genuine relief.\n\nWe who worship here live in a very different age, in a very different environment. The community of Howth, of which we are a part, the island of Ireland does not have that same dependence on agriculture or fishing as it would have even 40 years ago. So what does Harvest mean for us in our situation? Is it just an excuse to decorate, to sing those lovely hymns, to drift back to a vision of rural Ireland, of ‘comely maidens dancing at the cross roads?’ If it is not to be just an exercise in nostalgia, what does Harvest mean for us?\n\nWe may not be directly involved in agriculture or fisheries but we all depend on them for the neatly packaged food we buy in our supermarkets. But more than that, we are all inhabitants of this planet and we all have a responsibility for the welfare of this planet. But what is to be the basis of our concern? What is to be the rationale of our thinking? Is it nothing more than the dreamy idealism of the tree hugger, divorced from the reality of this world? Is the current Republican candidate for the Presidency of the United States right when he dismisses global warming as an illusion?\n\nThe Old Testament scriptures written in a very different time and culture, give us much needed food for thought on the whole issue of creation and man’s stewardship of it. I go back to the 1st chapter of the Book Genesis. In this we count off the days of creation, the gradual coming into being of the created order, light and darkness, land and sea, sun, moon and stars, plants and animals, coming to a climax with the creation of man, male and female, made in the image of God. We have those lovely words:\n\nGod saw everything that he had made, and indeed, it was very good. And there was evening and there was morning, the sixth day. Gen 1:31\n\nIt was finished – but if you look at the text again it wasn’t finished.\n\nAnd on the seventh day God finished the work that he had done, and he rested on the seventh day from all the work that he had done. 3 So God blessed the seventh day and hallowed it, because on it God rested from all the work that he had done in creation. Gen 2:2,3\n\nWhat is God’s work on the 7th day? God’s final act of creation is rest, to step back, to reflect, to enjoy his wonderful work. The Old Testament concept of Sabbath has its roots in the work of God on this 7th day.\n\nLike the creator, man is to work for six days and on the 7th day he is to rest; he, his household, his slaves and his animals; to step back from working, accumulating, consuming. To paraphrase the Shorter Catechism of the Presbyterian Church, man’s chief end is not to do, to make, to consume, to compete; man’s chief end is to glorify God and enjoy him for ever. Sabbath is a time to stand back, time to reflect on who I am, what I am in the context of all my other often frenzied activity; a time to rest in the presence of the God who creates and who rests.\n\nThe Old Testament also contains the concept of Sabbath for the land. One year in seven the land is to rest, to be left fallow, to recover from constant production. There is the recognition that the fertility of the earth, the resources of the earth are not inexhaustible. Yet man still continue to plunder the rain forests, to pollute, to waste and the earth is suffering, the climate is changing, the glaciers are melting, deserts are expanding, weather patterns are becoming more extreme.\n\nIn a consumer society such as ours which has placed a high premium on having the latest design, the latest car, the latest model of this or that, there is something compellingly contemporary about these ancient texts. The Biblical concept of Sabbath, of a balanced cycle of work and rest has much to say to our contemporary society.\n\nThe concept of Sabbath provides a spiritual and philosophical framework for our care for the environment. This earth we have been given to enjoy is held in trust for future generations. We are stewards, not owners of this wonderful world. Maintaining the cycle of work and rest is vital to the health of the earth; giving the land, fish stocks, rain forests, all the other resources of this amazing planet time to recover has to be an integral part of that stewardship. We can make our voice heard in the choices we make in our day to day purchases. Buying wooden products made from sustainable forests. Where possible buying our food products bearing the Fair Trade or similar mark. This is all part of our worship of the God who creates and who rests. Seen in this context the failure of the nations to come to agreement on steps to even contain the changes we are seeing in the world’s climate is nothing short of scandalous.\n\nIt frees Sabbath observance from an arid legalism that in the past would have swings tied up in a public playground. It becomes instead a space, a holy space, space set aside from work, from achieving, from competing. I think we really do have to ask has the so-called liberalisation of Sunday trading really enhanced us as a society in the pressures it has placed upon people with families, with elderly relatives, the pressures it has placed upon family life, community life. There is a truly eternal wisdom in the Biblical concept of Sabbath – space, holy space, space set aside for community, for family, for worship, for rest in the presence of the God in whose image we are made, a God who creates and who rests.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/harvest2010.txt",
        "raw_ocr_content": "Page 1 of 4\nHARVEST THANKSGIVING – Howth – 3rd October 2010\n131 God saw everything that he had made, and indeed, it was very good.\nAnd there was evening and there was morning, the sixth day.\n2:1 Thus the heavens and the earth were finished, and all their\nmultitude. 2 And on the seventh day God finished the work that he had\ndone, and he rested on the seventh day from all the work that he had\ndone. 3 So God blessed the seventh day and hallowed it, because on it\nGod rested from all the work that he had done in creation. Genesis\n1:31-2:3\nHarvest Thanksgiving is one of those well loved festivals in the life of the\nChurch. Our Churches are beautifully decorated; we enjoy singing the\ntraditional harvest hymns – there is a ‘feel good’ factor to our worship.\nIt is a tradition that is relatively modern. It evolved in a very different age to\nours, in Victorian England. Agriculture was far more precarious. The failure\nof harvest through adverse weather or disease could have a catastrophic impact\non a farming community involving real hardship. The Irish Potato Famine of\nthe mid 19th century is a case in point. For rural parishes in Ireland, Harvest\nThanksgiving is still directly related to their livelihood. I recall years in\nMountmellick when the hymn ‘All is safely gathered in’ was sung with a sense\nof genuine relief.\nWe who worship here live in a very different age, in a very different\nenvironment. The community of Howth, of which we are a part, the island of\nIreland does not have that same dependence on agriculture or fishing as it\nwould have even 40 years ago. So what does Harvest mean for us in our\nsituation? Is it just an excuse to decorate, to sing those lovely hymns, to drift\nback to a vision of rural Ireland, of ‘comely maidens dancing at the cross\nPage 2 of 4\nHARVEST THANKSGIVING – Howth – 3rd October 2010\nroads?’ If it is not to be just an exercise in nostalgia, what does Harvest mean\nfor us?\nWe may not be directly involved in agriculture or fisheries but we all depend\non them for the neatly packaged food we buy in our supermarkets. But more\nthan that, we are all inhabitants of this planet and we all have a responsibility\nfor the welfare of this planet. But what is to be the basis of our concern? What\nis to be the rationale of our thinking? Is it nothing more than the dreamy\nidealism of the tree hugger, divorced from the reality of this world? Is the\ncurrent Republican candidate for the Presidency of the United States right\nwhen he dismisses global warming as an illusion?\nThe Old Testament scriptures written in a very different time and culture, give\nus much needed food for thought on the whole issue of creation and man’s\nstewardship of it. I go back to the 1st chapter of the Book Genesis. In this we\ncount off the days of creation, the gradual coming into being of the created\norder, light and darkness, land and sea, sun, moon and stars, plants and\nanimals, coming to a climax with the creation of man, male and female, made\nin the image of God. We have those lovely words:\nGod saw everything that he had made, and indeed, it was very good.\nAnd there was evening and there was morning, the sixth day. Gen 1:31\nIt was finished – but if you look at the text again it was n’t finished.\nAnd on the seventh day God finished the work that he had done, and he\nrested on the seventh day from all the work that he had done. 3 So God\nblessed the seventh day and hallowed it, because on it God rested from\nall the work that he had done in creation. Gen 2:2,3\nPage 3 of 4\nHARVEST THANKSGIVING – Howth – 3rd October 2010\nWhat is God’s work on the 7th day? God’s final act of creation is rest, to step\nback, to reflect, to enjoy his wonderful work. The Old Testament concept of\nSabbath has its roots in the work of God on this 7th day.\nLike the creator, man is to work for six days and on the 7th day he is to rest; he,\nhis household, his slaves and his animals; to step back from working,\naccumulating, consuming. To paraphrase the Shorter Catechism of the\nPresbyterian Church, man’s chief end is not to do, to make, to consume, to\ncompete; man’s chief end is to glorify God and enjoy him for ever. Sabbath is\na time to stand back, time to reflect on who I am, what I am in the context of\nall my other often frenzied activity; a time to rest in the presence of the God\nwho creates and who rests.\nThe Old Testament also contains the concept of Sabbath for the land. One year\nin seven the land is to rest, to be left fallow, to recover from constant\nproduction. There is the recognition that the fertility of the earth, the resources\nof the earth are not inexhaustible. Yet man still continue to plunder the rain\nforests, to pollute, to waste and the earth is suffering, the climate is changing,\nthe glaciers are melting, deserts are expanding, weather patterns are becoming\nmore extreme.\nIn a consumer society such as ours which has placed a high premium on having\nthe latest design, the latest car, the latest model of this or that, there is\nsomething compellingly contemporary about these ancient texts. The Biblical\nconcept of Sabbath, of a balanced cycle of work and rest has much to say to\nour contemporary society.\nPage 4 of 4\nHARVEST THANKSGIVING – Howth – 3rd October 2010\nThe concept of Sabbath provides a spiritual and philosophical framework for\nour care for the environment. This earth we have been given to enjoy is held in\ntrust for future generations. We are stewards, not owners of this wonderful\nworld. Maintaining the cycle of work and rest is vital to the health of the earth;\ngiving the land, fish stocks, rain forests, all the other resources of this amazing\nplanet time to recover has to be an integral part of that stewardship. We can\nmake our voice heard in the choices we make in our day to day purchases.\nBuying wooden products made from sustainable forests. Where possible\nbuying our food products bearing the Fair Trade or similar mark. This is all\npart of our worship of the God who creates and who rests. Seen in this context\nthe failure of the nations to come to agreement on steps to even contain the\nchanges we are seeing in the world’s climate is nothing short of scandalous.\nIt frees Sabbath observance from an arid legalism that in the past would have\nswings tied up in a public playground. It becomes instead a space, a holy\nspace, space set aside from work, from achieving, from competing. I think we\nreally do have to ask has the so-called liberalisation of Sunday trading really\nenhanced us as a society in the pressures it has placed upon people with\nfamilies, with elderly relatives, the pressures it has placed upon family life,\ncommunity life. There is a truly eternal wisdom in the Biblical concept of\nSabbath – space, holy space, space set aside for community, for family, for\nworship, for rest in the presence of the God in whose image we are made, a\nGod who creates and who rests."
    }
}