{
    "title": "Here is your King",
    "date": "2011-04-17",
    "blurb": "This sermon explores the use of the word 'King' in John's Gospel, examining various passages where it is mentioned. It delves into the concept of Jesus as the 'King of the Jews' and the implications of this title in the context of the Gospel. The sermon encourages listeners to reflect on the nature of Jesus' kingship and its significance in their faith journey.",
    "raw_text": "USE OF THE WORD ‘KING’ IN JOHN’S Gospel\n\nJn 1:49.\n\n49 Nathanael replied, \"Rabbi, you are the Son of God! You are the King of Israel!\"\n\nJn 6:15.\n\nWhen Jesus realized that they were about to come and take him by force to make him king, he withdrew again to the mountain by himself.\n\nJn 12:13-15.\n\nSo they took branches of palm trees and went out to meet him, shouting,\n\n\"Hosanna!\nBlessed is the one who comes in the name of the Lord--\nthe King of Israel!\"\n\nJesus found a young donkey and sat on it; as it is written:\n\n\"Do not be afraid, daughter of Zion.\nLook, your king is coming,\nsitting on a donkey's colt!\"\n\nJn 18:33.\n\nThen Pilate entered the headquarters again, summoned Jesus, and asked him, \"Are you the King of the Jews?\"\n\nJesus answered, \"My kingdom is not from this world. If my kingdom were from this world, my followers would be fighting to keep me from being handed over to the Jews. But as it is, my kingdom is not from here.\" 37 Pilate asked him, \"So you are a king?\" Jesus answered, \"You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.\"\n\nJn 18:39\n\nBut you have a custom that I release someone for you at the Passover. Do you want me to release for you the King of the Jews?\"\n\nJn 19:3\n\nThey kept coming up to him, saying, \"Hail, King of the Jews!\" and striking him on the face.\n\nJn 19:12\n\nFrom then on Pilate tried to release him, but the Jews cried out, \"If you release this man, you are no friend of the emperor. Everyone who claims to be a king sets himself against the emperor.\"\n\nJn 19:14\n\nNow it was the day of Preparation for the Passover; and it was about noon. He said to the Jews, \"Here is your King!\" 15 They cried out, \"Away with him! Away with him! Crucify him!\" Pilate asked them, \"Shall I crucify your King?\" The chief priests answered, \"We have no king but the emperor.\" 16 Then he handed him over to them to be crucified.\n\nJn 19:19-21\n\nPilate also had an inscription written and put on the cross. It read, \"Jesus of Nazareth, the King of the Jews.\" 20 Many of the Jews read this inscription, because the place where Jesus was crucified was near the city; and it was written in Hebrew, in Latin, and in Greek. 21 Then the chief priests of the Jews said to Pilate, \"Do not write, 'The King of the Jews,' but, 'This man said, I am King of the Jews.'\n",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2011/Here is your King - notes.txt",
        "raw_ocr_content": "USE OF THE WORD ‘KING’ IN JOHN’S Gospel\nJn 1:49.\n49 Nathanael replied, \"Rabbi, you are the Son of God! You are the King of Israel!\"\nJn 6:15.\nJn 6:15 When Jesus realized that they were about to come and take him by force to make him king, he\nwithdrew again to the mountain by himself.\nJn 12:13-15.\n13 So they took branches of palm trees and went out to meet him, shouting,\n\"Hosanna!\nBlessed is the one who comes in the name of the Lord--\nthe King of Israel!\"\nJn 12:14 Jesus found a young donkey and sat on it; as it is written:\nJn 12:15 \"Do not be afraid, daughter of Zion.\nLook, your king is coming,\nsitting on a donkey's colt!\"\nJn 18:33.\nJn 18:33 Then Pilate entered the headquarters again, summoned Jesus, and asked him, \"Are you the\nKing of the Jews?\"\nJn 18:36-37\nJesus answered, \"My kingdom is not from this world. If my kingdom were from this world, my\nfollowers would be fighting to keep me from being handed over to the Jews. But as it is, my kingdom\nis not from here.\" 37 Pilate asked him, \"So you are a king?\" Jesus answered, \"You say that I am a\nking. For this I was born, and for this I came into the world, to testify to the truth. Everyone who\nbelongs to the truth listens to my voice.\"\nJn 18:39\n39 But you have a custom that I release someone for you at the Passover. Do you want me to release\nfor you the King of the Jews?\"\nJn 19:3\n3 They kept coming up to him, saying, \"Hail, King of the Jews!\" and striking him on the face.\nJn 19:12\n12 From then on Pilate tried to release him, but the Jews cried out, \"If you release this man, you are\nno friend of the emperor. Everyone who claims to be a king sets himself against the emperor.\"\nJn 19:14\n14 Now it was the day of Preparation for the Passover; and it was about noon. He said to the Jews,\n\"Here is your King!\" 15 They cried out, \"Away with him! Away with him! Crucify him!\" Pilate asked\nthem, \"Shall I crucify your King?\" The chief priests answered, \"We have no king but the emperor.\" 16\nThen he handed him over to them to be crucified.\nJn 19:19-21\n19 Pilate also had an inscription written and put on the cross. It read, \"Jesus of Nazareth, the King of\nthe Jews.\" 20 Many of the Jews read this inscription, because the place where Jesus was crucified\nwas near the city; and it was written in Hebrew, in Latin, and in Greek. 21 Then the chief priests of the\nJews said to Pilate, \"Do not write, 'The King of the Jews,' but, 'This man said, I am King of the Jews.'\n“"
    }
}