{
    "title": "Holy Week 2010",
    "date": "2010-03-28",
    "blurb": "This sermon, delivered during Holy Week 2010, explores the themes of divine love, sacrifice, redemption, and our response to these. It reflects on the pain and loneliness experienced by Jesus, the vulnerability of God's love, and the power of love to bring about redemption and change. The sermon encourages us to respond to God's love by embodying it in our own lives.",
    "raw_text": "Hymn 244 ‘There is a green hill far away’\nThursday vs 5 ‘O dearly, dearly has he loved…’\n\nEach night this week we have sung Mrs Alexander’s hymn, ‘There is a green hill far away’. It is a hymn of its time, that evolved in its own particular cultural setting, her husband was Church of Ireland Bishop of Derry & Raphoe in the latter half of the 19th Century. It is a hymn that touches upon timeless themes of divine love, sacrifice, redemption and our response to all this. The Cross, the events of the Cross, the drama of the Cross touches something deep within us. The poetry, the familiar tune all serve to keep these themes in our mind, enabling us to reflect, to mull over, to absorb; they help take us beyond the intellect to reflect, to allow my heart, my mind, my emotions to be touched, to be challenged.\n\nO dearly, dearly has he loved ……\n\nDearly is one of those words that bears a range of interpretations. The word dearly speaks both of great cost but also of great affection, even tenderness. It is important that we hold all of these together as we go on to reflect on what is going on on that Green Hill far away.\n\nThe other night we though of the pains he had to bear. The pain that began in Gethsemene, the agony in the garden – Let this cup pass from me yet not what I want but what you want – the betrayal by the kiss of a friend, the abandonment by the other disciples, the contempt of the religious establishment, the scorn of a fickle, manipulated crowd.\n\nThe pain of loneliness, of rejection; and then on the cross the pain of desolation – My God, My God, why have you forsaken me? A pain that goes beyond mere physical pain, one that can be dulled by drugged wine.\n\nBoth Mark and Matthew speak of that cry of desolation. To me that has always expressed a pain that goes to the very heart of the God head as the perfect communion between Father and Son is stretched to breaking point in the darkness of Calvary. That cry of desolation has touched me more than any other of the words from the cross; it epitomises for me the cost of the cross.\n\nDearly, dearly has he loved ……….. A measure of ‘the breadth and length and height and depth of the love of Christ that surpasses knowledge’.\n\nDearly, as I remarked, speaks also of affection, of commitment, of tenderness – so as I remarked the other night there is something vulnerable in love that leaves itself open to disappointment. For love is, in itself, essentially relational. There is the lover and the beloved. There should also be a reciprocity – the lover should be the beloved of the other and vice versa. Otherwise we are in the realm of unrequited love.\n\nThere is a vulnerability in God’s love for us that refuses to be disappointed. For God is love, so God takes the first step, God takes the initiative. God in love makes himself utterly vulnerable. Arms stretched out in love on the cross ready to embrace.\n\nDearly, dearly has he loved,\nand we must love him too.\n\nOn the wall of my office in the Parish Centre I have a print of a painting by Rembrandt, ‘The Return of the Prodigal’. At the heart of the picture is a scene of reconciliation between father and son. The son is on his knees at his father’s feet, bearing the marks of both his former dignity, in tattered shoes and clothes, and also of the depths to which he had sunk, his head shaved like that of a slave. The father is simply embracing his son and a warm light illuminates them both. The son, having disowned the father, had come back knowing he deserved no more than be treated as a hired hand and is overwhelmed to realise that the father had always loved him, had always been looking for him – all he can do is receive the unmerited, undeserved, all embracing love of the father.\n\nThere is something truly redemptive about love that has the power to change.\n\nDearly dearly has he loved\nand we must love him too.\n\nAnd trust in his redeeming blood..\n\nThe writer of the letter to the Ephesians reminds us:\n\n13 But now in Christ Jesus you who once were far off\nhave been brought near by the blood of Christ. 14 For he\nis our peace; ……. 15 He has abolished the law with its\ncommandments and ordinances, that he might create in\nhimself one new humanity in place of the two, thus\nmaking peace, 16 and might reconcile both groups to God\nin one body through the cross, Eph 2:13-16\n\nIn the language of Old Testament sacrifice, the blood is symptomatic of life and the life of Jesus is one marked by a total dedication to the Father, intimate communion with the heavenly Father who is love. The life, the death, the resurrection of Jesus is essentially one of love, of peace, of reconciliation – in short redemption, reclaiming for God man made in the image of God.\n\nThat is a life, that is a love that has the power to fundamentally challenge, to redeem lives. These are lives changed not by fear but by an encounter with a radical life changing, life enhancing love as revealed in the person of Jesus Christ. We are reminded in the 1st Letter of John:\n\n18 There is no fear in love, but perfect love casts out fear; ……..\n\n19 We love because he first loved us. 20 Those who say, \"I love\nGod,\" and hate their brothers or sisters, are liars; for those who\ndo not love a brother or sister whom they have seen, cannot\nlove God whom they have not seen. 1Jn 4:18-20\n\nI spoke earlier of love as relational, of the reciprocity of love – the lover and the beloved offering mutual love each to the other. Beloved of God, we are called to respond in love. Lives changed by the love of Christ are called to incarnate something of the love of Christ in the world in which they are set, among the people they are set alongside, in the situations in which they are placed. The medieval mystic Teresa of Avila reflected:\n\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\n\nand so:\n\nDearly dearly has he loved\nand we must love him too.\n\nAnd trust in his redeeming blood\nand try his works to do.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2010/holyweek22010.txt",
        "raw_ocr_content": "Page 1 of 4\nHOLY WEEK 2010\nHymn 244 ‘There is a green hill far away’\nThursday vs 5 ‘O dearly, dearly has he loved…’\nEach night this week we have sung Mrs Alexander’s hymn, ‘There is a green\nhill far away’. It is a hymn of its time, that evolved in its own particular\ncultural setting, her husband was Church of Ireland Bishop of Derry & Raphoe\nin the latter half of the 19th Century. It is a hymn that touches upon timeless\nthemes of divine love, sacrifice, redemption and our response to all this. The\nCross, the events of the Cross, the drama of the Cross touches something deep\nwithin us. The poetry, the familiar tune all serve to keep these themes in our\nmind, enabling us to reflect, to mull over, to absorb; they help take us beyond\nthe intellect to reflect, to allow my heart, my mind, my emotions to be touched,\nto be challenged.\nO dearly, dearly has he loved ……\nDearly is one of those words that bears a range of interpretations. The word\ndearly speaks both of great cost but also of great affection, even tenderness. It\nis important that we hold all of these together as we go on to reflect on what is\ngoing on on that Green Hill far away.\nThe other night we though of the pains he had to bear. The pain that began in\nGethsemene, the agony in the garden – Let this cup pass from me yet not what\nI want but what you want – the betrayal by the kiss of a friend, the\nabandonment by the other disciples, the contempt of the religious\nestablishment, the scorn of a fickle, manipulated crowd.\nThe pain of loneliness, of rejection; and then on the cross the pain of desolation\n– My God, My God, why have you forsaken me? A pain that goes beyond\nmere physical pain, one that can be dulled by drugged wine.\nPage 2 of 4\nHOLY WEEK 2010\nHymn 244 ‘There is a green hill far away’\nThursday vs 5 ‘O dearly, dearly has he loved…’\nBoth Mark and Matthew speak of that cry of desolation. To me that has always\nexpressed a pain that goes to the very heart of the God head as the perfect\ncommunion between Father and Son is stretched to breaking point in the\ndarkness of Calvary. That cry of desolation has touched me more than any\nother of the words from the cross; it epitomises for me the cost of the cross.\nDearly, dearly has he loved …….. A measure of ‘the breadth and length and\nheight and depth of the love of Christ that surpasses knowledge’.\nDearly, as I remarked, speaks also of affection, of commitment, of tenderness –\nso as I remarked the other night there is something vulnerable in love that\nleaves itself open to disappointment. For love is, in itself, essentially relational.\nThere is the lover and the beloved. There should also be a reciprocity – the\nlover should be the beloved of the other and vice versa. Otherwise we are in\nthe realm of unrequited love.\nThere is a vulnerability in God’s love for us that refuses to be disappointed.\nFor God is love, so God takes the first step, God takes the initiative. God in\nlove makes himself utterly vulnerable. Arms stretched out in love on the cross\nready to embrace.\nDearly, dearly has he loved,\nand we must love him too.\nOn the wall of my office in the Parish Centre I have a print of a painting by\nRembrandt, ‘The Return of the Prodigal’. At the heart of the picture is a scene\nof reconciliation between father and son. The son is on his knees at his father’s\nfeet, bearing the marks of both his former dignity, in tattered shoes and clothes,\nand also of the depths to which he had sunk, his head shaved like that of a\nslave. The father is simply embracing his son and a warm light illuminates\nPage 3 of 4\nHOLY WEEK 2010\nHymn 244 ‘There is a green hill far away’\nThursday vs 5 ‘O dearly, dearly has he loved…’\nthem both. The son, having disowned the father, had come back knowing he\ndeserved no more than be treated as a hired hand and is overwhelmed to realise\nthat the father had always loved him, had always been looking for him – all he\ncan do is receive the unmerited, undeserved, all embracing love of the father.\nThere is something truly redemptive about love that has the power to change.\nDearly dearly has he loved\nand we must love him too.\nAnd trust in his redeeming blood..\nThe writer of the letter to the Ephesians reminds us:\n13 But now in Christ Jesus you who once were far off\nhave been brought near by the blood of Christ. 14 For he\nis our peace; ……. 15 He has abolished the law with its\ncommandments and ordinances, that he might create in\nhimself one new humanity in place of the two, thus\nmaking peace, 16 and might reconcile both groups to God\nin one body through the cross, Eph 2:13-16\nIn the language of Old Testament sacrifice, the blood is symptomatic of life\nand the life of Jesus is one marked by a total dedication to the Father, intimate\ncommunion with the heavenly Father who is love. The life, the death, the\nresurrection of Jesus is essentially one of love, of peace, of reconciliation – in\nshort redemption, reclaiming for God man made in the image of God.\nThat is a life, that is a love that has the power to fundamentally challenge, to\nredeem lives. These are lives changed not by fear but by an encounter with a\nradical life changing, life enhancing love as revealed in the person of Jesus\nChrist. We are reminded in the 1st Letter of John:\nPage 4 of 4\nHOLY WEEK 2010\nHymn 244 ‘There is a green hill far away’\nThursday vs 5 ‘O dearly, dearly has he loved…’\n18 There is no fear in love, but perfect love casts out fear; …….\n19 We love because he first loved us. 20 Those who say, \"I love\nGod,\" and hate their brothers or sisters, are liars; for those who\ndo not love a brother or sister whom they have seen, cannot\nlove God whom they have not seen. 1Jn 4:18-20\nI spoke earlier of love as relational, of the reciprocity of love – the lover and\nthe beloved offering mutual love each to the other. Beloved of God, we are\ncalled to respond in love. Lives changed by the love of Christ are called to\nincarnate something of the love of Christ in the world in which they are set,\namong the people they are set alongside, in the situations in which they are\nplaced. The medieval mystic Teresa of Avila reflected:\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nand so:\nDearly dearly has he loved\nand we must love him too.\nAnd trust in his redeeming blood\nand try his works to do."
    }
}