{
    "title": "What is Truth?",
    "date": "2011-04-19",
    "blurb": "This sermon, delivered during Holy Week in 2011, explores the question posed by Pilate to Jesus: 'What is truth?'. It delves into the contrasting worldviews represented by Jesus and Pilate, and the implications of these differing perspectives for the followers of Jesus. The sermon emphasizes the importance of truth in understanding the character of Jesus and the essence of Christian life.",
    "raw_text": "In the course of our reflections this Holy Week we are focussing on one aspect of the whole drama of the Passion, the trial of Jesus before Pilate as told to us by St John. This was an encounter not just between two very different individuals but two very different world views. Pilate represented the worldly power of Rome, the superpower of the Ancient World who at that stage controlled the whole of Western Europe, with the possible exception of Ireland. Pilate represented power and he would have been very aware of the power at his disposal.\n\nJesus, no doubt showing the marks of his trial and detention the previous night, was brought before him by the Temple authorities. Found guilty of blasphemy, they present him to Pilate as a trouble maker, one who sought to make himself king. As Sonia said last night, you can sense the tension in the air between Pilate and the Temple authorities. The intricacies of Jewish religious law were lost on Pilate but from previous experience this is a problem that he has to sort out before trouble erupts on the streets.\n\nThe writer of John’s Gospel presents this as a series of encounters between Jesus and Pilate interspersed with his contacts with the Jewish leaders and the crowd waiting outside his house. As Sonia observed last night, Pilate’s questions say as much about where he is coming from as the information he is trying to find out from the prisoner before him. One senses an impatience on the part of Pilate with Jesus. With the crowds outside baying for his blood, Jesus seems almost indifferent. Throughout their discourse Pilate often reminds him he is in serious trouble, asking him, ‘Don’t you realise I have power to release you and power to crucify you?’ With all this going on, Jesus talks of his vocation to bear witness to the truth. One can imagine the sneer in Pilate’s voice, ‘What is truth?’\n\nIn the wider context of John’s Gospel as a whole, truth, the source of truth is a theme that reoccurs at different points in John’s Gospel and also in the Letters of John. So in fact Pilate’s question, ‘What is truth?’ lies at the heart of our whole understanding of who this character Jesus is. If we go back to the first chapter of John’s Gospel:\n\n> ‘17 The law indeed was given through Moses; grace and truth came through Jesus Christ.’ John 1:17\n\nTruth, truth about God, truth about man lies at the very heart of who Jesus is and what he came to do. Early in his ministry, as people began to reject or follow Jesus, he declared to those who followed him.\n\n> ‘32 and you will know the truth, and the truth will make you free.' John 8:32\n\nAnd in that extended teaching in the upper room described for us by John, Jesus declares to his disciples:\n\n> ‘I am the way, and the truth, and the life. No one comes to the Father except through me.’ John 14:6\n\nThat day Pilate asks, ‘What is truth?’ and truth was standing before him. That question that Pilate asked of Jesus is a question that faces each one of us. ‘What is truth?’ What is the foundation on which I lay my life, my understanding of right and wrong, my understanding of my humanity, my mortality, my hopes and fears, my understanding of God himself?\n\nIt is said that the first casualty of war is the truth, as propaganda delivered by both sides in the conflict obscures rather than contributes to the search for truth.\n\nAs I said at the outset, Pilate and Jesus represent not just two very different personalities but two very different world views. In fact they represent two very different Kingdoms, the Kingdom of God and the Kingdom of this world. As followers of Jesus, like our Lord, we are called to embody the values of the Kingdom of God on Pilate’s home territory, the Kingdom of this world. Jesus, in praying for the disciples on the night before he died, reminded them of this fundamental truth:\n\n> 14 I have given them your word, and the world has hated them because they do not belong to the world, just as I do not belong to the world. 15 I am not asking you to take them out of the world, but I ask you to protect them from the evil one. 16 They do not belong to the world, just as I do not belong to the world. 17 Sanctify them in the truth; your word is truth. 18 As you have sent me into the world, so I have sent them into the world. John 17:14-18\n\nChristian life is lived out at that intersection between the Kingdom of God and the world (or as the Americans put it ‘Where the rubber hits the road’). It is at that sometimes painful intersection we have to answer the question of Pilate, ‘What is truth?’ The values of the world are always seeking to impinge on our lives. That is the underlying theme of the Temptations of Jesus in the wilderness, as Satan showed Jesus all the kingdoms of the world in all their splendour and said, ‘Bow down and worship me and all this will be yours.’\n\nThe world, and the values of the world, will seek to impinge on the life of the Church itself, blunting our witness to the truth. An example of this is to be found in the very origins of Methodism itself. Large sections of the Church of England of John Wesley’s day had allowed itself to become absorbed with secular concerns, the comfort of Establishment. Methodism arose in direct response to this. Many parts of the Church in the Southern United States became comfortable with the racialism of the society in which it was set and so we saw ‘white only’ churches and of course we also saw the South African Dutch Reformed Church’s previous endorsement of the whole system of Apartheid from which they have since formally repented.\n\nEvery Church community, every individual Christian, standing as they do at that interface between the Kingdom of God and the Kingdom of the World, in the way we order our lives, in the way we set our priorities, in daily life, in public life, in Church life faces that question that Pilate posed to Jesus, ‘What is truth?’ Is it to be the truth as expressed in the life and teaching, the death and resurrection of Jesus Christ or the truth that the world of Pilate purports to proclaim where power and privilege prevail?",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2011/holyweek2011tues.txt",
        "raw_ocr_content": "Page 1 of 4\nHoly Week – 2011 – Pilate’s Questions\nTuesday – ‘What is truth?’\nIn the course of our reflections this Holy Week we are focussing on one aspect\nof the whole drama of the Passion, the trial of Jesus before Pilate as told to us\nby St John. This was an encounter not just between two very different\nindividuals but two very different world views. Pilate represented the worldly\npower of Rome, the superpower of the Ancient World who at that stage\ncontrolled the whole of Western Europe, with the possible exception of Ireland.\nPilate represented power and he would have been very aware of the power at\nhis disposal. Jesus, no doubt showing the marks of his trial and detention the\nprevious night, was brought before him by the Temple authorities. Found\nguilty of blasphemy, they present him to Pilate as a trouble maker, one who\nsought to make himself king. As Sonia said last night, you can sense the\ntension in the air between Pilate and the Temple authorities. The intricacies of\nJewish religious law were lost on Pilate but from previous experience this is a\nproblem that he has to sort out before trouble erupts on the streets.\nThe writer of John’s Gospel presents this as a series of encounters between\nJesus and Pilate interspersed with his contacts with the Jewish leaders and the\ncrowd waiting outside his house. As Sonia observed last night, Pilate’s\nquestions say as much about where he is coming from as the information he is\ntrying to find out from the prisoner before him. One senses an impatience on\nthe part of Pilate with Jesus. With the crowds outside baying for his blood,\nJesus seems almost indifferent. Throughout their discourse Pilate often\nreminds him he is in serious trouble, asking him, ‘Don’t you realise I have\npower to release you and power to crucify you?’ With all this going on, Jesus\nPage 2 of 4\nHoly Week – 2011 – Pilate’s Questions\nTuesday – ‘What is truth?’\ntalks of his vocation to bear witness to the truth. One can imagine the sneer in\nPilate’s voice, ‘What is truth?’\nIn the wider context of John’s Gospel as a whole, truth, the source of truth is a\ntheme that reoccurs at different points in John’s Gospel and also in the Letters\nof John. So in fact Pilate’s question, ‘What is truth?’ lies at the heart of our\nwhole understanding of who this character Jesus is. If we go back to the first\nchapter of John’s Gospel:\n‘17 The law indeed was given through Moses; grace and truth came\nthrough Jesus Christ.’ John 1:17\nTruth, truth about God, truth about man lies at the very heart of who Jesus is\nand what he came to do. Early in his ministry, as people began to reject or\nfollow Jesus, he declared to those who followed him.\n‘32 and you will know the truth, and the truth will make you free.\"\nJohn 8:32\nAnd in that extended teaching in the upper room described for us by John,\nJesus declares to his disciples:\n‘I am the way, and the truth, and the life. No one comes to the\nFather except through me.’ John 14:6\nThat day Pilate asks, ‘What is truth?’ and truth was standing before him.\nThat question that Pilate asked of Jesus is a question that faces each one of us.\n‘What is truth?’ What is the foundation on which I lay my life, my\nunderstanding of right and wrong, my understanding of my humanity, my\nmortality, my hopes and fears, my understanding of God himself?\nPage 3 of 4\nHoly Week – 2011 – Pilate’s Questions\nTuesday – ‘What is truth?’\nIt is said that the first casualty of war is the truth, as propaganda delivered by\nboth sides in the conflict obscures rather than contributes to the search for\ntruth.\nAs I said at the outset, Pilate and Jesus represent not just two very different\npersonalities but two very different world views. In fact they represent two\nvery different Kingdoms, the Kingdom of God and the Kingdom of this world.\nAs followers of Jesus, like our Lord, we are called to embody the values of the\nKingdom of God on Pilate’s home territory, the Kingdom of this world. Jesus,\nin praying for the disciples on the night before he died, reminded them of this\nfundamental truth:\n14 I have given them your word, and the world has hated them because\nthey do not belong to the world, just as I do not belong to the world. 15\nI am not asking you to take them out of the world, but I ask you to\nprotect them from the evil one. 16 They do not belong to the world, just\nas I do not belong to the world. 17 Sanctify them in the truth; your\nword is truth. 18 As you have sent me into the world, so I have sent\nthem into the world. John 17:14-18\nChristian life is lived out at that intersection between the Kingdom of God and\nthe world (or as the Americans put it ‘Where the rubber hits the road’). It is at\nthat sometimes painful intersection we have to answer the question of Pilate,\n‘What is truth?’ The values of the world are always seeking to impinge on our\nlives. That is the underlying theme of the Temptations of Jesus in the\nwilderness, as Satan showed Jesus all the kingdoms of the world in all their\nsplendour and said, ‘Bow down and worship me and all this will be yours.’\nPage 4 of 4\nHoly Week – 2011 – Pilate’s Questions\nTuesday – ‘What is truth?’\nThe world, and the values of the world, will seek to impinge on the life of the\nChurch itself, blunting our witness to the truth. An example of this is to be\nfound in the very origins of Methodism itself. Large sections of the Church of\nEngland of John Wesley’s day had allowed itself to become absorbed with\nsecular concerns, the comfort of Establishment. Methodism arose in direct\nresponse to this. Many parts of the Church in the Southern United States\nbecame comfortable with the racialism of the society in which it was set and so\nwe saw ‘white only’ churches and of course we also saw the South African\nDutch Reformed Church’s previous endorsement of the whole system of\nApartheid from which they have since formally repented.\nEvery Church community, every individual Christian, standing as they do at\nthat interface between the Kingdom of God and the Kingdom of the World, in\nthe way we order our lives, in the way we set our priorities, in daily life, in\npublic life, in Church life faces that question that Pilate posed to Jesus, ‘What\nis truth?’ Is it to be the truth as expressed in the life and teaching, the death\nand resurrection of Jesus Christ or the truth that the world of Pilate purports to\nproclaim where power and privilege prevail?"
    }
}