{
    "title": "Love and Marriage",
    "date": "2016-12-11",
    "blurb": "The sermon for the wedding of John Robinson and Kim Sargent in December 2016 emphasizes the depth of commitment and love in marriage, drawing parallels between the love shared by a couple and the love Christ has for his Church. It reflects on the teachings of St. Paul on love's enduring qualities and the role of Christian love in overcoming challenges within marriage. The core message is that marital love should mirror the self-giving love of Christ, fostering unity, forgiveness, and joy.",
    "raw_text": "We gather this afternoon to celebrate the marriage of Karl and Nicola. As we do so we join with them as they celebrate and rejoice in what they have already shared together, in the love and the companionship, the encouragement and the strength they have found in each other.\n\nThis day is for them a day of affirmation, of even deeper commitment to each other in love. The opening declaration of the marriage service talks of love in all its dimensions. In the course of this it draws an analogy, based on the teaching of St Paul, comparing the closeness the couple are to have with each other to the closeness that Christ has with his Church. As I often remark that is an almost scary closeness, something that we can at best aspire to. But it is worth reflecting on what is the basis of that closeness that Christ has with his Church - it is nothing less than his sacrificial, self-giving love of himself. The love we have for each other should mirror something of that self-giving love that Christ has for his Church, that we should love one another just as Christ has loved us. That we should show in our love for one another something of that self-giving, self-forgetting love of Christ, as we serve one another, as we defer to one another.\n\n> St Paul, in writing to the Church at Corinth teases out the meaning of Christian, Christ-like love and how that impacts on human relationships:\n> \"Love is patient, love is kind. It does not envy, it does not boast, it is not proud. It is not rude, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Love does not delight in evil but rejoices in the truth. It always protects, always trusts, always hopes, always perseveres.\" (1 Cor 13:4-7)\n\nA strong marriage is one that learns to deal with difficulty and disappointment, learns to deal with failure. That does not mean that disappointment and failure do not matter - they do. They are dealt with in the context of Christian love, in which both bring something of that self-giving, self-forgetting love that Christ has shown for us.\n\nThere is a description of marriage that I came across as I prepared for my own marriage that has always appealed to me. I find myself returning to it over and over again:\n\nMarriage is a relationship within which a couple affirm each other's identity, by which they heal and sustain each other and through which they make Christ present to each other.\n\nThere is a lovely prayer that forms part of the prayers we will use in a few minutes as we ask God's blessing on Karl and Nicola as they embark on their married life together.\n\n> May their life together witness to your love in this troubled world;\n> may unity overcome division,\n> forgiveness heal injury,\n> and joy triumph over sorrow.\n\nKarl, Nicola, we wish you well on this your wedding day. May you be granted many happy years together.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Wedding/John Robinson and Kim Sargent Dec 2016.txt",
        "raw_ocr_content": "Page 1\nMarriage of Nicola Ennis and Karl Smyth 11th September 2019 – St Mary’s, Howth\nWe gather this afternoon to celebrate the marriage of Karl and Nicola. As we\ndo so we join with them as they celebrate and rejoice in what they have already\nshared together, in the love and the companionship, the encouragement and the\nstrength they have found in each other.\nThis day is a for them a day of affirmation, of even deeper commitment to each\nother in love.\nThe opening declaration of the marriage service talks of love in all its\ndimensions. In the course of this it draws an analogy, based on the teaching of\nSt Paul, comparing the closeness the couple are to have with each other to the\ncloseness that Christ has with his Church. As I often remark that is an almost\nscary closeness, something that we can at best aspire to. But it is worth\nreflecting on what is the basis of that closeness that Christ has with his Church\n- it is nothing less than his sacrificial, self-giving love of himself. The love we\nhave for each other should mirror something of that self giving love that Christ\nhas for his Church, that we should love one another just as Christ has loved us.\nThat we should show in our love for one another something of that self giving,\nself forgetting love of Christ, as we serve one another, as we defer to one\nanother.\nSt Paul, in writing to the Church at Corinth teases out the meaning of Christian,\nChrist like love and how that impacts on human relationships:\nLove is patient, love is kind. It does not envy, it does not boast, it is not proud.\nIt is not rude, it is not self seeking, it is not easily angered, it keeps no record of\nwrongs. Love does not delight in evil but rejoices in the truth. It always\nprotects, always trusts, always hopes, always perseveres.\" (1 Cor 13:4-7)\nPage 2\nMarriage of Nicola Ennis and Karl Smyth 11th September 2019 – St Mary’s, Howth\nA strong marriage is one that learns to deal with difficulty and disappointment,\nlearns to deal with failure. That does not mean that disappointment and failure\ndo not matter - they do. They are dealt with in the context of Christian love, in\nwhich both bring something of that self giving, self forgetting love that Christ\nhas shown for us.\nThere is a description of marriage that I came across as I prepared for my own\nmarriage that has always appealed to me. I find myself returning to it over and\nover again:\nMarriage is a relationship within which a couple affirm each other's identity, by\nwhich they heal and sustain each other and through which they make Christ\npresent to each other.\nThere is a lovely prayer that forms part of the prayers we will use in a few\nminutes as we ask God's blessing on Karl and Nicola as they embark on their\nmarried life together.\nMay their life together witness to your love in this troubled world;\nmay unity over come division,\nforgiveness heal injury,\nand joy triumph over sorrow.\nKarl, Nicola, we wish you well on this your wedding day. May you be granted\nmany happy years together."
    }
}