{
    "title": "Joy Smith's Funeral",
    "date": "2021-06-07",
    "blurb": "This sermon is a tribute to Mrs. Joy Smith who passed away on 7th June 2021. The sermon reflects on her life, her devotion to her family and community, and her strong faith. The sermon also highlights her enduring spirit and her ability to find joy in caring for others.",
    "raw_text": "Funeral of Mrs Joy Smith – 7th June 2021\n\nJoy Smith – where do we begin? Over these few days since Joy died in Clontarf Hospital in the early hours of last Friday morning, Des, Denis, Alison, Trevor and the wider family have been remembering Joy, remembering a devoted wife, mother and grandmother. We as a Parish remember a longstanding a faithful member of this Parish. Her worship of Almighty God here each Sunday was an essential element of her weekly routine. In the full of their health, Des and Joy would have been here every Sunday A faith that worked itself out in so many ways in individual acts of care to wider family and community.\n\nJoy had faced sadness at different stages in her life. She lost her father when she was only a young child and remembers her mother looking after her family, running a large farm and a generous concern for those in the locality of all traditions who had hit problems. She was also widowed just as her family were getting ready to make their way in the world. She found love a second time with Des, who had also been widowed himself. Her son Denis is going to share with us the family’s memories of Joy and the various influences on her life. Everyone here will come this morning with your own particular memory of Joy.\n\nIf you asked me of one memory I might take away of Joy it would be a deep rooted care for people that underscored every aspect of her life. Many are those who would have benefitted from her gentle listening ear. Even in these recent times of poor health, she would be asking how other people are. As one of the family said to me over the last few days – you can take a nurse out of the Adelaide but you can’t take the Adelaide out of the nurse. Joy not only cared for people – she enjoyed people. The two don’t always go together. So we enjoyed that infectious laugh and smile that swept over her whole face. And she enjoyed meeting up with people, sharing meals, just sharing company.\n\nI’m sure those of you watching this service online will have your own fond memories of Joy. I invite you all, both family and friends here in Church and those of you watching online to bring your own particular memories of Joy before God and thank God for all that she has meant, and will continue to mean to you.\n\nAt Joy’s side over these last 24 years has been her husband Des. They had a shared commitment to the Hospice in Raheny, acting as volunteer drivers for a number of years. In recent times they have supported each other at different times and Des has been a constant support. Aided by members of the family and a team of committed carers they have been enabled to remain together in their own home.\n\nAs we gather to give thanks for Joy so we pray for those who will miss her most. We think of Des, of Denis, Alison and Trevor (who sadly is not able to be with us) and the wider family. However much we may anticipate the death of a loved one there is still that sense of loss and, however strong our faith, a very proper sadness for one who has been so much part of our lives is gone, leaving a gap that no-one else can fill in quite the same way.\n\nWe come to set our loss, the mystery of life and death in the context of our faith. Though enjoying life to the full, Joy was quite at ease with the thought of her mortality – she left detailed instructions for her funeral – including how prominently collection plates for Irish Heart Foundation were to be placed! She indicated that she would like the reading to be from St Matthew’s account of the Sermon on the Mount, the giving of the Beatitudes.\n\n“Blessed are the poor in spirit, for theirs is the kingdom of heaven.\n\n“Blessed are the meek, for they will inherit the earth.\n\n“Blessed are those who hunger and thirst for righteousness,\n\n“Blessed are the merciful, for they will receive mercy.\n\n“Blessed are the pure in heart, for they will see God.\n\n“Blessed are the peacemakers,\n\nIn this passage, I sense Jesus telling his hearers, telling us down through the ages that peace, a deep inner peace, is not to be found in focussing on myself but by looking out beyond myself. We find peace in a self-forgetfulness that we see in the life, death and resurrection of Jesus.\n\nOn an occasion such as this, I often find myself searching for a verse of scripture that draws my thoughts together. I find myself turning to the First Letter to Timothy. The Apostle gives his advice to the younger man:\n\nBut as for you, man of God, pursue righteousness, godliness, faith, love, endurance, gentleness. 12 Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Tim 6:11 ff\n\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This seems to me to draw together so many of the memories of Joy Smith that I came to know, that I know so many of you remember today with love and affection. She has fought the good fight and is now at peace. And so this morning we commend her to the loving care of her heavenly Father.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Joy Smith.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mrs Joy Smith – 7th June 2021\nJoy Smith – where do we begin?\nOver these few days since Joy died in Clontarf Hospital in the early hours of\nlast Friday morning, Des, Denis, Alison, Trevor and the wider family have\nbeen remembering Joy, remembering a devoted wife, mother and grandmother.\nWe as a Parish remember a longstanding a faithful member of this Parish. Her\nworship of Almighty God here each Sunday was an essential element of her\nweekly routine. In the full of their health, Des and Joy would have been here\nevery Sunday A faith that worked itself out in so many ways in individual acts\nof care to wider family and community.\nJoy had faced sadness at different stages in her life. She lost her father when\nshe was only a young child and remembers her mother looking after her family,\nrunning a large farm and a generous concern for those in the locality of all\ntraditions who had hit problems. She was also widowed just as her family\nwere getting ready to make their way in the world. She found love a second\ntime with Des, who had also been widowed himself. Her son Denis is going to\nshare with us the family’s memories of Joy and the various influences on her\nlife. Everyone here will come this morning with your own particular memory\nof Joy.\nIf you asked me of one memory I might take away of Joy it would be a deep\nrooted care for people that underscored every aspect of her life. Many are those\nwho would have benefitted from her gentle listening ear. Even in these recent\ntimes of poor health, she would be asking how other people are. As one of the\nfamily said to me over the last few days – you can take a nurse out of the\nAdelaide but you can’t take the Adelaide out of the nurse. Joy not only cared\nfor people – she enjoyed people. The two don’t always go together. So we\nPage 2 of 3\nFuneral of Mrs Joy Smith – 7th June 2021\nenjoyed that infectious laugh and smile that swept over her whole face. And\nshe enjoyed meeting up with people, sharing meals, just sharing company.\nI’m sure those of you watching this service online will have your own fond\nmemories of Joy. I invite you all, both family and friends here in Church and\nthose of you watching online to bring your own particular memories of Joy\nbefore God and thank God for all that she has meant, and will continue to mean\nto you.\nAt Joy’s side over these last 24 years has been her husband Des. They had a\nshared commitment to the Hospice in Raheny, acting as volunteer drivers for a\nnumber of years. In recent times they have supported each other at different\ntimes and Des has been a constant support. Aided by members of the family\nand a team of committed carers they have been enabled to remain together in\ntheir own home.\nAs we gather to give thanks for Joy so we pray for those who will miss her\nmost. We think of Des, of Denis, Alison and Trevor (who sadly is not able to\nbe with us) and the wider family. However much we may anticipate the death\nof a loved one there is still that sense of loss and, however strong our faith, a\nvery proper sadness for one who has been so much part of our lives is gone,\nleaving a gap that no-one else can fill in quite the same way.\nWe come to set our loss, the mystery of life and death in the context of our\nfaith. Though enjoying life to the full, Joy was quite at ease with the thought\nof her mortality – she left detailed instructions for her funeral – including how\nprominently collection plates for Irish Heart Foundation were to be placed!\nShe indicated that she would like the reading to be from St Matthew’s account\nof the Sermon on the Mount, the giving of the Beatitudes.\nPage 3 of 3\nFuneral of Mrs Joy Smith – 7th June 2021\n“Blessed are the poor in spirit, for theirs is the kingdom of heaven.\n…….\n“Blessed are the meek, for they will inherit the earth.\n“Blessed are those who hunger and thirst for righteousness,\n“Blessed are the merciful, for they will receive mercy.\n“Blessed are the pure in heart, for they will see God.\n“Blessed are the peacemakers,\nIn this passage, I sense Jesus telling his hearers, telling us down through the\nages that peace, a deep inner peace, is not to be found in focussing on myself\nbut by looking out beyond myself. We find peace in a self-forgetfulness that\nwe see in the life, death and resurrection of Jesus.\nOn an occasion such as this, I often find myself searching for a verse of\nscripture that draws my thoughts together. I find myself turning to the First\nLetter to Timothy. The Apostle gives his advice to the younger man:\nBut as for you, man of God, pursue righteousness, godliness, faith, love,\nendurance, gentleness. 12 Fight the good fight of the faith; take hold of\nthe eternal life, to which you were called and for which you made the\ngood confession in the presence of many witnesses. 1 Tim 6:11 ff\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This\nseems to me to draw together so many of the memories of Joy Smith that I\ncame to know, that I know so many of you remember today with love and\naffection. She has fought the good fight and is now at peace. And so this\nmorning we commend her to the loving care of her heavenly Father."
    }
}