{
    "title": "Kingdom in Matthew",
    "date": "2011-04-17",
    "blurb": "This sermon explores the use of the word 'Kingdom' in the book of Matthew. It highlights various verses where the term is used, offering a comprehensive understanding of its meaning and significance. The sermon also touches on barriers to the kingdom and who the inheritors of the kingdom are.",
    "raw_text": "This sermon focuses on the use of the word 'Kingdom' in Matthew. It begins with Matthew 3:1 where John the Baptist proclaims, 'Repent, for the kingdom of heaven has come near.' It continues with references from Matthew 4:17, Luke 6:20, and Matthew 4:23, where Jesus proclaims the good news of the kingdom and cures every disease and sickness among the people.\n\nThe sermon also highlights the Beatitudes in Matthew 5, where the kingdom of heaven is promised to the poor in spirit and those who are persecuted for righteousness' sake. The Lord's Prayer in Matthew 6:10 is also referenced, with a focus on the line, 'Your kingdom come. Your will be done, on earth as it is in heaven.'\n\nThe sermon then moves on to discuss the concept of a kingdom divided against itself in Matthew 12:25, and the various comparisons made to the kingdom of heaven in Matthew 13. It also discusses the barriers to the kingdom as mentioned in Matthew 6:31 and Matthew 19:23, and the inheritors of the kingdom as described in Matthew 18:1 and Matthew 25:34.\n\nFinally, the sermon concludes with references to the Annunciation in Luke 1:31 and the presence of the kingdom in Luke 17:20, where Jesus states, 'The kingdom of God is not coming with things that can be observed; nor will they say, 'Look, here it is!' or 'There it is!' For, in fact, the kingdom of God is among you.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2011/Kingdom - notes.txt",
        "raw_ocr_content": "USE OF THE WORD ‘KINGDOM’ IN MATTHEW\nMatt 3:1\nIn those days John the Baptist appeared in the wilderness of Judea, proclaiming, 2 \"Repent, for\nthe kingdom of heaven has come near.\"\nMatt 4:17\nFrom that time on Jesus began to proclaim, ‘Repent, for the Kingdom of heaven has come near.’\nLuke 6:20\n\"Blessed are you who are poor,\nfor yours is the kingdom of God.\nMatt 4:23\nJesus went throughout Galilee, teaching in their synagogues and proclaiming the good news of\nthe kingdom and curing every disease and every sickness among the people.\nBEATITUDES - Matt 5\nMt 5:3 \"Blessed are the poor in spirit, for theirs is the kingdom of heaven.\nMt 5:10 \"Blessed are those who are persecuted for righteousness' sake, for theirs is the kingdom of\nheaven\nLuke 6:20\n\"Blessed are you who are poor,\nfor yours is the kingdom of God.\nLORD’S PRAYER – Matt 6:10\nMt 6:10 Your kingdom come.\nYour will be done,\non earth as it is in heaven.\nSENDING OUT OF THE TWELVE - Matt 10:7\n7 As you go, proclaim the good news, 'The kingdom of heaven has come near.'\nKINGDOM DIVIDED AGAINST ITSELF – Matt 12:25\n\"Every kingdom divided against itself is laid waste, and no city or house divided against itself\nwill stand. 26 If Satan casts out Satan, he is divided against himself; how then will his kingdom\nstand? 27 If I cast out demons by Beelzebul, by whom do your own exorcists cast them out?\nTherefore they will be your judges. 28 But if it is by the Spirit of God that I cast out demons, then\nthe kingdom of God has come to you.\nTHE KINGDOM MAY BE COMPARED TO …\nMatt 13:24\n\"The kingdom of heaven may be compared to someone who sowed good seed in his field; 25\nMatt 13:31\n\"The kingdom of heaven is like a mustard seed that someone took and sowed in his field; 32\nMatt 13:33\n\"The kingdom of heaven is like yeast that a woman took and mixed in with three measures of\nflour until all of it was leavened.\"\nMatt 13:44\n\"The kingdom of heaven is like treasure hidden in a field, which someone found and hid; then in\nhis joy he goes and sells all that he has and buys that field.\nMatt 13:45\nMt 13:45 \"Again, the kingdom of heaven is like a merchant in search of fine pearls;\nMatt 13:47\nMt 13:47 \"Again, the kingdom of heaven is like a net that was thrown into the sea and caught fish of\nevery kind; 48 when it was full, they drew it ashore, sat down, and put the good into baskets but\nthrew out the bad.\nMatt 20:1\n\"For the kingdom of heaven is like a landowner who went out early in the morning to hire\nlaborers for his vineyard.\nBARRIERS TO THE KINGDOM\nMatt 6:31\nTherefore do not worry, saying, 'What will we eat?' or 'What will we drink?' or 'What will we\nwear?' 32 For it is the Gentiles who strive for all these things; and indeed your heavenly Father\nknows that you need all these things. 33 But strive first for the kingdom of God and his\nrighteousness, and all these things will be given to you as well.\nMatt 19:23\n\"Truly I tell you, it will be hard for a rich person to enter the kingdom of heaven. 24 Again I tell\nyou, it is easier for a camel to go through the eye of a needle than for someone who is rich to\nenter the kingdom of God.\"\nMatt 21:31\n\"Truly I tell you, the tax collectors and the prostitutes are going into the kingdom of God ahead\nof you. 32 For John came to you in the way of righteousness and you did not believe him, but the\ntax collectors and the prostitutes believed him; and even after you saw it, you did not change\nyour minds and believe him.\nLuke 9:57\nAs they were going along the road, someone said to him, \"I will follow you wherever you go.\" 58\nAnd Jesus said to him, \"Foxes have holes, and birds of the air have nests; but the Son of Man has\nnowhere to lay his head.\" 59 To another he said, \"Follow me.\" But he said, \"Lord, first let me go\nand bury my father.\" 60 But Jesus said to him, \"Let the dead bury their own dead; but as for you,\ngo and proclaim the kingdom of God.\" 61 Another said, \"I will follow you, Lord; but let me first\nsay farewell to those at my home.\" 62 Jesus said to him, \"No one who puts a hand to the plow\nand looks back is fit for the kingdom of God.\"\nINHERITORS OF THE KINGDOM\nMatt 18:1\nAt that time the disciples came to Jesus and asked, \"Who is the greatest in the kingdom of\nheaven?\" 2 He called a child, whom he put among them, 3 and said, \"Truly I tell you, unless you\nchange and become like children, you will never enter the kingdom of heaven.\nMatt 25:34\n34 Then the king will say to those at his right hand, 'Come, you that are blessed by my Father,\ninherit the kingdom prepared for you from the foundation of the world; 35 for I was hungry and\nyou gave me food, I was thirsty and you gave me something to drink, I was a stranger and you\nwelcomed me, 36 I was naked and you gave me clothing, I was sick and you took care of me, I\nwas in prison and you visited me.' 37\nMAGNIFICAT – ANNUNCIATION – Luke 1:31\n31 And now, you will conceive in your womb and bear a son, and you will name him Jesus. 32 He\nwill be great, and will be called the Son of the Most High, and the Lord God will give to him the\nthrone of his ancestor David. 33 He will reign over the house of Jacob forever, and of his\nkingdom there will be no end.\"\nPRESENCE OF THE KINGDOM - Luke 17:20\nOnce Jesus was asked by the Pharisees when the kingdom of God was coming, and he answered,\n\"The kingdom of God is not coming with things that can be observed; 21 nor will they say,\n'Look, here it is!' or 'There it is!' For, in fact, the kingdom of God is among you.\"\n"
    }
}