{
    "title": "Love at Full Stretch",
    "date": "2021-03-14",
    "blurb": "This sermon focuses on the concept of 'love at full stretch', drawing parallels between the love of a parent and the love of God. It emphasizes the importance of forgiveness, just as the Lord has forgiven us, and the graciousness of love. The sermon also reflects on the unconditional love experienced at home, which serves as our first encounter with such love.",
    "raw_text": "Lent 4 – Year B – 2021 – Family Service\n(Involves use of www.mentimeter.com)\n\nBefore this service began, I asked you to log in to the mentimeter platform and enter up to three words that come to mind as we think of the love of mother/mother figures in our lives. We will now see what has come up. The size of the print will indicate how many have chosen that particular word. We’ve got quite a range here. What we see in all these words is love in which nothing is held back; a love that shows itself in so many acts of service, so often taken for granted.\n\nQuite apart from the cooking, cleaning, tidying up – there is the listening ear, the advice, the encouragement, the patience, the understanding – what is coming out here is the spirit in which that is given. As I look at all these words, a word that comes to my mind is graciousness.\n\nI remember one night when our eldest lad was around 4 or 5, we were putting him to bed. He asked us, ‘Mummy, Daddy, do you love me this much?’ and the hands were held slightly apart. We assured him we did. Then the question was repeated with the hands had further and further apart until the hands were at full stretch. I’m left with a picture of love at full stretch.\n\nAs we look at this group of words on the screen, let’s put ‘love at full stretch’ alongside that word ‘graciousness’.\n\nLet’s now take a look at our reading. I want to focus on 13Bear with one another and, if anyone has a complaint against another, forgive each other; just as the Lord has forgiven you, so you also must forgive. Forgive as the Lord has forgiven you. That was a love in which nothing was held back; that was love at full stretch, culminating in arms stretched out on a cross.\n\nYou know when you are writing a letter or an essay, you often find yourself looking for the right word to use. Paul is doing that in his writing. There are several words in Greek (Paul was writing in Greek) that we translate as forgive. Some are very legal, talking of penalties laid aside. The word Paul is using in this part of his letter is different, it has the element of graciousness.\n\nThis is the love that we are called to share in the world in which we live, generously, graciously. Looking back on life, the home is probably the first place we experienced unconditional love. We were loved, we are loved simply because we are who we are. We don’t always deserve it; we are sometimes ungrateful; we sometimes hurt the one who loves us – but we continue to be loved. And we love in return, sometimes it’s an awkward, teenage, self-conscious love. But it is love.\n\nThe Bible often uses the illustration of the love of parent, of mother, of father to give us an insight into the love of God for us. So many of the words that are coming up on our screen also speak of the gracious, self-giving, self-emptying love of God for us in Christ.\n\nSo today we give thanks to God for the love we received in our homes, love that we learned to share. We give thanks for that love that we have known in Christ, that we seek to share in thought and word and deed in the world of today.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent42021 family service.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 4 – Year B – 2021 – Family Service\n(Involves us of www.mentimeter.com)\nBefore this service began, I asked you to log in to the mentimeter platform and\nenter up to three words that come to mind as we think of the love of\nmother/mother figures in our lives.\nWe will now see what has come up\nSwitch to www.mentimeter.com slide\nThe size of the print will indicate how many have chosen that particular word.\nWe’ve got quite a range here. What we see in all these words is love in which\nnothing is held back; a love that shows itself in so many acts of service, so\noften taken for granted.\nQuite apart from the cooking, cleaning, tidying up – there is the listening ear,\nthe advice, the encouragement, the patience, the understanding – what is\ncoming out here is the spirit in which that is given. As I look at all these\nwords, a word that comes to my mind is graciousness.\nI remember one night when our eldest lad was around 4 or 5, we were putting\nhim to bed. He asked us, ‘Mummy, Daddy, do you love me this much?’ and\nthe hands were held slightly apart. We assured him we did. Then the question\nwas repeated with the hands had further and further apart until the hands were\nat full stretch. I’m left with a picture of love at full stretch.\nAs we look at this group of words on the screen, let’s put ‘love at full stretch’\nalongside that word ‘graciousness’\nPage 2 of 3\nLent 4 – Year B – 2021 – Family Service\n(Involves us of www.mentimeter.com)\nLet’s now take a look at our reading. I want to focus on\n13Bear with one another and, if anyone has a complaint against another,\nforgive each other; just as the Lord has forgiven you, so you also must\nforgive.\nForgive as the Lord has forgiven you. That was a love in which nothing was\nheld back; that was love at full stretch, culminating in arms stretched out on a\ncross.\nYou know when you are writing a letter or an essay, you often find yourself\nlooking for the right word to use. Paul is doing that in his writing. There are\nseveral words in Greek (Paul was writing in Greek) that we translate as forgive.\nSome are very legal, talking of penalties laid aside. The word Paul is using in\nthis part of his letter is different, it has the element of graciousness.\nThis is the love that we are called to share in the world in which we live,\ngenerously, graciously. Looking back on life, the home is probably the first\nplace we experienced unconditional love. We were loved, we are loved simply\nbecause we are who we are. We don’t always deserve it; we are sometimes\nungrateful; we sometimes hurt the one who loves us – but we continue to be\nloved. And we love in return, sometimes it’s an awkward, teenage, self-\nconscious love. But it is love.\nThe Bible often uses the illustration of the love of parent, of mother, of father\nto give us an insight into the love of God for us. So many of the words that are\nPage 3 of 3\nLent 4 – Year B – 2021 – Family Service\n(Involves us of www.mentimeter.com)\ncoming up on our screen also speak of the gracious, self-giving, self-emptying\nlove of God for us in Christ.\nSo today we give thanks to God for the love we received in our homes, love\nthat we learned to share. We give thanks for that love that we have known in\nChrist, that we seek to share in thought and word and deed in the world of\ntoday."
    }
}