{
    "title": "The Power of God's Foolishness",
    "date": "2015-03-08",
    "blurb": "In this sermon, Kevin explores the concept of human power versus divine power, using historical and contemporary examples. He discusses the fall of the Roman Empire, the Cold War, and the financial crisis, contrasting these with the enduring power of God's 'foolishness' and 'weakness'. He emphasizes the need for each generation to make faith their own, and challenges listeners to choose their guiding light between God's 'foolishness' and man's.",
    "raw_text": "Shortly after the end of the 2nd World War, the world divided into two armed camps. As Churchill remarked, an Iron Curtain came down across Europe. International relationships were set in the context of the “Cold War”, only tempered by the realisation that either side has the power to obliterate the other. Periodically crises arose that threatened this perilous stability – I have memories of the tensions that surrounded the Cuban Missile Crisis. I also recall huge army convoys driving past our house in Birmingham at the time of the Suez Crisis. In more recent days, as we have watched the Civil War in the Ukraine , we have seen a return of the East West tensions that has characterised European politics since the time of Churchill.\n\nIn the context of Eastern Europe in the Cold War Era, the communist regimes held total control over the lives of their citizens. That power sought to control and suppress the Church. Our family was in Taize the summer after the fall of the Berlin Wall. For the first time Christians from many parts of Eastern Europe were allowed to travel freely. They spoke of the amazing changes they had witnessed as power collapsed. One of the Taize community spoke of a visit to priest in a village in what is now the Czech Republic. The priest told of how for years he had ministered to a faithful few – only a handful in Church each Sunday. Secret police had harassed his Church members, other villagers has viewed them with a mixture of amusement and hostility. Now, he mused, the power that sought to suppressed had collapsed almost overnight. The Church had not only survived but was now beginning to grow.\n\nOne example among many of the transitory nature of human power, of the arrogance of human power. Of course we are living in the midst of a collapse of human power. The proceedings of the Dail committee that is looking at the conduct of financial institutions around the time of the fall of the Celtic Tiger have reminded us of financial institutions, executives with power on a level with national governments, who felt themselves invulnerable, awarding themselves benefits beyond the dreams of many, who then saw their power, their world collapse. Society as a whole (and that means us) was mesmerised by their power and the collapse has impacted upon us all. This was a traumatic period for our society as we were left with a deep sense of insecurity. Many, who are still feeling the trauma of that period in loss of homes, relatives forced to emigrate. are rightly suspicious of any sings that we as a society will go down that route again.\n\nPaul, from whom we read as our Epistle was writing in a period close to the peak of the power of the Roman Empire. Of course Rome was the super-power of its day, having seen off all its rivals. Paul, in the portion we read from today from the 1st Letter to the Church at Corinth, draws a contrast between human power, undoubtedly exemplified by the might of Rome and the powerlessness of the infant Church, the seemingly pointless death of Jesus. At the same time he draws a contrast between the sophistication of Graeco-Roman culture and the ancient philosophers and the seemingly naïve teaching of the Church.\n\nOur passage concludes: ‘For God’s foolishness is wiser than human wisdom, and God’s weakness is stronger than human strength..’ (1 Cor 1:25) The words he chose in the original Greek text bring out this contrast even more sharply that our English translation.\n\nGod’s foolishness – the word Paul has used is ‘moron’ from which we of course derive the word ‘moron’. Moronic has connotations not just of foolishness, but also stupidity. God’s stupidity, the risk of creation, of incarnation; the risk of self giving, self denying, self emptying love is shown to far outweigh the seeming sophistication of much of contemporary wisdom.\n\nGod’s weakness – the word Paul uses here is ‘asthenes’ has connotations not just of weakness but also feebleness, verging on the pathetic. In the Gospel accounts of the Passion, Pilate presents the beaten, bleeding Jesus in purple robe and crown of thorns to the crowd, almost goading them ‘Shall I crucify your King?’ There is something darkly comical as the power of Rome makes a cynical point. But of course the influence of that crucified itinerant Galilean preacher has far outlasted the Pilate’s and Caesars of this world.\n\nWe are now approaching St Patrick’s Day, a day to give thanks for our Christian heritage, to recall the unique contribution of the Irish Church to the world wide Church – over the centuries Ireland has been a place of great light but sadly also great darkness. At times we have shown wonderful witness and at other times have shown how narrowness and bigotry can distort the Gospel. Jonathan Swift said of his generation ‘we have enough religion to make us hate but not enough to make us love one another.’ The late Terrence O’Neill, in his final broadcast as Prime Minister of Northern Ireland, sadly observed; ‘Our religion could have enriched our politics, Instead we have allowed our politics to demean our religion.’\n\nIn the period leading up to fall of Terence O’Neill and the beginning of the Troubles, the Belfast comedian, late James Young, produced a poem telling of a return visit St Patrick made to his beloved Ireland. He wanted to see how they were progressing in the faith. As he headed for Armagh, he was appalled to find a society torn apart by intolerance and bigotry. The poem ends with St Patrick telling God that he will be back later than he thought – he’ll have to stay behind and do the job all over again.\n\nFaith, commitment while passed down from one generation to another, can never be second hand. There is a real sense in which each generation has to make the faith its own, has to express the faith in its own way, has to live out the faith in its own context.\n\nThe continuing instability of the world’s financial systems, Russian willingness to use its control of natural gas supplies to Europe as part of its maneuvering in the crisis in Ukraine, the awful scenes we witness in the context of the impact of ISIS on Iraq and Syria. All these pose serious questions for mankind, for us as a society, for us as individuals. What is to be our guiding light? – the foolishness of God or the foolishness of man. The foolishness of the God who sent his Son, who in his weakness and vulnerability overcame the powers of death and darkness and triumphed on the Cross. The foolishness of men, who think their power, their influence, their interests reign supreme.\n\nJesu, Jesu, I thee adore – help me love thee more and more.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent32015.txt",
        "raw_ocr_content": "Page 1 of 4\nLent 3 – 2015 – Year B\nShortly after the end of the 2nd World War, the world divided into two armed\ncamps. As Churchill remarked, an Iron Curtain came down across Europe.\nInternational relationships were set in the context of the “Cold War”, only\ntempered by the realisation that either side has the power to obliterate the other.\nPeriodically crises arose that threatened this perilous stability – I have\nmemories of the tensions that surrounded the Cuban Missile Crisis. I also\nrecall huge army convoys driving past our house in Birmingham at the time of\nthe Suez Crisis. In more recent days, as we have watchedthe Civil War in the\nUkraine , we have seen a return of the East West tensions that has characterised\nEuropean politics since the time of Churchhill\nIn the context of Eastern Europe in the Cold War Era, the communist regimes\nheld total control over the lives of their citizens. That power sought to control\nand suppress the Church. Our family was in Taize the summer after the fall of\nthe Berlin Wall. For the first time Christians from many parts of Eastern\nEurope were allowed to travel freely. They spoke of the amazing changes they\nhad witnessed as power collapsed. One of the Taize community spoke of a\nvisit to priest in a village in what is now the Czech Republic. The priest told of\nhow for years he had ministered to a faithful few – only a handful in Church\neach Sunday. Secret police had harassed his Church members, other villagers\nhas viewed them with a mixture of amusement and hostility. Now, he mused,\nthe power that sought to suppressed had collapsed almost overnight. The\nChurch had not only survived but was now beginning to grow.\nOne example among many of the transitory nature of human power, of the\narrogance of human power. Of course we are living in the midst of a collapse\nof human power. The proceedings of the Dail committee that is looking at the\nconduct of financial institutions around the time of the fall of the Celtic Tiger\nhave reminded us of financial institutions, executives with power on a level\nwith national governments, who felt themselves invulnerable, awarding\nPage 2 of 4\nLent 3 – 2015 – Year B\nthemselves benefits beyond the dreams of many, who then saw their power,\ntheir world collapse. Society as a whole (and that means us) was mesmerised\nby their power and the collapse has impacted upon us all. This was a traumatic\nperiod for our society as we were left with a deep sense of insecurity. Many,\nwho are still feeling the trauma of that period in loss of homes, relatives forced\nto emigrate. are rightly suspicious of any sings that we as a society will go\ndown that route again.\nPaul, from whom we read as our Epistle was writing in a period close to the\npeak of the power of the Roman Empire. Of course Rome was the super-\npower of its day, having seen off all its rivals. Paul, in the portion we read from\ntoday from the 1st Letter to the Church at Corinth, draws a contrast between\nhuman power, undoubtedly exemplified by the might of Rome and the\npowerlessness of the infant Church, the seemingly pointless death of Jesus. At\nthe same time he draws a contrast between the sophistication of Graeco-Roman\nculture and the ancient philosophers and the seemingly naïve teaching of the\nChurch.\nOur passage concludes: ‘For God’s foolishness is wiser than human wisdom,\nand God’s weakness is stronger than human strength..’ (1 Cor 1:25) The\nwords he chose in the original Greek text bring out this contrast even more\nsharply that our English translation.\nGod’s foolishness – the word Paul has used is ‘moron’ from which we of\ncourse derive the word ‘moron’. Moronic has connotations not just of\nfoolishness, but also stupidity. God’s stupidity, the risk of creation, of\nincarnation; the risk of self giving, self denying, self emptying love is shown\nto far outweigh the seeming sophistication of much of contemporary wisdom.\nPage 3 of 4\nLent 3 – 2015 – Year B\nGod’s weakness – the word Paul uses here is ‘asthenes’ has connotations not\njust of weakness but also feebleness, verging on the pathetic. In the Gospel\naccounts of the Passion, Pilate presents the beaten, bleeding Jesus in purple\nrobe and crown of thorns to the crowd, almost goading them ‘Shall I crucify\nyour King?’ There is something darkly comical as the power of Rome makes a\ncynical point. But of course the influence of that crucified itinerant Galilean\npreacher has far outlasted the Pilate’s and Caesars of this world.\nWe are now approaching St Patrick’s Day, a day to give thanks for our\nChristian heritage, to recall the unique contribution of the Irish Church to the\nworld wide Church – over the centuries Ireland has been a place of great light\nbut sadly also great darkness. At times we have shown wonderful witness and\nat other times have shown how narrowness and bigotry can distort the Gospel.\nJonathan Swift said of his generation ‘we have enough religion to make us hate\nbut not enough to make us love one another.’ The late Terrence O’Neill, in his\nfinal broadcast as Prime Minister of Northern Ireland, sadly observed; ‘Our\nreligion could have enriched our politics, Instead we have allowed our politics\nto demean our religion.’\nIn the period leading up to fall of Terence O’Neill and the beginning of the\nTroubles, the Belfast comedian, late James Young, produced a poem telling of\na return visit St Patrick made to his beloved Ireland. He wanted to see how\nthey were progressing in the faith. As he headed for Armagh, he was appalled\nto find a society torn apart by intolerance and bigotry. The poem ends with St\nPatrick telling God that he will be back later than he thought – he’ll have to\nstay behind and do the job all over again.\nFaith, commitment while passed down from one generation to another, can\nnever be second hand. There is a real sense in which each generation has to\nPage 4 of 4\nLent 3 – 2015 – Year B\nmake the faith its own, has to express the faith in its own way, has to live out\nthe faith in its own context.\nThe continuing instability of the world’s financial systems, Russian\nwillingness to use its control of natural gas supplies to Europe as part of its\nmaneuvering in the crisis in Ukraine, the awful scenes we witness in the\ncontext of the impact of ISIS on Iraq and Syria. All these pose serious\nquestions for mankind, for us as a society, for us as individuals. What is to be\nour guiding light? – the foolishness of God or the foolishness of man. The\nfoolishness of the God who sent his Son, who in his weakness and vulnerability\novercame the powers of death and darkness and triumphed on the Cross. The\nfoolishness of men, who think their power, their influence, their interests reign\nsupreme.\nJesu, Jesu, I thee adore – help me love thee more and more."
    }
}