{
    "title": "Mothering Sunday - 2011",
    "date": "2011-04-03",
    "blurb": "This sermon, delivered on Mothering Sunday of 2011, discusses the importance and challenges of parenting. It highlights the role of love, values, and responsibility in raising a child. The sermon also reflects on the speaker's own experiences as a parent and child, and relates these to the understanding of God as a Father.",
    "raw_text": "Amidst all the doom and gloom of this last week, the debate on the Moriarty Report, the Bank Stress Tests and the news that the banks are going to require even more of our money, there was a lovely feel good feature on the news from Dublin Zoo with the birth of the baby gorilla. I was struck by a comment of the keeper on the news on Wednesday as he explained why it had not been possible to determine the sex of the new baby gorilla. The mother was keeping her new baby so close they simply could not see and then he said, 'She is obviously so good at her job and we are not going to do anything to disturb her.' In contrast to that there was that awful case in Belfast of a young father who killed his infant son. One wonders what experience of fatherhood, of parenting he experienced in his own childhood.\n\nParenting is one of the most vital, most demanding, most rewarding, most frustrating tasks any human being is ever going to undertake. The new parents find themselves suddenly home from hospital with this little bundle of humanity, bombarded with advice from mums, dads, grannies, friends, books, TV and internet. Bit by bit they discover what it is to love, to parent, to train, to encourage, to discipline, to laugh, to cry with this young life entrusted to their care.\n\nI always get a great kick out of watching young parents interacting with their children, watching a new family unit evolve from two individuals drawn together in love. As I thought on this and the events of this week, and of Mothering Sunday, it set me thinking; what are the most important things we do for our children in the context of our family life. Just think of those first couple of years, the pre-language stage of development, the ways that love is expressed, a feeling of security is fostered. Gradually manual skills are encouraged; the child learns to hold the biscuit, to move it in the general direction of the mouth, to use a spoon, a cup. Simple toys encourage basic manual skills. Simple social skills; expressions of affection are encouraged; punching father in the eye, throwing toys around the room, these evoke a different response. Gradually the child is encouraged to take responsibility for certain things, dressing, cleaning teeth, toileting, tidying things away. And so it goes on through early schooling, helping them through adolescence (without killing them in the process) until the stage comes when they embark on their own adult lives. At each stage love is expressed in the meeting of material needs, encouragement in education and to take responsibility for themselves, participation in the life of the Church and the community; and just being with them through the various stages, the joys and the traumas, of growing up.\n\nLooking back over my own childhood, looking back over my own, often flawed, parenting of my own children – what were the most important things. I think I would have to say the love and the values that were imparted. I am thinking not just of the basic values of right and wrong; the values of compassion, of concern for others, of loyalty, of integrity. As I reflected on this, an incident in my own childhood came to mind, I must have been around twelve or thirteen. I was giving off to my father about something my brother had done, how he was going to regret it. He said, 'Kevin, two wrongs never make a right.' I came back straight away, 'But neither does a right and a wrong.' The look of disappointment on his face as I said that has stayed with me; a look that said more powerfully than any words, 'You haven’t understood it yet have you, son.'\n\nI set all these thoughts in the context of the psalm appointed for today, a portion of Psalm 34, a passage that speaks of God’s fatherhood of each one of us. Our understanding of God as Father is in many ways modelled on our own experience of being parented, of being unconditionally loved, of being cherished, strengthened, disciplined and corrected, forgiven. As I read that passage I can imagine a parent sitting down with a confused, rebellious, hurting, defiant child. 'What is it that will make you truly happy?'\n\n13 Keep your | tongue from | evil @\nand your | lips from | lying | words.\n14. Turn from evil | and do | good; @\nseek | peace | and pur|sue it.\n\n'Do you ever feel that no-one understands you my child? Well, listen to me.'\n\n15 The eyes of the Lord are up|on the | righteous @\nand his ears are | open | to their | cry.\n\n17 The righteous cry and the | Lord | hears them @\nand delivers them | out of | all their | troubles.\n18. The Lord is near to the | broken|hearted @\nand will save | those ~ who are | crushed in | spirit.\n\nThis, in truth, gives us a pattern for our own parenting as we seek to impart standards, as we seek to love and support. Today, Mothering Sunday, we pay particular attention to the role of motherhood in the life of our families and wider society. In an era when we have been conditioned to defer to experts it is so easy for mothers, for parents in general to lose confidence in their abilities to fulfil the enormous privilege and task that has been laid upon them. Today is a day to celebrate parenthood, to give thanks for the role our own mothers played in our lives, in bringing us to birth, in loving and nurturing us along the way, to acknowledge those times we took them for granted, disappointed them, hurt them; times also in which we gave them cause for pride and celebration. Today is a day for mothers, for parents in general to offer their own parenting of their children to God. Just as God’s parental care of his people gives a model for our parenting so we offer that parenting, in all its strengths and weakness, that through it our children may get a glimpse of God’s unrelenting, unconditional love for them.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent42011.txt",
        "raw_ocr_content": "Page 1 of 4\nLent 4 – Mothering Sunday – 2011 – year A\nAmidst all the doom and gloom of this last week, the debate on the Moriarty\nReport, the Bank Stress Tests and the news that the banks are going to require\neven more of our money, there was a lovely feel good feature on the news from\nDublin Zoo with the birth of the baby gorilla. I was struck by a comment of\nthe keeper on the news on Wednesday as he explained why it had not been\npossible to determine the sex of the new baby gorilla. The mother was keeping\nher new baby so close they simply could not see and then he said, ‘She is\nobviously so good at her job and we are not going to do anything to disturb\nher.’ In contrast to that there was that aweful case in Belfast of a young father\nwho killed his infant son. One wonders what experience of fatherhood, of\nparenting he experienced in his own childhood.\nParenting is one of the most vital, most demanding, most rewarding, most\nfrustrating tasks any human being is ever going to undertake. The new parents\nfind themselves suddenly home from hospital with this little bundle of\nhumanity, bombarded with advice from mums, dads, grannies, friends, books,\nTV and internet. Bit by bit they discover what it is to love, to parent, to train,\nto encourage, to discipline, to laugh, to cry with this young life entrusted to\ntheir care.\nI always get a great kick out of watching young parents interacting with their\nchildren, watching a new family unit evolve from two individuals drawn\ntogether in love. As I thought on this and the events of this week, and of\nMothering Sunday, it set me thinking; what are the most important things we\ndo for our children in the context of our family life. Just think of those first\ncouple of years, the pre-language stage of development, the ways that love is\nPage 2 of 4\nLent 4 – Mothering Sunday – 2011 – year A\nexpressed, a feeling of security is fostered. Gradually manual skills are\nencouraged; the child learns to hold the biscuit, to move it in the general\ndirection of the mouth, to use a spoon, a cup. Simple toys encourage basic\nmanual skills. Simple social skills; expressions of affection are encouraged;\npunching father in the eye, throwing toys around the room, these evoke a\ndifferent response. Gradually the child is encouraged to take responsibility for\ncertain things, dressing, cleaning teeth, toileting, tidying things away. And so it\ngoes on through early schooling, helping them through adolescence (without\nkilling them in the process) until the stage comes when they embark on their\nown adult lives. At each stage love is expressed in the meeting of material\nneeds, encouragement in education and to take responsibility for themselves,\nparticipation in the life of the Church and the community; and just being with\nthem through the various stages, the joys and the traumas, of growing up.\nLooking back over my own childhood, looking back over my own, often\nflawed, parenting of my own children – what were the most important things. I\nthink I would have to say the love and the values that were imparted. I am\nthinking not just of the basic values of right and wrong; the values of\ncompassion, of concern for others, of loyalty, of integrity. As I reflected on\nthis, an incident in my own childhood came to mind, I must have been around\ntwelve or thirteen. I was giving off to my father about something my brother\nhad done, how he was going to regret it. He said, ‘Kevin, two wrongs never\nmake a right.’ I came back straight away, ‘But neither does a right and a\nwrong.’ The look of disappointment on his face as I said that has stayed with\nme; a look that said more powerfully than any words, ‘You haven’t understood\nit yet have you, son.’\nPage 3 of 4\nLent 4 – Mothering Sunday – 2011 – year A\nI set all these thoughts in the context of the psalm appointed for today, a\nportion of Psalm 34, a passage that speaks of God’s fatherhood of each one of\nus. Our understanding of God as Father is in many ways modelled on our own\nexperience of being parented, of being unconditionally loved, of being\ncherished, strengthened, disciplined and corrected, forgiven. As I read that\npassage I can imagine a parent sitting down with a confused, rebellious,\nhurting, defiant child. ‘What is it that will make you truly happy?’\n13 Keep your | tongue from | evil @\nand your | lips from | lying | words.\n14. Turn from evil | and do | good; @\nseek | peace | and pur|sue it.\n‘Do you ever feel that no-one understands you my child? Well, listen to me.’\n15 The eyes of the Lord are up|on the | righteous @\nand his ears are | open | to their | cry.\n…………………………………………………………………………….\n17 The righteous cry and the | Lord | hears them @\nand delivers them | out of | all their | troubles.\n18. The Lord is near to the | broken|hearted @\nand will save | those ~ who are | crushed in | spirit.\nThis, in truth, gives us a pattern for our own parenting as we seek to impart\nstandards, as we seek to love and support. Today, Mothering Sunday, we pay\nparticular attention to the role of motherhood in the life of our families and\nwider society. In an era when we have been conditioned to defer to experts it\nis so easy for mothers, for parents in general to lose confidence in their abilities\nto fulfil the enormous privilege and task that has been laid upon them. Today\nPage 4 of 4\nLent 4 – Mothering Sunday – 2011 – year A\nis a day to celebrate parenthood, to give thanks for the role our own mothers\nplayed in our lives, in bringing us to birth, in loving and nurturing us along the\nway, to acknowledge those times we took them for granted, disappointed them,\nhurt them; times also in which we gave them cause for pride and celebration.\nToday is a day for mothers, for parents in general to offer their own parenting\nof their children to God. Just as God’s parental care of his people gives a\nmodel for our parenting so we offer that parenting, in all its strengths and\nweakness, that through it our children may get a glimpse of God’s unrelenting,\nunconditional love for them."
    }
}