{
    "title": "Mothering Sunday Reflection",
    "date": "2014-03-30",
    "blurb": "This sermon, delivered on Mothering Sunday in 2014, reflects on the significance of the day beyond the commercialized 'Mother's Day'. It emphasizes the importance of gratitude for those who nurtured us, as well as the spiritual significance of returning to our 'mother church'. The sermon also includes a baptism and a reflection on the Christian journey, reminding us of the promises made at baptism and the importance of living in response to these promises.",
    "raw_text": "Today, in case you have not noticed it, is Mothering Sunday, or as the commercial world has rebranded it, Mothers Day. On this day in our thoughts and prayers we thank God for those who brought us to birth, who watched over us as we grew, absorbed the temper tantrums of our childhood and adolescence, who offered words of advice, comfort and encouragement. While gratitude should be an all the year affair, this is a day for showing particular gratitude and affection.\n\nBut mothers and motherhood is not the whole story of Mothering Sunday. In the early days of the Church, there was a custom on this 4th Sunday in Lent for Christians to visit the church in which they were baptised. It was more than just a matter of nostalgia; it was a return to their roots. So in our prayers this morning we will be thinking of our own mother church, the church in which we were baptised. We will be thinking of not just the building but the community that gathers there to worship.\n\nToday we are baptising Emma Rose Sweetman – so this Church, St Mary’s in the Parish of Howth will be Emma’s mother Church. This will be the community within which, along with her sister Lucy, she will have her first experience of Christian community.\n\nToday, on this Mothering Sunday, as we think back to our mother Church, the place of our Baptism; (as we witness Emma’s Baptism) this is a day to reflect on the Cross imprinted on our foreheads and the promises to be made on Emma’s behalf, the promises made on our behalf, the promises we make our own at Confirmation.\n\nMichael Ramsey, Archbishop of Canterbury as I was growing up, used to talk of his life being lived in response to his Baptism, of these questions being a yardstick for life – he would ask himself his baptismal questions from time to time, questions touching upon his loyalty to Christ, his rejection of evil.\n\nReceive the sign of the Cross. Cast your mind back to that time before you could remember, when you were marked with the sign of the cross, the symbol of our redemption.\n\nMay this be a day for reflection on our own Christian pilgrimage – whether it began in Howth or Sutton, in Athy or Drogheda, in Rosenallis, in Birmingham or wherever. There will have been highs and lows along that road, times of trial, of sadness and failure, times of great joy – God has been with us, in his Spirit or in those who have touched our lives.\n\nThis day you remember the people who were special to you, who encouraged you, who still encourage you – in their presence or in your memory. In years to come, how will Emma look back on this her mother Church? May her memories be of a community of welcome, of encouragement – where she has encountered Christ in worship and in one another and so be empowered to go out herself and show Christ to the world in which she lives.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent42014.txt",
        "raw_ocr_content": "Page 1 of 3\nLENT 4 – Mothering Sunday – Year A – 2014\nToday, in case you have not noticed it, is Mothering Sunday, or as the\ncommercial world has rebranded it, Mothers Day. On this day in our thoughts\nand prayers we thank God for those who brought us to birth, who watched over\nus as we grew, absorbed the temper tantrums of our childhood and\nadolescence, who offered words of advice, comfort and encouragement. While\ngratitude should be an all the year affair, this is a day for showing particular\ngratitude and affection.\nBut mothers and motherhood is not the whole story of Mothering Sunday, In\nthe early days of the Church, there was a custom on this 4th Sunday in Lent for\nChristians to visit the church in which they were baptised. It was more than\njust a matter of nostalgia; it was a return to their roots. So in our prayers this\nmorning we will be thinking of our own mother church, the church in which\nwe were baptised. We will be thinking of not just the building but the\ncommunity that gathers there to worship. We will be thinking of the people\nwho were important to us in those early formative years; Sunday School\nteachers, those who lead the organisations we may have belonged to, the\nclergy, those who encouraged us, who welcomed us. I still remember with\nhuge affection one particular couple in St Lawrence’s in Northfield in\nBirmingham, where I was baptised and to which I returned many years later as\na tentative seeker. I invite you to be still and recall the people and places in\nyour early Christian life.\nToday we are baptising Emma Rose Sweetman – so this Church, St Mary’s in\nthe Parish of Howth will be Emma’s mother Church. This will be the\ncommunity within which, along with her sister Lucy, she will have her first\nPage 2 of 3\nLENT 4 – Mothering Sunday – Year A – 2014\nexperience of Christian community, as their Mum and Dad, Colm and Hazel,\nbring them Sunday by Sunday. You and I will be the people she will\nremember, the welcome we give, the encouragement, the fellowship we offer.\nIn the course of the service, Linda will baptise her, as we were baptised in the\nname of the Father, and the Son, and the Holy Spirit. She will sign Emma with\nthe sign of the Cross, as we were signed at our own Baptism.\nToday, on this Mothering Sunday, as we think back to our mother Church, the\nplace of our Baptism; (as we witness Emma’s Baptism) this is a day to reflect\non the Cross imprinted on our foreheads and the promises to be made on\nEmma’s behalf, the promises made on our behalf, the promises we make our\nown at Confirmation.\nDo you reject the devil and all rebellion against God?\nI reject them.\nDo you renounce the deceit and corruption of evil?\nI renounce them.\nDo you repent of the sins that separate us from God and neighbour?\nI repent of them.\nDo you turn to Christ as Saviour?\nI turn to Christ.\nDo you submit to Christ as Lord?\nI submit to Christ.\nDo you come to Christ, the way, the truth and the life?\nI come to Christ.\nMichael Ramsey, Archbishop of Canterbury as I was growing up, used to talk\nof his life being lived in response to his Baptism, of these questions being a\nyardstick for life – he would ask himself his baptismal questions from time to\ntime, questions touching upon his loyalty to Christ, his rejection of evil.\nPage 3 of 3\nLENT 4 – Mothering Sunday – Year A – 2014\nReceive the sign of the Cross. Cast your mind back to that time before you\ncould remember, when you were marked with the sign of the cross, the symbol\nof our redemption.\nDo not be ashamed to confess the faith of Christ crucified.\nAll Fight valiantly as a disciple of Christ\nagainst sin, the world and the devil,\nand remain faithful to Christ to the end of your life.\nMay this be a day for reflection on our own Christian pilgrimage – whether it\nbegan in Howth or Sutton, in Athy or Drogheda, in Rosenallis, in Birmingham\nor wherever. There will have been highs and lows along that road, times of\ntrial, of sadness and failure, times of great joy – God has been with us, in his\nSpirit or in those who have touched our lives.\nThis day you remember the people who were special to you, who encouraged\nyou, who still encourage you – in their presence or in your memory. In years\nto come, how will Emma look back on this her mother Church? May her\nmemories be of a community of welcome, of encouragement – where she has\nencountered Christ in worship and in one another and so be empowered to go\nout herself and show Christ to the world in which she lives."
    }
}