{
    "title": "Unity in Crisis",
    "date": "2020-03-22",
    "blurb": "Kevin's sermon reflects on the unprecedented challenges posed by the Covid-19 pandemic, emphasizing the importance of solidarity and community spirit. He urges everyone to practice social distancing, support healthcare workers, and maintain hope during this national emergency. The core message is about coming together by staying apart, and the power of collective action in the face of a global crisis.",
    "raw_text": "Lá Fhéile Pádraig shona daoibh!\n\nThis is a Saint Patrick’s Day like no other. A day that none of us will ever forget. Today’s children will tell their own children and grandchildren about the national holiday in 2020 that had no parades or parties, but instead saw everyone staying at home to protect each other. In years to come, let them say of us, when things were at their worst, we were at our best.\n\nOur country is making big demands of our healthcare staff, big demands of every single one of us. Tonight I want you to know why these actions are being taken and what more needs to be done. We are in the midst of a global and national emergency – a pandemic – the likes of which none of us has seen before. So far the number of cases in Ireland has been relatively small. However, we believe that number will rise to fifteen thousand cases or more by the end of the month and rise further in the weeks thereafter.\n\nThe vast majority of us who contract Covid-19 will experience a mild illness, but some will be hospitalized and sadly some people will die. We cannot stop this virus but working together we can slow it in its tracks and push it back. We can, as you have heard by now – flatten the curve. But only if everyone takes sustained action. Nothing less will do.\n\nWe all need to take steps to reduce close human contact. That is how the virus is spread. Not just at public gatherings or public places but also in our own homes, places of leisure and work. Large public gatherings are canceled. All pubs and bars are shut. We have also asked people to curtail or cancel social gatherings like parties, weddings and other celebrations. I know these choices won’t be easy, but they are necessary.\n\nMore will be required in the coming weeks to reduce the spread of the virus. At all times we will be guided by, and take the expert advice, from our Public Health Emergency Team led by the Chief Medical Officer. We will always put your life and your health ahead of any other concern. All resources that we have, financial and human, are being deployed to serve this great national effort.\n\nWe are watching what’s happening around the world and will learn from the experience of other countries affected by Covid-19 before us – what works and what doesn’t. We know the best strategies focus on testing, contact tracing and social distancing. So, that is our strategy.\n\nWe will keep our essential services, supply chains and utilities operating. Many of you want to know when this will be over. The truth is we don’t know yet. This Emergency is likely to go on well beyond March 29th. It could go on for months into the summer so we need to be sensible in the approach we take.\n\nWe will deploy our full resources to ensure that essential shops, workplaces and public transport can continue to operate. People will still need to buy goods and avail of personal services in the weeks and months ahead. However, to do so, we need your co-operation and that of business and industry to make social distancing workable. This may mean changing how you do your business, but we will work with you to find safe and creative ways to do this.\n\nThis may mean adjusted opening hours, staggering breaks, phone calls rather than meetings, and if possible working from home. As you plan your life it will mean avoiding unnecessary journeys. Shopping online from local businesses and getting things delivered rather than physically going to the premises.\n\nIn short – we are asking people to come together as a nation by staying apart from each other. The most basic messages of washing your hands properly and practicing good hygiene around sneezing and coughing are still the most important.\n\nAnd, if you have a new cough that isn’t going away or a high temperature, stay at home and phone your doctor. A test will be arranged for you.\n\nAt a certain point, we will advise the elderly and people who have a long-term illness to stay at home for several weeks. We are putting in place the systems to ensure that if you are one of them, you will have food, supplies and are checked on. We call this 'cocooning' and it will save many lives, particularly the most vulnerable, the most precious in our society.\n\nIt’s going to be very difficult to stay apart from our loved ones. Most grandparents just want to give their grandkids a hug and a kiss – but as hard as this is, we need to keep our physical distance to stop the virus. Technology can help – check in with your loved ones on Skype or Facetime and promise them you’ll see them again soon.\n\nWe’ve already seen our fantastic community spirit spring into action. Phone your neighbors, see if they need help, and make sure those who are living alone are not left alone. To all the young people watching – I know you are bored and probably a bit fed up. You want to see your friends and you might even be wishing you were back at school. You’re going to have to wait a while longer for that.\n\nI hope you remember that this time is tough on your parents as well. So I’m asking you to ask your parents at least once a day what you can do to help them. Keep up your schoolwork and call your grandparents. Keep up your schoolwork, call your grandparents and try not to fight with your brothers and sisters.\n\nLike you, my family has spoken about little else in recent days. My partner, my two sisters, and both their husbands are working in the health service – here in Ireland and in the UK. They are all apprehensive. They have heard the stories from China and Italy of hospitals being overwhelmed and medical staff getting sick. I am so proud of all of them. Not all superheroes wear capes, some wear scrubs and gowns.\n\nAll of our healthcare workers need us to do the right thing in the weeks ahead. Our community services and hospitals are being tooled up. Essential equipment is on the way. Retired staff are returning to service. People are training for changed roles. This is the calm before the storm – before the surge. And when it comes – and it will come – never will so many ask so much of so few. We will do all that we can to support them.\n\nI am also grateful to the many people who have joined this great national effort. Not just our healthcare staff but also our army cadets, librarians and civil servants who are learning how to do contact tracing. The early education and childcare workers offering to look after the children of our front line staff so they can go to work. The teachers and lecturers finding new innovative ways to teach students on-line and putting together contingency plans for the Leaving Cert and College exams.\n\nThe people who are stocking our shelves every day, and those who are serving customers. Our hauliers, who leave their families on a Sunday evening and travel across the continent to ensure that we have the products, medicine and equipment that we need. All who have kept our supply chain moving, we thank them, a different kind of frontline service. Our journalists and broadcasters who are helping to inform and educate. All are deserving of our respect and thanks.\n\nCoronavirus is already having a deep impact on jobs and economic activity and will continue to do so. Some people watching will have seen their jobs lost, businesses closed, or their working hours reduced. More will be worried that this might happen to them too, especially as we do not know when the Emergency will end. I know this is causing huge stress to you and your families, on top of fear of the virus.\n\nWhile we do not have all the answers now, we are doing and will do all we can to help you through the time ahead. You will receive income support as quickly and efficiently as possible, and when we are through the worst, we will work as hard as possible to get people back to work and get business open again. Everyone in our society must show solidarity in this time of national sacrifice. For those who have lost their jobs and had their incomes reduced temporarily, there must be help and understanding from those who can give it, particularly the banks, government bodies and utilities.\n\nWe went into this crisis with a strong economy and the public finances in good order. We have the capacity and credit rating to borrow billions if we need to. I am confident that our economy will bounce back, but the damage will be significant and lasting. The bill will be enormous and it may take years to pay it. The Government has already signed off a 3 billion euro package for health, social welfare and business – we will take further action as needed.\n\nTonight I know many of you are feeling scared and overwhelmed. That is a normal reaction, but we will get through this and we will prevail. We need to halt the spread of the virus but we also need to halt the spread of fear. So please rely only on information from trusted sources. From Government, from the HSE, from the World Health Organisation and from the national media. Do not forward or share messages that are from other, unreliable sources. So much harm has already been caused by those messages, and we must insulate our communities and the most vulnerable from the contagion of fear. Fear is a virus in itself.\n\nPlease take regular breaks from watching news and media, and from consuming social media. Constantly scrolling on your phone or obsessively following the latest developments, is not good for anyone. Look after your mental health and well-being as well as your physical health.\n\nTonight on our national holiday I also want to send a message around the world that we are all in this together. To the people of China, Spain and Italy who have suffered untold heartbreak and loss – we are with you. To all of those across the world who have lost a loved one to this virus – we are with you. To all those living in the shadow of what is to come – we are with you.\n\nViruses pay no attention to borders, race, nationality or gender. They are the shared enemy of all humanity. So it will be the shared enterprise of all humanity that finds a treatment and a vaccine that protects us. Tonight I send a message of friendship and of hope from Ireland to everyone around the world this Saint Patrick’s Day.\n\nLá Fhéile Pádraig shona daoibh!\n\nOíche mhaith.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Lent/year A/lent42020 - Leo Varadkar address.txt",
        "raw_ocr_content": "Lá Fhéile Pádraig shona daoibh!\nThis is a Saint Patrick’s Day like no other.\nA day that none of us will ever forget.\nToday’s children will tell their own children and grandchildren about the national holiday in 2020\nthat had no parades or parties… but instead saw everyone staying at home to protect each\nother.\nIn years to come… let them say of us… when things were at their worst… we were at our best.\nOur country is making big demands of our healthcare staff… big demands of every single one\nof us.\nTonight I want you to know why these actions are being taken and what more needs to be done.\nWe are in the midst of a global and national emergency – a pandemic – the likes of which none\nof us has seen before.\nSo far the number of cases in Ireland has been relatively small.\nHowever, we believe that number will rise to fifteen thousand cases or more by the end of the\nmonth and rise further in the weeks thereafter.\nThe vast majority of us who contract Covid-19 will experience a mild illness… but some will be\nhospitalised and sadly some people will die.\nWe cannot stop this virus but working together we can slow it in its tracks and push it back.\nWe can, as you have heard by now – flatten the curve. But only if everyone takes sustained\naction. Nothing less will do.\nWe all need to take steps to reduce close human contact. That is how the virus is spread. Not\njust at public gatherings or public places but also in our\nown homes… places of leisure and work.\nLarge public gatherings are cancelled. All pubs and\nbars are shut.\nWe have also asked people to curtail or cancel social gatherings like parties, weddings and\nother celebrations. I know these choices won’t be easy,\nbut they are necessary.\nMore will be required in the coming weeks to reduce the spread of the virus. At all times we\nwill be guided by… and take the expert advice…\nfrom our Public Health Emergency Team led by the Chief Medical Officer.\nWe will always put your life and your health ahead of any other concern. All resources that we\nhave… financial and human… are being deployed to serve this great national effort.\nWe are watching what’s happening around the world and will learn from the experience of other\ncountries affected by Covid-19 before us – what works and what doesn’t.\nWe know the best strategies focus on testing… contact tracing and social distancing. So, that is\nour strategy.\nWe will keep our essential services… supply chains and utilities operating.\nMany of you want to know when this will be over.\nThe truth is we don’t know yet.\nThis Emergency is likely to go on well beyond March 29th. It could go on for months into the\nsummer so we need to be sensible in the approach we take.\nWe will deploy our full resources to ensure that essential shops… workplaces and public\ntransport can continue to operate. People will still need to buy goods and avail of personal\nservices in the weeks and months ahead.\nHowever… to do so… we need your co-operation and that of business and industry to make\nsocial distancing workable. This may mean changing how you do your business… but we will\nwork with you to find safe and creative ways to do this.\nThis may mean adjusted opening hours… Staggering breaks… phone calls rather than\nmeetings… and if possible working from home.\nAs you plan your life it will mean avoiding unnecessary journeys. Shopping online from local\nbusinesses and getting things delivered rather than physically going to the premises.\nIn short – we are asking people to come together as a nation by staying apart from each other.\n]\nThe most basic messages of washing your hands properly and practicing good hygiene around\nsneezing and coughing are still the most important.\nAnd… if you have a new cough that isn’t going away or a high temperature… stay at home and\nphone your doctor. A test will be arranged for you.\nAt a certain point… we will advise the elderly and people who have a long-term illness to stay at\nhome for several weeks. We are putting in place the systems to ensure that if you are one of\nthem,\nyou will have food, supplies and are checked on.\nWe call this ‘cocooning’ and it will save many lives… particularly the most vulnerable… the most\nprecious in our society.\nIt’s going to be very difficult to stay apart from our loved ones.\nMost grandparents just want to give their grandkids\na hug and a kiss – but as hard as this is… we need to keep our physical distance to stop the\nvirus.\nTechnology can help – check in with your loved ones on Skype or Facetime and promise them\nyou’ll see them again soon.\nWe’ve already seen our fantastic community spirit spring into action.\nPhone your neighbours… see if they need help…\nand make sure those who are living alone are not left alone.\nTo all the young people watching – I know you are bored and probably a bit fed up. You want to\nsee your friends and you might even be wishing you were back at school.\nYou’re going to have to wait a while longer for that.\nI hope you remember that this time is tough on your parents as well.\nSo I’m asking you to ask your parents at least once a day what you can do to help them. Keep\nup your schoolwork and call your grandparents.\nKeep up your schoolwork… call your grandparents and try not to fight with your brothers and\nsisters.\nLike you, my family has spoken about little else in recent days.\nMy partner… my two sisters… and both their husbands are working in the health service – here\nin Ireland and in the UK. They are all apprehensive. They have heard the stories from China\nand Italy of hospitals being overwhelmed and medical staff getting sick.\nI am so proud of all of them.\nNot all superheroes wear capes… some wear scrubs and gowns.\nAll of our healthcare workers need us to do the right thing in the weeks ahead.\nOur community services and hospitals are being tooled up.\nEssential equipment is on the way.\nRetired staff are returning to service. People are training for changed roles.\nThis is the calm before the storm – before the surge.\nAnd when it comes – and it will come – never will so many ask so much of so few.\nWe will do all that we can to support them.\nI am also grateful to the many people who have joined this great national effort.\nNot just our healthcare staff but also our army cadets… librarians and civil servants who are\nlearning how to do contact tracing.\nThe early education and childcare workers offering to look after the children of our front line staff\nso they can go to work.\nThe teachers and lecturers finding new innovative ways to teach students on-line and putting\ntogether contingency plans for the Leaving Cert and College exams.\nThe people who are stocking our shelves every day… and those who are serving customers.\nOur hauliers… who leave their families on a Sunday evening and travel across the continent to\nensure that we have the products, medicine and equipment that we need. All who have kept our\nsupply chain moving… we thank them…\na different kind of frontline service.\nOur journalists and broadcasters who are helping to inform and educate. All are deserving of\nour respect and thanks.\nCoronavirus is already having a deep impact on jobs and economic activity and will continue to\ndo so.\nSome people watching will have seen their jobs lost… businesses closed… or their working\nhours reduced. More will be worried that this might happen to them too… especially as we do\nnot know when the Emergency will end.\nI know this is causing huge stress to you and your families… on top of fear of the virus.\nWhile we do not have all the answers now… we are doing and will do all we can to help you\nthrough the time ahead.\nYou will receive income support as quickly and efficiently as possible… and when we are\nthrough the worst… we will work as hard as possible\nto get people back to work and get business open again.\nEveryone in our society must show solidarity in this time of national sacrifice. For those who\nhave lost their jobs and had their incomes reduced temporarily… there must be help and\nunderstanding from those who can give it… particularly the banks… government bodies and\nutilities.\nWe went into this crisis with a strong economy and the public finances in good order.\nWe have the capacity and credit rating to borrow billions if we need to.\nI am confident that our economy will bounce back… but the damage will be significant and\nlasting. The bill will be enormous and it may take years to pay it.\nThe Government has already signed off a 3 billion euro package for health, social welfare and\nbusiness – we will take further action as needed.\nTonight I know many of you are feeling scared and overwhelmed. That is a normal reaction, but\nwe will get through this and we will prevail.\nWe need to halt the spread of the virus but we also need to halt the spread of fear.\nSo please rely only on information from trusted sources. From Government… from the HSE…\nfrom the World Health Organisation and from the national media.\nDo not forward or share messages that are from other, unreliable sources. So much harm has\nalready been caused by those messages…\nand we must insulate our communities and the most vulnerable from the contagion of fear.\nFear is a virus in itself.\nPlease take regular breaks from watching news\nand media, and from consuming social media. Constantly scrolling on your phone or\nobsessively following the latest developments… is not good for anyone.\nLook after your mental health and well-being as well as your physical health.\nTonight on our national holiday I also want to send a message around the world that we are all\nin this together.\nTo the people of China, Spain and Italy who have suffered untold heartbreak and loss – we are\nwith you.\nTo all of those across the world who have lost\na loved one to this virus – we are with you.\nTo all those living in the shadow of what is to\ncome – we are with you.\nViruses pay no attention to borders… race… nationality or gender.\nThey are the shared enemy of all humanity.\nSo it will be the shared enterprise of all humanity that finds a treatment and a vaccine that\nprotects us.\nTonight I send a message of friendship and of hope from Ireland to everyone around the world\nthis Saint Patrick’s Day.\nLá Fhéile Pádraig shona daoibh!\nOíche mhaith."
    }
}