{
    "title": "Unity in Diversity",
    "date": "2014-03-23",
    "blurb": "This sermon, delivered on the third Sunday of Lent in 2014, discusses the importance of unity in the Church, despite differences in race, culture, class, and gender. It emphasizes the teachings of Jesus, who broke down barriers and promoted inclusion. The sermon also touches on the future of the Parish, stressing the need for mutual understanding, respect, and willingness to defer to one another.",
    "raw_text": "Each Sunday in Church, in the course of our worship, we read from the Bible. Our lessons are drawn from the Old Testament, the Acts and Epistles and of course the Gospels. In the course of our worship we reflect on the Psalms either in chant or spoken form. Reading from the word, reflecting on the word lies at the heart of our life and worship. Over this season of Lent, in our Gospel passages we are reading some of the big passages from John’s Gospel – Jesus and Nicodemus, Jesus and the Samaritan woman at the well, Jesus in dispute with the religious authorities over healing on the Sabbath, Jesus and the raising of Lazarus. Each of these represent key stages in the development of the ministry of Jesus on his journey towards Good Friday and Easter. John is very careful in the way he puts his Gospel together, the material he chooses, very clear in his overall purpose.\n\n> *30 Now Jesus did many other signs in the presence of his disciples, which are not written in this book. 31 But these are written so that you may come to believe that Jesus is the Messiah, the Son of God, and that through believing you may have life in his name.*\n> John 20:30-31\n\nAs you look at the overall structure of John’s Gospel, you have Jesus in Jerusalem and Judea (a Jewish heartland, a kind of home territory); Jesus in Galilee (where there is a strong Gentile presence) and as we read today, Jesus in Samaria (which would be a kind of no go territory for the devout Jew). What you have here is a picture of Jesus pushing out the boundaries of inclusion beyond what many devout Jews would have contemplated.\n\nThe Pharisees were alarmed at the fact he would have shared meals with ‘sinners’ – those who fell short of the demands of the Law. Others would have been shocked at his willingness to meet with Gentiles. And today in our Gospel reading we read of his willingness to meet, to talk with a Samaritan woman – the barriers between Jew and Samaritan were as severe as any barrier in contemporary society. So in the very way John chooses to lay out his material, he is making a point – in the life and ministry of Jesus barriers come down. Later Paul, as he writes to the Church in Galatia, where there would have been divisions on all sorts of levels, he reminds them of a fundamental unity they share in Christ.\n\n> *27 As many of you as were baptized into Christ have clothed yourselves with Christ. 28 There is no longer Jew or Greek, there is no longer slave or free, there is no longer male and female; for all of you are one in Christ Jesus.* Gal 3:27-28\n\nNo longer Jew nor Greek …… race and culture no longer matters\nNo longer slave nor free …….. social class no longer matters\nNo longer male nor female …….. gender no longer matters\n\nTo go back to our Gospel reading ….. Jesus sitting and talking to a Samaritan woman, asking her for a drink. All the regulations regarding table fellowship, ritual purity, mixing with heretics lie in shreds in the dust beneath them.\n\nSo this morning I want to think a bit about unity – unity in the Church, unity in the fellowship we share with one another and the implications of division in the life of the Church as something that flies in the face of all that Jesus stands for.\n\nNow of course unity does not mean uniformity, we are not all the same and the world would be much the poorer if we were – but there is a distinction between difference and division.\n\nA month ago the Archbishop invited the Bishop of London, Bishop Richard Chartres to address the clergy and, later the same day, laity drawn from right across our Diocese – Louise Fuller and Adele Sleator were among those who attended. Bishop Chartres spoke of the first major issue that he had to tackle in London Diocese was that of division, on issues of class, of churchmanship, of wealth and poverty, of race and culture. In the course of his address he used an expression that has been rattling around in my head ever since. It is an expression that touches upon that distinction between difference and division.\n\n> *‘Every legitimate expression must have a spoon in the soup’.*\n\nThat really resonated with me as I think about the future of our Parish over the next 10 or 20 years. We are about to embark upon the restoration of our Church roof. This will secure the building – but what about the community that meets to worship here. We are a diverse lot. There are differences in age, in temperament, differences in opinions on social issues, in worship preferences – but we are members of one Body. People ask me what is my vision for this place. I begin with a definition of Church that I first heard some 25 years ago – ‘A community of friends drawn together by the friendship of Jesus’ – that speaks to me of a diversity of individuals held together by a common commitment; a commitment to one another, a shared commitment to Christ. An essential ingredient of any friendship is an understanding of one another, a willingness at times to defer to one another. That is essentially my vision for this place – a community based on mutual understanding and respect for one another, in which we are prepared to defer to one another. This is why over the last number of years I have tried to encourage a broadening of our worship tradition, in and through the Family Service and the Family communion while maintaining the sung communion and Morning Prayer. What discourages me at times is when people dismiss one as inferior or less authentic than the other. I may prefer one style of worship but I can do that without denigrating the worship preferences of others. This is where I draw a distinction between difference and division. What we should aim for is excellence in all our worship that we offer to Almighty God.\n\n2016 will see the 150th Anniversary of the building of this Church, the 200th Anniversary of the building of the tower of this Church. As we prepare to enter upon the next era of the history of this place, securing the roof is the easy part. Securing the future of the community that meets to worship in this place – that will take a little more thought. The Bishop of London’s remark – ‘Every authentic expression must have a spoon in the soup.’ – that is not a bad place to start.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent32014.txt",
        "raw_ocr_content": "Page 1 of 4\nLENT 3 – 2014 – Year A\nEach Sunday in Church, in the course of our worship, we read from the Bible.\nOur lessons are drawn from the Old Testament, the Acts and Epistles and of\ncourse the Gospels. In the course of our worship we reflect on the Psalms\neither in chant or spoken form. Reading from the word, reflecting on the word\nlies at the heart of our life and worship. Over this season of Lent, in our\nGospel passages we are reading some of the big passages from John’s Gospel –\nJesus and Nicodemus, Jesus and the Samaritan woman at the well, Jesus in\ndispute with the religious authorities over healing on the Sabbath, Jesus and the\nraising of Lazarus. Each of these represent key stages in the development of\nthe ministry of Jesus on his journey towards Good Friday and Easter. John is\nvery careful in the way he puts his Gospel together, the material he chooses,\nvery clear in his overall purpose.\n30 Now Jesus did many other signs in the presence of his disciples,\nwhich are not written in this book. 31 But these are written so that\nyou may come to believe that Jesus is the Messiah, the Son of God,\nand that through believing you may have life in his name.\nJohn 20:30-31\nAs you look at the overall structure of John’s Gospel, you have Jesus in\nJerusalem and Judea (a Jewish heartland, a kind of home territory); Jesus in\nGalilee (where there is a strong Gentile presence) and as we read today, Jesus\nin Samaria (which would be a kind of no go territory for the devout Jew).\nWhat you have here is a picture of Jesus pushing out the boundaries of\ninclusion beyond what many devout Jews would have contemplated.\nThe Pharisees were alarmed at the fact he would have shared meals with\n‘sinners’ – those who fell short of the demands of the Law. Others would have\nbeen shocked at his willingness to meet with Gentiles. And today in our\nPage 2 of 4\nLENT 3 – 2014 – Year A\nGospel reading we read of his willingness to meet, to talk with a Samaritan\nwoman – the barriers between Jew and Samaritan were as severe as any barrier\nin contemporary society. So in the very way John chooses to lay out his\nmaterial, he is making a point – in the life and ministry of Jesus barriers come\ndown. Later Paul, as he writes to the Church in Galatia, where there would\nhave been divisions on all sorts of levels, he reminds them of a fundamental\nunity they share in Christ.\n27 As many of you as were baptized into Christ have clothed yourselves\nwith Christ. 28 There is no longer Jew or Greek, there is no longer\nslave or free, there is no longer male and female; for all of you are one\nin Christ Jesus. Gal 3:27-28\nNo longer Jew nor Greek …… race and culture no longer matters\nNo longer slave nor free …….. social class no longer matters\nNo longer male nor female …….. gender no longer matters\nTo go back to our Gospel reading ….. Jesus sitting and talking to a Samaritan\nwoman, asking her for a drink. All the regulations regarding table fellowship,\nritual purity, mixing with heretics lie in shreds in the dust beneath them.\nSo this morning I want to think a bit about unity – unity in the Church, unity in\nthe fellowship we share with one another and the implications of division in the\nlife of the Church as something that flies in the face of all that Jesus stands for.\nNow of course unity does not mean uniformity, we are not all the same and the\nworld would be much the poorer if we were – but there is a distinction between\ndifference and division.\nPage 3 of 4\nLENT 3 – 2014 – Year A\nA month ago the Archbishop invited the Bishop of London, Bishop Richard\nChartres to address the clergy and, later the same day, laity drawn from right\nacross our Diocese – Louise Fuller and Adele Sleator were among those who\nattended. Bishop Chartres spoke of the first major issue that he had to tackle in\nLondon Diocese was that of division, on issues of class, of churchmanship, of\nwealth and poverty, of race and culture. In the course of his address he used an\nexpression that has been rattling around in my head ever since. It is an\nexpression that touches upon that distinction between difference and division.\n‘Every legitimate expression must have a spoon in the soup’.\nThat really resonated with me as I think about the future of our Parish over the\nnext 10 or 20 years. We are about to embark upon the restoration of our\nChurch roof. This will secure the building – but what about the community\nthat meets to worship here. We are a diverse lot. There are differences in age,\nin temperament, differences in opinions on social issues, in worship\npreferences – but we are members of one Body. People ask me what is my\nvision for this place. I begin with a definition of Church that I first heard some\n25 years ago – ‘A community of friends drawn together by the friendship of\nJesus’ – that speaks to me of a diversity of individuals held together by a\ncommon commitment; a commitment to one another, a shared commitment to\nChrist. An essential ingredient of any friendship is an understanding of one\nanother, a willingness at times to defer to one another. That is essentially my\nvision for this place – a community based on mutual understanding and respect\nfor one another, in which we are prepared to defer to one another. This is why\nover the last number of years I have tried to encourage a broadening of our\nworship tradition, in and through the Family Service and the Family\nPage 4 of 4\nLENT 3 – 2014 – Year A\ncommunion while maintaining the sung communion and Morning Prayer. What\ndiscourages me at times is when people dismiss one as inferior or less authentic\nthan the other. I may prefer one style of worship but I can do that without\ndenigrating the worship preferences of others. This is where I draw a\ndistinction between difference and division. What we should aim for is\nexcellence in all our worship that we offer to Almighty God.\n2016 will see the 150th Anniversary of the building of this Church, the 200th\nAnniversary of the building of the tower of this Church. As we prepare to\nenter upon the next era of the history of this place, securing the roof is the easy\npart. Securing the future of the community that meets to worship in this place\n– that will take a little more thought. The Bishop of London’s remark – ‘Every\nauthentic expression must have a spoon in the soup.’ – that is not a bad place to\nstart."
    }
}