{
    "title": "Apollo 13 - Telling the Whole Story",
    "date": "2011-04-10",
    "blurb": "This sermon uses the story of Apollo 13 to illustrate the importance of understanding the whole story of Easter. It emphasizes that to fully appreciate the wonder of resurrection, we need to know the reality of the Cross. The sermon concludes with a reminder of God's love for us, demonstrated through the life, death, and resurrection of Jesus.",
    "raw_text": "Apollo 13 – Telling the whole story\n\nWe tell someone tells us about something that happened and they say, ‘Ah, but wait. You haven't heard the whole story.’ We hear bits about what happened. Story of Apollo 13, story of one of the early trips to the moon that went badly wrong but the crew got back safely in the end. It all started very well. People had almost got bored with these trips to the moon – it was no longer main item on the news. Then disaster struck – one of the oxygen tanks exploded – Major damage to the space craft - power reduced – oxygen supplies reduced – looked for a while that the crew were not going to be able to make it back – prayer vigil in St Patrick’s Cathedral and in city’s around the world. They made it back and landed safely. Crew recovered.\n\nWe could look at that last picture and say ‘They landed safely’ but it is only if we know the rest of that story that we can realise how amazing that safe landing was.\n\nWe are about to celebrate Easter. Next Sunday, Palm Sunday, we will read about the entry of Jesus into Jerusalem. On Easter morning we will read about the disciples finding the tomb empty. But we very rarely hear in Church (unless you go to one of the Holy Week Services) the rest of the story, the bit that happens in between. We need to know the reality of the Cross to appreciate the wonder of resurrection. In the light of the resurrection we see the cross as God’s victory over death.\n\nAs we approach Easter, this is what the Sunday School have done for us today – they have helped us to hear the whole story, the story of God’s love for us in the life, death and resurrection of Jesus.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent52011 - family service.txt",
        "raw_ocr_content": "Page 1 of 2\nLent 5 – Passion Sunday – Family Service – 2011\nApollo 13 – Telling the whole story\nWe tell someone tells us about something that happened and they say,\n‘Ah, but wait. You have n’t heard the whole story’\nWe hear bits about what happened.\nStory of Apollo 13 Slide 1 story of one of the early trips to the\nmoon that went badly wrong but the crew got back safely in the end.\nSlide 1 It all started very well. People had almost got bored with\nthese trips to the moon – it was no longer main item on the news.\nSlide 3 Then disaster struck – one of the oxygen tanks exploded –\nSlide 4 Major damage to the space craft - power reduced – oxygen\nsupplies reduced – looked for a while that the crew were not going to\nbe able to make it back – prayer vigil in St Patrick’s Cathedral and in\ncity’s around the world.\nSlide 5 They made it back and landed safely\nSlide 6 Crew recovered\nPage 2 of 2\nLent 5 – Passion Sunday – Family Service – 2011\nApollo 13 – Telling the whole story\nWe could look at that last picture and say ‘They landed safely’ but it is\nonly if we know the rest of that story that we can realise how amazing\nthat safe landing was.\nWe are about to celebrate Easter. Next Sunday, Palm Sunday, we will\nread about the entry of Jesus into Jerusalem. On Easter morning we\nwill read about the disciples finding the tomb empty. But we very\nrarely hear in Church (unless you go to one of the Holy Week\nServices) the rest of the story, the bit that happens in between. We\nneed to know the reality of the Cross to appreciate the wonder of\nresurrection. In the light of the resurrection we see the cross as God’s\nvictory over death.\nAs we approach Easter, this is what the Sunday School have done for\nus today – they have helped us to hear the whole story, the story of\nGod’s love for us in the life, death and resurrection of Jesus."
    }
}