{
    "title": "Temptation and Relationship with God",
    "date": "2017-03-05",
    "blurb": "This sermon, delivered on the first Sunday of Lent in 2017, discusses the theme of temptation and its role in undermining our relationship with God. Drawing from the temptation of Jesus in the wilderness and the temptation in the Garden of Eden, the sermon emphasizes that sin, at its heart, is about a breakdown of a relationship. It also reassures that Jesus, our great high priest, truly understands our struggles and temptations.",
    "raw_text": "We have now entered the season of Lent. One of the themes of Lent is this whole area of Temptation, we think of Jesus fasting and facing temptation in the wilderness and our own struggles in this whole area. This morning our Old Testament Lesson centres on the temptation in the Garden of Eden and our Gospel reading speaks of Jesus in the wilderness.\n\nThese passages touch on far more than individual temptations – eat the fruit of this tree; turn these stones into bread. They are about undermining, chipping away at a relationship with God. ‘Did God say ……?’ Doubt creeps in. ‘Why shouldn’t I? No harm trying.’ And so is introduced the Biblical concept of Fall – a separation between God and his creation. We get this idea of brokenness, of disjointedness, of distance.\n\nSin, at its heart, is not about this naughty deed or that naughty deed to be rhymed off before God, it is about a breakdown of a relationship. In the Old Testament this is played out in a saga of God reaching out to man, to a particular family, to a particular nation in the call of Abram, in the redemption of people slavery in Egypt. This is developed in the giving of the law and, with that, times of faithfulness and times of abject failure, with the nation, having turned its back on God’s purposes, facing hardship, exile. It is almost like the story of a dysfunctional family.\n\nOur Gospel reading tells of a similar attempt to undermine a relationship with God that we saw in the Garden of Eden. We find Jesus in the wilderness, fresh from his experience of Baptism by John the Baptist, and with it the affirmation by God, ‘This is my son, my beloved ….’\n\nIn the stillness of the desert, as he contemplates his future, there comes the voice of temptation: ‘If you are the Son of God …?’ Are you really? Are you putting your neck on the line for an illusion? ‘If you are the Son of God …?’ ‘Turn these stones into bread ………throw yourself down …..’ ‘Do you really need to go through with this fasting nonsense ……… Do something spectacular ………that will draw the crowds ………’\n\nAs I say there is an attempt to chip away at the close relationship between Jesus and the Father – but Jesus stays firm, committing himself to the path he is called to follow.\n\nWhen we think of Jesus being tempted, we can think of it simply in terms of what is happening in our Gospel story, a once off event that wasn’t going to trouble him again. But as we look through the Gospel narratives we see that this is actually a recurring theme.\n\nIt happens when, after Peter has confessed him as the Christ, Jesus talks of his coming suffering and death. Peter you recall, jumps in to say that this must never happen to him. What does Jesus say? ‘Get behind me Satan’. Temptation comes even in the well meaning words of a trusted friend.\n\nIt happens in the Garden of Gethsemane, as Jesus agonises over what lies ahead in the coming hours. ‘Father, let this cup pass from me.’ We see a Jesus not immune from the full spectrum of human emotion in the face of coming trial. But he continues; ‘Nevertheless, not my will, but yours be done.’\n\nIt happens when he is on the cross. His enemies throw one last insult at him. He is the King of Israel; let him come down from the cross now, and we will believe in him. 43 He trusts in God; let God deliver him now, if he wants to; Matt 27:42\n\nIt is almost an echo of the temptation ‘If you are the Son of God, throw yourself down; for it is written, “He will command his angels concerning you”, and “On their hands they will bear you up, so that you will not dash your foot against a stone.”’\n\nSo temptation, and his faithfulness in the face of temptation, is one of those threads that run through the story of Jesus.\n\nIn my own pilgrimage, I may not be able to identify with Jesus’ temptation to turn stones into bread or to throw myself off a high building. But I do know what it means for well meaning friends, with my best interests at heart, to question my faith, to question the path I am taking. I do know what it is like to wake in the middle of the night and wonder how I am going to cope, or watch over friends and loved ones facing great suffering and think ‘Where is God in this, does God actually care?’ I know what it is like to feel utterly powerless in the face of outright mockery.\n\nIt is as I reflect on these other temptations of Jesus, Son of God and truly man, that I suddenly realise a fundamental truth that lies at the heart of my Christian faith. There is nothing, no temptation, no anxiety or doubt that I have to face in this life that I face utterly alone. This is where the passage from the Letter to the Hebrews that I have included in a text box on the front of your lesson sheet really speaks to me.\n\n15 For we do not have a high priest who is unable to sympathize with our weaknesses, but we have one who in every respect has been tested as we are, yet without sin. 16 Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Heb 4:15,16\n\nJesus, our great high priest, knows, really knows, what it is like to be me. He knows what it is like to be alone, what it is like to be tempted, to be undermined, to be misunderstood. He knows what it is like to be afraid, to feel rejection, to suffer, even to face death itself.\n\nLet us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent12017.txt",
        "raw_ocr_content": "Page 1 of 4\nLENT 1 – 2017 – Year A\nWe have now entered the season of Lent. One of the themes of Lent is this\nwhole area of Temptation, we think of Jesus fasting and facing temptation in\nthe wilderness and our own struggles in this whole area. This morning our Old\nTestament Lesson centres on the temptation in the Garden of Eden and our\nGospel reading speaks of Jesus in the wilderness.\nThese passages touch on far more than individual temptations – eat the fruit of\nthis tree; turn these stones into bread. They are about undermining, chipping\naway at a relationship with God.\n‘Did God say ……?’\nDoubt creeps in. ‘Why shouldn’t I? No harm trying.’\nAnd so is introduced the Biblical concept of Fall – a separation between God\nand his creation. We get this idea of brokenness, of disjointedness, of distance.\nSin, at its heart, is not about this naughty deed or that naughty deed to be\nrhymed off before God, it is about a breakdown of a relationship. In the Old\nTestament this is played out in a saga of God reaching out to man, to a\nparticular family, to a particular nation in the call of Abram, in the redemption\nof people slavery in Egypt. This is developed in the giving of the law and, with\nthat, times of faithfulness and times of abject failure, with the nation, having\nturned its back on God’s purposes, facing hardship, exile. It is almost like the\nstory of a dysfunctional family.\nOur Gospel reading tells of a similar attempt to undermine a relationship with\nGod that we saw in the Garden of Eden. We find Jesus in the wilderness, fresh\nPage 2 of 4\nLENT 1 – 2017 – Year A\nfrom his experience of Baptism by John the Baptist, and with it the affirmation\nby God, ‘This is my son, my beloved ….’\nIn the stillness of the desert, as he contemplates his future, there comes the\nvoice of temptation:\n‘If you are the Son of God …?’ Are you really? Are you putting your neck on\nthe line for an illusion?\n‘If you are the Son of God …?’\n‘Turn these stones into bread ……….throw yourself down …..’\n‘Do you really need to go through with this fasting nonsense ……… Do\nsomething spectacular …….that will draw the crowds ………’\nAs I say there is an attempt to chip away at the close relationship between\nJesus and the Father – but Jesus stays firm, committing himself to the path he is\ncalled to follow.\nWhen we think of Jesus being tempted, we can think of it simply in terms of\nwhat is happening in our Gospel story, a once off event that wasn’t going to\ntrouble him again. But as we look through the Gospel narratives we see that\nthis is actually a recurring theme.\nIt happens when, after Peter has confessed him as the Christ, Jesus talks of his\ncoming suffering and death. Peter you recall, jumps in to say that this must\nnever happen to him. What does Jesus say? ‘Get behind me Satan’.\nTemptation comes even in the well meaning words of a trusted friend.\nPage 3 of 4\nLENT 1 – 2017 – Year A\nIt happens in the Garden of Gethsemane, as Jesus agonises over what lies\nahead in the coming hours. ‘Father, let this cup pass from me.’ We see a Jesus\nnot immune from the full spectrum of human emotion in the face of coming\ntrial. But he continues; ‘Nevertheless, not my will, but yours be done.’\nIt happens when he is on the cross. His enemies throw one last insult at him.\nHe is the King of Israel; let him come down from the cross now, and\nwe will believe in him. 43 He trusts in God; let God deliver him now,\nif he wants to; Matt 27:42\nIt is almost an echo of the temptation\n‘If you are the Son of God, throw yourself down; for it is written, “He\nwill command his angels concerning you”,\nand “On their hands they will bear you up,\nso that you will not dash your foot against a stone.”’\nSo temptation, and his faithfulness in the face of temptation, is one of those\nthreads that run through the story of Jesus.\nIn my own pilgrimage, I may not be able to identify with Jesus’ temptation to\nturn stones into bread or to throw myself off a high building. But I do know\nwhat it means for well meaning friends, with my best interests at heart, to\nquestion my faith, to question the path I am taking. I do know what it is like to\nwake in the middle of the night and wonder how I am going to cope, or watch\nover friends and loved ones facing great suffering and think ‘Where is God in\nthis, does God actually care?’ I know what it is like to feel utterly powerless in\nthe face of outright mockery.\nIt is as I reflect on these other temptations of Jesus, Son of God and truly man,\nthat I suddenly realise a fundamental truth that lies at the heart of my Christian\nPage 4 of 4\nLENT 1 – 2017 – Year A\nfaith. There is nothing, no temptation, no anxiety or doubt that I have to face\nin this life that I face utterly alone. This is where the passage from the Letter to\nthe Hebrews that I have included in a text box on the front of your lesson sheet\nreally speaks to me.\n15 For we do not have a high priest who is unable to sympathize with\nour weaknesses, but we have one who in every respect has been tested\nas we are, yet without sin. 16 Let us therefore approach the throne of\ngrace with boldness, so that we may receive mercy and find grace to\nhelp in time of need. Heb 4:15,16\nJesus, our great high priest, knows, really knows, what it is like to be me. He\nknows what it is like to be alone, what it is like to be tempted, to be\nundermined, to be misunderstood. He knows what it is like to be afraid, to feel\nrejection, to suffer, even to face death itself.\nLet us therefore approach the throne of grace with boldness, so that we may\nreceive mercy and find grace to help in time of need."
    }
}