{
    "title": "Temptation and Faith",
    "date": "2019-03-10",
    "blurb": "This sermon discusses the personal experience of temptation and how it relates to Christian faith and discipleship. It emphasizes the importance of free will and personal responsibility in making moral decisions. The sermon also highlights the role of faith in overcoming temptation, drawing on biblical examples of encounters with God in the wilderness.",
    "raw_text": "1st Sunday of Lent – 2019 – year C\n\nLast Wednesday, as Elke and I were preparing the pizza that is served at the start of each of our Confirmation classes (the youngsters have just come direct from the Burrow School), Elke proceeded to prepare a serving of popcorn in the microwave. This was put into a bowl in the centre of the table with a note placed over it ‘Do not touch!’ It was interesting to watch their reaction. Hands reached out and then pulled back. In the course of the class, we got them to talk about their feelings, their reactions. It wasn’t a very dramatic temptation. It would not have mattered if the popcorn had not been there – they didn’t actually need it. There was that ongoing experience of temptation, that nagging feeling. There is nothing earth shattering or life changing about this experience. Our Gospel reading, telling as it does of the temptations of Jesus in the wilderness, set me thinking about those more fundamental moments of indecision that we all face in life, the experience of temptation.\n\nI just want to think about temptation and our experience of it, how we deal with it, in the context of our Christian faith and discipleship. Does this mean that we descend into a mire of inadequacy, failure and guilt? For I often think that for a community that has at its heart a message of forgiveness and redemption we do guilt very well.\n\nFirst of all temptation is a very personal experience. It impinges on me as an individual not a community. It is a consequence of free will – I am a free moral agent, with responsibility for my own decisions. As I contemplate the choices before me, I experience as an inner tension within myself, as I am torn between different options available to me, between right and wrong, between black and white, or sometimes between different shades of grey.\n\nWhere is that battle fought and with whom is it fought? That lovely practical letter of James has a lovely insight into this whole issue He wrote: ‘One is tempted by one’s own desire.’ It is not God or anyone else leading us astray. It is that part of my nature, that self focussed inner me that is at odds with God. It is this choice that lies at the heart of free will; a choice to go with God, to grow in his likeness, or to stay with self and the priorities of self.\n\nSometimes that can be a real struggle, as Paul recalls from his own experience in his letter to the Romans\n\n> So I find it to be a law that when I want to do what is good, evil lies close at hand. 22 For I delight in the law of God in my inmost self, 23 but I see in my members another law at war with the law of my mind, making me captive to the law of sin that dwells in my members. 24 Wretched man that I am! Who will rescue me from this body of death? 25 Thanks be to God through Jesus Christ our Lord. Rom 7:21-25\n\nWe sometimes find ourselves in a very lonely place. But then I remind myself that the wilderness in our Gospel reading was a very lonely place. Frequently in the Bible the wilderness is a place of encounter; encounter between God and Moses, God and Elijah. Wilderness is also the place of Christ, the setting for his temptations but also the place to which he resorted for prayer.\n\nThe words that we translate as temptation and testing come at three crucial points in the Gospels. There is the temptation of Jesus in the wilderness. It also occurs in the accounts of Gethsemene as Jesus tells the disciples, ‘Pray that you may not into the time of trial; the spirit is indeed willing but the flesh is weak.’ Matt 26:41 But it also features in the Lord’s Prayer:\n\n> ‘And forgive us our sins, for we ourselves forgive everyone indebted to us. And do not bring us to the time of trial.' Luke 11:4\n\nDo not bring us to the time of trial, which in the version we use in our services is rendered ‘lead us not into temptation’. But let’s stay with that ‘do not bring us to the time of trial’. May I not get to the point at which my faith is tested to breaking point, the time at which I feel utterly helpless, utterly alone. That is what Jesus told the disciples to pray at Gethsemene, that is the timeless lesson he teaches in the words of the Lord’s Prayer. The prayer he leaves us directs us towards the answer, away from self and towards the one, who made us, who calls us, who comes to meet us.\n\nElijah fled to the desert. The noise of wind and clatter of rocks fed his fear and vulnerability, his sense of being alone and defenceless in the face of all the forces against him. It is in the still small voice he felt the power and presence of God and found the power to go out and resume the mission to which God had called him.\n\nIn that passage I quoted from Paul’s letter to the Romans; it is even as he rails against his weakness in the face of temptation, as he asks who will save him from that body of sin and death, that he suddenly discovers that he is not alone.. The one who met him on the road as he headed for Damascus intent on persecuting the followers of Christ; the one who encountered disillusioned and frightened men fleeing Jerusalem, hopes shattered by the Cross. He is the one who is there for us, beside us as we grapple with the varied choices in our lives, inspiring us to faithfulness, ready to help us rebuild in our times of weakness and failure, leading us onward, upward into life.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent12029.txt",
        "raw_ocr_content": "Page 1 of 3\n1st Sunday of Lent – 2019 – year C\nLast Wednesday, as Elke and I were preparing the pizza that is served at the\nstart of each of our Confirmation classes (the youngsters have just come direct\nfrom the Burrow School), Elke proceeded to prepare a serving of popcorn in\nthe microwave. This was put into a bowl in the centre of the table with a note\nplaced over it ‘Do not touch!’ It was interesting to watch their reaction. Hands\nreached out and then pulled back. In the course of the class, we got them to\ntalk about their feelings, their reactions. It wasn’t a very dramatic temptation.\nIt would not have mattered if the popcorn had not been there – they didn’t\nactually need it. There was that ongoing experience of temptation, that\nnagging feeling. There is nothing earth shattering or life changing about this\nexperience. Our Gospel reading, telling as it does of the temptations of Jesus\nin the wilderness, set me thinking about those more fundamental moments of\nindecision that we all face in life, the experience of temptation.\nI just want to think about temptation and our experience of it, how we deal with\nit, in the context of our Christian faith and discipleship. Does this mean that\nwe descend into a mire of inadequacy, failure and guilt? For I often think that\nfor a community that has at its heart a message of forgiveness and redemption\nwe do guilt very well.\nFirst of all temptation is a very personal experience. It impinges on me as an\nindividual not a community. It is a consequence of free will – I am a free moral\nagent, with responsibility for my own decisions. As I contemplate the choices\nbefore me, I experience as an inner tension within myself, as I am torn between\ndifferent options available to me, between right and wrong, between black and\nwhite, or sometimes between different shades of grey.\nWhere is that battle fought and with whom is it fought? That lovely practical\nletter of James has a lovely insight into this whole issue He wrote: ‘One is\ntempted by one’s own desire.’ It is not God or anyone else leading us astray.\nPage 2 of 3\n1st Sunday of Lent – 2019 – year C\nIt is that part of my nature, that self focussed inner me that is at odds with God.\nIt is this choice that lies at the heart of free will; a choice to go with God, to\ngrow in his likeness, or to stay with self and the priorities of self.\nSometimes that can be a real struggle, as Paul recalls from his own experience\nin his letter to the Romans\nSo I find it to be a law that when I want to do what is good,\nevil lies close at hand. 22 For I delight in the law of God in my\ninmost self, 23 but I see in my members another law at war\nwith the law of my mind, making me captive to the law of sin\nthat dwells in my members. 24 Wretched man that I am! Who\nwill rescue me from this body of death? 25 Thanks be to God\nthrough Jesus Christ our Lord. Rom 7:21-25\nWe sometimes find ourselves in a very lonely place. But then I remind myself\nthat the wilderness in our Gospel reading was a very lonely place. Frequently\nin the Bible the wilderness is a place of encounter; encounter between God\nand Moses, God and Elijah. Wilderness is also the place of Christ, the setting\nfor his temptations but also the place to which he resorted for prayer.\nThe words that we translate as temptation and testing come at three crucial\npoints in the Gospels. There is the temptation of Jesus in the wilderness. It\nalso occurs in the accounts of Gethsemene as Jesus tells the disciples, ‘Pray\nthat you may not into the time of trial; the spirit is indeed willing but the flesh\nis weak.’ Matt 26:41 But it also features in the Lord’s Prayer:\n‘And forgive us our sins,\nfor we ourselves forgive everyone indebted to us.\nAnd do not bring us to the time of trial.\" Luke 11:4\nDo not bring us to the time of trial, which in the version we use in our services\nis rendered ‘lead us not into temptation’. But let’s stay with that ‘do not bring\nus to the time of trial’. May I not get to the point at which my faith is tested to\nbreaking point, the time at which I feel utterly helpless, utterly alone. That is\nPage 3 of 3\n1st Sunday of Lent – 2019 – year C\nwhat Jesus told the disciples to pray at Gethsemene, that is the timeless lesson\nhe teaches in the words of the Lord’s Prayer. The prayer he leaves us directs\nus towards the answer, away from self and towards the one, who made us,\nwho calls us, who comes to meet us.\nElijah fled to the desert. The noise of wind and clatter of rocks fed his fear\nand vulnerability, his sense of being alone and defenceless in the face of all\nthe forces against him. It is in the still small voice he felt the power and\npresence of God and found the power to go out and resume the mission to\nwhich God had called him.\nIn that passage I quoted from Paul’s letter to the Romans; it is even as he rails\nagainst his weakness in the face of temptation, as he asks who will save him\nfrom that body of sin and death, that he suddenly discovers that he is not\nalone.. The one who met him on the road as he headed for Damascus intent\non persecuting the followers of Christ; the one who encountered disillusioned\nand frightened men fleeing Jerusalem, hopes shattered by the Cross. He is the\none who is there for us, beside us as we grapple with the varied choices in our\nlives, inspiring us to faithfulness, ready to help us rebuild in our times of\nweakness and failure, leading us onward, upward into life."
    }
}