{
    "title": "Journey of Covenant",
    "date": "2016-03-20",
    "blurb": "This sermon discusses the theme of 'Covenant' that has been followed throughout the Lent season. It explores the relationship between God and man, the promises and commitments made, and the recurring theme of failure and reconciliation. The sermon also highlights the journey of the people in and out of promise, and the enduring hope rooted in the belief that God is with his people, even in his apparent absence.",
    "raw_text": "Over the season of Lent this year, we've been following a theme that has been running through the Old Testament Lessons appointed to be read each Sunday - that of Covenant. We started thinking of Covenant in terms of relationship between God and man that developed from the basic Covenant with Noah between God and man through to the Covenant with Abram, subsequently reaffirmed with Isaac and Jacob. We then went on to think of Covenant in terms of promises and commitment - the promise of descendants, the promise of land. Another theme that runs through the Old Testament is that of failure, as the people fall away from their commitment to the Covenant, and reconciliation - we spoke of God as a God of fresh starts, of new beginnings.\n\nToday I want to pick up on another theme that has been running through our story - that of journey, or a series of journeys:\n\n- that of Abram, called to journey to the land of Canaan.\n- in the time of famine in the land, in the story of Jacob and Joseph, there is the journey down into Egypt.\n- then in the time of Moses, there is the journey out of slavery and back into the promised land.\n- in the 8th century, in the period of the great prophets, as the people came to put their trust in foreign alliances that turned sour, there came the fall of Jerusalem and the journey into Exile.\n\nThere was if you like, on the part of the people, a journey in and out of promise.\n\nThen at different points in the Biblical story there is the prospect of hope. Writing to a people languishing in Exile, the prophet Isaiah speaks of new beginnings, of a fresh start. To a people who had experienced the desolation of the destruction of Jerusalem, the bitterness of Exile, who thought that God was no longer there any more, the prophet declares:\n\n> 13 Sing for joy, O heavens, and exult, O earth;\n> break forth, O mountains, into singing!\n> For the LORD has comforted his people,\n> and will have compassion on his suffering ones.\n> 14 But Zion said, \"The LORD has forsaken me,\n> my Lord has forgotten me.\"\n> 15 Can a woman forget her nursing child,\n> or show no compassion for the child of her womb?\n> Even these may forget,\n> yet I will not forget you.\n> 16 See, I have inscribed you on the palms of my hands;\n> your walls are continually before me. Is 49:14-15\n\nOne of the features of the Covenant journey is hope, a hope that has its roots in the conviction that even in his apparent absence, God is with his people. Hope is essentially focused on the future.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent52016not used.txt",
        "raw_ocr_content": "Over the season of Lent this year, we’ve been following a theme that has been\nrunning through the Old Testament Lessons appointed to be read each Sunday\n– that of Covenant. We started thinking of Covenant in terms of relationship\nbetween God and man that developed from the basic Covenant with Noah\nbetween God and man through to the Covenant with Abram, subsequently\nreaffirmed with Isaac and Jacob. We then went on to think of Covenant in\nterms of promises and commitment – the promise of descendants, the promise\nof land. Another theme that runs through the Old Testament is that of failure,\nas the people fall away from their commitment to the Covenant, ad\nreconciliation – we spoke of God as a God of fresh starts, of new beginnings.\nToday I want to pick up on another theme that has been running through our\nstory – that of journey, or a series of journeys:\nthat of Abram, called to journey to the land of Canaan.\nin the time of famine in the land, in the story of Jacob and Joseph, there is\nthe journey down into Egypt.\nthen in the time of Moses, there is the journey out of slavery and back\ninto the promised land.\nin the 8th century, in the period of the great prophets, as the people came\nto put their trust in foreign alliances that turned sour, there came the fall\nof Jerusalem and the journey into Exile.\nThere was if you like, on the part of the people, a journey in and out of\npromise.\nThen at different points in the Biblical story there is the prospect of hope.\nWriting to a people languishing in Exile, the prophet Isaiah speaks of new\nbeginnings, of a fresh start. To a people who had experienced the desolation of\nthe destruction of Jerusalem, the bitterness of Exile, who thought that God was\nno longer there any more, the prophet declares:\n13 Sing for joy, O heavens, and exult, O earth;\nbreak forth, O mountains, into singing!\nFor the LORD has comforted his people,\nand will have compassion on his suffering ones.\n14 But Zion said, \"The LORD has forsaken me,\nmy Lord has forgotten me.\"\n15 Can a woman forget her nursing child,\nor show no compassion for the child of her womb?\nEven these may forget,\nyet I will not forget you.\n16 See, I have inscribed you on the palms of my hands;\nyour walls are continually before me. Is 49:14-15\nOne of the features of the Covenant journey is hope, a hope that has its roots in\nthe conviction that even in his apparent absence, God is with his people. Hope\nis essentially focussed on the future"
    }
}