{
    "title": "Faith Amidst Trials",
    "date": "2010-02-28",
    "blurb": "The sermon discusses the enduring faith of individuals despite life's trials and tribulations. It emphasizes that belief in God does not insulate us from hardships but equips us with the courage and hope to face them. The sermon draws on the story of Abraham and Sophie O’Neill, demonstrating that faith is not an escape from reality but a means to engage with God amidst everyday challenges.",
    "raw_text": "It is strange how little incidents stay with you – memories of events from the past that have a habit of coming back to surface from time to time. During the week, in the course of the Confirmation Group, Shaz and I were talking to the youngsters about faith not just in the good times of life but also in the harder times. As we were talking my mind went back to Finglas in the early 1980’s and a Mrs Sophie O’Neill. At that stage Sophie was well into her 80’s. She had married late, had one son John, who had Downe’s Syndrome. She had been widowed not long after John had been born. Life had been hard in Dublin in the 40’s and the 50’s as she had reared her son. She and John were always seen together – she looked after him until just before she died. I visited her in her house one cold winter night not long before she died. The house was run down, drab and cold. John had been sent out to the kitchen to make a cup of tea for us – out of the blue she looked me straight in the eye and said, ‘You know, Mr Brew, God is good.’\n\n'God is good.' Everything in that house seemed to say otherwise – the cold, the hardship, early widowhood, anxiety about John’s future when anything happened to her – but the eyes and the whole expression told me this was not empty platitude, this came straight from the heart. Sophie O’Neill knew that 'God is good' – she knew that not despite her experiences of life but in and through her experiences of life.\n\nBelief in God, faith in God, indeed life dedicated to God does not insulate us from trial and tribulation.\n\nThis ties in with part of the message of our Psalm for today, Psalm 27. One of the primary lessons of the psalms is this; 'Faith in God does not remove difficulties but rather equips God’s people to live with courage and hope' Indeed this is one of the strands that runs through the whole story of Abraham that we are reading from at the minute in our Old Testament Lessons. The story begins with his experience of call to leave his homeland and travel to a strange land. With the call comes the promise of descendants – descendants that never seem to come. Then when his long expected son finally does arrive there is that deeply perplexing episode in which he is asked to give him up in sacrifice. Throughout the whole story Abraham lives with the apparent contradiction between what God has promised and what he is experiencing in real life.\n\nOur Old Testament Lesson begins with God assuring Abram:\n\n'Do not be afraid, Abram.\nI am your shield,\nyour very great reward.'\n\nAbram comes back:\n\n, 'O Sovereign LORD, what can you give me since I remain childless You have given me no children; so a servant in my household will be my heir.'\n\nGod reaffirms the promise of land but Abraham still asks: 'O Sovereign LORD, how can I know that I shall gain possession of it?' That is a question that comes to all of us at some stage or another, 'Lord, how can I know?'\n\nBut all through 'Abraham believed and it was credited to him as righteousness.' Abram’s faith was not an escape from reality, rather it was faith lived with all the ambiguity and uncertainty of our mortal life. Even as he wrestles with the difficulties and uncertainties, Abram knows God’s presence, knows that God is there as one to whom he can come, one with whom he can share all his doubts and uncertainties, most of all one in whom he can trust.\n\nIn time Abram and Sarai will have their longed for son. Along the road their faith will waver as, desperate for a child they try to force the pace by having a child through Sarai’s maidservant Hagar. But in the course of time Isaac is born and Abram experiences God’s faithfulness.\n\nWe are able to look at all this from the perspective of the end; when we see the birth of Isaac, when we see the promise fulfilled. But in our own personal walk with God, like Abram we find ourselves in the middle of the story. There are those times when God seems just not to be there, times when we feel very alone – times when we feel like crying out with the Psalmist; 'My God, my God – why have you abandoned me?' There is something painfully honest about that cry. There are no pretensions; there is no false piety – just a piercing honesty before God. But if we are to read on it that psalm (and it is well worth it) we discover a man on a journey of faith. Now that all the pretensions to piety are gone, now that all the defences are down, the psalmist comes to recognise God’s faithfulness in the past to his forefathers: They cried to you and were saved.’ Then a black despair seems to sweep over him again and he cries; 'I am a worm and no man'. But hope keeps bubbling to the surface; 'Yet you brought me out of my mother’s womb, you have been my God.'\n\nare further cycles of hope and despair; then as this 22nd psalm draws to a close he declares:\n\n'From you comes the theme of my prayer in the great assembly …'\n\n'All the ends of the earth will remember and turn to the Lord …'\n\n'They will proclaim his righteousness to a people yet unborn – for he has done it.'\n\nThe message that comes to me as I reflect on all this, that visit to Sophie O’Neill that cold winter’s night, the story of Abram and Sarai as they lived with the promise and the disappointments, the message of today’s Psalm as well as Ps 22, is that a living faith in a living God is no escape from reality – rather it is an engagement with that same living God as we encounter and grapple with the realities of everyday living. In that engagement I come to see my present difficulties and problems within the context of a living God who in Christ promised to be with me to the very close fo the age.\n\nThat I think is why Sophie O’Neill could look me straight in the eye that night and say:\n\n'You know, Mr Brew, God is good.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent22010.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 2 – Year C – 2010\nIt is strange how little incidents stay with you – memories of events from the past that\nhave a habit of coming back to surface from time to time. During the week, in the course\nof the Confirmation Group, Shaz and I were talking to the youngsters about faith not just\nin the good times of life but also in the harder times. As we were talking my mind went\nback to Finglas in the early 1980’s and a Mrs Sophie O’Neill. At that stage Sophie was\nwell into her 80’s. She had married late, had one son John, who had Downe’s Syndrome.\nShe had been widowed not long after John had been born. Life had been hard in Dublin in\nthe 40’s and the 50’s as she had reared her son. She and John were always seen together –\nshe looked after him until just before she died. I visited her in her house one cold winter\nnight not long before she died. The house was run down, drab and cold. John had been\nsent out to the kitchen to make a cup of tea for us – out of the blue she looked me straight\nin the eye and said, ‘You know, Mr Brew, God is good.’\n‘God is good.’ Everything in that house seemed to say otherwise – the cold, the hardship,\nearly widowhood, anxiety about John’s future when anything happened to her – but the\neyes and the whole expression told me this was not empty platitude, this came straight\nfrom the heart. Sophie O’Neill knew that ‘God is good’ – she knew that not despite her\nexperiences of life but in and through her experiences of life.\nBelief in God, faith in God, indeed life dedicated to God does not insulate us from trial\nand tribulation.\nThis ties in with part of the message of our Psalm for today, Psalm 27. One of the primary\nlessons of the psalms is this; ‘Faith in God does not remove difficulties but rather equips\nGod’s people to live with courage and hope’ Indeed this is one of the strands that runs\nthrough the whole story of Abraham that we are reading from at the minute in our Old\nTestament Lessons. The story begins with his experience of call to leave his homeland\nand travel to a strange land. With the call comes the promise of descendants –\ndescendants that never seem to come. Then when his long expected son finally does arrive\nPage 2 of 3\nLent 2 – Year C – 2010\nthere is that deeply perplexing episode in which he is asked to give him up in sacrifice.\nThroughout the whole story Abraham lives with the apparent contradiction between what\nGod has promised and what he is experiencing in real life.\nOur Old Testament Lesson begins with God assuring Abram:\n“Do not be afraid, Abram.\nI am your shield,\nyour very great reward.”\nAbram comes back:\n, “O Sovereign LORD, what can you give me since I remain childless You have given me\nno children; so a servant in my household will be my heir.”\nGod reaffirms the promise of land but Abraham still asks: “O Sovereign LORD, how can I\nknow that I shall gain possession of it?”. That is a question that comes to all of us at some\nstage or another, ‘Lord, how can I know?’\nBut all through ‘Abraham believed and it was credited to him as righteousness.’ Abram’s\nfaith was not an escape from reality, rather it was faith lived with all the ambiguity and\nuncertainty of our mortal life. Even as he wrestles with the difficulties and uncertainties,\nAbram knows God’s presence, knows that God is there as one to whom he can come, one\nwith whom he can share all his doubts and uncertainties, most of all one in whom he can\ntrust.\nIn time Abram and Sarai will have their longed for son. Along the road their faith will\nwaver as, desperate for a child they try to force the pace by having a child through Sarai’s\nmaidservant Hagar. But in the course of time Isaac is born and Abram experiences God’s\nfaithfulness.\nWe are able to look at all this from the perspective of the end; when we see the birth of\nIsaac, when we see the promise fulfilled. But in our own personal walk with God, like\nAbram we find ourselves in the middle of the story. There are those times when God\nseems just not to be there, times when we feel very alone – times when we feel like crying\nPage 3 of 3\nLent 2 – Year C – 2010\nout with the Psalmist; ‘My God, my God – why have you abandoned me?’ There is\nsomething painfully honest about that cry. There are no pretensions; there is no false\npiety – just a piercing honesty before God. But if we are to read on it that psalm (and it is\nwell worth it) we discover a man on a journey of faith. Now that all the pretensions to\npiety are gone, now that all the defences are down, the psalmist comes to recognise God’s\nfaithfulness in the past to his forefathers: They cried to you and were saved.’ Then a\nblack despair seems to sweep over him again and he cries; ‘I am a worm and no man’. But\nhope keeps bubbling to the surface; ‘Yet you brought me out of my mother’s womb, you\nhave been my God.’\nare further cycles of hope and despair; then as this 22nd psalm draws to a close he\ndeclares:\n‘From you comes the theme of my prayer in the great assembly …’\n‘All the ends of the earth will remember and turn to the Lord …..’\n‘They will proclaim his righteousness to a people yet unborn – for he has done it.’\nThe message that comes to me as I reflect on all this, that visit to Sophie O’Neill that cold\nwinter’s night, the story of Abram and Sarai as they lived with the promise and the\ndisappointments, the message of today’s Psalm as well as Ps 22, is that a living faith in a\nliving God is no escape from reality – rather it is an engagement with that same living God\nas we encounter and grapple with the realities of everyday living. In that engagement I\ncome to see my present difficulties and problems within the context of a living God who in\nChrist promised to be with me to the very close fo the age.\nThat I think is why Sophie O’Neill could look me straight in the eye that night and say:\n‘You know, Mr Brew, God is good.’"
    }
}