{
    "title": "Transfiguration: A Different Angle",
    "date": "2021-02-28",
    "blurb": "In this sermon, Kevin explores the concept of Transfiguration and encourages the congregation to look at Jesus from a different angle. He emphasizes that Jesus is not just a teacher, but God's beloved Son, and His teachings should change the way we act, think, and live. This new perspective also changes how we view ourselves and others, highlighting our potential as beings made in God's image.",
    "raw_text": "I just want to start with a puzzle. At this point would everyone unmute. It is one of those number sequences.\n\nTake a look at it and I’ll start the clock. See if anyone gets it before the clock stops – just shout out if you get it. I didn’t get it when I first saw it! You solve it not by complex mathematical calculation. You solve it by looking at it from a different angle – once you do that you get the sequence.\n\nOur lesson was Mark’s account of the Transfiguration – that otherworldly account of the experience of the disciples seeing Jesus’ appearance changed on the mountaintop. What exactly are we to make of all this? What exactly are we talking about? As our puppet display showed, big words can sometimes confuse rather explain.\n\nI look at it this way. Up to now the disciples had been following Jesus as a teacher, a man who had a way of connecting with people. In the Transfiguration, in whatever it was that they experienced that day, they sense God telling them to look at Jesus differently, from a different angle. ‘This is my beloved Son, listen to him.’\n\nJesus is not just one more engaging teacher among others, he is God’s beloved Son. We are not just to admire who he is and what he says, we are to listen. The characters in the puppet show spoke of authority. What he says, what he teaches he says with authority. We are not just to listen to what he says, we are to do what he says. We are to let his teaching actually change the way we act, the way we think, the way we live.\n\nThat means looking at Jesus from a different angle will mean that we start looking at other things from a different angle. We start looking at ourselves from a different angle. The Bible talks of us being made in the image of God but that image being blurred by our selfishness, our indifference (what people call sin). In Jesus we see what man, what you and I, what being made in God’s image is meant be. Not only shows us but in his life, in his death and resurrection enables us to be.\n\nThat changes the way we look at other people. Jesus, in one of his parables, the parable of the sheep and the goats, talks of people who look after the lonely, the poor, the sick, the prisoners and says ‘as much look after the lonely, the poor, the sick, the prisoners and says ‘as you did it to the least of these my brothers and sisters, you did it to me.’\n\nI started with this puzzle. Once you look at it from a different angle it all becomes clear. In the Transfiguration, the disciples were taught to look at Jesus from a different angle. He was not just their teacher, he was their Lord – and they would follow him and bear witness to him to the very end of their lives.\n\nPrayer of St Ignatius\n\n> Teach us, good Lord, to serve thee as thou deservest;\n> To give, and not to count the cost,\n> to fight, and not to heed the wounds,\n> to toil, and not to seek for rest,\n> to labour, and not to ask for any reward,\n> save that of knowing that we do thy will.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent22021 Family Service.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 2 – Year B (Transfiguration) – 2021 – Family Service\nI just want to start with a puzzle. At this point would everyone un\nmute. It is one of those number sequences.\nShow slide\nTake a look at it and I’ll start the clock.\nSee if anyone gets it before the clock stops – just shout out if you get\nit.\nI didn’t get it when I first saw it!\nYou solve it not by complex mathematical calculation. You solve it\nby looking at it from a different angle – once you do that you get the\nsequence.\nNext slide\nOur lesson was Mark’s account of the Transfiguration – that\notherworldly account of the experience of the disciples seeing Jesus’\nappearance changed on the mountaintop.\nWhat exactly are we to make of all this? What exactly are we talking\nabout? As our puppet display showed, big words can sometimes\nconfuse rather explain.\nI look at it this way. Up to now the disciples had been following Jesus\nas a teacher, an man who had a way of connecting with people.\nPage 2 of 3\nLent 2 – Year B (Transfiguration) – 2021 – Family Service\nIn the Transfiguration, in whatever it was that they experienced that\nday, they sense God telling them to look at Jesus differently, from a\ndifferent angle. ‘This is my beloved Son, listen to him.’\nJesus is not just one more engaging teacher among others, he is God’s\nbeloved Son. We are not just to admire who he is and what he says,\nwe are to listen. The characters in the puppet show spoke of authority.\nWhat he says, what he teaches he says with authority. We are not just\nto listen to what he says, we are to do what he says. We are to let his\nteaching actually change the way we act, the way we think, the way\nwe live.\nThat means looking at Jesus from a different angle will mean that we\nstart looking at other things from a different angle. We start looking\nat ourselves from a different angle. The Bible talks of us being made\nin the image of God but that image being blurred by our selfishness,\nour indifference (what people call sin). In Jesus we see what man,\nwhat you and I, what being made in God’s image is meant be. Not\nonly shows us but in his life, in his death and resurrection enables us\nto be.\nPage 3 of 3\nLent 2 – Year B (Transfiguration) – 2021 – Family Service\nThat changes the way we look at other people. Jesus, in one of his\nparables, the parable of the sheep and the goats, talks of people who\nlook after the lonely, the poor, the sick, the prisoners and says ‘as\nmuch look after the lonely, the poor, the sick, the prisoners and says\n‘as you did it to the least of these my brothers and sisters, you did it to\nme.’\nI started with this puzzle\nShow slide\nOnce you look at it from a different angle it all becomes clear.\nIn the Transfiguration, the disciples were taught to look at Jesus from\na different angle. He was not just their teacher, he was their Lord –\nand they would follow him and bear witness to him to the very end of\ntheir lives.\nPrayer of St Ignatius\nTeach us, good Lord, to serve thee as thou deservest;\nTo give, and not to count the cost,\nto fight, and not to heed the wounds,\nto toil, and not to seek for rest,\nto labour, and not to ask for any reward,\nsave that of knowing that we do thy will."
    }
}