{
    "title": "Journey of Reconciliation",
    "date": "2019-03-17",
    "blurb": "This sermon, delivered on St. Patrick's Day 2019, explores the journey of St. Patrick, from being a slave to becoming a beacon of the Gospel. It discusses how we respond when life goes wrong and emphasizes the importance of not retaliating but seeking reconciliation. The sermon also addresses the recent terrorist attack in New Zealand, condemning all forms of terrorism and urging listeners to stand alongside voices of reason and truth.",
    "raw_text": "Each morning I came down to breakfast in the Rectory in Ahoghill, as I filled the kettle for the first cup of tea, I would look out of the window and see Slemish Mountain in the distance. It was on Slemish that the young Patrick is reputed to have worked as a slave watching over sheep. He had been captured by pirates and transported from his native land. Sometimes Slemish was bathed in sunshine, sometimes covered in snow.\n\nFrom time to time I would think of Patrick, his experiences as a slave, treated as a nobody. I thought of him, having escaped from Ireland, returning to the land of his captivity, to bring the Gospel. That journey of return represents in itself a journey of reconciliation, putting behind past hurts.\n\nWe read as one of our lessons that lovely passage from Paul’s Second Letter to the Corinthians. My mind turns in particular to the words:\n\n> We are afflicted in every way, but not crushed; perplexed, but not driven to despair; persecuted, but not forsaken; struck down, but not destroyed; always carrying in the body the death of Jesus, so that the life of Jesus may also be made visible in our bodies. 2 Cor 4:8,9\n\nThat to me echoes my thoughts of Patrick, his hardships on the slopes of Slemish, cut off from family and community, and his return to the land of his oppressors to proclaim the Gospel of the love of God in Christ.\n\nThat set me thinking. How do we respond when life goes badly wrong; when we are hurt physically, mentally, spiritually by life? It is very natural to retreat into ourselves, to strike back. The period of violence in Northern Ireland was marked all too often by a series of tit-for-tat killings or bomb attacks in which an attack on one community was followed by an attack on the other, in which innocents suffered in order to maintain some sort of distorted balance of suffering. But this period was also marked by occasions of inspiration when victims would speak out of a deep rooted Christian conviction, calling for no retaliation, no more killing. The response of Gordon Wilson to the bombing on Remembrance Sunday in Enniskillen and the initiatives for reconciliation that came out of that would be the one that most frequently comes to mind.\n\nLast Friday, in an act of blind and evil hatred, 49 people died in an attack on two mosques in the New Zealand city of Christchurch. Quite by coincidence I was in the mosque in Clonskeagh for Friday prayers as part of a group visiting different places of worship of other faith communities in our city. The preacher could not but address the issue of the terrible events earlier in the day in New Zealand. In a trenchant condemnation of terrorism from whatever corner it comes, he first of all told his hearers that there can be no place for retribution in Islam. Referring not only to the attacker in New Zealand but also specifically referring to ISIS and other Islamic extremists he said again and again, ‘Terrorism has no faith.’ He also welcomed messages of support he had received from Christian and Jewish leaders in Ireland.\n\nIn a world of fake and distorted news, in which voices of extremism, those who for their own ends would promote division and suspicion between different groups in society, find their way into hearts and minds through social media, it is all the more important that we stand alongside voices of reason, voices of moderation, voices of truth in our society.\n\nTurning back to our lesson from 2nd Corinthians, in the chapter prior to the passage we read from, Paul refers to his readers as ‘letters of Christ’. I find that a very powerful image. You and I a letter of Christ, a letter from Christ. You and I a message to the world about us. We are not going to let voices of hatred, voices of half truth go unchallenged in the world of today. In us and through us Christ, the Gospel of Christ, his teaching of love, of reconciliation, of justice, of light in the face of darkness, of life in the face of death, might be made know in the world in which we live.\n\nLater this morning, in the sacrament of Baptism, as two children are signed with the sign of the cross, I will say:\n\n> Christ claims you for his own.\n> Receive the sign of the cross.\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n\nFinish the race, keep the faith. This is our calling, as ones baptised in the name of God, Father, Son and Holy Spirit. May we in our day, these children in the days to come, be letters from Christ to the world in which we live; that the voices of hatred, voices of half truth not go unchallenged in the world of today. That in us and through us the light of Christ may continue to shine.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent2stpatrick2019.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 2 – St Patrick’s Day – 2019\nEach morning I came down to breakfast in the Rectory in Ahoghill, as I filled\nthe kettle for the first cup of tea, I would look out of the window and see\nSlemish Mountain in the distance. It was on Slemish that the young Patrick is\nreputed to have worked as a slave watching over sheep. He had been captured\nby pirates and transported from his native land. Sometimes Slemish was\nbathed in sunshine, sometimes covered in snow.\nFrom time to time I would think of Patrick, his experiences as a slave, treated\nas a nobody. I thought of him, having escaped from Ireland, returning to the\nland of his captivity, to bring the Gospel. That journey of return represents in\nitself a journey of reconciliation, putting behind past hurts.\nWe read as one of our lessons that lovely passage from Paul’s Second Letter to\nthe Corinthians. My mind turns in particular to the words:\n8 We are afflicted in every way, but not crushed; perplexed, but not\ndriven to despair; 9 persecuted, but not forsaken; struck down, but not\ndestroyed; 10 always carrying in the body the death of Jesus, so that\nthe life of Jesus may also be made visible in our bodies. 2 Cor 4:8,9\nThat to me echoes my thoughts of Patrick, his hardships on the slopes of\nSlemish, cut off from family and community, and his return to the land of his\noppressors to proclaim the Gospel of the love of God in Christ.\nThat set me thinking. How do we respond when life goes badly wrong; when\nwe are hurt physically, mentally, spiritually by life? It is very natural to retreat\ninto ourselves, to strike back. The period of violence in Northern Ireland was\nmarked all too often by a series of tit-for-tat killings or bomb attacks in which\nan attack on one community was followed by an attack on the other, in which\nPage 2 of 3\nLent 2 – St Patrick’s Day – 2019\ninnocents suffered in order to maintain some sort of distorted balance of\nsuffering. But this period was also marked by occasions of inspiration when\nvictims would speak out of a deep rooted Christian conviction, calling for no\nretaliation, no more killing. The response of Gordon Wilson to the bombing on\nRemembrance Sunday in Enniskillen and the initiatives for reconciliation that\ncame out of that would be the one that most frequently comes to mind.\nLast Friday, in an act of blind and evil hatred, 49 people died in an attack on\ntwo mosques in the New Zealand city of Christchurch. Quite by coincidence I\nwas in the mosque in Clonskeagh for Friday prayers as part of a group visiting\ndifferent places of worship of other faith communities in our city. The\npreacher could not but address the issue of the terrible events earlier in the day\nin New Zealand. In a trenchant condemnation of terrorism from whatever\ncorner it comes, he first of all told his hearers that there can be no place for\nretribution in Islam. Referring not only to the attacker in New Zealand but also\nspecifically referring to ISIS and other Islamic extremists he said again and\nagain, ‘Terrorism has no faith.’ He also welcomed messages of support he had\nreceived from Christian and Jewish leaders in Ireland.\nIn a world of fake and distorted news, in which voices of extremism, those who\nfor their own ends would promote division and suspicion between different\ngroups in society, find their way into hearts and minds through social media, it\nis all the more important that we stand alongside voices of reason, voices of\nmoderation, voices of truth in our society.\nPage 3 of 3\nLent 2 – St Patrick’s Day – 2019\nTurning back to our lesson from 2nd Corinthians, in the chapter prior to the\npassage we read from, Paul refers to his readers as ‘letters of Christ’. I find\nthat a very powerful image. You and I a letter of Christ, a letter from Christ.\nYou and I a message to the world about us. We are not going to let voices of\nhatred, voices of half truth go unchallenged in the world of today. In us and\nthrough us Christ, the Gospel of Christ, his teaching of love, of reconciliation,\nof justice, of light in the face of darkness, of life in the face of death, might be\nmade know in the world in which we live.\nLater this morning, in the sacrament of Baptism, as two children are signed\nwith the sign of the cross, I will say:\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nFinish the race, keep the faith. This is our calling, as ones baptised in the name\nof God, Father, Son and Holy Spirit. May we in our day, these children in the\ndays to come, be letters from Christ to the world in which we live; that the\nvoices of hatred, voices of half truth not go unchallenged in the world of today.\nThat in us and through us the light of Christ may continue to shine."
    }
}