{
    "title": "Letter of Christ",
    "date": "2010-03-21",
    "blurb": "This sermon reflects on the life and teachings of St. Patrick, emphasizing his role as a 'letter of Christ' spreading the message of Christianity. It also discusses the journey of faith that young people embark on during their teenage years, and the importance of the church community in supporting them through this journey.",
    "raw_text": "Last Wednesday parades were held all over Ireland to celebrate St Patrick’s Day. It is a day of carnival, of celebration but behind it all, almost hidden by it all is the story of the evangelisation of the Irish people. Much has happened in the years since. The Church has known times of great spiritual growth in which this island has been truly blessed alongside times of great failure and hurt. But at all times there has been this figure of Patrick, himself a complex and very human figure, as a source of inspiration.\n\nOne of the views we enjoyed from the Rectory in Ahoghill was that of Slemish. The hill of Slemish, the core of a long dormant volcano, dominated the landscape around Ballymena. Situated just outside the village of Broughshane, it is reputed to be the spot where Patrick, who as a young man was captured from his home and family in Britain, served as a slave tending sheep. In the ‘Confessions’, reputed to be written by Patrick towards the end of his life, the saint speaks of that time in terms of a growing spiritual awakening, seeing it in terms of God disciplining him. After some six years of captivity, Patrick escaped and returned to England and to his family. He is trained for ministry, probably in France, though he always regards himself as having little learning.\n\nIn the course of his ‘Confessions’ he speaks of a sense of call to return to Ireland. He faced severe opposition form some within the Church who brought up his lack of learning and somewhat dubious lifestyle before his conversion. None the less he returns. His ministry is marked by times of success. He speaks with obvious pride in the numbers he brought to Baptism. There were the darker times, times of repeated brushes with death and imprisonment as well as an inner struggle to remain true to the Christ who had called him.\n\nI am left with a picture of a very human figure, aware of his failings yet feeling compelled to fulfil the ministry to which he had been called, aware that it is only by grace that he can fulfil it. There is an expression that occurs near the beginning of the ‘Confessions’ that has stood out for me and one that seemed to set the tone of the rest of the book. He described his own vocation, and that of any believer, to be ‘a letter of Christ bearing salvation to the uttermost parts of the world.’ Patrick in his own words – J Duffy – p 14).\n\nYou and I each called to be a letter of Christ; called to proclaim Christ, to witness to Christ, to be Christ.\n\nNext Sunday young people from this Parish and the Parish of Raheny will be confirmed by the Archbishop. At the heart of this Service they will make for themselves the promises of Baptism. We as a congregation will be witnesses, encouragers. It is not just a matter of being witnesses and encouragers next Sunday; we are called to stand alongside them in love and prayer and support in the days that will lie ahead.\n\nThese young people are about to enter their teenage years. These are strange, exciting, troubling, confusing, exhilarating, frustrating times for teenagers – and of course for their parents. It is an age of questioning, doubting, rebelling – a time of idealism, of selfishness, or generosity – a time of yearning to belong and be accepted and yet to be free of ties; a time of forming new, different relationships, a time when sexuality begins to kick in and with that the turmoil of emotions. A time of transition between childhood and adulthood, all the time buffeted by the many competing claims for their attention in this complicated, increasing secular and material world.\n\nNext Sunday they will make for themselves the promises of Confirmation and come forward to receive Holy Communion. In one sense they are not ready but then were any of us truly ready in heart and mind for that step. I suspect I am not alone in saying that my understanding of Baptism, of discipleship, of the Eucharist has developed and matured over the years. So they are being invited to join us on a life long journey of faith and discipleship. They are, if you like, being invited to become in themselves, ‘letters from Christ’ But who is to be a ‘letter from Christ’ to them?\n\nIn the portion we read from the letter of Paul to the Philippians we read:\n\n10I want to know Christ and the power of his resurrection and the sharing of his sufferings by becoming like him in his death, 11if somehow I may attain the resurrection from the dead.\n\nHow are they to know, how are they to encounter Christ? For that matter how are any of us to know and encounter Christ? We encounter Christ in one another as we allow Christ to live, to speak, to serve, to love in and through us. Young people drift away, drift away from family, from Church – in part that drift is a part and parcel of that whole process of questioning, doubting, rebelling that I was referring to earlier, that is so much part of that journey from child hood to adulthood. Parents have watched, sometimes helplessly, as children have gone off, made mistakes in education, in relationships and a host of other areas that they know they will regret in times to come. But they continue to love and watch over their children. God will continue to love and watch over each one of us, over each one of our children even though at times we might wonder away. Next Sunday we will watch as witnesses, as encouragers. As I said, it is not just a matter of being witnesses and encouragers next Sunday; we are called to stand alongside them in love and prayer and support in the days that will lie ahead as living signs of the love and concern of God for each one of them; to be a community that is open and welcoming; to be a community within which they can feel at home, within which they can continue their own spiritual pilgrimage, within which they can encounter Christ.\n\nThe early Celtic Church had a very strong sense of God, of Christ very much present in our midst, in the world around us and in one another. In the Breat Plate, an early Irish hymn attributed to St Patrick (no 322 in our book) we have a lovely expression of Christ accompanying, enfolding us, living within us as we travel the raod:\n\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\n\nPatrick spoke of himself, of all believers, as a ‘letter of Christ’. This is the Christ we are to take out into the world; this is the Christ who goes with us as we go out into the world. The Christ who emptied himself, who drew alongside the rejected, the despised, who turned the other cheek, who went the extra mile. This is the Christ we are encouraging our young people to follow, to show to the world at large. How can they follow, how can they show unless they have first met that Christ in us? And see in us a community that is shaped by the self giving, self emptying love of God in Christ, a community that is ‘a letter of Christ’ to the world, to one another, to them.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent52010.txt",
        "raw_ocr_content": "Page 1 of 4\nLent 5 – 2010 – year C\nSunday after St Patrick’s Day\nLast Wednesday parades were held all over Ireland to celebrate St Patrick’s Day. It is a\nday of carnival, of celebration but behind it all, almost hidden by it all is the story of the\nevangelisation of the Irish people. Much has happened in the years since. The Church has\nknown times of great spiritual growth in which this island has been truly blessed alongside\ntimes of great failure and hurt. But at all times there has been this figure of Patrick,\nhimself a complex and very human figure, as a source of inspiration.\nOne of the views we enjoyed from the Rectory in Ahoghill was that of Slemish. The hill\nof Slemish, the core of a long dormant volcano, dominated the landscape around\nBallymena. Situated just outside the village of Broughshane, it is reputed to be the spot\nwhere Patrick, who as a young man was captured from his home and family in Britain,\nserved as a slave tending sheep. In the ‘Confessions’, reputed to be written by Patrick\ntowards the end of his life, the saint speaks of that time in terms of a growing spiritual\nawakening, seeing it in terms of God disciplining him. After some six years of captivity,\nPatrick escaped and returned to England and to his family. He is trained for ministry,\nprobably in France, though he always regards himself as having little learning.\nIn the course of his ‘Confessions’ he speaks of a sense of call to return to Ireland. He\nfaced severe opposition form some within the Church who brought up his lack of learning\nand somewhat dubious lifestyle before his conversion. None the less he returns. His\nministry is marked by times of success. He speaks with obvious pride in the numbers he\nbrought to Baptism. There were the darker times, times of repeated brushes with death\nand imprisonment as well as an inner struggle to remain true to the Christ who had called\nhim.\nI am left with a picture of a very human figure, aware of his failings yet feeling compelled\nto fulfil the ministry to which he had been called, aware that it is only by grace that he can\nfulfil it. There is an expression that occurs near the beginning of the ‘Confessions’ that\nhas stood out for me and one that seemed to set the tone of the rest of the book. He\nPage 2 of 4\nLent 5 – 2010 – year C\nSunday after St Patrick’s Day\ndescribed his own vocation, and that of any believer, to be ‘a letter of Christ bearing\nsalvation to the uttermost parts of the world.’ Patrick in his own words – J Duffy – p 14).\nYou and I each called to be a letter of Christ; called to proclaim Christ, to witness to\nChrist, to be Christ.\nNext Sunday young people from this Parish and the Parish of Raheny will be confirmed by\nthe Archbishop. At the heart of this Service they will make for themselves the promises of\nBaptism. We as a congregation will be witnesses, encouragers. It is not just a matter of\nbeing witnesses and encouragers next Sunday; we are called to stand alongside them in\nlove and prayer and support in the days that will lie ahead.\nThese young people are about to enter their teenage years. These are strange, exciting,\ntroubling, confusing, exhilarating, frustrating times for teenagers – and of course for their\nparents. It is an age of questioning, doubting, rebelling – a time of idealism, of\nselfishness, or generosity – a time of yearning to belong and be accepted and yet to be free\nof ties; a time of forming new, different relationships, a time when sexuality begins to\nkick in and with that the turmoil of emotions. A time of transition between childhood and\nadulthood, all the time buffeted by the many competing claims for their attention in this\ncomplicated, increasing secular and material world.\nNext Sunday they will make for themselves the promises of Confirmation and come\nforward to receive Holy Communion. In one sense they are not ready but then were any of\nus truly ready in heart and mind for that step. I suspect I am not alone in saying that my\nunderstanding of Baptism, of discipleship, of the Eucharist has developed and matured\nover the years. So they are being invited to join us on a life long journey of faith and\ndiscipleship. They are, if you like, being invited to become in themselves, ‘letters from\nChrist’ But who is to be a ‘letter from Christ’ to them?\nIn the portion we read from the letter of Paul to the Philippians we read:\nPage 3 of 4\nLent 5 – 2010 – year C\nSunday after St Patrick’s Day\n10I want to know Christ and the power of his resurrection and the sharing\nof his sufferings by becoming like him in his death, 11if somehow I may\nattain the resurrection from the dead.\nHow are they to know, how are they to encounter Christ? For that matter how are any of\nus to know and encounter Christ? We encounter Christ in one another as we allow Christ\nto live, to speak, to serve, to love in and through us. Young people drift away, drift away\nfrom family, from Church – in part that drift is a part and parcel of that whole process of\nquestioning, doubting, rebelling that I was referring to earlier, that is so much part of that\njourney from child hood to adulthood. Parents have watched, sometimes helplessly, as\nchildren have gone off, made mistakes in education, in relationships and a host of other\nareas that they know they will regret in times to come. But they continue to love and\nwatch over their children. God will continue to love and watch over each one of us, over\neach one of our children even though at times we might wonder away. Next Sunday we\nwill watch as witnesses, as encouragers. As I said, it is not just a matter of being\nwitnesses and encouragers next Sunday; we are called to stand alongside them in love and\nprayer and support in the days that will lie ahead as living signs of the love and concern of\nGod for each one of them; to be a community that is open and welcoming; to be a\ncommunity within which they can feel at home, within which they can continue their own\nspiritual pilgrimage, within which they can encounter Christ.\nThe early Celtic Church had a very strong sense of God, of Christ very much present in\nour midst, in the world around us and in one another. In the Breat Plate, an early Irish\nhymn attributed to St Patrick (no 322 in our book) we have a lovely expression of Christ\naccompanying, enfolding us, living within us as we travel the raod:\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\nPage 4 of 4\nLent 5 – 2010 – year C\nSunday after St Patrick’s Day\nPatrick spoke of himself, of all believers, as a ‘letter of Christ’. This is the Christ we are\nto take out into the world; this is the Christ who goes with us as we go out into the world.\nThe Christ who emptied himself, who drew alongside the rejected, the despised, who\nturned the other cheek, who went the extra mile. This is the Christ we are encouraging our\nyoung people to follow, to show to the world at large. How can they follow, how can they\nshow unless they have first met that Christ in us? And see in us a community that is\nshaped by the self giving, self emptying love of God in Christ, a community that is ‘a\nletter of Christ’ to the world, to one another, to them ,"
    }
}