{
    "title": "Shine as a Light in the World",
    "date": "2013-03-17",
    "blurb": "On St Patrick's Day, this sermon reflects on the life of St Patrick, his journey of faith, and his mission to spread the Gospel in Ireland. The sermon draws parallels between Patrick's mission and the call for all Christians to be 'a letter of Christ', shining as a light in the world. It emphasizes the importance of community, support, and encouragement in the Christian journey.",
    "raw_text": "Today in parades, in Church Services, in family gatherings Irish people throughout the world are celebrating St Patrick's Day. All around the world, buildings and monuments are being illuminated in green light, rivers, even beer, will be died green in honour of the patron saint. This year, under the auspices of the Gathering, Irish people who have settled in different parts of the world are being invited to return home. It is good to see signs of a spirit of optimism and confidence in our land, even in the midst of our continuing economic troubles. So who is this figure of Patrick whose feast provides us with an excuse for celebration?\n\nIn truth very little is known about him and many of the stories about him are surrounded in folk lore bordering on legend. There is hardly a part of Ireland where he has not been reputed to visit, and three sites claim to be the site of his burial. So what can we say with any measure of certainty? He was born somewhere in Britain, the son of a town councillor and deacon in the local Church. In his teens he does not seem to have shown any great interest in religion. When he was about sixteen he was captured by Irish pirates and brought to Ireland as a slave; some say to Sligo and others say to Slemish, just outside Ballymena – having spent 16 years looking out on Slemish, I like the idea of Slemish. Wherever it was, he seems to have spent his time keeping sheep and was treated harshly. In time he escaped his captors, journeyed to the South East of Ireland and escaped back to England. During this time of captivity his faith seems to have developed and in time he travelled to France where he was trained for ministry and opted to return to Ireland, the land of those who had abused him. So began a period of evangelisation that brought the Gospel to ever corner of Ireland. Armagh, the hill of Tara, Croagh Patrick, Downpatrick, Saul, Slemish are all associated with Patrick. By his own admission Patrick was not a scholarly man so there is very little written material that is attributed to him. Whether he wrote the hymn St Patrick's Breastplate is open to question but one other item, St Patrick's Confession does seem to be authentic, written towards the end of his life, shortly before his death around 460 AD. In this he reflects on his childhood, his captivity, the awakening of his faith and his return to Ireland. It would seem that his ministry was beset with many problems both inside and outside the Church and he felt the need to defend himself against those who would have criticised his lack of learning.. in the course of the Confession he argues that the most eloquent witness is not in what is written but in a life that is lived. As so, in the passage I have reproduced in the text box on your lesson sheets, he wrote:\n\n> ... we, who are in the words of Scripture, a letter of Christ bearing salvation to the uttermost parts of the earth? The letter may not be elegant but it is assuredly and most powerfully written on your hearts, not with ink but with the Spirit of the living God. Confession – St Patrick\n\n'Ourselves, as a letter of Christ, bearing salvation to the uttermost parts of the earth.' This calls to mind the role of the Irish Church in the years that followed the collapse of the Roman Empire, when this island of Ireland was one of the outposts of the Christian faith in Europe and the place from which missionaries such as Columba travelled to Iona, to Scotland, to England and on into Northern Europe.\n\nThis theme of mission and light comes through in the closing section of the Service of Baptism: (I have printed it on the sheet)\n\n> God has delivered us from the dominion of darkness and has given us a place with the saints in light.\n\nThe newly baptized are sent out\n\n> You have received the light of Christ; walk in this light all the days of your life.\n\n> Shine as a light in the world to the glory of God the Father.\n\n> Go in peace to love and serve the Lord in the name of Christ. Amen.\n\nWalk in the light of Christ, shine as a light of Christ. At the very beginning of Lent, as I began these reflections on Baptism, I reflected on our spiritual life as a journey, a journey undertaken with Christ, a journey into Christ. We are all at different stages on that journey of a life time. This is not a journey that you and I travel in isolation, it is a journey that we travel in solidarity with one another as members of the Body of Christ. In the words of the service, 'in baptism, God calls us from darkness into his marvellous light. To follow Christ means dying to sin and rising to new life with him.' As promises are made on behalf of the child, we ourselves are called upon to make our own promise of solidarity:\n\n> You have heard these our brothers and sisters respond to Christ. Will you support them in this calling?\n\nThe congregation answers\n\n> We will support them.\n\nWe will support them, we will walk with them on this journey from light into darkness. So there is a vocation of encouragement in which we all have a share. So in the service of Baptism the Exchange of the Peace is introduced with the words:\n\n> We are the body of Christ. By one spirit we were all baptized into one body. Let us then pursue all that makes for peace and builds up our common life together.\n\nLet us then pursue all that makes for peace and builds up our common life together. As I have remarked in the past, it is all too easy to see the life of a Christian community in terms of a collection of competing factions. We are not. We are members of the Body of Christ, called to serve one another, to honour one another, to encourage one another; each of us called to incarnate in our own imperfect lives the love of Christ in the word of today, to be in the words of Patrick, 'a letter of Christ, bearing salvation to the uttermost parts of the earth.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent52013.txt",
        "raw_ocr_content": "Page 1 of 4\nLent 5 – St Patrick’s Day – 2013 – year C\nBaptism – Shine as a light in the world – a ‘letter of Christ’\nToday in parades, in Church Services, in family gatherings Irish people\nthroughout the world are celebrating St Patrick’s Day. All around the world,\nbuildings and monuments are being illuminated in green light, rivers, even\nbeer, will be died green in honour of the patron saint. This year, under the\nauspices of the Gathering, Irish people who have settled in different parts of the\nworld are being invited to return home. It is good to see signs of a spirit of\noptimism and confidence in our land, even in the midst of our continuing\neconomic troubles. So who is this figure of Patrick whose feast provides us\nwith an excuse for celebration?\nIn truth very little is known about him and many of the stories about him are\nsurrounded in folk lore bordering on legend. There is hardly a part of Ireland\nwhere he has not been reputed to visit, and three sites claim to be the site of his\nburial. So what can we say with any measure of certainty? He was born\nsomewhere in Britain, the son of a town councillor and deacon in the local\nChurch. In his teens he does not seem to have shown any great interest in\nreligion. When he was about sixteen he was captured by Irish pirates and\nbrought to Ireland as a slave; some say to Sligo and others say to Slemish, just\noutside Ballymena – having spent 16 years looking out on Slemish, I like the\nidea of Slemish. Wherever it was, he seems to have spent his time keeping\nsheep and was treated harshly. In time he escaped his captors, journeyed to the\nSouth East of Ireland and escaped back to England. During this time of\ncaptivity his faith seems to have developed and in time he travelled to France\nwhere he was trained for ministry and opted to return to Ireland, the land of\nthose who had abused him. So began a period of evangelisation that brought\nPage 2 of 4\nLent 5 – St Patrick’s Day – 2013 – year C\nBaptism – Shine as a light in the world – a ‘letter of Christ’\nthe Gospel to ever corner of Ireland. Armagh, the hill of Tara, Croagh Patrick,\nDownpatrick, Saul, Slemish are all associated with Patrick. By his own\nadmission Patrick was not a scholarly man so there is very little written\nmaterial that is attributed to him. Whether he wrote the hymn St Patrick’s\nBreastplate is open to question but one other item, St Patrick’s Confession does\nseem to be authentic, written towards the end of his life, shortly before his\ndeath around 460 AD. In this he reflects on his childhood, his captivity, the\nawakening of his faith and his return to Ireland. It would seem that his\nministry was beset with many problems both inside and outside the Church and\nhe felt the need to defend himself against those who would have criticised his\nlack of learning.. in the course of the Confession he argues that the most\neloquent witness is not in what is written but in a life that is lived. As so, in\nthe passage I have reproduced in the text box on your lesson sheets, he wrote:\n….. we, who are in the words of Scripture, a letter of Christ\nbearing salvation to the uttermost parts of the earth? The letter\nmay not be elegant but it is assuredly and most powerfully\nwritten on your hearts, not with ink but with the Spirit of the\nliving God. Confession – St Patrick\n(Patrick in his own words – Joseph Duffy p98)\n‘Ourselves, as a letter of Christ, bearing salvation to the uttermost parts of the\nearth.’ This calls to mind the role of the Irish Church in the years that followed\nthe collapse of the Roman Empire, when this island of Ireland was one of the\noutposts of the Christian faith in Europe and the place from which missionaries\nsuch as Columba travelled to Iona, to Scotland, to England and on into\nNorthern Europe.\nPage 3 of 4\nLent 5 – St Patrick’s Day – 2013 – year C\nBaptism – Shine as a light in the world – a ‘letter of Christ’\nThis theme of mission and light comes through in the closing section of the\nService of Baptism: (I have printed it on the sheet)\nGod has delivered us from the dominion of darkness and has\ngiven us a place with the saints in light.\nThe newly baptized are sent out\nYou have received the light of Christ; walk in this light all the\ndays of your life.\nShine as a light in the world\nto the glory of God the Father.\nGo in peace to love and serve the Lord\nin the name of Christ. Amen.\nWalk in the light of Christ, shine as a light of Christ. At the very beginning of\nLent, as I began these reflections on Baptism, I reflected on our spiritual life as\na journey, a journey undertaken with Christ, a journey into Christ. We are all\nat different stages on that journey of a life time. This is not a journey that you\nand I travel in isolation, it is a journey that we travel in solidarity with one\nanother as members of the Body of Christ. In the words of the service, ‘in\nbaptism, God calls us from darkness into his marvellous light. To follow Christ\nmeans dying to sin and rising to new life with him.’ As promises are made on\nbehalf of the child, we ourselves are called upon to make our own promise of\nsolidarity:\nYou have heard these our brothers and sisters respond to Christ.\nWill you support them in this calling?\nThe congregation answers\nWe will support them.\nWe will support them, we will walk with them on this journey from light into\ndarkness. So there is a vocation of encouragement in which we all have a\nPage 4 of 4\nLent 5 – St Patrick’s Day – 2013 – year C\nBaptism – Shine as a light in the world – a ‘letter of Christ’\nshare. So in the service of Baptism the Exchange of the Peace is introduced\nwith the words:\nWe are the body of Christ.\nBy one spirit we were all baptized into one body.\nLet us then pursue all that makes for peace and builds up our\ncommon life together.\nLet us then pursue all that makes for peace and builds up our common life\ntogether. As I have remarked in the past, it is all too easy to see the life of a\nChristian community in terms of a collection of competing factions. We are\nnot. We are members of the Body of Christ, called to serve one another, to\nhonour one another, to encourage one another; each of us called to incarnate in\nour own imperfect lives the love of Christ in the word of today, to be in the\nwords of Patrick, ‘a letter of Christ, bearing salvation to the uttermost parts of\nthe earth.’"
    }
}