{
    "title": "Celebrating Lilian O'Connor's Life",
    "date": "2021-02-26",
    "blurb": "This sermon, delivered at the funeral of Lilian O’Connor, celebrates her life and the love she shared with her family and community. It emphasizes the Christian hope in the face of death, and the unity that can be found in shared life experiences. The sermon also touches on the power of faith in overcoming darkness and suffering.",
    "raw_text": "We come to celebrate the life of Lilian O’Connor, to give thanks for all that she meant to us. Those outside the family circle, many joining with us online, offer their love, their sympathy and their prayers to you her family.\n\nOne of the options for prayers in the Church of Ireland funeral Liturgy contains the words, ‘In the midst of life, we are in death, of whom may we seek for succour.’ As we gather for the funeral of Lilian O’Connor, I just want to reverse that. ‘In the midst of death, we are in life.’ In the face of death, accepting our mortality, we come in Christian hope to celebrate life.\n\nLilian, a native of Limerick, had come to the Parish in 1971 with her husband Arthur. Coming from different traditions, there was always a respect shown to both. So the family would have been brought here to St Mary’s to share in some of the special occasions such as Christmas Services. She was a regular and faithful member of this Parish, regular in public worship.\n\nShe took an active part in local community life, actively involved in the Peninsula Society and Active Retirement Group. This involved visits to many stately homes and gardens. This latter aspect of their visits caused Arthur some amusement as her many talents did not run to an expertise in gardening. The family maintained that several plants were ‘pruned to death’.\n\nLilian loved music and taught piano both in the Smith’s School of Music in Raheny, as well as a home.\n\nFamily, and care for family lay at the heart of her life. Her daughters Deirdre, Nuala and Fiona remember growing up in a loving home. Lilian spoke with deep pride of all that they had achieved and of their families. Her affection extended to her sons in law, Fergus, Richie and the recently deceased Tom each of which would be described as her favourite on different occasions. She would also talk of her grandchildren who remember her today with deep affection.\n\nWe come to celebrate the life that Lilian and Arthur shared together. As I said, they came to their marriage out of different life experiences, different traditions. We often talk of inter church marriage in terms of difficulty, in terms of problems. Couples like Lilian and Arthur show us the other side. There are differences between us but folk like Lilian and Arthur show us an ecumenism that is lived out 24/7 in the nuts and bolts of daily living; in a shared life, lived out in love, built on respect and understanding for one another. So as we celebrate their life together, I offer it as a sign of hope in the life of the Church as we seek that unity that is Christ’s will for us all.\n\nIn the face of death we come to celebrate life in Christ. We are not long out of the season of Christmas and Epiphany. In our Sunday readings we have returned on a number of occasion to the first chapter of John’s Gospel. The Gospel writer speaks of God among us in the person of Jesus Christ. We hear those lovely words:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nThe light shines in the darkness and the darkness did not overcome it. Darkness has not had the last word in the life of Lilian O’Connor. Sickness, weakness has not had the final say. In fellowship with Lilian, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nTo return to the beginning, in the midst of death we are in life. In the face of death we celebrate the life of Lilian O’Connor, the life she shared with Arthur and the rest of the family. In word and in the sacrament of the Eucharist we celebrate the life we have in Christ, crucified, risen and ascended, victorious over death. We do so conscious of the loss of those who will miss Lilian most, her husband Arthur, their daughters Deirdre, Nuala and Fiona, her sister Valerie and all those who have loved her. And so as we commend Lilian to God we pray for you all as you feel the pain of her passing, as you continue to offer love and support to Arthur. May we be signs of Christ’s presence to each other in the days and weeks to come, shedding something of his light in the darkness of your loss.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Lilian O_Connor.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Lilian O’Connor – St Mary’s Church – 26th February 2021\nWe come to celebrate the life of Lilian O’Connor, to give thanks for all that she\nmeant to us.\nThose outside the family circle, many joining with us online, offer their love,\ntheir sympathy and their prayers to you her family.\nOne of the options for prayers in the Church of Ireland funeral Liturgy contains\nthe words, ‘In the midst of life, we are in death, of whom may we seek for\nsuccour.’\nAs we gather for the funeral of Lilian O’Connor, I just want to reverse that. ‘In\nthe midst of death, we are in life.’ In the face of death, accepting our mortality,\nwe come in Christian hope to celebrate life.\nLilian, a native of Limerick, had come to the Parish in 1971 with her husband\nArthur. Coming from different traditions, there was always a respect shown to\nboth. So the family would have been brought here to St Mary’s to share in\nsome of the special occasions such as Christmas Services. She was a regular\nand faithful member of this Parish, regular in public worship.\nShe took an active part in local community life, actively involved in the\nPeninsula Society and Active Retirement Group. This involved visits to many\nstately homes and gardens. This latter aspect of their visits caused Arthur some\namusement as her many talents did not run to an expertise in gardening. The\nfamily maintained that several plants were ‘pruned to death’.\nPage 2 of 3\nFuneral of Lilian O’Connor – St Mary’s Church – 26th February 2021\nLilian loved music and taught piano both in the Smith’s School of Music in\nRaheny, as well as a home.\nFamily, and care for family lay at the heart of her life. Her daughters Deirdre,\nNuala and Fiona remember growing up in a loving home. Lilian spoke with\ndeep pride of all that they had achieved and of their families. Her affection\nextended to her sons in law, Fergus, Richie and the recently deceased Tom\neach of which would be described as her favourite on different occasions. She\nwould also talk of her grandchildren who remember her today with deep\naffection.\nWe come to celebrate the life that Lilian and Arthur shared together. As I said,\nthey came to their marriage out of different life experiences, different\ntraditions. We often talk of inter church marriage in terms of difficulty, in\nterms of problems. Couples like Lilian and Arthur show us the other side.\nThere are differences between us but folk like Lilian and Arthur show us an\necumenism that is lived out 24/7 in the nuts and bolts of daily living; in a\nshared life, lived out in love, built on respect and understanding for one\nanother. So as we celebrate their life together, I offer it as a sign of hope in the\nlife of the Church as we seek that unity that is Christ’s will for us all.\nIn the face of death we come to celebrate life in Christ. We are not long out of\nthe season of Christmas and Epiphany. In our Sunday readings we have\nreturned on a number of occasion to the first chapter of John’s Gospel. The\nGospel writer speaks of God among us in the person of Jesus Christ. We hear\nthose lovely words:-\nPage 3 of 3\nFuneral of Lilian O’Connor – St Mary’s Church – 26th February 2021\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nThe light shines in the darkness and the darkness did not overcome it. Darkness\nhas not had the last word in the life of Lilian O’Connor. Sickness, weakness\nhas not had the final say. In fellowship with Lilian, we follow a Lord who\nknows what death, what suffering, what loss is all about; one who knew what it\nwas like to weep at the grave of his friend Lazarus. Not only that, he is the one\nwho was raised triumphant over death, breaking the power of death itself.\nKnowing in his own person what it was all about, I find in him one to whom I\ncam come in my own time of suffering and find real comfort, real strength and\nreal hope.\nTo return to the beginning, in the midst of death we are in life. In the face of\ndeath we celebrate the life of Lilian O’Connor, the life she shared with Arthur\nand the rest of the family. In word and in the sacrament of the Eucharist we\ncelebrate the life we have in Christ, crucified, risen and ascended, victorious\nover death. We do so conscious of the loss of those who will miss Lilian most,\nher husband Arthur, their daughters Deirdre, Nuala and Fiona, her sister\nValerie and all those who have loved her. And so as we commend Lilian to\nGod we pray for you all as you feel the pain of her passing, as you continue to\noffer love and support to Arthur. May we be signs of Christ’s presence to each\nother in the days and weeks to come, shedding something of his light in the\ndarkness of your loss."
    }
}