{
    "title": "Celebrating Arthur and Lilian O'Connor",
    "date": "2021-03-01",
    "blurb": "This sermon is a celebration of the lives of Arthur and Lilian O'Connor, a couple who lived their lives in love, respect and understanding. Despite coming from different traditions, they showed an ecumenism lived out in their daily lives. The sermon also emphasizes the Christian hope of life in the face of death, and the light that shines in the darkness.",
    "raw_text": "We come to celebrate the life of Arthur and Lilian O’Connor, to give thanks for their lives and for all that they meant to us as parents, grandparents, brother and sister. They came to Church together to be married, today they come together in death on the day of their funeral.\n\nThose outside the family circle, many joining with us online, offer their love, their sympathy and their prayers to you their family.\n\nOne of the options for prayers in the Church of Ireland funeral Liturgy contains the words, ‘In the midst of life, we are in death, of whom may we seek for succour.’ As we gather for the funeral of Arthur and Lilian O’Connor, I just want to reverse that. ‘In the midst of death, we are in life.’ In the face of death, accepting our mortality, we come in Christian hope to celebrate life.\n\nThey came to the Howth Sutton in 1971 to establish their home. It is here they reared their daughters, Deidre, Nuala and Fiona. Coming from different traditions, there was always a respect shown to both. Their daughters were reared in the Roman Catholic Church and the family would have been brought here to St Mary’s to share in some of the special occasions such as Christmas Services. Arthur remained a faithful member of the Roman Catholic Church and Lilian was a regular and faithful member of this Parish, regular in public worship.\n\nArthur, a quiet, gentle man, worked for many years in the Dublin Port Authority. He was, by all accounts a very good bridge player. He took a quiet pride in his home and in his family. Lilian took an active part in local community life, actively involved in the Peninsula Society and Active Retirement Group. This involved visits to many stately homes and gardens. This latter aspect of their visits caused Arthur some amusement as her many talents did not run to an expertise in gardening. The family maintained that several plants were ‘pruned to death’. She also loved music and taught piano both in the Smith’s School of Music in Raheny, as well as a home.\n\nFamily, and care for family lay at the heart of their life together. their daughters Deirdre, Nuala and Fiona remember growing up in a loving home. Their Mum and Dad spoke with deep pride of all that they had achieved and of their families. Their affection extended to their sons in law, Fergus, Richie and the recently deceased Tom: each of which would be described as Lilian’s favourite on different occasions. They would also talk of her grandchildren who remember them today with deep affection.\n\nWe come to celebrate the life that Lilian and Arthur shared together. As I said, they came to their marriage out of different life experiences, different traditions. We often talk of inter church marriage in terms of difficulty, in terms of problems. Couples like Lilian and Arthur show us the other side. There are differences between us but folk like Lilian and Arthur show us an ecumenism that is lived out 24/7 in the nuts and bolts of daily living; in a shared life, lived out in love, built on respect and understanding for one another. So as we celebrate their life together, I offer it as a sign of hope in the life of the Church as we seek that unity that is Christ’s will for us all.\n\nIn the face of death we come to celebrate life in Christ. We are not long out of the season of Christmas and Epiphany. In our Sunday readings we have returned on a number of occasion to the first chapter of John’s Gospel. The Gospel writer speaks of God among us in the person of Jesus Christ. We hear those lovely words:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nThe light shines in the darkness and the darkness did not overcome it. Darkness has not had the last word in the life of Arthur and Lilian O’Connor. Sickness, weakness has not had the final say. In fellowship with them, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nTo return to the beginning, in the midst of death we are in life. In the face of death we celebrate the life of Arthur and Lilian O’Connor that they shared with the rest of the family. In word and in the sacrament of the Eucharist we celebrate the life we have in Christ, crucified, risen and ascended, victorious over death. We do so conscious of the loss of those who will miss Arthur and Lilian most, their daughters Deirdre, Nuala and Fiona, Lilian’s sister Valerie, Arthur’s sister Oonagh and all those who have loved them. And so as we commend Arthur and Lilian, together in life, together in death, to God we pray for you all as you feel the pain of their passing, as you continue to offer love and support to each other. May we be signs of Christ’s presence to each other in the days and weeks to come, shedding something of his light in the darkness of your loss.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Lilian and Arthur O_Connor.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Arthur and Lilian O’Connor – St Mary’s Church – 1st March 2021\nWe come to celebrate the life of Arthur and Lilian O’Connor, to give thanks\nfor their lives and for all that they meant to us as parents, grandparents, brother\nand sister. They came to Church together to be married, today they come\ntogether in death on the day of their funeral.\nThose outside the family circle, many joining with us online, offer their love,\ntheir sympathy and their prayers to you their family.\nOne of the options for prayers in the Church of Ireland funeral Liturgy contains\nthe words, ‘In the midst of life, we are in death, of whom may we seek for\nsuccour.’\nAs we gather for the funeral of Arthur and Lilian O’Connor, I just want to\nreverse that. ‘In the midst of death, we are in life.’ In the face of death,\naccepting our mortality, we come in Christian hope to celebrate life.\nThey came to the Howth Sutton in 1971 to establish their home. It is here they\nreared their daughters, Deidre, Nuala and Fiona. Coming from different\ntraditions, there was always a respect shown to both. Their daughters were\nreared in the Roman Catholic Church and the family would have been brought\nhere to St Mary’s to share in some of the special occasions such as Christmas\nServices. Arthur remained a faithful member of the Roman Catholic Church\nand Lilian was a regular and faithful member of this Parish, regular in public\nworship.\nPage 2 of 4\nFuneral of Arthur and Lilian O’Connor – St Mary’s Church – 1st March 2021\nArthur, a quiet, gentle man, worked for many years in the Dublin Port\nAuthority. He was, by all accounts a very good bridge player. He took a quiet\npride in his home and in his family. Lilian took an active part in local\ncommunity life, actively involved in the Peninsula Society and Active\nRetirement Group. This involved visits to many stately homes and gardens.\nThis latter aspect of their visits caused Arthur some amusement as her many\ntalents did not run to an expertise in gardening. The family maintained that\nseveral plants were ‘pruned to death’. She also loved music and taught piano\nboth in the Smith’s School of Music in Raheny, as well as a home.\nFamily, and care for family lay at the heart of their life together. their\ndaughters Deirdre, Nuala and Fiona remember growing up in a loving home.\nTheir Mum and Dad spoke with deep pride of all that they had achieved and of\ntheir families. Their affection extended to their sons in law, Fergus, Richie and\nthe recently deceased Tom: each of which would be described as Lilian’s\nfavourite on different occasions. They would also talk of her grandchildren\nwho remember them today with deep affection.\nWe come to celebrate the life that Lilian and Arthur shared together. As I said,\nthey came to their marriage out of different life experiences, different\ntraditions. We often talk of inter church marriage in terms of difficulty, in\nterms of problems. Couples like Lilian and Arthur show us the other side.\nThere are differences between us but folk like Lilian and Arthur show us an\necumenism that is lived out 24/7 in the nuts and bolts of daily living; in a\nshared life, lived out in love, built on respect and understanding for one\nPage 3 of 4\nFuneral of Arthur and Lilian O’Connor – St Mary’s Church – 1st March 2021\nanother. So as we celebrate their life together, I offer it as a sign of hope in the\nlife of the Church as we seek that unity that is Christ’s will for us all.\nIn the face of death we come to celebrate life in Christ. We are not long out of\nthe season of Christmas and Epiphany. In our Sunday readings we have\nreturned on a number of occasion to the first chapter of John’s Gospel. The\nGospel writer speaks of God among us in the person of Jesus Christ. We hear\nthose lovely words:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nThe light shines in the darkness and the darkness did not overcome it. Darkness\nhas not had the last word in the life of Arthur and Lilian O’Connor. Sickness,\nweakness has not had the final say. In fellowship with them, we follow a Lord\nwho knows what death, what suffering, what loss is all about; one who knew\nwhat it was like to weep at the grave of his friend Lazarus. Not only that, he is\nthe one who was raised triumphant over death, breaking the power of death\nitself. Knowing in his own person what it was all about, I find in him one to\nwhom I cam come in my own time of suffering and find real comfort, real\nstrength and real hope.\nTo return to the beginning, in the midst of death we are in life. In the face of\ndeath we celebrate the life of Arthur and Lilian O’Connor that they shared with\nthe rest of the family. In word and in the sacrament of the Eucharist we\nPage 4 of 4\nFuneral of Arthur and Lilian O’Connor – St Mary’s Church – 1st March 2021\ncelebrate the life we have in Christ, crucified, risen and ascended, victorious\nover death. We do so conscious of the loss of those who will miss Arthur and\nLilian most, their daughters Deirdre, Nuala and Fiona, Lilian’s sister Valerie,\nArthur’s sister Oonagh and all those who have loved them. And so as we\ncommend Arthur and Lilian, together in life, together in death, to God we pray\nfor you all as you feel the pain of their passing, as you continue to offer love\nand support to each other. May we be signs of Christ’s presence to each other\nin the days and weeks to come, shedding something of his light in the darkness\nof your loss."
    }
}