{
    "title": "Journey with God",
    "date": "2015-09-21",
    "blurb": "This sermon is a tribute to Mr. Cecil Jermyn, a man of faith, love, endurance, and gentleness. It celebrates his life journey, his faithfulness, and his courage in the face of life's challenges. The sermon also reflects on the hope and peace offered by Christian faith in the face of death.",
    "raw_text": "Funeral of Mr Cecil Jermyn – Howth – 21st September 2015\n\nThe Service of Baptism in the Book of Common Prayer has a Pastoral Introduction which begins with the following words:\n\n>Baptism marks the beginning of a journey with God which continues for the rest of our lives, the first response to God’s love.\n\nand concludes with the words:\n\n>As you pray for the candidates, picture them with yourself and the whole Church throughout the ages, journeying into the fullness of God’s love.\n\nWe gather here in St Mary’s Church to mark the end of Cecil Jermyn’s journey with God in this world, that began at his baptism in Glasnevin Parish Church and ended in the early hours of last Friday as he died peacefully in the care of Glengarra Nursing Home and enfolded in the love of his family.\n\nToday, on this the day of his funeral, we gather to give thanks to God for the life of Cecil Jermyn, for his faithfulness along all stages of that journey with God and with those he loved. The writer of the first letter to Timothy gives this advice to a younger man:\n\n>But as for you, man of God, pursue righteousness, godliness, faith, love, endurance, gentleness. 12 Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Tim 6:11 ff\n\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This seems to me to draw together our memories of Cecil Jermyn so many of you remember today with love and affection. Cecil fought the good fight, not just in the recent years of decline but all through life as he overcome the hurdles of early widowhood, building a life for him and his sons David and Garry.\n\nCecil had trained as an accountant, and had begun work in South Africa, accompanied by his first wife Catherine. After a while they returned to Dublin where Cecil joined Craig Gardiner, always referred to as ‘The Firm’.\n\nCatherine was to die young and Cecil was left to care for their two young sons David and Garry. He was to discover love again in the person of Audrey Dickson and they were to share the home at Avalon together until, following a serious bout of pneumonia, his declining health necessitated a move into residential care in Glengarra.\n\nWe come to thank God for this man, for his courage, his fortitude, his gentleness – characteristics that he brought to bear on all stages of his life. Family and love of family lay at the heart of that life. He had a firm and sincerely held Christian faith that was expressed in a faithful and active participation in the life of this Parish right up to time he went into Glengarra. I will remember him as a great encourager. He had a great interest in sport of all varieties and was a very accomplished tennis player – though I was surprised to learn that this man of such gentle disposition was no mean performer in the boxing ring. Of course he loved travel and he and Audrey set off to all parts of the world. His latter years have been marked by decline as Alzheimer’s took its hold. Not even this was to subdue Cecil’s fundamental courage and gentleness. All through this period Audrey was at his side, encouraging, enabling him to participate in life to the full, supported by David and Garry and the wider family.\n\nWe come to set the mystery of death in the context of our Christian faith. As I said, Cecil had a deeply held, sincere Christian faith, worshipping here Sunday by Sunday, living that faith in his work and leisure, in his family life. He would have known well those lovely words from St John’s Gospel:-\n\n>4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n>12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nDarkness has not had the last word in the life of Cecil Jermyn. Sickness, weakness has not had the final say. A light has gone out in our lives. But the light shines on, the light of Christ, risen, ascended, glorified. Our hope and prayer this day is life and peace for Cecil in the closer presence of the God he served and worshipped, free from pain, from weakness as he completes that journey, begun in Baptism, into the fullness of God’s love.\n\nCecil must have spent many happy hours looking out over Howth Harbour from his home on Asgard Road. The following is a poem that sets our hope for Cecil and for ourselves in the sailing tradition of this lovely place:\n\n>A Parable of Immortality.\n\n>I am standing by the seashore.\n\n>A ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\n\n>She is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\n\n>Then someone at my side says, ‘There she goes! ‘\n\n>Gone where? Gone from my sight - that is all.\n\n>She is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\n\n>Her diminished size is in me, not in her.\n\n>And just at the moment when someone at my side says, ‘There she goes!’, there are other eyes watching her coming, and other voices ready to take up the glad shout :\n\n>‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mr Cecil Jermyn.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mr Cecil Jermyn – Howth – 21st September 2015\nThe Service of Baptism in the Book of Common Prayer has a Pastoral\nIntroduction which begins with the following words:\nBaptism marks the beginning of a journey with God which\ncontinues for the rest of our lives, the first response to God’s love.\nand concludes with the words:\nAs you pray for the candidates, picture them with yourself and the\nwhole Church throughout the ages, journeying into the fullness of\nGod’s love.\nWe gather here in St Mary’s Church to mark the end of Cecil Jermyn’s journey\nwith God in this world, that began at his baptism in Glasnevin Parish Church\nand ended in the early hours of last Friday as he died peacefully in the care of\nGlengarra Nursing Home and enfolded in the love of his family.\nToday, on this the day of his funeral, we gather to give thanks to God for the\nlife of Cecil Jermyn, for his faithfulness along all stages of that journey with\nGod and with those he loved. The writer of the first letter to Timothy gives\nthis advice to a younger man:\nBut as for you, man of God, pursue righteousness, godliness, faith, love,\nendurance, gentleness. 12 Fight the good fight of the faith; take hold of\nthe eternal life, to which you were called and for which you made the\ngood confession in the presence of many witnesses. 1 Tim 6:11 ff\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This\nseems to me to draw together our memories of Cecil Jermyn so many of you\nremember today with love and affection. Cecil fought the good fight, not just\nin the recent years of decline but all through life as he overcome the hurdles\nof early widowhood, building a life for him and his sons David and Garry.\nPage 2 of 4\nFuneral of Mr Cecil Jermyn – Howth – 21st September 2015\nCecil had trained as an accountant, and had begun work in South Africa,\naccompanied by his first wife Catherine. After a while they returned to Dublin\nwhere Cecil joined Craig Gardiner, always referred to as ‘The Firm’.\nCatherine was to die young and Cecil was left to care for their two young sons\nDavid and Garry. He was to discover love again in the person of Audrey\nDickson and they were to share the home at Avalon together until, following a\nserious bout of pneumonia, his declining health necessitated a move into\nresidential care in Glengarra.\nWe come to thank God for this man, for his courage, his fortitude, his\ngentleness – characteristics that he brought to bear on all stages of his life.\nFamily and love of family lay at the heart of that life. He had a firm and\nsincerely held Christian faith that was expressed in a faithful and active\nparticipation in the life of this Parish right up to time he went into Glengarra. I\nwill remember him as a great encourager. He had a great interest in sport of all\nvarieties and was a very accomplished tennis player – though I was surprised to\nlearn that this man of such gentle disposition was no mean performer in the\nboxing ring. Of course he loved travel and he and Audrey set off to all parts of\nthe world. His latter years have been marked by decline as Alzheimer’s took\nits hold. Not even this was to subdue Cecil’s fundamental courage and\ngentleness. All through this period Audrey was at his side, encouraging,\nenabling him to participate in life to the full, supported by David and Garry and\nthe wider family.\nWe come to set the mystery of death in the context of our Christian faith. As I\nsaid, Cecil had a deeply held, sincere Christian faith, worshipping here Sunday\nPage 3 of 4\nFuneral of Mr Cecil Jermyn – Howth – 21st September 2015\nby Sunday, living that faith in his work and leisure, in his family life. He\nwould have known well those lovely words from St John’s Gospel:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nDarkness has not had the last word in the life of Cecil Jermyn. Sickness,\nweakness has not had the final say. A light has gone out in our lives. But the\nlight shines on, the light of Christ, risen, ascended, glorified. Our hope and\nprayer this day is life and peace for Cecil in the closer presence of the God he\nserved and worshipped, free from pain, from weakness as he completes that\njourney, begun in Baptism, into the fullness of God’s love.\nCecil must have spent many happy hours looking out over Howth Harbour\nfrom his home on Asgard Road. The following is a poem that sets our hope for\nCecil and for ourselves in the sailing tradition of this lovely place:\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nPage 4 of 4\nFuneral of Mr Cecil Jermyn – Howth – 21st September 2015\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}