{
    "title": "Funeral of Mr Erwin Lanz",
    "date": "2017-01-10",
    "blurb": "This sermon is a tribute to Mr Erwin Lanz, a well-loved father, husband, and friend, who lived a life full of love, dignity, and respect. It reflects on the mystery of death in the context of Christian faith, and offers comfort, strength, and hope in the face of loss.",
    "raw_text": "This morning we have gathered in St Mary’s for the funeral of Mr Erwin Lanz. His son Urs has already shared with us some of the family’s memories and affection for him. They remember a family man, a man with a love and zest for life. A native of Switzerland, he was born in the town of Uzwil, in the Swiss German region of the country. He had met his wife Rosealeen at a party and so began a love match that was to last 61 years. A textile engineer by profession, his work was to take him to many parts of the world. In the course of their travels, Erwin and Rosealeen reared their three sons, Urs, David and Justin. A sister, Monica, died in childhood. As Urs has already said, Erwin is remembered as a well-loved father, a proud and dignified man, respected by all who knew him.\n\nHe had just celebrated his 87th birthday and until recently had been in good health so his death has come as something of a shock to his family. A funeral is a time to reflect, to take stock. One of the privileges of being with a family as they prepare the funeral of a loved one, is to be there as memories are recalled, how they met, important and not so important events in a family’s journey. Even in the sadness there are the smiles as a loved one is remembered.\n\nToday is a day for you to come before God with your own particular memories of Erwin and give thanks to God for all that he has meant to you as husband, as father, as grandfather and friend, to thank God for all that was good and true in his life, his many talents, his dignity, his pleasure in simple things, his love and friendship.\n\nThose of us outside the family circle have come to offer our love and support at this time as you begin to come to terms with your loss, how best to support one another in the days and weeks and months to come.\n\nWe come to set the mystery of death in the context of our Christian faith. We have just celebrated the Festival of Christmas. In the darkest time of the year, we celebrate the birth of our Lord Jesus Christ.\n\nI often find myself turning to those lovely words from the Gospel of John that we read at Christmas:-\n\n> 4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n> 12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nThe old funeral service reminds us that in the midst of life we are in death. In the context of a funeral service, I often like to think of it the other way round: in the midst of death we are in life. For today in this Church, on the occasion of the funeral of Erwin Lanz, we declare that darkness has not had the last word in the life of Erwin. As you go out of this Church you will find two climbing roses on either side of the Church door. Even in the bleakest times of the year, even in the depths of winter, there are always signs of life on those roses be it a leaf, a bud or even a rose.\n\nBereavement, the loss of one with whom we have shared so much, is a very lonely experience. Yet we do not face it alone. We share it with ones who share our memories, our love our sadness. Not only that, In fellowship with the Apostle John, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I can come in my own time of suffering and find real comfort, real strength and real hope.\n\nIn the house the other night, I was shown one of the last photographs of Erwin, with Rosealeen overlooking the harbour in Howth. Situated as we are, on this beautiful hill of Howth, where from the top of the hill we can stand and watch ferries come and go, I will just leave you with this piece.\n\nA Parable of Immortality.\n\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\nShe is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says, ‘There she goes!’, there are other eyes watching her coming, and other voices ready to take up the glad shout :\n‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mr Erwin Lanz.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mr Erwin Lanz – St Mary’s – 10th January 2017\nThis morning we have gathered in St Mary’s for the funeral of MrErwin Lanz.\nHis son Urs has already shared with us some of the family’s memories and\naffection for him. They remember a family man, a man with a love and zest\nfor life. A native of Switzerland, he was born in the town of Uzwil, in the\nSwiss German region of the country. He had met his wife Rosealeen at a party\nand so began a lovematch that was to last 61 years. A textile engineer by\nprofession, his work was to take him to many parts of the world. In the course\nof their travels, Erwin and Rosealeen reared their three sons, Urs, David and\nJustin. A sister, Monica, died in childhood. As Urs has already said, Erwin is\nremembered as a well loved father, a proud and dignified man, respected by all\nwho knew him.\nHe had just celebrated his 87th birthday and until recently had been in good\nhealth so his death has come as something of a shock to his family. A funeral\nis a time to reflect, to take stock. One of the privileges of being with a family\nas they prepare the funeral of a loved one, is to be there as memories are\nrecalled, how they met, important and not so important events in a family’s\njourney. Even in the sadness there are the smiles as a loved one is\nremembered.\nToday is a day for you to come before God with your own particular memories\nof Erwin and give thanks to God for all that he has meant to you as husband, as\nfather, as grandfather and friend, to thank God for all that was good and true in\nhis life, his many talents, his dignity, his pleasure in simple things, his love and\nfriendship.\nPage 2 of 3\nFuneral of Mr Erwin Lanz – St Mary’s – 10th January 2017\nThose of us outside the family circle have come to offer our love and support at\nthis time as you begin to come to terms with your loss, how best to support one\nanother in the days and weeks and months to come.\nWe come to set the mystery of death in the context of our Christian faith. We have just\ncelebrated the Festival of Christmas. In the darkest time of the year, we\ncelebrate the birth of our Lord Jesus Christ.\nI often find myself turning to those lovely words from the Gospel of John that\nwe read at Christmas:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nThe old funeral service reminds us that in the midst of life we are in death. In\nthe context of a funeral service, I often like to think of it the other way round:\nin the midst of death we are in life. For today in this Church, on the occasion\nof the funeral of Erwin Lanz, we declare that darkness has not had the last\nword in the life of Erwin. As you go out of this Church you will find two\nclimbing roses on either side of the Church door. Even in the bleakest times of\nthe year, even in the depths of winter, there are always signs of life on those\nroses be it a leaf, a bud or even a rose.\nBereavement, the loss of one with whom we have shared so much, is a very\nlonely experience. Yet we do not face it alone. We share it with ones who\nshare our memories, our love our sadness. Not only that, In fellowship with\nPage 3 of 3\nFuneral of Mr Erwin Lanz – St Mary’s – 10th January 2017\nthe Apostle John, we follow a Lord who knows what death, what suffering,\nwhat loss is all about; one who knew what it was like to weep at the grave of\nhis friend Lazarus. Not only that, he is the one who was raised triumphant over\ndeath, breaking the power of death itself. Knowing in his own person what it\nwas all about, I find in him one to whom I cam come in my own time of\nsuffering and find real comfort, real strength and real hope.\nIn the house the other night, I was shown one of the last photographs of Erwin,\nwith Rosealeen overlooking the harbour in Howth. Situated as we are, on this\nbeautiful hill of Howth, where from the top of the hill we can stand and watch\nferries come and go, I will just leave you with this piece.\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}