{
    "title": "Funeral of William Carron",
    "date": "2017-07-31",
    "blurb": "This sermon was delivered at the funeral of William Carron, a poet and artist, who passed away four months after his wife, Barbara. The sermon reflects on William's passion for the creative arts and his spiritual connection with the world around him. It also touches on his love for sailing, drawing a parallel between his journey and a ship's voyage.",
    "raw_text": "Funeral of William Carron – Mount Jerome – July 31st 2017\n\nBack in May we gathered in St Mary’s Church for the funeral of Barbara Carron. Back then we referred to a wonderful creative partnership between Barbara and her husband William. Today, less than four months later, we gather for the funeral of William.\n\nWe gather to stand alongside Rachael as she lets go of those who brought her to birth, who loved and cherished her, who encouraged her. William was born in Clontarf and, like Barbara, shared a passion for the creative arts. As I was reflecting on what to say today, I was struck by the prayers appointed for Monday in the Church of Ireland Book of Common Prayer in which we are encouraged to give thanks ‘for the continuing work of creation, our share in it and for creative vision and inventive skill.\n\nI had known all along that William was a poet – I had not realised that he was an artist in his own right, a superb draughtsman, working in ceramics, an Associate of the Royal Irish Academy. As Rachael remarked, he possibly had to work harder at his art than Barbara to produce his own distinctive genius.\n\nThe house at Matakana was very much a place of creative vision and inventive skill. Barbara and William each had their own space in which to work, in which to create. Barbara had her studio in the house, William the shed at the end of garden. In that separation they worked out their common creative spirit.\n\nIt was very much a home within which they each encouraged and supported each other. It was a place of great simplicity – there were no unnecessary frills either in dress or décor.\n\nWilliam taught for a while in Sutton Park School – something he really enjoyed. When you think of the other people on the staff at that time, the staff room at that time must have been a very interesting place.\n\nI would gather that growing up William did not have a good experience of Church and so would not have regarded himself as religious. Sadly that is more a comment on the Church than on William. Just because he would not have regarded himself as religious, there would have been a strong spiritual dimension to his life. For one thing that would mark out the artist is a strong sense of the Other, something, someone beyond ourselves.\n\nSpeaking as a complete outsider on this one, I would see the artist must have something of a sense of wonder before they ever put brush to canvas, or pen to paper. This sense of wonder, whether for the scientist or for the artist, is beautifully expressed in the Psalms of the Old Testament. I often find myself going back again and again to Psalm 8\n\n4 When I consider your heavens, the work of your fingers, \nthe moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; \nthe son of man, that you should seek him out?\n\nFor William, and all those engaged in creative work, there is a losing of ourselves in the work, a giving of ourselves in the work, that brings us in touch with the Other. There is a strong tradition in the ancient Celtic Church of encountering God in and through his creation that is summed up in the title of a book I have at home, ‘Listening to the heart beat of God’.\n\nThere is a passage that that is read many times in Church comes from the opening chapter of the Book Genesis, that ancient poetic description of creation.\n\n31 God saw everything that he had made, and indeed, it was very good.\nAnd there was evening and there was morning, the sixth day. Gen 1:31\n\nI just have an image of Barbara the artist, William the poet stepping back from their work and just smiling and saying to themselves, ‘That’s it’.\n\nSo today we give thanks to God for William, as artist, as poet, as father and friend. To Rachael we offer our love and sympathy in the days and weeks and years to come For William the struggles of these past years of illness are past and we commend him to the loving care of Almighty God in fellowship with his beloved Barbara.\n\nAnother passion in William’s life was sailing, something at which I gather he was very good. And so I close with a passage that draws together his love of sailing and our hope for him and all those we love.\n\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mr William Carron.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of William Carron – Mount Jerome – July 31st 2017\nBack in May we gathered in St Mary’s Church for the funeral of Barbara\nCarron. Back then we referred to a wonderful creative partnership between\nBarbara and her husband William. Today, less than four months later, we\ngather for the funeral of William.\nWe gather to stand alongside Rachael as she lets go of those who brought her\nto birth, who loved and cherished her, who encouraged her.\nWilliam was born in Clontarf and, like Barbara, shared a passion for the\ncreative arts. As I was reflecting on what to say today, I was struck by the\nprayers appointed for Monday in the Church of Ireland Book of Common\nPrayer in which we are encouraged to give thanks\n‘for the continuing work of creation,\nour share in it\nand for creative vision and inventive skill.\nI had known all along that William was a poet – I had not realised that he was\nan artist in his own right, a superb draughtsman, working in ceramics, an\nAssociate of the Royal Irish Academy. As Rachael remarked, he possibly had\nto work harder at his art than Barbara to produce his own distinctive genius.\nThe house at Matakana was very much a place of creative vision and inventive\nskill. Barbara and William each had their own space in which to work, in\nwhich to create. Barbara had her studio in the house, William the shed at the\nend of garden. In that separation they worked out their common creative spirit.\nIt was very much a home within which they each encouraged and supported\neach other. It was a place of great simplicity – there were no unnecessary frills\neither in dress or décor.\nPage 2 of 3\nFuneral of William Carron – Mount Jerome – July 31st 2017\nWilliam taught for a while in Sutton Park School – something he really\nenjoyed. When you think of the other people on the staff at that time, the staff\nroom at that time must have been a very interesting place.\nI would gather that growing up William did not have a good experience of\nChurch and so would not have regarded himself as religious. Sadly that is\nmore a comment on the Church than on William. Just because he would not\nhave regarded himself as religious, there would have been a strong spiritual\ndimension to his life. For one thing that would mark out the artist is a strong\nsense of the Other, something, someone beyond ourselves.\nSpeaking as a complete outsider on this one, I would see the artist must have\nsomething of a sense of wonder before they ever put brush to canvas, or pen to\npaper. This sense of wonder, whether for the scientist or for the artist, is\nbeautifully expressed in the Psalms of the Old Testament. I often find myself\ngoing back again and again to Psalm 8\n4 When I consider your heavens, the work of your fingers, ♦\nthe moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; ♦\nthe son of man, that you should seek him out?\nFor William, and all those engaged in creative work, there is a losing of\nourselves in the work, a giving of ourselves in the work, that brings us in touch\nwith the Other. There is a strong tradition in the ancient Celtic Church of\nencountering God in and through his creation that is summed up in the title of a\nbook I have at home, ‘Listening to the heart beat of God’.\nThere is a passage that that is read many times in Church comes from the\nopening chapter of the Book Genesis, that ancient poetic description of\ncreation.\nPage 3 of 3\nFuneral of William Carron – Mount Jerome – July 31st 2017\n31 God saw everything that he had made, and indeed, it was very good.\nAnd there was evening and there was morning, the sixth day. Gen 1:31\nI just have an image of Barbara the artist, William the poet stepping back from\ntheir work and just smiling and saying to themselves, ‘That’s it’.\nSo today we give thanks to God for William, as artist, as poet, as father and\nfriend. To Rachael we offer our love and sympathy in the days and weeks and\nyears to come For William the struggles of these past years of illness are past\nand we commend him to the loving care of Almighty God in fellowship with\nhis beloved Barbara.\n.\nAnother passion in William’s life was sailing, something at which I gather he\nwas very good. And so I close with a passage that draws together his love of\nsailing and our hope for him and all those we love.\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}