{
    "title": "Funeral of Mrs Pamela Blandford",
    "date": "2009-06-06",
    "blurb": "This sermon was delivered on the occasion of the funeral of Mrs Pamela Blandford. It reflects on the sadness of loss, the mystery of death, and the Christian faith's promise of life triumphant over death. The sermon also shares memories of Mrs Blandford as a remarkable woman with many gifts and talents.",
    "raw_text": "This morning we have gathered here in St Mary’s for the funeral of Pamela Blandford, a dearly loved mother, grandmother, friend. At the end of a long life graciously lived, lived and savoured to the full, we come to remember with thanksgiving one who has been taken from us, one we have loved and whose love has sustained us, one who has been part of our lives. Along with our thankfulness we come with a very proper sadness and loss.\n\nHowever much we know the end is coming, however much we want the suffering of a loved one to be over, there is still that loss, that gap in our lives that no one else can fill in quite the same way. Those of us outside the immediate family circle come to support those who will miss her most, her children.\n\nWe come to set the mystery of death in the context of our Christian faith. I begin with Easter, with life triumphant over death that lies at the heart of our faith. In this I am reminded that we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep and the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I can come in my own time of suffering and find real comfort, real strength and real hope.\n\nA passage I often find myself turning to at a time of a funeral is from St Paul's second letter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home. The words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Pamela Blandford, that all the limitations of these latter years, the frailty, along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ.\n\nThe family have shared with us memories of a remarkable woman, with many gifts and talents. I have only known her in the latter stages of life, at that stage a life dominated by illness and decline. That decline must have been hard for the family to watch, hard for Pamela herself. What always struck me about her, apart form a deep pride and love for her family, was a common sense, very practical approach to life and the stage she was at. There was a deep rooted acceptance; now there was nothing defeatist about this – it had its roots in a spiritual heritage that permeated her very being. When she was able it was lovely to share communion with her. She was the sort of person it was very natural to pray with, for whom the blessing at the end of a visit meant a great deal.\n\nI will close with a prayer that brings home to me the hope that we have in Christ for ourselves and for those who have gone before us in the faith.; a prayer that I think would be very much in tune with Pamela’s own spirituality.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Pamela Blandford.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Mrs Pamela Blandford – 6th June 2009\nThis morning we have gathered here in St Mary’s for the funeral of Pamela Blandford, a\ndearly loved mother, grandmother, friend. At the end of a long life graciously lived, lived\nand savoured to the full, we come to remember with thanksgiving one who has been taken\nfrom us, one we have loved and whose love has sustained us, one who has been part of our\nlives. Along with our thankfulness we come with a very proper sadness and loss.\nHowever much we know the end is coming, however much we want the suffering of a\nloved one to be over, there is still that loss, that gap in our lives that no one else can fill in\nquite the same way. Those of us outside the immediate family circle come to support\nthose who will miss her most, her children.\nWe come to set the mystery of death in the context of our Christian faith. I begin with\nEaster, with life triumphant over death that lies at the heart of our faith. In this I am\nreminded that we follow a Lord who knows what death, what suffering, what loss is all\nabout; one who knew what it was like to weep and the grave of his friend Lazarus. Not\nonly that, he is the one who was raised triumphant over death, breaking the power of death\nitself. Knowing in his own person what it was all about, I find in him one to whom I cam\ncome in my own time of suffering and find real comfort, real strength and real hope.\nA passage I often find myself turning to at a time of a funeral is from St Paul's second\nletter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this\nPaul presents us with the reality of our own mortality and death, he talks very plainly of\nthe body wearing out. But just as he talks of the reality of physical decline and death,\nPaul talks of our new heavenly home. The words that really stand out for me are ; \"So\nthat what is mortal may be swallowed up by life.\" This is our hope for Pamela Blandford,\nthat all the limitations of these latter years, the frailty, along with all the limitations that go\nwith being human are \"swallowed up by life\", that is our inheritance in Christ.\nThe family have shared with us memories of a remarkable woman, with many gifts and\ntalents. I have only known her in the latter stages of life, at that stage a life dominated by\nPage 2 of 2\nFuneral of Mrs Pamela Blandford – 6th June 2009\nillness and decline. That decline must have been hard for the family to watch, hard for\nPamela herself. What always struck me about her, apart form a deep pride and love for\nher family, was a common sense, very practical approach to life and the stage she was at.\nThere was a deep rooted acceptance; now there was nothing defeatist about this – it had its\nroots in a spiritual heritage that permeated her very being. When she was able it was\nlovely to share communion with her. She was the sort of person it was very natural to\npray with, for whom the blessing at the end of a visit meant a great deal.\nI will close with a prayer that brings home to me the hope that we have in Christ for\nourselves and for those who have gone before us in the faith.; a prayer that I think would\nbe very much in tune with Pamela’s own spirituality.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose\nthem in giving, so we have not lost them by their return. What thou gavest thou takest not\naway, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal\nand love is immortal, and death is only an horizon, and an horizon is nothing save the limit\nof our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that\nwe may see more clearly; and draw us closer to thyself that we may know ourselves to be\nnearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be for evermore."
    }
}