{
    "title": "Remembering Florrie Rowden",
    "date": "2015-02-11",
    "blurb": "This sermon was delivered at the funeral of Mrs Florrie Rowden on 11th February 2015. It reflects on Florrie's life, her warmth and positivity despite personal challenges, and her deep connection to her family and community. The sermon also offers comfort and hope to those mourning her loss, drawing on biblical passages to affirm the resurrection hope.",
    "raw_text": "Funeral of Mrs Florrie Rowden – 11th February 2015\n\nI remember back in 2005 when I first came to Howth, one of my first visits to Ailsbury Nursing Home to visit Florrie Rowden. At that stage she had been living there for nearly a year following a major stroke that had rendered her immobile.\n\nGillian has shared her own reflections on Florrie, some of the events in her early life that helped to make Florrie the person she was. Events like the, the experience of early loss, the immobility following her stroke can have two effects on us. They can turn us in on ourselves or they can bring out a warmth and positivity. the Florrie I met in the wheelchair that afternoon was anything but inward looking. She was more keen to talk about me, my family, how we were settling in that about herself.\n\nShe had grown up on a farm near Athy and experienced the early loss of her father and other family members. And, as Gillian has reflected, family, the maintenance of contact with family were important to her. As we all know, she adored Christmas – the gathering of friends and family, the welcome, the giving were very much part of who she was.\n\nShe came up to work in Dublin. It is here she met Cecil. They settled first in Kilbarrack and then Offington and here they reared their son Alan. They became very much part of the community here in St Mary’s. Florrie would have been regular in her participation in the life and worship of this place. She was never one to seek the limelight but was always there ready to work, looking after the distribution of the Review and the Gazette for many years, helping on the cakestall, helping with teas and coffee – and all of it with her cheerful and easy going manner.\n\nShe really appreciated the continuing friendship and support of her many friends in the Parish following her stroke. Those regular visits across to Sandymount were hugely important to her – though as her friends would have said to me on many occasion she was a lovely person to visit. She and Cecil have been deeply appreciative of the wonderful care given by the Nursing Home staff and the pastoral support of Canon Ted Ardis, and latterly Rev John Marchant of Donnybrook and Irishtown\n\nAll through these last ten years, her beloved Cecil has been there; visiting, encouraging, a constant loving presence at her side, wonderfully supported by Alan and his wife Gillian. There was one time of year when he wasn’t there – Christmas shopping - Gillian may have said something about body language.\n\nThere is so much to be thankful for in the life of this lovely lady as wife, as mother, mother-in-law, as friend. But however thankful we are, however strong our faith, however much we know that our loved one’s time of suffering and incapacity is over, there is still that searing loss, a very proper sadness as we lose the closer presence of one we have loved, who has loved and cherished us, one who has been so much a light and strengthening presence in our lives.\n\nAnd so those of us outside the immediate family circle gather around today to extend our love and sympathy to Cecil, to Alan and to Gillian, and to those who loved Florrie Rowden. You are very much in our thoughts and prayers, not just for today but for the days and weeks to come.\n\nFlorrie grew up on the land, she loved her garden and so she would have been very familiar with the cycle of the seasons, the cycle of life, of growth and death. So the themes of the passage that we read from Ecclesiastes would have been familiar to her – a time to be born and a time to die, a time to weep and a time to laugh. With that cycle of life comes an acceptance of mortality. But we do that, not in a spirit of fatalism but of hope.\n\nOn these occasions, and particularly at the funeral of a person such as Florrie who has known a period of extended immobility, I will often reflect on a passage from Paul’s second letter to the Corinthians. In this passage Paul talks very naturally of mortality, of the body wearing out and then declares:\n\n4 For while we are still in this tent, we groan under our burden, because we wish not to be unclothed but to be further clothed, so that what is mortal may be swallowed up by life. 2 Cor 5:4\n\nThose words, ‘so that what is mortal may be swallowed up by life’, go right to the heart of our resurrections hope. That is our hope for Florrie this day, that all the limitations of these past few years, the immobility, the frustrations that even Florrie must have felt, the limitations of just being human – all swallowed up in life in the closer presence of Christ in the faith of whom Florrie lived and died, in whose presence may she find perfect peace.\n\nAs Florrie leaves the Church, the organist will be playing the tune of hymn 552. Verse 3 runs as follows\n\n'Tis Jesus calls me on\nto perfect faith and love,\nto perfect hope, and peace, and trust,\nfor earth and heaven above..\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Florrie Rowden.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mrs Florrie Rowden – 11th February 2015\nI remember back in 2005 when I first came to Howth, one of my first visits to\nAilsbury Nursing Home to visit Florrie Rowden. At that stage she had been\nliving there for nearly a year following a major stroke that had rendered her\nimmobile.\nGillian has shared her own reflections on Florrie, some of the events in her\nearly life that helped to make Florrie the person she was. Events like the, the\nexperience of early loss, the immobility following her stroke can have two\neffects on us. They can turn us in on ourselves or they can bring out a warmth\nand positivity. the Florrie I met in the wheelchair that afternoon was anything\nbut inward looking. She was more keen to talk about me, my family, how we\nwere settling in that about herself.\nShe had grown up on a farm near Athy and experienced the early loos of her\nfather and other family members. And, as Gillian has reflected, family, the\nmaintenance of contact with family were important to her. As we all know, she\nadored Christmas – the gathering of friends and family, the welcome, the\ngiving were very much part of who she was.\nShe came up to work in Dublin. It is here she met Cecil. They settled first in\nKilbarrack and then Offington and here they reared their son Alan. They\nbecame very much part of the community here in St Mary’s. Florrie would\nhave been regular in her participation in the life and worship of this place. She\nwas never one to seek the limelight but was always there ready to work,\nlooking after the distribution of the Review and the Gazette for many years,\nhelping on the cakestall, helping with teas and coffee – and all of it with her\ncheerful and easy going manner.\nShe really appreciated the continuing friendship and support of her many\nfriends in the Parish following her stroke. Those regular visits across to\nPage 2 of 3\nFuneral of Mrs Florrie Rowden – 11th February 2015\nSandymount were hugely important to her – though as her friends would have\nsaid to me on many occasion she was a lovely person to visit. She and Cecil\nhave been deeply appreciative of the wonderful care given by the Nursing\nHome staff and the pastoral support of Canon Ted Ardis, and latterly Rev John\nMarchant of Donnybrook and Irishtown\nAll through these last ten years, her beloved Cecil has been there; visiting,\nencouraging, a constant loving presence at her side, wonderfully supported by\nAlan and his wife Gillian. There was one time of year when he wasn’t there –\nChristmas shopping - Gillian may have said something about body language.\nThere is so much to be thankful for in the life of this lovely lady as wife, as\nmother, mother-in-law, as friend. But however thankful we are, however\nstrong our faith, however much we know that our loved one’s time of suffering\nand incapacity is over, there is still that searing loss, a very proper sadness as\nwe lose the closer presence of one we have loved, who has loved and cherished\nus, one who has been so much a light and strengthening presence in our lives.\nAnd so those of us outside the immediate family circle gather around today to\nextend our love and sympathy to Cecil, to Alan and to Gillian, and to those\nwho loved Florrie Rowden. You are very much in our thoughts and prayers,\nnot just for today but for the days and weeks to come.\nFlorrie grew up on the land, she loved her garden and so she would have been\nvery familiar with the cycle of the seasons, the cycle of life, of growth and\ndeath. So the themes of the passage that we read from Ecclesiastes would have\nbeen familiar to her – a time to be born and a time to die, a time to weep and a\ntime to laugh. With that cycle of life comes an acceptance of mortality. But\nwe do that, not in a spirit of fatalism but of hope.\nPage 3 of 3\nFuneral of Mrs Florrie Rowden – 11th February 2015\nOn these occasions, and particularly at the funeral of a person such as Florrie\nwho has known a period of extended immobility, I will often reflect on a\npassage from Paul’s second letter to the Corinthians. In this passage Paul talks\nvery naturally of mortality, of the body wearing out and then declares:\n4 For while we are still in this tent, we groan under our burden, because\nwe wish not to be unclothed but to be further clothed, so that what is\nmortal may be swallowed up by life. 2 Cor 5:4\nThose words, ‘so that what is mortal may be swallowed up by life’, go right to\nthe heart of our resurrections hope. That is our hope for Florrie this day, that\nall the limitations of these past few years, the immobility, the frustrations that\neven Florrie must have felt, the limitations of just being human – all swallowed\nup in life in the closer presence of Christ in the faith of whom Florrie lived and\ndied, in whose presence may she find perfect peace.\nAs Florrie leaves the Church, the organist will be playing the tune of hymn\n552. Verse 3 runs as follows\n‘Tis Jesus calls me on\nto perfect faith and love,\nto perfect hope, and peace, and trust,\nfor earth and heaven above..\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be\nfor evermore."
    }
}