{
    "title": "Barbara Carron - Memorial Service",
    "date": "2017-05-16",
    "blurb": "A memorial service for Barbara Carron, a beloved artist, teacher, wife, and mother. The sermon reflects on Barbara's life and creative spirit, drawing parallels between her artistic process and the act of prayer. It also emphasizes the importance of love, as seen in Barbara's relationships and her generous sharing of her artistic gift.",
    "raw_text": "We have come here to remember, to give thanks, to reflect on the life and witness of Barbara Carron as mother, as wife, as member of this place, as artist. The Barbara I met in this place was quiet and almost understated, who would come here for the quietness of the 9:30 and slip quietly away. The Barbara I met in Matakana was the same Barbara but here I met the Barbara so many of you have come here to honour, to give thanks, to celebrate, an artist of considerable distinction, a wonderful and gifted teacher and a much loved wife and mother.\n\nSo this afternoon in my thoughts I just want to bring together Barbara at worship and Barbara’s creative spirit. Speaking as a complete outsider on this one, I would see the artist must have something of a sense of wonder before they ever put brush to canvas. And so I begin with Psalm 8, a Psalm that Barbara would have said many a time in this place:\n\n> 4 When I consider your heavens, the work of your fingers, ♦\n> the moon and the stars that you have ordained,\n> 5 What is man, that you should be mindful of him; ♦\n> the son of man, that you should seek him out?\n\nThat sense of wonder must also be at the heart of prayer. St Benedict, in writing his Monastic Rule, spoke of prayer as the work of God. I have a picture of the monk praying not only in the offices of the day but also over the tasks he is assigned..\n\nFor Barbara, and all those engaged in creative work, there is a losing of ourselves in the work, a giving of ourselves in the work, that brings us in touch with the Other. There is a strong tradition in the ancient Celtic Church of encountering God in and through his creation that is summed up in the title of a book I have at home, ‘Listening to the heart beat of God’.\n\nA passage that Barbara will have heard many times in this Church comes from the opening chapter of the Book Genesis, that ancient poetic description of creation.\n\n> 31 God saw everything that he had made, and indeed, it was very good.\n> And there was evening and there was morning, the sixth day. Gen 1:31\n\nI just have an image of Barbara the artist, stepping back from a canvas and just smiling and saying to herself, ‘That’s it’.\n\nOne of the insights of the Hebrew Scriptures is that we are made in the image of God. We are called in our own selves to express something of that creative spirit of God. So today we give thanks to God for Barbara the artist.\n\nIn the New Testament, the Apostle John, in his first letter, offers another insight into the nature of God. He does not tell us that God loves – no he goes deeper than that and declares ‘God is love’ and in his command ‘little children, love one another’. And so this afternoon we give thanks to God for the ways in which we have experienced love in the life of Barbara Carron. Barbara was married to another creative genius, her husband William, who crafted not in paint but in words – though as their daughter Rachael remarked to me it was as well they worked in different parts of the house. Together they brought up Rachael here in Howth. Many of you will know her not just as artist, but also as teacher and we have heard of the warmth and the generosity with which she shared her gift.\n\nSo today we give thanks to God for Barbara, for her creative genius, her warm and generous heart, for ways in which God has touched our lives through hers\n\n> O God, we thank you for the gift of life\n> and for the faculties which enable us to enjoy it.\n> You have given us eyes to see the beauty of our world,\n> our ears to hear speech and the sound of music,\n> our lips with which to speak in friendship to others,\n> and our hands with which to minister to their needs.\n> Help us through the grace of your Holy Spirit,\n> to use all that we have in your service\n> and for your greater glory;\n> through Jesus Christ our Lord.\n\nOf course the death of a loved one, however much we may anticipate it, know it is coming, is a time of loss and a very proper sadness. The one we loved, the listening ear, the friendly smile is no longer there. So today, as we give thanks for the life, the vitality, the talent of Barbara Carron, we think of William, of Rachael, their daughter and all who loved her. As you remember your Mum, as you miss your Mum, may you know God’s presence and peace in the days to come and be assured of the love and prayers of so many who love and treasure you.\n\nAnd so this day, in love and gratitude we commend Barbara to the loving care of almighty God\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Barbara Carron - memorial service.txt",
        "raw_ocr_content": "Page 1 of 3\nBarbara Carron – Memorial Service – 16th May 2017\nWe have come here to remember, to give thanks, to reflect on the life and\nwitness of Barbara Carron as mother, as wife, as member of this place, as artist.\nThe Barbara I met in this place was quiet and almost understated, who would\ncome here for the quietness of the 9:30 and slip quietly away. The Barbara I\nmet in Matakana was the same Barbara but here I met the Barbara so many of\nyou have come here to honour, to give thanks, to celebrate, an artist of\nconsiderable distinction, a wonderful and gifted teacher and a much loved wife\nand mother.\nSo this afternoon in my thoughts I just want to bring together Barbara at\nworship and Barbara’s creative spirit.\nSpeaking as a complete outsider on this one, I would see the artist must have\nsomething of a sense of wonder before they ever put brush to canvas. And so I\nbegin with Psalm 8, a Psalm that Barbara would have said many a time in this\nplace:\n4 When I consider your heavens, the work of your fingers, ♦\nthe moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; ♦\nthe son of man, that you should seek him out?\nThat sense of wonder must also be at the heart of prayer. St Benedict, in\nwriting his Monastic Rule, spoke of prayer as the work of God. I have a\npicture of the monk praying not only in the offices of the day but also over the\ntasks he is assigned..\nFor Barbara, and all those engaged in creative work, there is a losing of\nourselves in the work, a giving of ourselves in the work, that brings us in touch\nwith the Other. There is a strong tradition in the ancient Celtic Church of\nPage 2 of 3\nBarbara Carron – Memorial Service – 16th May 2017\nencountering God in and through his creation that is summed up in the title of a\nbook I have at home, ‘Listening to the heart beat of God’.\nA passage that Barbara will have heard many times in this Church comes from\nthe opening chapter of the Book Genesis, that ancient poetic description of\ncreation.\n31 God saw everything that he had made, and indeed, it was very good.\nAnd there was evening and there was morning, the sixth day. Gen 1:31\nI just have an image of Barbara the artist, stepping back from a canvas and just\nsmiling and saying to herself, ‘That’s it’.\nOne of the insights of the Hebrew Scriptures is that we are made in the image\nof God. We are called in our own selves to express something of that creative\nspirit of God. So today we give thanks to God for Barbara the artist.\nIn the New Testament, the Apostle John, in his first letter, offers another\ninsight into the nature of God. He does not tell us that God loves – no he goes\ndeeper than that and declares ‘God is love’ and in his command ‘little children,\nlove one another’. And so this afternoon we give thanks to God for the ways in\nwhich we have experienced love in the life of Barbara Carron. Barbara was\nmarried to another creative genius, her husband William, who crafted not in\npaint but in words – though as their daughter Rachael remarked to me it was as\nwell they worked in different parts of the house. Together they brought up\nRachael here in Howth. Many of you will know her not just as artist, but also\nas teacher and we have heard of the warmth and the generosity with which she\nshared her gift.\nSo today we give thanks to God for Barbara, for her creative genius, her warm\nand generous heart, for ways in which God has touched our lives through hers\nPage 3 of 3\nBarbara Carron – Memorial Service – 16th May 2017\nO God, we thank you for the gift of life\nand for the faculties which enable us to enjoy it.\nYou have given us eyes to see the beauty of our world,\nour ears to hear speech and the sound of music,\nour lips with which to speak in friendship to others,\nand our hands with which to minister to their needs.\nHelp us through the grace of your Holy Spirit,\nto use all that we have in your service\nand for your greater glory;\nthrough Jesus Christ our Lord.\nOf course the death of a loved one, however much we may anticipate it, know\nit is coming, is a time of loss and a very proper sadness. The one we loved, the\nlistening ear, the friendly smile is no longer there. So today, as we give thanks\nfor the life, the vitality, the talent of Barbara Carron, we think of William, of\nRachael, their daughter and all who loved her. As you remember your Mum,\nas you miss your Mum, may you know God’s presence and peace in the days to\ncome and be assured of the love and prayers of so many who love and treasure\nyou.\nAnd so this day, in love and gratitude we commend Barbara to the loving care\nof almighty God\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst\nnot lose them in giving, so we have not lost them by their return. What thou\ngavest thou takest not away, O Lover of souls; for what is thine is ours also if we\nare thine. And life is eternal and love is immortal, and death is only an horizon,\nand an horizon is nothing save the limit of our sight. Lift us up, strong Son of God,\nthat we may see further; cleanse our eyes that we may see more clearly; and draw\nus closer to thyself that we may know ourselves to be nearer to our loved ones who\nare with thee. And while thou dost prepare for us, prepare us also for that happy\nplace, that where they are and thou art, we too may be for evermore."
    }
}