{
    "title": "Remembering Betty Hegarty",
    "date": "2014-04-04",
    "blurb": "This sermon is a tribute to the life of Mrs. Betty Hegarty, a remarkable woman with a wide range of interests and a passion for justice. She was a beloved mother, a voracious reader, a traveler, and an advocate for women's rights. Her death was sudden and unexpected, but she was comfortable with her mortality, viewing death as a 'big adventure'.",
    "raw_text": "Funeral of Mrs Betty Hegarty – 4th April 2014\n\nLast Monday I received the news that Mrs Betty Hegarty had died in her home on the Old Carrickbrack Road and the family began the preparations for her funeral today. Over these last few days, in conversations with her family and with those who had known her in the area I gained a picture of a remarkable lady. Today the family, through a series of readings and tributes, will be sharing some of their memories, ways in which Betty Hegarty touched their lives and will continue to inspire them. The many friends who have gathered here have come to offer their own thanks for Betty and to stand alongside her family at this time. Standing as we do, in the approach to Good Friday and Easter, we acknowledge the reality of death , of mortality and proclaim, in the words of a prayer I will use later in this service, ‘And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight.’. It is that horizon, that limit to our sight, that Betty sought to explore, to extend in her own mind, in the minds of others.\n\nBetty Hegerty grew up in Clontarf within the fellowship of the Presbyterian Church. She met and married her husband Brian and they established their home in Howth on the Old Carrickbrack Road and here they reared their family Robin, Andrew and Liz. The family recall a woman with a wide range of interests. She was very much a mother, devoting herself to the care of her children, developing their interests and their individuality.\n\nA voracious reader, she loved the theatre and films. She loved travel and would until very recently have been a frequent visitor to India. She had a love of people and a passion for justice. A keen advocate of women’s rights, she was involved in education for disadvantaged women in Tallaght.\n\nHer death was sudden and unexpected and this has been a shock to the family but Betty was clearly comfortable with her mortality. She would have spoken of the big adventure of death. I think she could have identified with that expression I quoted earlier, ‘And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight.’ The family remember her as a deeply spiritual woman. A period of meditation would have been part of her daily routine and she was a core member of a group meeting in town.\n\nSo today we gather to thank God for Betty Hegerty; a beloved mother, a woman with a zest for life, one with a deep concern for people, for the disadvantaged, for justice, one who was clearly very much at peace with herself.\n\nWe pray with and for her family and for ourselves as we commend her to Almighty God.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Betty Hegarty.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Mrs Betty Hegarty – 4th April 2014\nLast Monday I received the news that Mrs Betty Hegarty had died in her home\non the Old Carrickbrack Road and the family began the preparations for her\nfuneral today. Over these last few days, in conversations with her family and\nwith those who had known her in the area I gained a picture of a remarkable\nlady. Today the family, through a series of readings and tributes, will be\nsharing some of their memories, ways in which Betty Hegarty touched their\nlives and will continue to inspire them. The many friends who have gathered\nhere have come to offer their own thanks for Betty and to stand alongside her\nfamily at this time. Standing as we do, in the approach to Good Friday and\nEaster, we acknowledge the reality of death , of mortality and proclaim, in the\nwords of a prayer I will use later in this service, ‘And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save the limit\nof our sight.’. It is that horizon, that limit to our sight, that Betty sought to\nexplore, to extend in her own mind, in the minds of others.\nBetty Hegerty grew up in Clontarf within the fellowship of the Presbyterian\nChurch. She met and married her husband Brian and they established their\nhome in Howth on the Old Carrickbrack Road and here they reared their family\nRobin, Andrew and Liz. The family recall a woman with a wide range of\ninterests. She was very much a mother, devoting herself to the care of her\nchildren, developing their interests and their individuality.\nA voracious reader, she loved the theatre and films. She loved travel and\nwould until very recently have been a frequent visitor to India. She had a love\nof people and a passion for justice. A keen advocate of women’s rights, she\nwas involved in education for disadvantaged women in Tallaght.\nPage 2 of 2\nFuneral of Mrs Betty Hegarty – 4th April 2014\nHer death was sudden and unexpected and this has been a shock to the family\nbut Betty was clearly comfortable with her mortality. She would have spoken\nof the big adventure of death. I think she could have identified with that\nexpression I quoted earlier, ‘And life is eternal and love is immortal, and death\nis only an horizon, and an horizon is nothing save the limit of our sight.’ The\nfamily remember her as a deeply spiritual woman. A period of meditation\nwould have been part of her daily routine and she was a core member of a\ngroup meeting in town.\nSo today we gather to thank God for Betty Hegerty; a beloved mother, a\nwoman with a zest for life, one with a deep concern for people, for the\ndisadvantaged, for justice, one who was clearly very much at peace with\nherself.\nWe pray with and for her family and for ourselves as we commend her to\nAlmighty God.\nWe give them back to thee, dear Lord, who gavest them to us.\nYet as thou didst not lose them in giving, so we have not lost\nthem by their return. What thou gavest thou takest not away, O\nLover of souls; for what is thine is ours also if we are thine.\nAnd life is eternal and love is immortal, and death is only an\nhorizon, and an horizon is nothing save the limit of our sight.\nLift us up, strong Son of God, that we may see further; cleanse\nour eyes that we may see more clearly; and draw us closer to\nthyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us,\nprepare us also for that happy place, that where they are and\nthou art, we too may be for evermore."
    }
}