{
    "title": "Remembering Muriel Robinson",
    "date": "2016-04-29",
    "blurb": "This sermon is a touching tribute to Mrs. Muriel Robinson, who passed away in 2016. It recounts her life, her love for people, and her dedication to her family and community. The sermon emphasizes her contentment in life and her faith, inspiring others to find peace and prioritize faith in their own lives.",
    "raw_text": "Funeral of Mrs Muriel Robinson – 29th April 2016\n\nBack in 1964, David and Muriel Robinson came to settle among us. David had come down to direct the newly established Horticultural Institute in Kinsealy. It was part of the era of Lemass and Whitaker as Ireland began to look beyond its own borders to develop its industry and horticultural sector. They had come down from Belfast and they settled in Earlscliffe in Howth. Earlscliffe had a history and tradition of its own, being the home at one stage of Provost Mehaffy of Trinity. Muriel and David Robinson began to make their own mark on it. David with his horticultural skills developed a wonderful garden which drew visitors from near and far. Muriel developed a home – first and foremost for her family - but also a place of great hospitality.\n\nMuriel was born in Belfast moving later to Glengormley. Her father was an engineer and her mother worked as a GP. She would speak very warmly of her family life. She would also speak very warmly of the move to Howth, the reaction of some of their friends in the North to the move to this strange part of the world. There was evidently a great satisfaction in seeing the house and garden develop.\n\nWhereas her own mother had got great satisfaction in her work as a GP, Muriel got hers from watching her family grow up, in sharing David’s love of the garden, providing hospitality to the many and varied groups that would come to visit. As the family have been sharing some of their memories of Muriel, one thing that kept coming to the surface was her love of people. One phrase that really struck me was her ‘confidence in human goodness.’. When asylum seekers were settled in Sutton Castle, she would gladly give lifts to perfect strangers, alone in a foreign land. Karen spoke of her visiting a traveller encampment and explaining a letter that a lady had received from the health authorities – it was just a natural thing to do.\n\nOriginally members of the Presbyterian Church, they had come to settle in St Mary’s. Here Muriel became very much part of this congregation, always ready to give a helping hand, ready to help in the kitchen providing coffee for after our Sunday Service. Then in the wider community, helping with meals on wheels, even after others would have given up.\n\nThen as her health began to deteriorate, and carers came into the house, she would be very attentive to the needs of the carers. When the time came when she needed full time residential care, she moved into Highfield, she retained her wonderful warm personality, always very appreciative of all that was done for her.\n\nI suppose what is coming through here is a basic contentment. This is a theme that runs through both of the lessons that the family have chosen for our service today, that lovely passage from Ecclesiastes that speaks to me of a rhythm that runs through life and that lovely passage from the Sermon on the Mount in which Jesus enjoins us not to worry, not to be anxious. In that Muriel found a peace that eludes so many of us. That is a lesson that so many of us who live in this much faster, hi tech world of constant availability, 24 hours news and information have lost – that simple peace that passes understanding that I think Muriel showed us in her life.\n\nA funeral, particularly of a loved one, is a time of taking stock. A big part of that for each of us is that of periodically reassessing our priorities, what is really important in life, the place we give to God in our decisions, in our worship in our life. Those of Muriel’s generation have valuable lessons to teach us in the priority they give to worship, to faith – it is so easy to lose sight of that in the busy-ness in which the seemingly urgent can displace the important.\n\nOf course the death of a loved one involves a letting go. One whose presence we have enjoyed, whose love and encouragement has meant so much to us is no longer with us. There is a sadness in our letting go. And however strong our faith, however much we know that death is a release for our loved ones, there is still a very proper sadness on an occasion such as this as we say farewell to someone who has been so much of our lives, with whom we have shared so many memories, so much love and in this regard we think particularly of her family and close friends on this day. Those of us outside the immediate family circle have come today to assure you of our love and prayers not just for today but for the weeks and months to come as you come to terms to life without Muriel.\n\nOur hope for Muriel this day is peace in the closer presence of the God she worshipped in this place and in her life. Inspired by her example and her faith let us this day dedicate ourselves afresh to the worship and service of Almighty God looking forward to that day when we shall be reunited with those who have gone before us in the faith.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Muriel Robinson.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mrs Muriel Robinson – 29th April 2016\nBack in 1964, David and Muriel Robinson came to settle among us. David had\ncome down to direct the newly established Horticultural Insititute in Kinsealy.\nIt was part of the era of Lemass and Whitaker as Ireland began to look beyond\nits own borders to develop its industry and horticultural sector. They had come\ndown from Belfast and they settled in Earlscliffe in Howth. Earlsclifee ahd a\nhistory and tradition of its own, being the home oat one stage of Provost\nMehaffy of Trinity. Muriel and David Robinson began to make their own\nmark on it. David with his horticultural skills developed a wonderful garden\nwhich drew visitors from near and far. Muriel developed a home – first and\nforemost for her family - but also a place of great hospitality.\nMuriel was born in Belfast moving later to Glengormley. Her father was an\nengineer and her mother worked as a GP. She would speak very warmly of her\nfamily life. She would also speak very warmly of the move to Howth, the\nreaction of some of their friends in the North to the move to this strange part of\nthe world. There was evidently a great satisfaction in seeing the house and\ngarden develop.\nWhereas her won mother had got great satisfaction in her work as a GP, Muriel\ngot hers from watching her family grow up, in sharing David’s love of the\ngarden, providing hospitality to the many and varied groups that would come\nto visit. As the family have been sharing some of their memories of Muriel,\none thing that kept coming to the surface was her love of people. One phrase\nthat really struck me was her ‘confidence in human goodness.’. When asylum\nseekers were settled in Sutton Castle, she would gladly give lifts to perfect\nstrangers, alone in a foreign land. Karen spoke of her visiting a traveller\nencampment and explaining a letter that a lady had received from the health\nauthorities – it was just a natural thing to do.\nPage 2 of 3\nFuneral of Mrs Muriel Robinson – 29th April 2016\nOriginally members of the Presbyterian Church, they had come to settle in St\nMary’s. Here Muriel became very much part of this congregation, always\nready to give a helping hand, ready to help in the kitchen providing coffee for\nafter our Sunday Service. Then in the wider community, helping with meals\non wheels, even after others would have given up.\nThen as her health began to deteriorate, and carers came into the house, she\nwould be very attentive to the needs of the carers. When the time came when\nshe needed full time residential care, she moved into Highfield, she retained\nher wonderful warm personality, always very appreciative of all that was done\nfor her.\nI suppose what is coming through here is a basic contentment. This is a theme\nthat runs through both of the lessons that the family have chosen for our service\ntoday, that lovely passage from Ecclesiastes that speaks to me of a rhythm that\nruns through life and that lovely passage from the Sermon on the Mount in\nwhich Jesus enjoins us not to worry, not to be anxious. In that Muriel found a\npeace that eludes so many of us. That is a lesson that so many of us who live\nin this much faster, hi tech world of constant availability, 24 hours news and\ninformation have lost – that simple peace that passes understanding that I think\nMuriel showed us in her life.\nA funeral, particularly of a loved one, is a time of taking stock. A big part of\nthat for each of us is that of periodically reassessing our priorities, what is\nreally important in life, the place we give to God in our decisions, in our\nworship in our life. Those of Muriel’s generation have valuable lessons to\nteach us in the priority they give to worship, to faith – it is so easy to lose sight\nof that in the busy-ness in which the seemingly urgent can displace the\nimportant.\nPage 3 of 3\nFuneral of Mrs Muriel Robinson – 29th April 2016\nOf course the death of a loved one involves a letting go. One whose presence\nwe have enjoyed, whose love and encouragement has meant so much to us is\nno longer with us. There is a sadness in our letting go. And however strong our\nfaith, however much we know that death is a release for our loved ones, there\nis still a very proper sadness on an occasion such as this as we say farewell to\nsomeone who has been so much of our lives, with whom we have shared so\nmany memories, so much love and in this regard we think particularly of her\nfamily and close friends on this day. Those of us outside the immediate family\ncircle have come today to assure you of our love and prayers not just for today\nbut for the weeks and months to come as you come to terms to life without\nMuriel.\nOur hope for Muriel this day is peace in the closer presence of the God she\nworshipped in this place and in her life. Inspired by her example and her faith\nlet us this day dedicate ourselves afresh to the worship and service of Almighty\nGod looking forward to that day when we shall be reunited with those who\nhave gone before us in the faith.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be\nfor evermore."
    }
}