{
    "title": "Remembering Vera Poole",
    "date": "2015-11-24",
    "blurb": "This sermon, delivered at the funeral of Mrs. Vera Poole, reflects on her life, her faith, and the impact she had on her community. The sermon emphasizes the importance of faith in life and how it brings peace and contentment. It also encourages the congregation to reflect on their own spiritual lives and relationships with God.",
    "raw_text": "One of my first visits after I arrived in Howth was to the house of Harry and Vera Poole in Clontarf. Harry was not well at that stage but Harry and Vera made of point of getting to Church as often as they possible could. It was the habit of a lifetime that was learned growing up in rural Ireland. Church, membership, worship were important to them both.\n\nVera had grown up in Templederry and though she had lived in Dublin for a number of years, had worshipped in Howth – Templederry was still the home Parish. I recall visiting Vera and her sister Lily one time for house communion and they were telling me of work being done on the Church and how they had supported it. When Vera came to Dublin, she had worked as a buyer in Newell’s of Grafton Street.\n\nShe had met Harry through a shared interest in badminton. They married and set up their home in Clontarf but Howth became their Parish through contacts with Canon Frank Blennerhassett, the Rector at the time. Their’s seemed to be a real love match and they were to share 38 years together.\n\nHarry’s death was a real blow to Vera and her own health was to deteriorate shortly after his death. She moved up to Kilbarrack to be closer to her sister Lily. Then after Lily died something of the spark went out of her and she moved back down to her native Tipperary where she was cared for in the Ardeen Nursing Home.\n\nShe has not been well for some considerable time now and when death came last Saturday, it was the end of a long struggle. While for Vera this was something of a release, for those who loved her, her sister Maud, her brothers William and Edgar and all who loved her, there is still that sense of loss, that one who has been so much part of your lives is now gone.\n\nThe passage we have just read from Paul's second letter to the Corinthians is the passage we read at Harry’s funeral. This passage always speaks very powerfully to me at a time such as this. It speaks very plainly about the body wearing out. But even as he does this, Paul talks of our new heavenly home.\n\nThe words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Vera and for all those who have gone before us in the faith, that all the limitations of these last couple of years, the frailty, the loss of that energy that was once his along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ.\n\nFor those of Vera’s generation, the life of faith, the practice of faith was part and parcel of life. That gave a peace and contentment that so often eludes us in this apparently more sophisticated age. As we give thanks to God for Vera Poole, this is an opportunity to just stop and reflect on our own priorities, to what extent we have allowed ourselves to get sucked into the busyness and materialism of our present age, to what extent we have lost touch with the spiritual. Let us resolve this day see whatever time is left to us in terms of opportunity - opportunity to deepen our relationships with each other and with God through faith in Christ that we may find a peace and hope in which we may approach our own death secure in his undying love.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Vera Poole.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Mrs Verra Poole – 24th November 2015 – Mount Jerome\nOne of my first visits after I arrived in Howth was to the house of Harry and\nVera Poole in Clontarf. Harry was not well at that stage but Harry and Vera\nmade of point of getting to Church as often as they possible could. It was the\nhabit of a lifetime that was learned growing up in rural Ireland. Church,\nmembership, worship were important to them both\nVera had grown up in Templederry and though she had lived in Dublin for a\nnumber of years, had worshipped in Howth – Templederry was still the home\nParish. I recall visiting Vera and her sister Lily one time for house communion\nand they were telling me of work being done on the Church and how they had\nsupported it. When Vera came to Dublin, she had worked as a buyer in\nNewell’s of Grafton Street.\nShe had met Harry through a shared interest in badminton. They married and\nset up their home in Clontaft but Howth became their Parish through contacts\nwith Canon Frank Blennerhassett, the Rector at the time. Their’s seemed to be\na real love match and they were to share 38 years together\nHarry’s death was a real blow to Vera and her own health was to deteriorate\nshortly after his death. She moved up to Kilbarrack to be closer to her sister\nLily. Then after Lily died something of the spark went out of her and she\nmoved back down to her native Tipperary where she was cared for in the\nArdeen Nursing Home.\nShe has not been well for some considerable time now and when death came\nlast Saturday, it was the end of a long struggle. While for Vera this was\nsomething of a release, for those who loved her, her sister Maud, her brothers\nWilliam and Edgar and all who loved her, there is still that sense of loss, that\none who has been so much part of your lives is now gone.\nPage 2 of 2\nFuneral of Mrs Verra Poole – 24th November 2015 – Mount Jerome\nThe passage we have just read from Paul's second letter to the Corinthians is\nthe passage we read at Harry’s funeral. This passage always speaks very\npowerfully to me at a time such as this. It speaks very plainly about the body\nwearing out. But even as he does this, Paul talks of our new heavenly home.\nThe words that really stand out for me are ; \"So that what is mortal may be\nswallowed up by life.\" This is our hope for Vera and for all those who have\ngone before us in the faith, that all the limitations of these last couple of years,\nthe frailty, the loss of that energy that was once his along with all the\nlimitations that go with being human are \"swallowed up by life\", that is our\ninheritance in Christ.\nFor those of Vera’s generation, the life of faith, the practice of faith was part\nand parcel of life. That gave a peace and contentment that so often eludes us in\nthis apparently more sophisticated age. As we give thanks to God for Vera\nPoole, this is an opportunity to just stop and reflect on our own priorities, to\nwhat extent we have allowed ourselves to get sucked into the busyness and\nmaterialism of our present age, to what extent we have lost touch with the\nspiritual. Let us resolve this day see whatever time is left to us in terms of\nopportunity - opportunity to deepen our relationships with each other and with\nGod through faith in Christ that we may find a peace and hope in which we\nmay approach our own death secure in his undying love.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may\nbe for evermore."
    }
}