{
    "title": "Funeral of Muriel McMillan",
    "date": "2021-04-20",
    "blurb": "This sermon was given at the funeral of Muriel McMillan, a beloved member of the parish. The sermon reflects on Muriel's life, her contributions to the church, and the comfort found in faith during times of loss. It emphasizes the Christian belief in the triumph of life over death, as celebrated during Easter.",
    "raw_text": "We come today for the funeral of Muriel McMillan. In these strange times only a few of us can gather in Church with John but there are a large number of people outside the Church, those watching us online – we think especially of Muriel’s sons Russell and Murray. We extend our sympathy to John, Russell and Murray on this the day of your Mum’s funeral and assure you of our love and prayers in the days to come.\n\nIn a funeral we do a number of things. We remember, we give thanks. Later on in the service, John will be paying his own personal tribute to Muriel on behalf of himself and his brothers who cannot be here, as they remember a mother, a husband of Alistair, a grandmother. One who was at the heart of the family. Her friends remember a dear friend, a wonderful companion and conversationist, one with a keen, impish sense of humour. As a parish we remember one who was regular in public worship, always willing to give of her time, share her talents.\n\nOne of my memories of her is her coming out of Church at the end of a family service. She may have been in her nineties but she was acutely aware of the need for the Church to touch all generations. She came up to me and in a voice that would have been heard by others who were maybe not so keen on that service, declared ‘Kevin, that was wonderful!’\n\nWe remember, we gather in Church and online to offer our love and support to her sons John, Murray and Russell. John has provided wonderful love and care to Muriel enabling her to stay in her own home, to celebrate her 100th birthday last May. He was by her side as she died peacefully in her own bed.\n\nI know I speak for so many people who cannot be here, but are joining us online today, as I assure you of love, of prayers, of simple friendship in the days that lie ahead.\n\nWe remember, we offer our love, we set your loss, our loss in the context of our faith. We come to set the mystery of death in the context of our Christian faith. We have just celebrated the Festival of Easter, the triumph of life over death. We have heard once against the Gospel accounts of disciples devastated by the death of Jesus, huddled together in the upper room.\n\nWe have heard of those same disciples transformed by an encounter with he risen Jesus, that they can only understand in terms of resurrection; an encounter that broke through the darkness of loss and regrets in the words of that simple greeting; ‘Peace be with you.’\n\nSo, today, on the day of her funeral we declare that darkness, death has not had the last word in the life of Muriel McMillan. Sickness, weakness has not had the final say. In fellowship with Muriel, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I can come in my own time of suffering and find real comfort, real strength and real hope.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Muriel McMillan.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Muriel McMillan – Howth – 20 April 2021\nWe come today for the funeral of Muriel McMillan, In these strange times\nonly a few of us can gather in Church with John but there are a large number of\npeople outside the Church, those watching us online – we think especially of\nMuriel’s sons Russell and Murray. We extend our sympathy to John, Russell\nand Murray on this the day of your Mum’s funeral and assure you of our love\nand prayers in the days to come.\nIn a funeral we do a number of things. We remember, we give thanks. Later\non in the service, John will be paying his own personal tribute to Muriel on\nbehalf of himself and his brothers who cannot be here, as they remember a\nmother, a husband of Alistair, a grandmother. One who was at the heart of the\nfamily. Her friends remember a dear friend, a wonderful companion and\nconversationist, one with a keen, impish sense of humour. As a parish we\nremember one who was regular in public worship, always willing to give of her\ntime, share her talents. One of my memories of her is her coming out of\nChurch at the end of a family service. She may have been in her nineties but\nshe was acutely aware of the need for the Church to touch all generations. She\ncame up to me and in a voice that would have been heard by others who were\nmaybe not so keen on that service, declared ‘Kevin, that was wonderful!’\nWe remember, we gather in Church and online to offer our love and support to\nher sons John, Murray and Russell. John has provided wonderful love and care\nto Muriel enabling her to stay in her own home, to celebrate her 100th birthday\nlast May. He was by her side as she died peacefully in her own bed. I know I\nspeak for so many people who cannot be here, but are joining us online today,\nPage 2 of 2\nFuneral of Muriel McMillan – Howth – 20 April 2021\nas I assure you of love, of prayers, of simple friendship in the days that lie\nahead.\nWe remember, we offer our love, we set your loss, our loss in the context of\nour faith. We come to set the mystery of death in the context of our Christian\nfaith. We have just celebrated the Festival of Easter, the triumph of life over\ndeath. We have heard once against the Gospel accounts of disciples devastated\nby the death of Jesus, huddled together in the upper room. We have heard of\nthose same disciples transformed by an encounter with he risen Jesus, that they\ncan only understand in terms of resurrection; an encounter that broke through\nthe darkness of loss and regrets in the words of that simple greeting; ‘Peace be\nwith you.’\nSo, today, on the day of her funeral we declare that darkness, death has not had\nthe last word in the life of Muriel McMillan. Sickness, weakness has not had\nthe final say. In fellowship with Muriel, we follow a Lord who knows what\ndeath, what suffering, what loss is all about; one who knew what it was like to\nweep at the grave of his friend Lazarus. Not only that, he is the one who was\nraised triumphant over death, breaking the power of death itself. Knowing in\nhis own person what it was all about, I find in him one to whom I can come in\nmy own time of suffering and find real comfort, real strength and real hope."
    }
}