{
    "title": "Palm Sunday 2013 - Baptism",
    "date": "2013-03-24",
    "blurb": "The sermon discusses the concept of life and faith as a journey, using the framework of the Church of Ireland Service of Baptism. It emphasizes the continuous learning and discovery in life, faith, and understanding God. The sermon also highlights the importance of the promises of Baptism and the journey of Jesus from Galilee to Jerusalem, culminating in his death and resurrection.",
    "raw_text": "Palm Sunday 2013 – Baptism – finishing the Journey\n\nOver this season of Lent, we have been thinking around the topic of membership using the Church of Ireland Service of Baptism as a framework for our thoughts. One thread that has been running through our reflections has been the whole idea of ‘journey’.\n\nLife is a journey, a journey from birth to death, a journey of discovery, of learning. Faith is a journey, a journey of a lifetime, a journey undertaken with Christ, a journey into Christ. A feature of this journey is that there is always more ahead, more to learn, more to discover about life, about God, about myself; about what it means to live as ones made in the image of God, what it means to live as a member of the Body of Christ.\n\nWe thought of the promises of Baptism, those great questions of solemn commitment. There are those questions asked of parents and godparents about the upbringing of their child, that they will provide an environment within which faith is fostered and encouraged. There is that question asked of the congregation, the wider Church family, that we will welcome, that we will encourage.\n\nThen there are those questions that lie at the heart of Baptism and Confirmation. At Baptism these are made by parents and godparents on behalf of the child. At confirmation these questions are asked of the young people themselves. On the 2nd Sunday after Easter it will be our joy and privilege to stand alongside our young people as they make these promises in their own name when they are confirmed by the Archbishop.\n\nDo you reject the devil and all proud rebellion against God?\nDo you submit to Christ as Lord?\nThese are questions not of people who have arrived, who have got it all sorted. These are questions of people on a journey, a journey of faith.\n\nThis morning we celebrate Palm Sunday. As our Gospel reading we have read St Luke’s account of Jesus’ triumphal entry into Jerusalem. In the wider context of the Gospel account as a whole this is a crucial point on a journey that has taken him from the relative obscurity of Galilee through Samaria, and on to Jerusalem and to Calvary and death and resurrection. It has been a journey that has seen a gradually sharpening conflict between Jesus and the religious authorities of his day that will culminate in his trial and death on the cross.\n\nIn the prayer over the water at Baptism (I have printed this in the text box on your lesson sheets), as water is poured into the font we recall God’s journey with mankind; from creation, through the redemption of the people of Israel from slavery in Egypt, to Jesus’ own birth, his Baptism by John and his death.\n\nWe give you thanks that through the deep waters of death Jesus delivered us from our sins and was raised to new life in triumph.\n\nWe have a coming together here of two journeys – my journey and God’s journey and the two come together in my encounter with the person of Jesus.\n\nI often find myself reflecting on words that Paul wrote in his letter to the Philippians. As I read it the image of a trek across country comes to my mind. you know the time you might come to a ditch and it is good to have someone on the other side who is there to reach across and help you over. I have that picture of Christ, hand outstretched helping me onward over whatever obstacles life puts in my path.\n\n10 I want to know Christ and the power of his resurrection and the sharing of his sufferings by becoming like him in his death, 11 if somehow I may attain the resurrection from the dead.\n\n12 Not that I have already obtained this or have already reached the goal; but I press on to make it my own, because Christ Jesus has made me his own. 13 Beloved, I do not consider that I have made it my own; but this one thing I do: forgetting what lies behind and straining forward to what lies ahead, 14 I press on toward the goal for the prize of the heavenly call of God in Christ Jesus. Philippians 3:10-14\n\nThe journey, as I say, is a journey of a life time. Christ leads us further on.\n\nAnd so the prayer over the water concludes:\n\nWe give you thanks for the grace of the Holy Spirit who forms us in the likeness of Christ and leads us to proclaim your Kingdom.\n\nThat we might be formed in the likeness of Christ. As we are reminded at the very outset of the Service of Baptism. ‘As children of God we have a new dignity and God calls us to fullness of life.’\n\nThat is the goal of our journey, our journey with Christ, our journey into Christ as we seek to make real in our own lives the injunction of Paul we find in our lesson from his letter to the Philippians:\n\n5Let the same mind be in you that was in Christ Jesus,\n6who, though he was in the form of God, did not regard equality with God as something to be exploited, 7but emptied himself, taking the form of a slave, being born in human likeness. And being found in human form, 8he humbled himself and became obedient to the point of death – even death on a cross. Philippians 2:5-8\n\nOr as the German martyr theologian of the Second World War, Dietrich Boenhoffer wrote in his book ‘The Cost of Discipleship’:\n\n“It is only because he became like us that we can become like him.”",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/palmsunday2013.txt",
        "raw_ocr_content": "Page 1 of 3\nPalm Sunday 2013 – Baptism – finishing the Journey\nOver this season of Lent, we have been thinking around the topic of\nmembership using the Church of Ireland Service of Baptism as a framework\nfor our thoughts. One thread that has been running through our reflections has\nbeen the whole idea of ‘journey’.\nLife is a journey, a journey from birth to death, a journey of discovery, of\nlearning. Faith is a journey, a journey of a lifetime, a journey undertaken with\nChrist, a journey into Christ. A feature of this journey is that there is always\nmore ahead, more to learn, more to discover about life, about God, about\nmyself; about what it means to live as ones made in the image of God, what it\nmeans to live as a member of the Body of Christ.\nWe thought of the promises of Baptism, those great questions of solemn\ncommitment. There are those questions asked of parents and godparents about\nthe upbringing of their child, that they will provide an environment within\nwhich faith is fostered and encouraged. There is that question asked of the\ncongregation, the wider Church family, that we will welcome, that we will\nencourage.\nThen there are those questions that lie at the heart of Baptism and\nConfirmation. At Baptism these are made by parents and godparents on behalf\nof the child. At confirmation these questions are asked of the young people\nthemselves. On the 2nd Sunday after Easter it will be our joy and privilege to\nstand alongside our young people as they make these promises in their own\nname when they are confirmed by the Archbishop.\nDo you reject the devil and all proud rebellion against God?\nDo you submit to Christ as Lord?\nThese are questions not of people who have arrived, who have got it all sorted.\nThese are questions of people on a journey, a journey of faith.\nPage 2 of 3\nPalm Sunday 2013 – Baptism – finishing the Journey\nThis morning we celebrate Palm Sunday. As our Gospel reading we have read\nSt Luke’s account of Jesus’ triumphal entry into Jerusalem. In the wider\ncontext of the Gospel account as a whole this is a crucial point on a journey\nthat has taken him from the relative obscurity of Galilee through Samaria, and\non to Jerusalem and to Calvary and death and resurrection. It has been a\njourney that has seen a gradually sharpening conflict between Jesus and the\nreligious authorities of his day that will culminate in his trial and death on the\ncross.\nIn the prayer over the water at Baptism (I have printed this in the text box on\nyour lesson sheets), as water is poured into the font we recall God’s journey\nwith mankind; from creation, through the redemption of the people of Israel\nfrom slavery in Egypt, to Jesus’ own birth, his Baptism by John and his death.\nWe give you thanks that through the deep waters of death Jesus\ndelivered us from our sins and was raised to new life in triumph.\nWe have a coming together here of two journeys – my journey and God’s\njourney and the two come together in my encounter with the person of Jesus.\nI often find myself reflecting on words that Paul wrote in his letter to the\nPhilippians. As I read it the image of a trek across country comes to my mind.\nyou know the time you might come to a ditch and it is good to have someone\non the other side who is there to reach across and help you over. I have that\npicture of Christ, hand outstretched helping me onward over whatever\nobstacles life puts in my path.\n10 I want to know Christ and the power of his resurrection and the\nsharing of his sufferings by becoming like him in his death, 11 if\nsomehow I may attain the resurrection from the dead.\nPage 3 of 3\nPalm Sunday 2013 – Baptism – finishing the Journey\n12 Not that I have already obtained this or have already reached the\ngoal; but I press on to make it my own, because Christ Jesus has made\nme his own. 13 Beloved, I do not consider that I have made it my own;\nbut this one thing I do: forgetting what lies behind and straining\nforward to what lies ahead, 14 I press on toward the goal for the prize\nof the heavenly call of God in Christ Jesus. Philippians 3:10-14\nThe journey, as I say, is a journey of a life time. Christ leads us further on.\nAnd so the prayer over the water concludes:\nWe give you thanks for the grace of the Holy Spirit who forms us in\nthe likeness of Christ and leads us to proclaim your Kingdom.\nThat we might be formed in the likeness of Christ. As we are reminded at the\nvery outset of the Service of Baptism. ‘As children of God we have a new\ndignity and God calls us to fullness of life.’\nThat is the goal of our journey, our journey with Christ, our journey into Christ\nas we seek to make real in our own lives the injunction of Paul we find in our\nlesson from his letter to the Philippians:\n5Let the same mind be in you that was in Christ Jesus,\n6who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7but emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8he humbled himself\nand became obedient to the point of death –\neven death on a cross. Philippians 2:5-8\nOr as the German martyr theologian of the Second World War, Dietrich\nBoenhoffer wrote in his book ‘The Cost of Discipleship’:\n“It is only because he became like us that we can become like him.”"
    }
}