{
    "title": "Meekness and Majesty",
    "date": "2021-03-28",
    "blurb": "This sermon explores the themes of Palm Sunday and the days that follow, focusing on the apparent contradictions in the nature of Jesus Christ. It discusses the meekness and majesty of Jesus, and how understanding both aspects is crucial to understanding his identity and the events of Holy Week. The sermon also delves into the mystery of Jesus' suffering and the depth of God's love.",
    "raw_text": "I recall many years ago, when studying physics at school, we began looking more closely at the phenomenon of light. Now we tend to assume that light travels in straight lines yet there are things we come across that show us that it is a bit more complicated than that, such as the rainbow pattern you get when light shines on a CD.\n\nThere are times when it makes more sense to think of light as a stream of particles, others when it makes more sense to think of it as a wave. Wave or particle – they seem to be mutually exclusive yet neither by themselves gives us the full picture – yet taken together they help us to understand the complex phenomenon that is light.\n\nI want to use this idea of finding truth in apparent contradictions, in thinking about the themes of Palm Sunday and the days that are to follow.\n\nOne of the more recent hymns, that has become a classic in its own right, that has really struck a chord with me is that lovely hymn by Graham Kendrick, ‘Meekness and Majesty’. In this hymn Kendrick, with a lovely economy of language, holds together the apparent contradictions, the meekness and the majesty, the manhood and the deity of Jesus of Nazareth.\n\nThis coming week, Holy Week, leading up to Easter next Sunday, is a week of contradictions. We begin, as we have read this morning, with Jesus’ triumphal entry into the City of Jerusalem, acclaimed as a long-awaited King. By the end of the week, this same Jesus, deserted and betrayed by those closest to him, humiliated by his opponents, will die a lonely death upon a cross.\n\nWhat a contrast, what a contradiction – adulation and humiliation – the meekness and the majesty – each one an intrinsic part of who Jesus is. And if we are going to understand Jesus, who he is; the events of Holy Week, what they meant then and what they mean now, then we have to hold these two apparent opposites together.\n\nFor if we were to think simply in terms of the majesty of Christ, we would be left with a remote unapproachable figure, quite alien to the Jesus who reached out to the sick, the sinner, the marginalised, who we meet in the Gospels. If we think of Jesus only in his meekness, we are left simply with a nice man who would not offend anyone – again quite alien to the Jesus we meet in the Gospels who challenged the establishment of his day, challenged the established norms of his day and culture.\n\nI think Paul expresses this meekness and majesty of Jesus in that lovely passage from his letter to the Philippians, as he speaks of Jesus emptying himself, taking the form of a servant, humbling himself, accepting even death, death on a cross.\n\nOver the years, people have often tried to closely define what was going on on the cross, to tie up the loose ends, to get a neatly packaged explanation and we get the various theories of atonement. I find it far more productive to stay with loose ends, with the untidiness of the apparent contradictions of it all, and just let the Gospel accounts speak to my heart.\n\nIn the various accounts of the passion, the bit that always stands out for me is that verse in Mark’s Gospel:\n\n> At three o’clock Jesus cried out with a loud voice, “Eloi, Eloi, lema sabachthani?” which means, “My God, my God, why have you forsaken me?” Mark 15:34\n\nHere I find myself confronted with the mystery of the meekness and the majesty. But in this I also get a glimpse of the ‘depth-and-pain-of-love’, and so we remember with Kendrick:\n\n> suffering to give us life,\n> conquering through sacrifice –\n> and, as they crucify,\n> prays, ‘Father, forgive.’\n\nThe German theologian Jurgen Moltmann explores the Passion in terms of not just what is happening to Jesus but in terms of the dynamics of the Trinity, Father, Son and Holy Spirit. There is, he argues, a fundamental communion, a unity in the God-head. In the darkness of Calvary, in that cry of desolation from the Cross, the communion between Jesus and the Father is stretched to breaking point, there is a pain that goes to the heart of the God-head.\n\nIt is as I apprehend this ‘depth-and-pain-of-love’ that I begin to realise that there is no pain, no anguish, no hurt of ours that God does not understand, does not share, does not in some sense take upon himself. There is a fundamental healing as our pain is set in the context of the ‘depth-and-pain-of-love’ of the love of God in Christ.\n\nI often recall a brief meeting I had, along with a group of fellow 2nd year Divinity students with the late Michael Ramsey shortly after he had retired as Archbishop of Canterbury. We had asked him had he ever doubted his vocation to ministry. He either did not hears us clearly or, looking back on it, I think more likely, he chose to go much deeper. ‘Have I ever doubted? Oh yes, oh yes. And each time I take myself to the foot of the Cross. Since then, I have often thought of that spiritual giant of the 20th century making his own personal pilgrimage to the foot of the Cross. In a strange paradox, it is in the darkness of Calvary, in the self-emptying love that I get my clearest perception of the love of God.\n\nThe Taize community have a chant that they will often use in their liturgy of worship around the Cross.\n\n> Jesus, the Christ, lumiere interieur,\n> Ne laissez pas mes tenebres me parler\n> Lord Jesus Christ, your light shines within us.\n> Let not my doubts or my darkness speak to me.\n\nIn the person of Jesus, God has plunged the darkness of Calvary. It is out of that darkness, that ‘depth-and-pain-of-love’, that the light of the love of God shines in the world of today. As we have been thinking over the last few weeks, that light shines, can only shine, in the life and witness of the Church, in the life and witness of you and me in whatever situation God places us. We must model something of the meekness and the majesty, the self-forgetting, self-emptying love of God in Christ. To continue with Kendrick:\n\n> love indestructible,\n> in frailty appears:\n> Lord of infinity,\n> stooping so tenderly,\n> lifts our humanity\n> to the heights of his throne.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/palmsunday2021.txt",
        "raw_ocr_content": "Page 1 of 5\nPALM SUNDAY – Year A – 2021\nI recall many years ago, when studying physics at school, we began looking\nmore closely at the phenomenon of light. Now we tend to assume that light\ntravels in straight lines yet there are things we come across that show us that it\nis a bit more complicated than that, such as the rainbow pattern you get when\nlight shines on a CD.\nThere are times when it makes more sense to think of light as a stream of\nparticles, others when it makes more sense to think of it as a wave. Wave or\nparticle – they seem to be mutually exclusive yet neither by themselves gives\nus the full picture – yet taken together they help us to understand the complex\nphenomenon that is light.\nI want to use this idea of finding truth in apparent contradictions, in thinking\nabout the themes of Palm Sunday and the days that are to follow.\nOne of the more recent hymns, that has become a classic in its own right, that\nhas really struck a chord with me is that lovely hymn by Graham Kendrick,\n‘Meekness and Majesty’. In this hymn Kendrick, with a lovely economy of\nlanguage, holds together the apparent contradictions, the meekness and the\nmajesty, the manhood and the deity of Jesus of Nazareth.\nThis coming week, Holy Week, leading up to Easter next Sunday, is a week of\ncontradictions. We begin, as we have read this morning, with Jesus’ triumphal\nentry into the City of Jerusalem, acclaimed as a long-awaited King. By the end\nof the week, this same Jesus, deserted and betrayed by those closest to him,\nhumiliated by his opponents, will die a lonely death upon a cross.\nPage 2 of 5\nPALM SUNDAY – Year A – 2021\nWhat a contrast, what a contradiction – adulation and humiliation – the\nmeekness and the majesty – each one an intrinsic part of who Jesus is. And if\nwe are going to understand Jesus, who he is; the events of Holy Week, what\nthey meant then and what they mean now, then we have to hold these two\napparent opposites together.\nFor if we were to think simply in terms of the majesty of Christ, we would be\nleft with a remote unapproachable figure, quite alien to the Jesus who reached\nout to the sick, the sinner, the marginalised, who we meet in the Gospels. If we\nthink of Jesus only in his meekness, we are left simply with a nice man who\nwould not offend anyone – again quite alien to the Jesus we meet in the\nGospels who challenged the establishment of his day, challenged the\nestablished norms of his day and culture.\nI think Paul expresses this meekness and majesty of Jesus in that lovely\npassage from his letter to the Philippians, as he speaks of Jesus emptying\nhimself, taking the form of a servant, humbling himself, accepting even death,\ndeath on a cross.\nOver the years, people have often tried to closely define what was going on on\nthe cross, to tie up the loose ends, to get a neatly packaged explanation and we\nget the various theories of atonement. I find it far more productive to stay with\nloose ends, with the untidiness of the apparent contradictions of it all, and just\nlet the Gospel accounts speak to my heart.\nPage 3 of 5\nPALM SUNDAY – Year A – 2021\nIn the various accounts of the passion, the bit that always stands out for me is\nthat verse in Mark’s Gospel:\nAt three o’clock Jesus cried out with a loud voice, “Eloi, Eloi, lema\nsabachthani?” which means, “My God, my God, why have you\nforsaken me?” Mark 15:34\nHere I find myself confronted with the mystery of the meekness and the\nmajesty. But in this I also get a glimpse of the ‘depth-and-pain-of-love’, and so\nwe remember with Kendrick:\nsuffering to give us life,\nconquering through sacrifice –\nand, as they crucify,\nprays, ‘Father, forgive.’\nThe German theologian Jurgen Moltmann explores the Passion in terms of not\njust what is happening to Jesus but in terms of the dynamics of the Trinity,\nFather, Son and Holy Spirit. There is, he argues, a fundamental communion, a\nunity in the God-head. In the darkness of Calvary, in that cry of desolation\nfrom the Cross, the communion between Jesus and the Father is stretched to\nbreaking point, there is a pain that goes to the heart of the God-head.\nIt is as I apprehend this ‘depth-and-pain-of-love’ that I begin to realise that\nthere is no pain, no anguish, no hurt of ours that God does not understand, does\nnot share, does not in some sense take upon himself. There is a fundamental\nhealing as our pain is set in the context of the ‘depth-and-pain-of-love’ of the\nlove of God in Christ.\nI often recall a brief meeting I had, along with a group of fellow 2nd year\nDivinity students with the late Michael Ramsey shortly after he had retired as\nPage 4 of 5\nPALM SUNDAY – Year A – 2021\nArchbishop of Canterbury. We had asked him had he ever doubted his\nvocation to ministry. He either did not hears us clearly or, looking back on it, I\nthink more likely, he chose to go much deeper. ‘Have I ever doubted? Oh yes,\noh yes. And each time I take myself to the foot of the Cross. Since then, I\nhave often thought of that spiritual giant of the 20th century making his own\npersonal pilgrimage to the foot of the Cross. In a strange paradox, it is in the\ndarkness of Calvary, in the self-emptying love that I get my clearest perception\nof the love of God.\nThe Taize community have a chant that they will often use in their liturgy of\nworship around the Cross.\nJesus, the Christ, lumiere interieur,\nNe laissez pas mes tenebres me parler\nLord Jesus Christ, your light shines within us.\nLet not my doubts or my darkness speak to me.\nIn the person of Jesus, God has plunged the darkness of Calvary. It is out of\nthat darkness, that ‘depth-and-pain-of-love’, that the light of the love of God\nshines in the world of today. As we have been thinking over the last few\nweeks, that light shines, can only shine, in the life and witness of the Church,\nin the life and witness of you and me in whatever situation God places us. We\nmust model something of the meekness and the majesty, the self-forgetting,\nself-emptying love of God in Christ. To continue with Kendrick:\nlove indestructible,\nin frailty appears:\nLord of infinity,\nstooping so tenderly,\nlifts our humanity\nto the heights of his throne.\nPage 5 of 5\nPALM SUNDAY – Year A – 2021"
    }
}