{
    "title": "The Crossed Out 'I'",
    "date": "2011-04-17",
    "blurb": "In this sermon, Kevin uses the metaphor of the letter 'I' crossed out to describe the selfless life of Jesus. He encourages the congregation to model their attitudes and lives on Jesus, living selflessly and obediently. He also brings out the importance of being the 'aroma of Christ' and a 'letter of Christ', living lives that draw people to Christ and are written not with ink but with the Spirit of the living God.",
    "raw_text": "Palm Sunday – we began with the story of Jesus’ entry into Jerusalem. Started with a cheering crowd – ends with Jesus on the Cross, with his enemies jeering. What happened?\n\nWe will start with keeping things simple. What letter does this represent? (Hold up piece of wood) That letter is quite important to us if you think about it – we use it a lot.\n\nWe use to express opinions – ‘I think Birmingham City are a great football team.’ We use it to express our affection – we might say to someone ‘I love you’ We use it to encourage other people – ‘I think you are looking great today’; ‘I think you are really good at doing that’.\n\nBut ‘I’ is not always so pleasant. We can use it to express prejudice – ‘I think foreigners are lazy, or stupid, or dishonest.’ We can use it to express hatred – ‘I hate you.’; ‘I despise you.’\n\nSo the letter ‘I’ needs to be controlled a bit. In fact sometimes I need to cross the letter ‘I’ out. (Put cross bar in place and hold up) Now what do I get?\n\nThat’s right a cross – the cross is, if you like, the letter ‘I’ crossed out. ‘I’ crossed out in many ways describes not just the death of Jesus but the whole of his life. That is summed beautifully in those words Paul wrote to the Church at Philippi as he encouraged them to model their attitudes and life on those of Jesus himself.\n\n> Phil2:5-8 Think of yourselves the way Christ Jesus thought of himself. He had equal status with God but didn’t think so much of himself that he had to cling to the advantages of that status no matter what. Not at all. When the time came, he set aside the privileges of deity and took on the status of a slave, became human! Having become human, he stayed human. It was an incredibly humbling process. He didn’t claim special privileges. Instead, he lived a selfless, obedient life and then died a selfless, obedient death—and the worst kind of death at that—a crucifixion.\n\nOn one occasion Jesus told his followers, “If any want to become my followers, let them deny themselves and take up their cross daily and follow me.” How can we think of taking up our cross daily? We find our example in that selfless obedient life of Jesus, life lived with the ‘I’ crossed out.\n\nThe idea of life lived ‘with the I crossed out’ is one that is very relevant to the situation we find ourselves in. But this has to go beyond words or gestures. Paul, in his second letter ot the Corinthians, a Church very much taken up by outward, out of the ordinary signs of the Spirit, used a couple of lovely expressions:\n\n> For we are the aroma of Christ 2 Cor 2:15\n\nI remember when I first arrived in Dublin in the late 60’s, walking up Grafton Street, smelling the most wonderful smell of coffee. In those days, Bewley’s used to roast their coffee beans in the front window of the shop and the fumes were vented out onto the street.\n\nWe are the aroma of Christ, a presence of Christ, a witness to Christ, that goes beyond words, beyond actions. We are called to be the presence of Christ, the ‘I crossed out’ Christ in the world of today. A presence that draws people in.\n\nThen just a few verses later, another image springs to mind.\n\n> you are a letter of Christ, ….. , written not with ink but with the Spirit of the living God, not on tablets of stone but on tablets of human hearts. 2 Cor 3:3\n\nIn this electronic age, we don’t write letters so much these days. When I was younger, I used to loved receiving letters, writing letters. Letters from my parents, from friends, courtship letters; letters read not just once but brought out and read and re-read.\n\nA life in which I seek to encourage people rather than undermine them; in which I express love and not hatred, in which we turn our back on prejudice and honour one another.\n\nI will just close with the prayer of St Ignatius which I think gives us a lovely pattern for living in the footsteps of Jesus.\n\n> Teach us, good Lord, to serve thee as thou deservest;\nTo give, and not to count the cost,\nto fight, and not to heed the wounds,\nto toil, and not to seek for rest,\nto labour, and not to ask for any reward,\nsave that of knowing that we do thy will.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/palmsunday2011.txt",
        "raw_ocr_content": "Page 1 of 4\nPalm Sunday – 2019 – Family Service\nPalm Sunday – we began with the story of Jesus’ entry into Jerusalem.\nStarted with a cheering crowd – ends with Jesus on the Cross, with his\nenemies jeering. What happened?\nWe will start with keeping things simple.\nWhat letter does this represent? (Hold up piece of wood)\nThat letter is quite important to us if you think about it – we use it a\nlot.\nWe use to express opinions – ‘I think Birmingham City are a great\nfootball team.’\nWe use it to express our affection – we might say to someone ‘I love\nyou’\nWe use it to encourage other people – ‘I think you are looking great\ntoday’; ‘I think you are really good at doing that’.\nBut ‘I’ is not always so pleasant.\nWe can use it to express prejudice – ‘I think foreigners are lazy, or\nstupid, or dishonest.’\nWe can use it to express hatred – ‘I hate you.’; ‘I despise you.’\nPage 2 of 4\nPalm Sunday – 2019 – Family Service\nWe can use it to undermine people – ‘I think you are stupid.’; ‘I think\nyou are ugly.’\nSo the letter ‘I’ needs to be controlled a bit. In fact sometimes I need\nto cross the letter ‘I’ out. (Put cross bar in place and hold up)\nNow what do I get?\nThat’s right a cross – the cross is, if you like, the letter ‘I’ crossed out.\n‘I’ crossed out in many ways describes not just the death of Jesus but\nthe whole of his life. That is summed beautifully in those words Paul\nwrote to the Church at Philippi as he encouraged them to model their\nattitudes and life on those of Jesus himself. I am going to read it from\nthe translation, ‘The Message’.\nPhil2:5-8 Think of yourselves the way Christ Jesus thought of\nhimself. He had equal status with God but didn’t think so much\nof himself that he had to cling to the advantages of that status\nno matter what. Not at all. When the time came, he set aside\nthe privileges of deity and took on the status of a slave, became\nhuman! Having become human, he stayed human. It was an\nincredibly humbling process. He didn’t claim special\nprivileges. Instead, he lived a selfless, obedient life and then\ndied a selfless, obedient death—and the worst kind of death at\nthat—a crucifixion.\nPage 3 of 4\nPalm Sunday – 2019 – Family Service\nOn one occasion Jesus told his followers, “If any want to become my\nfollowers, let them deny themselves and take up their cross daily and\nfollow me.” How can we think of taking up our cross daily? We find\nour example in that selfless obedient life of Jesus, life lived with the\n‘I’ crossed out.\nThe idea of life lived ‘with the I crossed out’ is one that is very\nrelevant to the situation we find ourselves in. But this has to go\nbeyond words or gestures. Paul, in his second letter ot the\nCorinthians, a Church very much taken up by outward, out of the\nordinary signs of the Spirit, used a couple of lovely expressions:\nFor we are the aroma of Christ 2 Cor 2:15\nI remember when I first arrived in Dublin in the late 60’s, walking up\nGrafton Street, smelling the most wonderful smell of coffee. In those\ndays, Bewley’s used to roast their coffee beans in the front window of\nthe shop and the fumes were vented out onto the street.\nWe are the aroma of Christ, a presence of Christ, a witness to Christ,\nthat goes beyond words, beyond actions. We are called to be the\npresence of Christ, the ‘I crossed out’ Christ in the world of today. A\npresence that draws people in.\nThen just a few verses later, another image springs to mind.\nyou are a letter of Christ, ….. , written not with ink but with\nthe Spirit of the living God, not on tablets of stone but on\ntablets of human hearts. 2 Cor 3:3\nPage 4 of 4\nPalm Sunday – 2019 – Family Service\nIn this electronic age, we don’t write letters so much these days.\nWhen I was younger, I used to loved receiving letters, writing letters.\nLetters from my parents, from friends, courtship letters; letters read\nnot just once but brought out and read and re-read.\nA life in which I seek to encourage people rather than undermine\nthem; in which I express love and not hatred, in which we turn our\nback on prejudice and honour one another.\nI will just close with the prayer of St Ignatius which I think gives us a\nlovely pattern for living in the footsteps of Jesus.\nTeach us, good Lord, to serve thee as thou deservest;\nTo give, and not to count the cost,\nto fight, and not to heed the wounds,\nto toil, and not to seek for rest,\nto labour, and not to ask for any reward,\nsave that of knowing that we do thy will."
    }
}