{
    "title": "Feast of Pentecost 2011",
    "date": "2011-06-12",
    "blurb": "In this sermon, Kevin explores the concept of the Holy Spirit and its role in inspiring all that is good in mankind. He discusses how the Holy Spirit enables us to become more like Christ and how our love, concern, and service for one another should mirror Christ's love for us. He emphasizes the intertwining of love and obedience, and how our adherence to what is right should be rooted in love.",
    "raw_text": "Feast of Pentecost – 2011 – year A\n\nIt has often been said that pets become more like their owner – or is it the other way round? Whichever way you take it, what is meant is that the long term association, the long term companionship has its effect in affecting change in one party or the other.\n\nI leave you to ponder that deep philosophical point and ask a very different question, ‘Why do we do what is right?’\n\nI am not saying that we do the right thing – because we don’t. But the thing is we know when we have done wrong and we generally feel bad about it (even if for reasons of pride we try not to show it.)\n\nThere is planted deep within us an awareness of right and wrong which we would call conscience. It is not just an individual thing. Different religious and national traditions have ethical codes that will certainly differ but will show remarkable similarities to one another.\n\nThe Revised Catechsim of the Church of Ireland (which regrettably was not printed in the current edition of the Prayer Book), in talking of the Holy Spirit, makes two important points.\n\nFirst – the Holy Spirit inspires all that is good in mankind. The writer of Genesis, in the second of the two Creation narratives, tells of God forming man from the dust of the ground, breathing into his nostrils the breath of life and man becoming a living being. In our Gospel reading on this Day of Pentecost we read of Jesus, on the day of resurrection, in the upper room breathing on his disciples and saying, ‘Receive the Holy Spirit’. We have this picture of each of us, made in the image of God, having something of the breath, the Spirit of God, moving us, inspiring us.\n\nThe second point the Catechism makes – the Holy Spirit enables me to become more like Christ. At this point I just want to reflect on Jesus’ teaching in the Upper Room on the night before he died. ‘As the Father has loved me, so I have loved you; abide in my love. If you keep my commandments you will abide in my love.’\n\nWhy, I asked earlier, do we do the right thing? Yes there is that basic feeling for right and wrong that we share with all humanity, the impulse of conscience. But there is more to us than gut reaction, however divinely inspired. What about those selfless acts of love and service that have touched our lives. As I speak you may recall occasions on which you have benefited from the love and generosity of others, maybe when sickness or tragedy struck your life, or life was just difficult and someone saw your pain and just reached out in love.\n\nReturning to Jesus’ teaching in the upper room, John tells us of Jesus saying to his disciples, ‘This is my commandment that you love one another as I have loved you.’ Our love, our concern, our service for one another should mirror something of his love for us; should have something of that same self-giving, self-forgetting, cross centred love that we find in Jesus.\n\nTo go back for a moment to those occasions when you have experienced the love and generosity of spirit of another in a time of need – a time when Christ touched your life, when Christ ministered to your need. The Holy Spirit enables us to become more like Christ.\n\nThis takes me back to that deep philosophical point concerning owners becoming more like their pets – or whichever way round it is. It is all about the time we spend with each other.\n\nThe more time we spend with Christ, the more we consciously seek his presence, the more we seek his will and purpose in our lives – as we do so the more we come to recognise something of the height, the depth, the length, the breadth of the love of God for us in Christ, the more we seek to make our own response of love.\n\nWhy, I asked at the outset, do we do what is right? Returning to Jesus’ teaching on the night before he died, ‘You are my friends if you do what I command you. I do not call you servants any longer …. but I have called you friends. You did not choose me but I chose you …..to go and bear fruit, fruit that will last.’\n\nWhat we are talking of here is an intertwining of love and obedience. An obedience, and adherence to what is right, that has its roots in love. A love that has its outpouring in obedience to a God who has loved us in Christ. may we, in our daily walk with God be enabled by the indwelling Spirit of God to grow in our likeness ot Christ as we respond in daily living to his self giving love.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/pentecost2011.txt",
        "raw_ocr_content": "Page 1 of 3\nFeast of Pentecost – 2011 – year A\nIt has often been said that pets become more like their owner – or is it the other\nway round? Whichever way you take it, what is meant is that the long term\nassociation, the long term companionship has its effect in affecting change in\none party or the other.\nI leave you to ponder that deep philosophical point and ask a very different\nquestion, ‘Why do we do what is right?’\nI am not saying that we do the right thing – because we don’t. But the thing is\nwe know when we have done wrong and we generally feel bad about it (even if\nfor reasons of pride we try not to show it.)\nThere is planted deep within us an awareness of right and wrong which we\nwould call conscience. It is not just an individual thing. Different religious\nand national traditions have ethical codes that will certainly differ but will\nshow remarkable similarities to one another.\nThe Revised Catechsim of the Church of Ireland (which regrettably was not\nprinted in the current edition of the Prayer Book), in talking of the Holy Spirit,\nmakes two important points.\nFirst – the Holy Spirit inspires all that is good in mankind. The writer of\nGenesis, in the second of the two Creation narratives, tells of God forming man\nfrom the dust of the ground, breathing into his nostrils the breath of life and\nman becoming a living being. In our Gospel reading on this Day of Pentecost\nwe read of Jesus, on the day of resurrection, in the upper room breathing on his\nPage 2 of 3\nFeast of Pentecost – 2011 – year A\ndisciples and saying, ‘Receive the Holy Spirit’. We have this picture of each of\nus, made in the image of God, having something of the breath, the Spirit of\nGod, moving us, inspiring us.\nThe second point the Catechism makes – the Holy Spirit enables me to become\nmore like Christ. At this point I just want to reflect on Jesus’ teaching in the\nUpper Room on the night before he died. ‘As the Father has loved me, so I\nhave loved you; abide in my love. If you keep my commandments you will\nabide in my love.’\nWhy, I asked earlier, do we do the right thing? Yes there is that basic feeling\nfor right and wrong that we share with all humanity, the impulse of conscience.\nBut there is more to us than gut reaction, however divinely inspired. What\nabout those selfless acts of love and service that have touched our lives. As I\nspeak you may recall occasions on which you have benefited from the love and\ngenerosity of others, maybe when sickness or tragedy struck your life, or life\nwas just difficult and someone saw your pain and just reached out in love.\nReturning to Jesus’ teaching in the upper room, John tells us of Jesus saying to\nhis disciples, ‘This is my commandment that you love one another as I have\nloved you.’ Our love, our concern, our service for one another should mirror\nsomething of his love for us; should have something of that same self-giving,\nself-forgetting, cross centred love that we find in Jesus.\nTo go back for a moment to those occasions when you have experienced the\nlove and generosity of spirit of another in a time of need – a time when Christ\nPage 3 of 3\nFeast of Pentecost – 2011 – year A\ntouched your life, when Christ ministered to your need. The Holy Spirit\nenables us to become more like Christ.\nThis takes me back to that deep philosophical point concerning owners\nbecoming more like their pets – or whichever way round it is. It is all about the\ntime we spend with each other.\nThe more time we spend with Christ, the more we consciously seek his\npresence, the more we seek his will and purpose in our lives – as we do so the\nmore we come to recognise something of the height, the depth, the length, the\nbreadth of the love of God for us in Christ, the more we seek to make our own\nresponse of love.\nWhy, I asked at the outset, do we do what is right? Returning to Jesus’\nteaching on the night before he died, ‘You are my friends if you do what I\ncommand you. I do not call you servants any longer …. but I have called you\nfriends. You did not choose me but I chose you …..to go and bear fruit, fruit\nthat will last.’\nWhat we are talking of here is an intertwining of love and obedience. An\nobedience, and adherence to what is right, that has its roots in love. A love that\nhas its outpouring in obedience to a God who has loved us in Christ. may we,\nin our daily walk with God be enabled by the indwelling Spirit of God to grow\nin our likeness ot Christ as we respond in daily living to his self giving love."
    }
}