{
    "title": "Pentecost 2014",
    "date": "2014-06-08",
    "blurb": "On this Pentecost Sunday, Kevin discusses the different perceptions of the gift of the Spirit and its role in enabling us to grow in likeness to Jesus Christ. He uses the story of a young boy and a master musician to illustrate how God, like the musician, draws out the best in us by accompanying us. He emphasizes the importance of being open to the Spirit's work in our lives.",
    "raw_text": "# PENTECOST – 2014\n\nIn our reading this Pentecost Sunday, we have two very different perceptions of the gift of the Spirit. There is the rushing wind, the tongues of flames, the speaking in different languages in the lesson from Acts. In the Gospel there is the gentle breath of the risen Christ as he greets disciples sheltering in the Upper Room. Different parts of the New Testament will bear witness to the various gifts of the Spirit. In the Cathedral this afternoon the Archbishop, as he conducts the Service of Confirmation will pray that the candidates may be confirmed in the Holy Spirit. So we have a picture of the Spirit as empowering, as inspiring in the life of the Church.\n\nThis is all brought together in the teaching of the Revised Catechism on the person and work of the Holy Spirit.\n\n> 11 What does the Church teach about God the Holy Spirit?\n\n> The Church teaches that God the Holy Spirit inspires all that is good in mankind; that he came in his fulness at Pentecost to be the giver of life in the Church, and that he enables me to grow in likeness to Jesus Christ.\n\nThis morning I just want to latch onto that enabling me to grow in likeness to Jesus Christ.\n\nAs I do that, I just want to share a story I read in the last couple of weeks.. It is the story of a young boy who is being put forward for a musical scholarship for the violin. The day comes when he must meet with the master musician who has come to assess him. The poor lad practices furiously. Finally the time comes when he was to meet the master.\n\nAs he sits nervously in the music room, a kindly old man comes in, shakes hands, sits at the piano and says ‘Come, let us make a little music together.’ He plays an A on the piano and the boy tunes his violin, then looks anxiously at the master. The old man asks, ‘Joseph, what would you like to play?’ Nervously the young lad held out his exercise book.\n\n‘No, I want you to play something from memory, and not an exercise, but something easy that you know by heart, perhaps a song you like.’ Poor Joseph was confused but he was so enchanted by the gentleness of the face and the eyes. The old man did not insist, but instead played the opening chords of a song that was well known from school and Joseph began to play the melody with pleasure. ‘Now let us do that again.’ As Joseph played the old man added an extra accompaniment. The tune was played again and again and the room was filled with the melody as the boy played with more confidence.\n\nThe old man said, ‘Is that enough?’ This time Joseph shook his head and started playing again. The room was once more filled with music as Joseph and the old man were lost in the music as their various parts complemented and supported each other. As the melody came to an end the old man asked the boy, ‘Did you like that, Joseph?’. The boy, still unable to speak beamed with pleasure.\n\nGod’s work with us is like that of the music master with young Joseph. He draws out the best of us by accompanying us. We do great things together.\n\nNow let us go back to that idea of the Holy Spirit and enabling me to grow in likeness to Jesus Christ. At Baptism, after the signing with the sign of the Cross, I will say to a child\n\n> May almighty God deliver you from the powers of darkness,\n\n> restore in you the image of his glory,\n\n> and lead you in the light and obedience of Christ. Amen.\n\nRestore in you the image of his glory – the Spirit enabling us to grow in likeness to Christ. This calls to mind the fruit of the Spirit, the outworking of the Spirit in my daily life and discipleship.\n\n> the fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, 23 gentleness, and self-control. There is no law against such things. 24 And those who belong to Christ Jesus have crucified the flesh with its passions and desires. 25 If we live by the Spirit, let us also be guided by the Spirit. Galatians 5:22 ff\n\nRestore in you the image of his glory – this reminds that these gifts are not imposed from the outside, they are drawn out from deep within us as the Spirit works to heal and empower our fragile humanity.\n\nThis is where the story of young Joseph and the master musician strikes a chord in my own thoughts as I reflect on the work of the Spirit. Joseph had that music within him, working alongside him, the master musician brought it out in a wonderful way.\n\nAs I said earlier of God and the Holy Spirit, He draws out the best of us by accompanying us. We do great things together. May we be open to the working of the Spirit in our own lives. May the Spirit work in and through each one of us to bring forth fruit to his glory.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/pentecost2014.txt",
        "raw_ocr_content": "Page 1 of 3\nPENTECOST – 2014\nIn our reading this Pentecost Sunday, we have two very different perceptions\nof the gift of the Spirit. There is the rushing wind, the tongues of flames, the\nspeaking in different languages in the lesson from Acts. In the Gospel there is\nthe gentle breath of the risen Christ as he greets disciples sheltering in the\nUpper Room. Different parts of the New Testament will bear witness to the\nvarious gifts of the Spirit. In the Cathedral this afternoon the Archbishop, as he\nconducts the Service of Confirmation will pray that the candidates may be\nconfirmed in the Holy Spirit. So we have a picture of the Spirit as\nempowering, as inspiring in the life of the Church.\nThis is all brought together in the teaching of the Revised Catechism on the\nperson and work of the Holy Spirit.\n11 What does the Church teach about God the Holy Spirit?\nThe Church teaches that God the Holy Spirit inspires all that is good\nin mankind; that he came in his fulness at Pentecost to be the giver of\nlife in the Church, and that he enables me to grow in likeness to Jesus\nChrist.\nThis morning I just want to latch onto that enabling me to grow in likeness to\nJesus Christ.\nAs I do that, I just want to share a story I read in the last couple of weeks.. It is\nthe story of a young boy who is being put forward for a musical scholarship for\nthe violin. The day comes when he must meet with the master musician who\nhas come to assess him. The poor lad practices furiously. Finally the time\ncomes when he was to meet the master.\nAs he sits nervously in the music room, a kindly old man comes in, shakes\nhands, sits at the piano and says ‘Come, let us make a little music together.’\nHe plays an A on the piano and the boy tunes his violin, then looks anxiously\nPage 2 of 3\nPENTECOST – 2014\nat the master. The old man asks, ‘Joseph, what would you like to play?’\nNervously the young lad held out his exercise book.\n‘No, I want you to play something from memory, and not an exercise, but\nsomething easy that you know by heart, perhaps a song you like.’ Poor Joseph\nwas confused but he was so enchanted by the gentleness of the face and the\neyes.’ The old man did not insist, but instead played the opening chords of a\nsong that was well known from school and Joseph began to play the melody\nwith pleasure. ‘Now let us do that again.’ As Joseph played the old man added\nan extra accompaniment. The tune was played again and again and the room\nwas filled with the melody as the boy played with more confidence.\nThe old man said, ‘Is that enough?’ This time Joseph shook his head and\nstarted playing again. The room was once more filled with music as Joseph\nand the old man were lost in the music as their various parts complemented and\nsupported each other. As the melody came to an end the old man asked the\nboy, ‘Did you like that, Joseph?’. The boy, still unable to speak beamed with\npleasure.\nGod’s work with us is like that of the music master with young Joseph. He\ndraws out the best of us by accompanying us. We do great things together.\nNow let us go back to that idea of the Holy Spirit and enabling me to grow in\nlikeness to Jesus Christ. At Baptism, after the signing with the sign of the\nCross, I will say to a child\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\nPage 3 of 3\nPENTECOST – 2014\nRestore in you the image of his glory – the Spirit enabling us to grow in\nlikeness to Christ. This calls to mind the fruit of the Spirit, the outworking of\nthe Spirit in my daily life and discipleship.\nthe fruit of the Spirit is love, joy, peace, patience, kindness,\ngenerosity, faithfulness, 23 gentleness, and self-control. There is no\nlaw against such things. 24 And those who belong to Christ Jesus\nhave crucified the flesh with its passions and desires. 25 If we live by\nthe Spirit, let us also be guided by the Spirit. Galatians 5:22 ff\nRestore in you the image of his glory – this reminds that these gifts are not\nimposed from the outside, they are drawn out from deep within us as the Spirit\nworks to heal and empower our fragile humanity.\nThis is where the story of young Joseph and the master musician strikes a\nchord in my own thoughts as I reflect on the work of the Spirit. Joseph had\nthat music within him, working alongside him, the master musician brought it\nout in a wonderful way.\nAs I said earlier of God and the Holy Spirit, He draws out the best of us by\naccompanying us. We do great things together. May we be open to the\nworking of the Spirit in our own lives. May the Spirit work in and through\neach one of us to bring forth fruit to his glory"
    }
}