{
    "title": "Funeral of Peter Smeed",
    "date": "2014-03-12",
    "blurb": "This sermon was given at the funeral of Mr. Peter Smeed, a man of love, zest for life, and courage in the face of adversity. The sermon reflects on the life of Peter, his contributions, and the hope of life after death. It emphasizes the Christian faith's perspective on death and the hope of resurrection.",
    "raw_text": "This morning we have gathered in St Mary’s for the funeral of Mr Peter Smeed. His son David has already shared with us some of the family’s memories and affection for him. They remember a family man, a man with a love and zest for life. A native of Kent, he had travelled widely, serving in India and Burma in World War 2, an accomplished engineer, involved in an incredible range of projects from the UK Department of Defence to Gallahers Tobacco plant in Belfast. They remember a father and a grandfather, a loving husband to his wife Mary. They remember a man who faced illness with a dogged defiance. The deterioration over the last few years has been hard for the family to watch, hard for Peter. I thought of words from the 2nd Letter to Timothy as Paul proclaims, ‘I have fought the good fight, I have finished the race, I have kept the faith.’ Today is a day for you to come before God with your own particular memories of Peter and give thanks to God for all that he has meant to you as husband, as father, as grandfather and friend, to thank God for all that was good and true in his life, his courage in the face of adversity, his love and friendship.\n\nThose of us outside the family circle have come to offer our love and support at this time as you begin to come to terms with your loss, how best to support one another in the days and weeks and months to come. A passage I often find myself turning to at a time of a funeral is from St Paul's second letter to the Church at Corinth, the end of chapter 4 and the beginning of chapter 5. In this Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home. The words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Peter Smeed, that all the limitations of these latter years, the frailty, along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ.\n\nWe come to set the mystery of death in the context of our Christian faith. I often find myself turning to those lovely words from the Gospel of John that we read on Christmas Day:-\n\n> 4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n> 12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nDarkness has not had the last word in the life of Peter Smeed. Sickness, weakness has not had the final say. In fellowship with the Apostle John, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I can come in my own time of suffering and find real comfort, real strength and real hope.\n\nSituated as we are, on this beautiful hill of Howth, where we can stand and watch ferries come and go, I will just leave you with this piece.\n\n> A Parable of Immortality.\n\n> I am standing by the seashore.\n\n> A ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\n\n> She is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\n\n> Then someone at my side says, ‘There she goes! ‘\n\n> Gone where? Gone from my sight - that is all.\n\n> She is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\n\n> Her diminished size is in me, not in her.\n\n> And just at the moment when someone at my side says, ‘There she goes!’, there are other eyes watching her coming, and other voices ready to take up the glad shout :\n\n> ‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Peter Smeed.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Mr Peter Smeed – 12th March 2014\nThis morning we have gathered in St Mary’s for the funeral of Mr Peter Smeed. His son\nDavid has already shared with us some of the family’s memories and affection for him.\nThey remember a family man, a man with a love and zest for life. A native of Kent, he\nhad travelled widely, serving in India and Burma in World War 2, an accomplished\nengineer, involved in an incredible range of projects from the UK Department of Defence\nto Gallahers Tobacco plant in Belfast. They remember a father and a grandfather, a loving\nhusband to his wife Mary. They remember a man who faced illness with a dogged\ndefiance. The deterioration over the last few years has been hard for the family to watch,\nhard for Peter. I thought of words from the 2nd Letter to Timothy as Paul proclaims, ‘I\nhave fought the good fight, I have finished the race, I have kept the faith.’ Today is a day\nfor you to come before God with your own particular memories of Peter and give thanks to\nGod for all that he has meant to you as husband, as father, as grandfather and fried, to\nthank God for all that was good and true in his life, his courage in the face of adversity, his\nlove and friendship.\nThose of us outside the family circle have come to offer our love and support at this time\nas you begin to come to terms with your loss, how best to support one another in the days\nand weeks and months to come.\nA passage I often find myself turning to at a time of a funeral is from St Paul's second\nletter to the Church at Corinth, the end of chapter 4 and the beginning of chapter 5. In this\nPaul presents us with the reality of our own mortality and death, he talks very plainly of\nthe body wearing out. But just as he talks of the reality of physical decline and death,\nPaul talks of our new heavenly home. The words that really stand out for me are ; \"So\nthat what is mortal may be swallowed up by life.\" This is our hope for Peter Smeed, that\nall the limitations of these latter years, the frailty, along with all the limitations that go\nwith being human are \"swallowed up by life\", that is our inheritance in Christ.\nWe come to set the mystery of death in the context of our Christian faith. I often find\nmyself turning to those lovely words from the Gospel of John that we read on Christmas\nDay:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\nPage 2 of 2\nFuneral of Mr Peter Smeed – 12th March 2014\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nDarkness has not had the last word in the life of Peter Smeed. Sickness, weakness has not\nhad the final say. In fellowship with the Apostle John, we follow a Lord who knows what\ndeath, what suffering, what loss is all about; one who knew what it was like to weep at the\ngrave of his friend Lazarus. Not only that, he is the one who was raised triumphant over\ndeath, breaking the power of death itself. Knowing in his own person what it was all\nabout, I find in him one to whom I cam come in my own time of suffering and find real\ncomfort, real strength and real hope.\nSituated as we are, on this beautiful hill of Howth, where we can stand and watch ferries\ncome and go, I will just leave you with this piece.\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}