{
    "title": "Presentation of Christ in the Temple",
    "date": "2021-02-02",
    "blurb": "This sermon reflects on the Presentation of Christ in the Temple, drawing parallels with the liberation of Auschwitz. It emphasizes the importance of recognizing the humanity in others and warns against the dangers of racism, sectarianism, and other forms of discrimination. The sermon underscores the message of Jesus as a beacon of righteousness, truth, and reconciliation in a broken world.",
    "raw_text": "This Sunday we remember the Presentation of Christ in the Temple in Jerusalem as told to us by St Luke. Mary and Joseph have taken their new born son, their first born to the Temple in Jerusalem to make the sacrifices as laid down in the Law. This Christian festival is close to another, darker remembrance, the anniversary of the liberation of the Nazi Concentration Camp at Auschwitz Birkenau in Poland by the Soviet Army in 1945. To this day, the word ‘Auschwitz’ summons up images of a brutal human depravity that is even now hard to comprehend.\n\nWhen we were in Krakow for the occasion our son Anthony’s wedding, we went to visit this place. Even though the gas chambers and crematoria have been largely destroyed, and all that remains of many of the barracks of the Birkenau section of the camp is rows of concrete foundations, there is still an eerie atmosphere to the complex. There are still the railway lines passing through the entrance arch. You still see the sign proclaiming the grotesque lie, ‘Arbeit Macht Frei’, work makes you free. You see the evidence in display cabinets of a grim efficiency in what was designed as an industrial process; the detailed records of names, photographs of inmates, recording dates of arrival and extermination; the evidence of recycling of the possessions, shoes, clothes, hair and even artificial limbs of those who were transported to this place, simply because they were different, different race, different religion. It is true, you do not hear a sound of a bird to break the eerie silence of this place.\n\nAs we prepared to go in, our guide made an observation that I have never forgotten. ‘What happened here was not done by monsters. It was done by human beings to other human beings.’\n\nThis Sunday, as I say, is observed as the Feast of the Presentation of Christ in the Temple. Our Gospel reading rounds off the New Testament accounts of the infancy of Jesus. He was born a child as we were, he lived in a human family who celebrated the birth of their first born son according the traditions of their ancestors. In the words of our lesson from the Letter to the Hebrews we are reminded ‘He had to become like his brothers and sisters in every respect’. Heb 2:17\n\nThis is a theme that is picked up by a number of early Christian writers, as they declare ‘He became like us so that we might become more like him. Jesus is the one through whom and in whom we see humanity as God intended. In his teaching, in his death and resurrection we discover our own humanity as God intends it to be. In him we see God’s welcome to us in all our imperfection.\n\nIn the words of our Eucharistic Prayer In Christ you shared our life that we might live in him and he in us. He opened wide his arms upon the cross and, with love stronger than death, he made the perfect sacrifice for sin.\n\nAs he took the child Jesus in his arms, when his parents brought him to the Temple, Simeon declared:\n\n29‘Master, now you are dismissing your servant in peace, according to your word;\n30for my eyes have seen your salvation,\n31which you have prepared in the presence of all peoples,\n\n32a light for revelation to the Gentiles and for glory to your people Israel.’ Luke 2:29ff\n\nMy eyes have seen your salvation, a light for revelation, a glory.\n\nAuschwitz and the Presentation – two pictures of humanity. Humanity as God intended and humanity as it can be when it loses sight of all morality. I return to the words of the guide who took us around Auschwitz ‘What happened here was not done by monsters. It was done by human beings to other human beings.’\n\nThe first step in any process of such as that of Hitler’s ‘Final Solution’ is to undermine that fundamental truth in the minds of camp guards, administrators, to portray the victims as different, not human in the way that they are human. It is this that lies at the heart of racism, sectarianism, anti-Semitism, Islamophobia. When we go down that path, we lose sight not only of the humanity of the other, we lose light of our own humanity.\n\nThis has implications not just for us as individuals but for us as a society. One of the features of the electoral process in different parts of the world has been the rise of an insidious form of populism. This purports to suggest that the problems of a society are caused by those who are different; the migrant, the Muslim, the traveller, the Jew. It has been worrying to see the rise of far right and fundamentalist groups, making gains on the strength of the fears they instil in the wider population.\n\nWe must never be complacent. We have seen what Nazism did to Germany, apartheid to South Africa. Societies that are built on undermining the worth of whole sections of the population are themselves impoverished.\n\nThis near juxtaposition of the Anniversary of the Liberation of Auschwitz, with its chilling images of the depths of inhumanity, and this Feast of the Presentation of Christ – God becoming like us so that we might become more like him; all this draws attention to that contrast between what man is called to be and the depths to which evil can drag him.\n\nThe Gospel, with its message of humanity as seen in the person of Jesus, of righteousness, of witness to truth, to reconciliation can be a message of healing in this broken and hurting world.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/presentationofchrist2021.txt",
        "raw_ocr_content": "Page 1 of 4\nPresentation of Christ in the Temple – Year B – 2021\nThis Sunday we remember the Presentation of Christ in the Temple in\nJerusalem as told to us by St Luke. Mary and Joseph have taken their new\nborn son, their first born to the Temple in Jerusalem to make the sacrifices as\nlaid down in the Law. This Christian festival is close to another, darker\nremembrance, the anniversary of the liberation of the Nazi Concentration\nCamp at Auschwitz Birkenau in Poland by the Soviet Army in 1945. To this\nday, the word ‘Auschwitz’ summons up images of a brutal human depravity\nthat is even now hard to comprehend.\nWhen we were in Krakow for the occasion our son Anthony’s wedding, we\nwent to visit this place. Even though the gas chambers and crematoria have\nbeen largely destroyed, and all that remains of many of the barracks of the\nBirkenau section of the camp is rows of concrete foundations, there is still an\neerie atmosphere to the complex. There are still the railway lines passing\nthrough the entrance arch. You still see the sign proclaiming the grotesque lie,\n‘Arbeit Macht Frei’, work makes you free. You see the evidence in display\ncabinets of a grim efficiency in what was designed as an industrial process; the\ndetailed records of names, photographs of inmates, recording dates of arrival\nand extermination; the evidence of recycling of the possessions, shoes, clothes,\nhair and even artificial limbs of those who were transported to this place,\nsimply because they were different, different race, different religion. It is true,\nyou do not hear a sound of a bird to break the eerie silence of this place.\nAs we prepared to go in, our guide made an observation that I have never\nforgotten. ‘What happened here was not done by monsters. It was done by\nhuman beings to other human beings.’\nPage 2 of 4\nPresentation of Christ in the Temple – Year B – 2021\nThis Sunday, as I say, is observed as the Feast of the Presentation of Christ in\nthe Temple. Our Gospel reading rounds off the New Testament accounts of the\ninfancy of Jesus. He was born a child as we were, he lived in a human family\nwho celebrated the birth of their first born son according the traditions of their\nancestors. In the words of our lesson from the Letter to the Hebrews we are\nreminded\n‘He had to become like his brothers and sisters in every respect’.\nHeb 2:17\nThis is a theme that is picked up by a number of early Christian writers, as they\ndeclare ‘He became like us so that we might become more like him.\nJesus is the one through whom and in whom we see humanity as God intended.\nIn his teaching, in his death and resurrection we discover our own humanity as\nGod intends it to be. In him we see God’s welcome to us in all our\nimperfection.\nIn the words of our Eucharistic Prayer\nIn Christ you shared our life\nthat we might live in him and he in us.\nHe opened wide his arms upon the cross\nand, with love stronger than death,\nhe made the perfect sacrifice for sin.\nAs he took the child Jesus in his arms, when his parents brought him to the\nTemple, Simeon declared:\n29‘Master, now you are dismissing your servant in peace,\naccording to your word;\n30for my eyes have seen your salvation,\n31which you have prepared in the presence of all peoples,\nPage 3 of 4\nPresentation of Christ in the Temple – Year B – 2021\n32a light for revelation to the Gentiles\nand for glory to your people Israel.’ Luke 2:29ff\nMy eyes have seen your salvation, a light for revelation, a glory.\nAuschwitz and the Presentation – two pictures of humanity. Humanity as God\nintended and humanity as it can be when it loses sight of all morality. I return\nto the words of the guide who took us around Auschwitz\n‘What happened here was not done by monsters. It was done by\nhuman beings to other human beings.’\nThe first step in any process of such as that of Hitler’s ‘Final Solution’ is to\nundermine that fundamental truth in the minds of camp guards, administrators,\nto portray the victims as different, not human in the way that they are human.\nIt is this that lies at the heart of racism, sectarianism, anti-Semitism,\nIslamophobia. When we go down that path, we lose sight not only of the\nhumanity of the other, we lose light of our own humanity.\nThis has implications not just for us as individuals but for us as a society. One\nof the features of the electoral process in different parts of the world has been\nthe rise of an insidious form of populism. This purports to suggest that the\nproblems of a society are caused by those who are different; the migrant, the\nMuslim, the traveller, the Jew. It has been worrying to see the rise of far right\nand fundamentalist groups, making gains on the strength of the fears they instil\nin the wider population.\nWe must never be complacent. We have seen what Nazism did to Germany,\napartheid to South Africa. Societies that are built on undermining the worth of\nwhole sections of the population are themselves impoverished.\nPage 4 of 4\nPresentation of Christ in the Temple – Year B – 2021\nThis near juxtaposition of the Anniversary of the Liberation of Auschwitz, with\nits chilling images of the depths of inhumanity, and this Feast of the\nPresentation of Christ – God becoming like us so that we might become more\nlike him; all this draws attention to that contrast between what man is called to\nbe and the depths to which evil can drag him.\nThe Gospel, with its message of humanity as seen in the person of Jesus, of\nrighteousness, of witness to truth, to reconciliation can be a message of healing\nin this broken and hurting world."
    }
}