{
    "title": "Farewell to Howth",
    "date": "2021-06-20",
    "blurb": "Kevin reflects on the resilience of faith through personal experiences and historical challenges faced by the Church of Ireland. He recounts his visit to Budapest and the emotional service at Kalvin Ter Presbyterian Church. The sermon emphasizes the importance of resilience in the face of adversity, drawing parallels between the early Church's endurance and the parish's recent efforts during the pandemic and church restoration.",
    "raw_text": "PROPER 7 – 2021 – Trinity 3 – Farewell to Howth\n\nWhenever I hear the passage that we read as our first lesson this morning, my mind goes back to the period after Christmas in 1991. Myself and a member of Ahoghill Parish went to Budapest, capital of Hungary, for the European Meeting being organised by the Taize Community. It was a wonderful experience as we joined more than 30,000 people who had travelled from all over Europe. All 30,000 were found beds in Church Halls, School classrooms and private homes. We were all assigned to a particular Church and I found myself in Kalvin Ter Presbyterian Church in the centre of Budapest.\n\nI have vivid memories of the Service on New Year’s Eve. The Church was packed and at the end of the service they sang for the first time in many years the pre-communist National Anthem, 'God Bless Hungary'. I could not understand a word but I could feel the emotion. Earlier in the service, I was asked to read the passage we read this morning from 2nd Corinthians. I felt then, and do to this day, humbled by the fact that I was reading this to people for whom this had been a reality, and they had maintained their faith:\n\n> as servants of God we have commended ourselves in every way:\n> through great endurance, in afflictions, hardships, calamities,\n> beatings, imprisonments, ... by purity, knowledge, patience,\n> kindness, holiness of spirit, genuine love, truthful speech, and the\n> power of God; ... We are treated as impostors, and yet are true;\n> ... as sorrowful, yet always rejoicing; as poor, yet making many\n> rich;. 2 Cor 4-10\n\nThis passage speaks of a resilience in the life and faith of the early Church. We are reminded that in the face of trenchant opposition, the early Church remained faithful, continued to bear witness. During those few days in Budapest, and subsequently talking with Christians from Eastern Europe in Taize itself, I heard of examples of resilience, of people seeing Secret Police parked outside the Church from time to time, watching people going into Church, aware that jobs could be on the line.\n\nI want to stay with this line of resilience in the context of this Parish. Since this present Church was built in 1866, the Church of Ireland faced fundamental challenges that struck at the heart of how we saw ourselves, how we saw our place in Irish society – I think of the Disestablishment of the Church of Ireland in 1870, which saw our Church lose much of its wealth and privileged position and then, 40 years later, the formation of the Irish Free State, a development many of the leading members of this Parish would have opposed.\n\nDisestablishment lead not to the demise of the Church of Ireland that some feared but rather a renewal in the life of the Church that came with a development of lay participation in all levels of Church government. Those in this Parish who opposed the formation of the Irish Free State, stayed on to make their own contribution to the emerging independent Ireland.\n\nSome ten years ago, we contemplated the task facing us in the restoration of the roof of this Church. At that time difficult questions were asked. A long standing servant of the Parish asked me 'Should we be putting a new roof on this Church?' Not 'Can we?' but 'Should we?' This wasn’t asked in a spirit of defeatism, it was a question that went to the heart of what we saw as our future role and mission in this place.\n\nWhat we saw was not only an amazing response to an appeal for money to enable us to complete this work, there were other things that stood out for me. We were out of the Church for 6 months, worshipping in the Hall. One fear frequently expressed to me at that time was that of 'No-one is going to want to come to Church in the Hall.' Strangely enough, not only were our numbers largely maintained, but these services developed a style and vitality of their own.\n\nThen of course there has been the last fifteen months. Back in March 2020 we faced closure of our Church for months on end. We were not the only Parish to worry about how we were to manage without our regular worship that bonded us together, how we would survive financially. Many of our social and fundraising activities were all put on hold. So there has been no after Church coffee, no midweek service and coffee, no Fete, no Christmas Concert, no Youth Club, Social Club, Men’s Breakfast, Choir; no carol service, those big annual services. I want to thank the Vestry under the guidance of Tadhg for the magnificent way in which they rose to the occasion as we continued to meet on Zoom. The Vestry very consciously chose not to go for an immediate fund-raiser. It was recognised that Covid had produced enough financial uncertainty in the homes of the Parish without an immediate begging letter from the Church. When the appeal was made the response was little short of amazing.\n\nMaybe money was the easy one. How were we going to maintain any sense of a worshipping community? We all went on a very steep learning curve as we experimented with first with YouTube, then Zoom (who had even heard of Zoom 2 years ago?) and Facebook. As time went by more and more people, including some who rarely if ever came to Church began to engage. At the same time, the Vestry invested in the provision of equipment for live streaming. So even though the Church was closed for public worship, people were able to watch a service being conducted in the Church, whether on Sunday or one of the many funerals we have had this year.\n\nThen, as the weeks went by, I heard more and more instances of simple acts of kindness to those living alone, those isolated from families that gave me a very strong sense of this Parish as a community.\n\nWe have now come to a new stage in the life of this Parish. As Rachel and I prepare to move on, you begin the process of the appointment of my successor. She or he will be different, with a different skill set, facing different issues as the Church faces into mission in a post Covid era. I wish my successor and you every blessing as you embark on this next stage.\n\nIt is my hope and prayer that the spirit of resilience that I have been talking about will continue to show itself in the life of St Mary’s. A resilience that will rise to the challenges that lie ahead. Church is going to different for all sorts of reasons. I suspect Covid has brought to the fore challenges that were there anyway and needed to be faced. Difference should not be seen as a threat. Difference brings new opportunities. I recall on the night I was introduced as Bishop’s Curate in Finglas, Archbishop McAdoo telling the people of Finglas. 'When the new man speaks of new ways of doing things, don’t reach straight for the shotgun on the wall. Leave it on the wall, listen to what he is saying.'\n\nMaybe that will be my advice to you as I depart, 'Leave the shot gun on the wall.'\n\nThere will be challenges in the months of the vacancy that lie ahead. The Rural Dean, Rev Lesley Robinson will have overall supervision. Sunday worship will continue in this place, provided mainly by Canon Robert Deane and Rev Ken Sherwood. Canon Deane will also be providing emergency pastoral care and also chairing meetings of Select Vestry.\n\nUse this time of transition to think, to reflect, to pray about the future life and direction of this place. Listen to each other, understand and look after each other. In short, draw on those gifts of resilience that have taken you through the challenges of recent time.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper72021 - retirement.txt",
        "raw_ocr_content": "Page 1 of 5\nPROPER 7 – 2021 – Trinity 3 – Farewell to Howth\nWhenever I hear the passage that we read as our first lesson this morning, my\nmind goes back to the period after Christmas in 1991. Myself and a member of\nAhoghill Parish went to Budapest, capital of Hungary, for the European\nMeeting being organised by the Taize Community. It was a wonderful\nexperience as we joined more than 30,000 people who had travelled from all\nover Europe. All 30,000 were found beds in Church Halls, School classrooms\nand private homes. We were all assigned to a particular Church and I found\nmyself in Kalvin Ter Presbyterian Church in the centre of Budapest.\nI have vivid memories of the Service on New Year’s Eve. The Church was\npacked and at the end of the service they sang for the first time in many years\nthe pre-communist National Anthem, ‘God Bless Hungary’. I could not\nunderstand a word but I could feel the emotion. Earlier in the service, I was\nasked to read the passage we read this morning from 2nd Corinthians. I felt\nthen, and do to this day, humbled by the fact that I was reading this to people\nfor whom this had been a reality, and they had maintained their faith:\nas servants of God we have commended ourselves in every way:\nthrough great endurance, in afflictions, hardships, calamities,\n5beatings, imprisonments, …….. 6by purity, knowledge, patience,\nkindness, holiness of spirit, genuine love, 7truthful speech, and the\npower of God; ……. We are treated as impostors, and yet are true;\n……….. 10as sorrowful, yet always rejoicing; as poor, yet making many\nrich;. 2 Cor 4-10\nThis passage speaks of a resilience in the life and faith of the early Church.\nWe are reminded that in the face of trenchant opposition, the early Church\nremained faithful, continued to bear witness. During those few days in\nBudapest, and subsequently talking with Christians from Eastern Europe in\nTaize itself, I heard of examples of resilience, of people seeing Secret Police\nPage 2 of 5\nPROPER 7 – 2021 – Trinity 3 – Farewell to Howth\nparked outside the Church from time to time, watching people going into\nChurch, aware that jobs could be on the line.\nI want to stay with this line of resilience in the context of this Parish. Since\nthis present Church was built in 1866, the Church of Ireland faced fundamental\nchallenges that struck at the heart of how we saw ourselves, how we saw our\nplace in Irish society – I think of the Disestablishment of the Church of Ireland\nin 1870, which saw our Church lose much of its wealth and privileged position\nand then, 40 years later, the formation of the Irish Free State, a development\nmany of the leading members of this Parish would have opposed.\nDisestablishment lead not to the demise of the Church of Ireland that some\nfeared but rather a renewal in the life of the Church that came with a\ndevelopment of lay participation in all levels of Church government. Those in\nthis Parish who opposed the formation of the Irish Free State, stayed on to\nmake their own contribution to the emerging independent Ireland.\nSome ten years ago, we contemplated the task facing us in the restoration of\nthe roof of this Church. At that time difficult questions were asked. A long\nstanding servant of the Parish asked me ‘Should we be putting a new roof on\nthis Church?’ Not ‘Can we?’ but ‘Should we?’ This wasn’t asked in a spirit of\ndefeatism, it was a question that went to the heart of what we saw as our future\nrole and mission in this place.\nWhat we saw was not only an amazing response to an appeal for money to\nenable us to complete this work, there were other things that stood out for me.\nWe were out of the Church for 6 months, worshipping in the Hall. One fear\nPage 3 of 5\nPROPER 7 – 2021 – Trinity 3 – Farewell to Howth\nfrequently expressed to me at that time was that of ‘No-one is going to want to\ncome to Church in the Hall.’ Strangely enough, not only were our numbers\nlargely maintained, but these services developed a style and vitality of their\nown.\nThen of course there has been the last fifteen months. Back in March 2020 we\nfaced closure of our Church for months on end. We were not the only Parish to\nworry about how we were to manage without our regular worship that bonded\nus together, how we would survive financially. Many of our social and\nfundraising activities were all put on hold. So there has been no after Church\ncoffee, no midweek service and coffee, no Fete, no Christmas Concert, no\nYouth Club, Social Club, Men’s Breakfast, Choir; no carol service, those big\nannual services. I want to thank the Vestry under the guidance of Tadhg for\nthe magnificent way in which they rose to the occasion as we continued to\nmeet on Zoom. The Vestry very consciously chose not to go for an immediate\nfund-raiser. It was recognised that Covid had produced enough financial\nuncertainty in the homes of the Parish without an immediate begging letter\nfrom the Church. When the appeal was made the response was little short of\namazing.\nMaybe money was the easy one. How were we going to maintain any sense of\na worshipping community? We all went on a very steep learning curve as we\nexperimented with first with YouTube, then Zoom (who had even heard of\nZoom 2 years ago?) and Facebook. As time went by more and more people,\nincluding some who rarely if ever came to Church began to engage. At the\nsame time, the Vestry invested in the provision of equipment for live\nPage 4 of 5\nPROPER 7 – 2021 – Trinity 3 – Farewell to Howth\nstreaming. So even though the Church was closed for public worship, people\nwere able to watch a service being conducted in the Church, whether on\nSunday or one of the many funerals we have had this year.\nThen, as the weeks went by, I heard more and more instances of simple acts of\nkindness to those living alone, those isolated from families that gave me a very\nstrong sense of this Parish as a community.\nWe have now come to a new stage in the life of this Parish. As Rachel and I\nprepare to move on, you begin the process of the appointment of my successor.\nShe or he will be different, with a different skill set, facing different issues as\nthe Church faces into mission in a post Covid era. I wish my successor and\nyou every blessing as you embark on this next stage.\nIt is my hope and prayer that the spirit of resilience that I have been talking\nabout will continue to show itself in the life of St Mary’s. A resilience that will\nrise to the challenges that lie ahead. Church is going to different for all sorts of\nreasons. I suspect Covid has brought to the fore challenges that were there\nanyway and needed to be faced. Difference should not be seen as a threat.\nDifference brings new opportunities. I recall on the night I was introduced as\nBishop’s Curate in Finglas, Archbishop McAdoo telling the people of Finglas.\n‘When the new man speaks of new ways of doing things, don’t reach straight\nfor the shotgun on the wall. Leave it on the wall, listen to what he is saying.’\nMaybe that will be my advice to you as I depart, ‘Leave the shot gun on the\nwall.’\nPage 5 of 5\nPROPER 7 – 2021 – Trinity 3 – Farewell to Howth\nThere will be challenges in the months of the vacancy that lie ahead. The\nRural Dean, Rev Lesley Robinson will have overall supervision. Sunday\nworship will continue in this place, provided mainly by Canon Robert Deane\nand Rev Ken Sherwood. Canon Deane will also be providing emergency\npastoral care and also chairing meetings of Select Vestry.\nUse this time of transition to think, to reflect, to pray about the future life and\ndirection of this place. Listen to each other, understand and look after each\nother. In short, draw on those gifts of resilience that have taken you through\nthe challenges of recent time."
    }
}