{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper122012.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 12 – 2012 – Year B\n– Trinity 8\nI want to begin this morning by asking you to cast your mind back. I want you to try\nand remember a time when a person you really looked up to, a parent, a teacher,\nclergyman or whatever, let you down, disappointed you in some way. I am not so\nmuch looking for an adult memory as one in child hood. Something that was\npromised, or perceived to be promised, that was not delivered upon. it may not have\nseemed important to the other person involved – but it was to you. At that moment\nof disappointment all the other good points of the person were clouded out.\nI remember when I was a young child my father had a lovely old Norton motorbike.\nOccasionally he would take my older brother for a ride on it – how I longed for the\nday when I would be big enough to be taken. Dad had always said when I was\neleven he would take me for a ride. Then I overheard him telling my mother that he\nwas going to sell the bike and I suddenly realised that the promised ride was never\ngoing to happen – I can still recall the feeling of disappointment and of being let\ndown. It was totally irrational as only a nine year old can be. My total faith in\nadults was shaken. Looking at it another way my faith became mmore realistic – I\ncame to love and trust my father with his weaknesses as well as his many strengths.\nToday, in our Old Testament Lesson, we have read of someone who was a hero to\nhis people letting himself and them down. Over the last few weeks we have been\nfollowing the story of David; from his being called away from the flock to be\nanointed by Samual as King to succeed Saul; his defeat of Goliath; his\nacknowledgement as King by the tribes of Israel and the establishment of Jerusalem\nas his capital. It was a golden era in the history of the Jewish people. Today we\nread of one of the darker episodes in David’s life, of his adulterous relationship with\nBathsheba and his making arrangements for the certain death of her husband on the\nbattlefield.\nThere is no attempt to idealise David – he is presented warts and all. There is no\ndoubt that David was powerfully used by God; the expected Messiah is still to be of\nthe house of David – he was used by God but he most certainly was not God.\nPage 2 of 3\nPROPER 12 – 2012 – Year B\n– Trinity 8\nThis is a reminder to us that all human role models, all human leaders are fallible. It\nis worth keeping that in mind in our own day. Human beings can disappoint us –\nsometimes our expectations of them are unreal and we imprison them in our\nexpectations of their perfection. Human beings, being human, can fall prey to\ntemptation and weakness and fail.\nIn Church we pray on a regular basis for those called to leadership, that God may\nwork in them and through them to bring peace and justice into our broken and\nhurting world. Not that we would see any of them as perfect or infallible; rather we\nare asking that God would work through their strengths and their weaknesses to\nfurther his purposes.\nAs we look back over the story of David, we have seen David, outwardly weak but\nconfident in God’s power, felled Goliath with a sling. Today we have read of\nDavid, outwardly strong but departing from God, crumbling.\nTurning to our Gospel passage, this morning we have departed from the Gospel\naccording to St Mark. Over the next few weeks we will be reading from John,\nchapter 6. This section of the Fourth Gospel gives John’s account of the feeding of\nthe five thousand, Jesus walking on the water and stilling the storm and Jesus’\nteaching on himself as the bread of life.\nYou recall from the portion we read today, after the feeding of the multitude, the\ncrowd wanted to seize Jesus and make him King on the spot. What we have in our\nOld Testament and Gospel passages is a contrast between two kings. David had all\nthe trappings and privileges of power and abused them for his own selfish ends.\nJesus was offered those same trappings and privileges and refused them. The crowd\nwere looking for another David, a great leader. Jesus, the true successor of David,\nwould not be limited by their expectations. for the Kingship the crowd sought and\nthe Kingship that Jesus offered were not compatible.\nPage 3 of 3\nPROPER 12 – 2012 – Year B\n– Trinity 8\nIn feeding them, Jesus had satisfied the needs of the crowd but he was not prepared\nto satisfy their demands and so he withdrew. Jesus offered a Kingship that met their\nultimate needs based on self sacrifice and service. As the Gospel story unfolds,\nJesus’ Kingship becomes more and more unwelcome, more and more threatening\nuntil the final show down at the cross. How often we can fall into the same mistake\nas the crowd. Even in our most sincere prayers before God we find ourselves\nlooking for God to do what we want him to do rather than seeking to understand\nwhat he is doing in our lives and the lives of those for whom we pray – in doing that\nwe are treating him as a human leader who can pressurised into our way of thinking\nrather than coming to him as our Lord, as one to be served and worshipped.\nAt one level the story of David is a part of that timeless story of those in positions of\npower and privilege abusing their privilege for selfish ends. But it is a lot more than\nthat. There is no attempt to idealise David – he is presented warts and all. There is\nno doubt that David was powerfully used by God; the expected Messiah is still to be\nof the house of David – he was used by God but he most certainly was not God.\nIt is a reminder that God can work in and through human frailty. He worked\nthrough David as he was. God can and does take even the likes of you and me to do\nhis work in the world of today.\nPrayer of Saint Francis of Assisi\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen"
    },
    "base": "{\n  \"title\": \"Human Frailty and Divine Kingship\",\n  \"date\": \"2012-07-29\",\n  \"blurb\": \"Kevin reflects on the disappointment of unmet expectations, using personal anecdotes and biblical narratives to illustrate the fallibility of human role models, contrasting King David's failings with Jesus's example of self-sacrifice and service. He emphasizes that God can work through human weaknesses and calls for a kingship based on service rather than power.\",\n  \"raw_text\": \"PROPER 12 – 2012 – Year B – Trinity 8\\n\\nI want to begin this morning by asking you to cast your mind back. I want you to try and remember a time when a person you really looked up to, let you down, disappointed you in some way. It may not have seemed important to the other person involved – but it was to you. At that moment of disappointment all the other good points of the person were clouded out.\\n\\nI remember when I was a young child my father had a lovely old Norton motorbike. Occasionally he would take my older brother for a ride on it – how I longed for the day when I would be big enough to be taken. Dad had always said when I was eleven he would take me for a ride. Then I overheard him telling my mother that he was going to sell the bike and I suddenly realised that the promised ride was never going to happen – I can still recall the feeling of disappointment and of being let down. It was totally irrational as only a nine year old can be. My total faith in adults was shaken. Looking at it another way my faith became more realistic – I came to love and trust my father with his weaknesses as well as his many strengths.\\n\\nToday, in our Old Testament Lesson, we have read of someone who was a hero to his people letting himself and them down. Over the last few weeks we have been following the story of David; from his being called away from the flock to be anointed by Samuel as King to succeed Saul; his defeat of Goliath; his acknowledgement as King by the tribes of Israel and the establishment of Jerusalem as his capital. It was a golden era in the history of the Jewish people. Today we read of one of the darker episodes in David’s life, of his adulterous relationship with Bathsheba and his making arrangements for the certain death of her husband on the battlefield.\\n\\nThere is no attempt to idealise David – he is presented warts and all. There is no doubt that David was powerfully used by God; the expected Messiah is still to be of the house of David – he was used by God but he most certainly was not God.\\n\\nThis is a reminder to us that all human role models, all human leaders are fallible. It is worth keeping that in mind in our own day. Human beings can disappoint us – sometimes our expectations of them are unreal and we imprison them in our expectations of their perfection. Human beings, being human, can fall prey to temptation and weakness and fail.\\n\\nIn Church we pray on a regular basis for those called to leadership, that God may work in them and through them to bring peace and justice into our broken and hurting world. Not that we would see any of them as perfect or infallible; rather we are asking that God would work through their strengths and their weaknesses to further his purposes.\\n\\nAs we look back over the story of David, we have seen David, outwardly weak but confident in God’s power, felled Goliath with a sling. Today we have read of David, outwardly strong but departing from God, crumbling.\\n\\nTurning to our Gospel passage, this morning we have departed from the Gospel according to St Mark. Over the next few weeks we will be reading from John, chapter 6. This section of the Fourth Gospel gives John’s account of the feeding of the five thousand, Jesus walking on the water and stilling the storm and Jesus’s teaching on himself as the bread of life.\\n\\nYou recall from the portion we read today, after the feeding of the multitude, the crowd wanted to seize Jesus and make him King on the spot. What we have in our Old Testament and Gospel passages is a contrast between two kings. David had all the trappings and privileges of power and abused them for his own selfish ends. Jesus was offered those same trappings and privileges and refused them. The crowd were looking for another David, a great leader. Jesus, the true successor of David, would not be limited by their expectations. for the Kingship the crowd sought and the Kingship that Jesus offered were not compatible.\\n\\nIn feeding them, Jesus had satisfied the needs of the crowd but he was not prepared to satisfy their demands and so he withdrew. Jesus offered a Kingship that met their ultimate needs based on self sacrifice and service. As the Gospel story unfolds, Jesus’s Kingship becomes more and more unwelcome, more and more threatening until the final showdown at the cross. How often we can fall into the same mistake as the crowd. Even in our most sincere prayers before God we find ourselves looking for God to do what we want him to do rather than seeking to understand what he is doing in our lives and the lives of those for whom we pray – in doing that we are treating him as a human leader who can be pressurised into our way of thinking rather than coming to him as our Lord, as one to be served and worshipped.\\n\\nAt one level the story of David is a part of that timeless story of those in positions of power and privilege abusing their privilege for selfish ends. But it is a lot more than that. There is no attempt to idealise David – he is presented warts and all. There is no doubt that David was powerfully used by God; the expected Messiah is still to be of the house of David – he was used by God but he most certainly was not God.\\n\\nIt is a reminder that God can work in and through human frailty. He worked through David as he was. God can and does take even the likes of you and me to do his work in the world of today.\\n\\n> Prayer of Saint Francis of Assisi\\n> Lord, make me an instrument of your peace.\\n> Where there is hatred, let me sow love;\\n> where there is injury, pardon;\\n> where there is doubt, faith;\\n> where"
}