{
    "title": "Struggle and Transformation",
    "date": "2014-08-03",
    "blurb": "Kevin reflects on the historical significance of individuals and events that shape nations, drawing parallels to the biblical story of Jacob's struggle with God. He emphasizes the timeless nature of internal conflict and the potential for transformative experiences that align us with God's purpose. The sermon encourages self-examination and the pursuit of noble qualities in alignment with divine guidance.",
    "raw_text": "PROPER 13 – 2014 – YEAR A – Trinity 7\n\nOne of the subjects that I enjoyed studying at school was history. The history of any country or society is a combination of an account of a sequence of events and a reflection on the people and events that shaped those events. Whenever the history of a nation comes to be written, certain individuals stand out as crucial.\n\nIn the context of Ireland's Decade of Centenaries, we recall events that shaped the history of Ireland North and South, and the people who shaped these events, such as Dillon, Pearse, Childers, Casement, Carson, Collins, De Valera, Craig. These individuals embody the communities from which they arose, articulating the hopes and fears of those communities.\n\nIn our Old Testament Lessons, we have been following the Genesis accounts of the Patriarchs, Abraham, Isaac, and Jacob. These figures stand at the heart of the emergence of the people of Israel. As followers of Christ, this is part of our story, part of our heritage.\n\nThe biblical history transcends history, with issues that speak to each succeeding generation. We find Jacob and his family encamped near the ford at Jabbock. In the stillness of the desert night, he struggles with a man all night, which is a struggle with God. This struggle marked a turning point in the life of Jacob before God.\n\nWhen the sun rose on Jacob that morning, it rose upon a different, more chastened man. He went on as Israel, one who recognized that he had been in the very presence of God, to fulfill the task to which God had called him.\n\nThere is something timeless about the struggle within us. It recurs generation after generation in the hearts and minds of men and nations. Each of us must come face to face with the conflict within. God brings us face to face with ourselves, which can be a life-changing experience.\n\nGod was with Jacob that night and blessed him as he struggled. He was with him as he traveled to be reconciled with his brother Esau. God is with us as we wrestle with the contradictions in our own lives and personalities as we seek a way forward. That way forward is found in affirming that which is noble and well pleasing to God and putting behind us that which is wrong.\n\nAs we have followed the story of the Patriarchs, we see not only their impact on the history of the people of God; we also see in their lives, in the highs and lows of their walk with God, something of our own pilgrimage. As we come to see God working in their lives, in all their contradictions and fragile humanity, for the advancement of his Kingdom, so may we come to see God's call on our own lives and, offering ourselves as we are, go forward in his presence and in his power to live and work for him in whatever situation we find ourselves.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper132014.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 13 – 2014 – YEAR a – Trinity 7\nOne of the subjects that I enjoyed studying at school was history. The history\nof any country or society is a combination of an account of a sequence of\nevents and a reflection on the people and events that shaped those events.\nWhenever the history of a nation comes to be written, certain individuals stand\nout as crucial. A history of the first world war will contain not only the dates\nof decisive battles such as Ypres, the Somme, Paschendale, but also the leaders\nsuch as Herbert Asquith, David Lloyd George, Field Marshall Haig, Kaiser\nWilhelm, Marshall Petain. We are now in the midst of a Decade of\nCentenaries of events that shaped the history of Ireland North and South. In\nthe context of this we will be recalling, not celebrating, the Ulster Covenant,\nthe gun runnings into Larne and Howth, the 1916 rising, the establishment of\nthe first Dail in 1919, the Anglo Irish Treaty and Partition and the Civil War –\nbut also the people who shaped these events, Dillon, Pearse, Childers,\nCasement, Carson, Collins, De Valera, Craig.\nIn a very real sense these are more than individuals – they embody the\ncommunities out of which they arose. In them we see articulated the hopes and\nfears, the aspirations and hostilities of these same communities. To understand\nthe era the events through which they lived we have to understand them – for\neach of them emerged from particular communities in particular circumstances.\nOver these last few weeks in our Old Testament Lessons we have been\nfollowing the Genesis accounts of the lives of the Patriarchs, Abraham, Isaac\nand Jacob. These figures stand at the heart of the emergence of the people of\nIsrael. As we follow this story, we read of events that shaped not just\nPage 2 of 4\nPROPER 13 – 2014 – YEAR a – Trinity 7\nindividuals, but shaped a nation and its particular relationship with the God\nwho called Abram out of obscurity to be the father of a nation through whom\nall nations would be blessed, a promise fulfilled in the coming of Christ. As\nfollowers of Christ, this is part of our story, part of our heritage.\nOne of the characteristics of the biblical history is that it transcends history.\nThe issues that are dealt with speak to each succeeding generation. Take the\naccount we read this morning in Genesis. The events described happened to a\nparticular individual, Jacob, at a particular point in time.\nWe find Jacob and his family encamped near the ford at Jabbock. In the\nstillness of the desert night, he is left with his thoughts. We are told that he\nstruggled with a man all night. It is quite clear from the story that his struggle\nis with God.\nA man’s struggle with God is never in isolation but is related to who he is and\nwhat he is. Jacob is brought face to face with his past. Jacob at the time had\nbeen able to justify his behaviour to himself. Esau had not valued his\nbirthright; Laban had deceived him. It has definitely brought him prosperity.\nBut that night in the stillness of the desert it did not bring him peace.\nBut there is another side to the man who struggled with God and himself that\nnight. for alongside his scheming, Jacob did have a devotion and a loyalty as\nwitnessed by his willingness to serve 14 years for his beloved Rachel and a\ndesire to be right with God. In a very real sense the struggle that night was\nbetween a Jacob who was indifferent to God and a Jacob who desired to serve\nPage 3 of 4\nPROPER 13 – 2014 – YEAR a – Trinity 7\nGod. That struggle marked a turning point in the life of Jacob before God. It\nquite literally left its mark on him.\nWhen the sun rose on Jacob that morning, it rose upon a different, more\nchastened man. he went on as Israel, one who recognised that he had been in\nthe very presence of God, to fulfil the task to which God had called him, to be\nthe father of his people.\nLike all of us, Jacob was a mixture of good and bad, like all of us he was a\nproduct of his ancestry and of his past. He had in him something of his\nmother’s unscrupulousness but also his father Isaac’s loyalty; some thing of\nhis grandmother Sarah’s jealousy and also something of Abraham’s far seeing\nfaith. The question was, which side of him was going to predominate. That\nwas the substance of the struggle that night.\nThere is something timeless about that struggle. It recurs generation after\ngeneration in the hearts and minds of mean and nations. In all of us there are\nthings that are good and there is also the darker side. Each of us at some stage\nor another must come face to face with the conflict within each one of us. Like\nJacob, we can I suspect, justify the darker side of our nature to ourselves.\n‘Sure that is just the way I am’. ‘You’ve got to look after yourself in this\nworld, because if you don’t no-one else will.’. But at some stage God brings us\nface to face with ourselves. This can happen in a number of ways – it may be\nin the context of some traumatic experience such as the sudden loss of a job, of\nhealth or bereavement. It can take the form of a growing realisation of failure\nin our own lives, till we reach the point we can avoid it no longer. That\nPage 4 of 4\nPROPER 13 – 2014 – YEAR a – Trinity 7\nactually has the potential to be a life changing experience – one that literally\nleaves its mark on our lives.\nGod was with Jacob that night and blessed him as he struggled. he was with\nhim as he went on from that spot, as he travelled to be reconciled with his\nbrother Esau. God is with us as we wrestle with the contradictions in our own\nlives and personalities as we seek a way forward. That way forward is found in\naffirming that which is noble and well pleasing to God and putting behind us\nthat which is wrong.\nI began this morning reflecting on the nature of history, on the place of\nindividuals in the life and history of a community, of a nation. Ways in which\nthese individuals embody the strengths and frailties of the communities from\nwhich they emerge.\nAs we have followed the story of the Patriarchs in our Old Testament lessons,\nwe see not only their impact on the history of the people of God; we also wee\nin their lives, in the highs and lows of their walk with God, something of our\nown pilgrimage. As we have come to see God working in their lives, in all\ntheir contradictions and fragile humanity, for the advancement of his Kingdom,\nso may we come to see God’s call on our own lives and, offering ourselves as\nwe are, go forward in his presence and in his power to live and work for him in\nwhatever situation we find ourselves."
    }
}