{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper132016 - notes.txt",
        "raw_ocr_content": "PROPER 13 Gospel (parable of foolish famer) speaks of fundamental attitudes\nMurder of French priest saying mass in France challenges fundamental attitudes that lie at the heart\nof the Gospel.\nJustin Welby tweeted on the day of the attack ‘Evil attacks the weakest, denies truth and love, is\ndefeated through Jesus Christ.\nRomans 12\n14Bless those who persecute you; bless and do not curse.15Rejoice\nwith those who rejoice; mourn with those who mourn. 16Live in\nharmony with one another. Do not be proud, but be willing to\nassociate with people of low position. Do not be conceited.\n[c]\n17Do not repay anyone evil for evil. Be careful to do what is right in the eyes of\neveryone. 18If it is possible, as far as it depends on you, live at peace with\neveryone. 19Do not take revenge, my dear friends, but leave room for God’s\nwrath, for it is written: “It is mine to avenge; I will repay,”[d] says the Lord. 20On\nthe contrary:\n“If your enemy is hungry, feed him;\nif he is thirsty, give him something to drink.\nIn doing this, you will heap burning coals on his head.”[e]\n21Do not be overcome by evil, but overcome evil with good.\nCross and Resurrection\nDeath and darkness o not have the ultimate power – life and light will ultimately triumph\ne.g. New Year Service in Kalvinter Presbyterian Church in Budapst.\nGoes beyond defiance – proclaiming the positive power of love\nThe power of the other cheek, the power of the second mile\nThe power of ‘Father forgive – for they know not what they do.’\nNo, Jesus absorbs the violence that comes from us not from God. He\nreceives our blows, our punishments, our disdain. And, despite his\ninnocence – or, rather, precisely because of it – he refuses to answer back\nin kind. No more an eye for an eye.\nIn other words, the sacrifice of the cross is the non-violent absorption of\nhuman violence. The offer of love in return for hate, even to the point of\ndeath. This is the horrendous price that peace is sometimes asked to pay.\nThis is what makes the eucharistic sacrifice life-giving and not some\nhistorical death cult. And this is the sacrifice that Father Jacques was\ncelebrating as he died. He died as a priest, doing what priests do. May he\nrest in peace and rise in glory.\nGiles Fraser – ex priest writing in the Guardian\nHe was constantly searching how to give concrete form to heartfelt\ncompassion, especially towards the poor. He liked to quote Saint\nAugustine: “Love, and say it with your life.” This sometimes led him to\nsurprising steps. On one occasion, he came back from a stay in Calcutta\nwith a baby in his arms, a little girl that Mother Teresa had entrusted to him,\nin the hope that going to Europe would save her life – which turned out to\nbe true. He also welcomed to the village of Taizé and helped to settle there\ntwo widows from Vietnam, with their large families of children, whom he\nhad met while visiting a refugee camp in Thailand.\nThe need to be concrete: this characteristic of his was also seen in his gift\nfor arranging a room or a house. He did not like to construct buildings.\nWhen this was absolutely necessary, they had to be quite simple, very low,\nand if possible built with re-used material. But he loved transforming\nplaces. Using very little, he tried to create beauty. At a certain point a new\nchurch had to be built at Taizé, but he resisted the project for a long time,\nand afterwards he was continually adapting and changing the\narrangements. I noticed this even in the impoverished neighbourhood of\nMathare Valley in Kenya, where we stayed for a few weeks before some of\nthe brothers came to live there for many years. In that poor shack in the\nmidst of squalor, he found a way of adding some beauty, using almost\nnothing. As he used to say, we would like to do everything to make life\nbeautiful for those around us.\nBrother Roger often referred to the Beatitudes, and he sometimes said\nabout himself: Je suis un pauvre, “I am a poor man.” He called us, the\nbrothers, not to be spiritual masters but people who listen. He referred to\nhis ministry as prior as being a “poor servant of communion within the\ncommunity”. He did not hide his vulnerability.\nNow, our little community feels impelled to continue along the way he\nopened up. It is a way of trust. For him the word “trust” was not a facile\nexpression. It contains an appeal: to welcome very simply the love that God\nbears towards everyone, to root our lives in that love, and to take the risks\nthat that implies.\nTo lose that intuition would lead us to impose burdens on those who come\nseeking the living water. Faith in this love is a wholly simple reality, so\nsimple that everyone can receive it. And this faith can move mountains.\nThen, even if the world is often torn apart by violence and conflict, the way\nwe look on it can be filled with hope.\nBrother Alois"
    },
    "base": "{\n  \"title\": \"Overcoming Evil with Good\",\n  \"date\": \"2016-07-31\",\n  \"blurb\": \"Kevin's sermon reflects on the parable of the foolish farmer and the fundamental attitudes it challenges, in light of the murder of a French priest. He emphasizes the Christian call to bless those who persecute, to live in harmony, and to overcome evil with good, as taught in Romans 12. The sermon also honors the non-violent sacrifice of the cross and the life-giving nature of the eucharistic sacrifice, drawing inspiration from the actions and teachings of Father Jacques and Brother Roger.\",\n  \"raw_text\": \"PROPER 13 Gospel (parable of foolish farmer) speaks of fundamental attitudes. Murder of French priest saying mass in France challenges fundamental attitudes that lie at the heart of the Gospel.\n\nJustin Welby tweeted on the day of the attack 'Evil attacks the weakest, denies truth and love, is defeated through Jesus Christ.'\n\n**Romans 12**\n14 Bless those who persecute you; bless and do not curse. 15 Rejoice with those who rejoice; mourn with those who mourn. 16 Live in harmony with one another. Do not be proud, but be willing to associate with people of low position. Do not be conceited.\n17 Do not repay anyone evil for evil. Be careful to do what is right in the eyes of everyone. 18 If it is possible, as far as it depends on you, live at peace with everyone. 19 Do not take revenge, my dear friends, but leave room for God's wrath, for it is written: 'It is mine to avenge; I will repay,' says the Lord. 20 On the contrary:\n'If your enemy is hungry, feed him;\nif he is thirsty, give him something to drink.\nIn doing this, you will heap burning coals on his head.'\n21 Do not be overcome by evil, but overcome evil with good.\n\nCross and Resurrection\nDeath and darkness do not have the ultimate power – life and light will ultimately triumph. Goes beyond defiance – proclaiming the positive power of love. The power of the other cheek, the power of the second mile, the power of 'Father forgive – for they know not what they do.'\n\nJesus absorbs the violence that comes from us not from God. He receives our blows, our punishments, our disdain. And, despite his innocence – or, rather, precisely because of it – he refuses to answer back in kind. No more an eye for an eye.\n\nThe sacrifice of the cross is the non-violent absorption of human violence. The offer of love in return for hate, even to the point of death. This is the horrendous price that peace is sometimes asked to pay. This is what makes the eucharistic sacrifice life-giving and not some historical death cult. And this is the sacrifice that Father Jacques was celebrating as he died. He died as a priest, doing what priests do. May he rest in peace and rise in glory.\n\n> Giles Fraser – ex priest writing in the Guardian\n\nBrother Roger's example is also highlighted, showing his compassion and simplicity in serving others and creating beauty even in the most impoverished conditions. He emphasized the Beatitudes and the importance of trust, faith, and hope in the face of a world often torn apart by violence and conflict.\"\n}"
}