{
    "title": "Harvest of Compassion",
    "date": "2015-08-02",
    "blurb": "Kevin's sermon focuses on the biblical call to care for the marginalized, drawing from Leviticus 19 and Deuteronomy 24, which instruct the faithful to leave the edges of their harvest for the poor and the alien. He emphasizes the importance of remembering one's own past hardships to foster empathy and kindness towards others. The sermon also touches on the unity in Christ, as expressed in Galatians 3, and the sanctity of the Sabbath from Exodus 20.",
    "raw_text": "Lev 19:9 When you reap the harvest of your land, you shall not reap to the very edges of your field, or gather the gleanings of your harvest. You shall not strip your vineyard bare, or gather the fallen grapes of your vineyard; you shall leave them for the poor and the alien: I am the LORD your God. Lev 19:9-10\n\nDt 24:21 When you gather the grapes of your vineyard, do not glean what is left; it shall be for the alien, the orphan, and the widow. Remember that you were a slave in the land of Egypt; therefore I am commanding you to do this. Deut 24:21-22\n\nPr 22:2 The rich and the poor have this in common: the LORD is the maker of them all.\n\nGal 3:27 As many of you as were baptized into Christ have clothed yourselves with Christ. There is no longer Jew or Greek, there is no longer slave or free, there is no longer male and female; for all of you are one in Christ Jesus. Gal 3:27-28\n\nEx 20:8 Remember the Sabbath day, and keep it holy. Six days you shall labor and do all your work. But the seventh day is a Sabbath to the LORD your God; you shall not do any work--you, your son or your daughter, your male or female slave, your livestock, or the alien resident in your towns. For in six days the LORD made heaven and earth, the sea, and all that is in them, but rested the seventh day; therefore the LORD blessed the Sabbath day and consecrated it. Ex 20:8-11\n\nLev 19:33 When an alien resides with you in your land, you shall not oppress the alien. The alien who resides with you shall be to you as the citizen among you; you shall love the alien as yourself, for you were aliens in the land of Egypt: I am the LORD your God. Lev 19:33-34",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper182015 - notes.txt",
        "raw_ocr_content": "Lev 19:9 When you reap the harvest of your land, Dt 24:21 When you gather the grapes of your vineyard,\nyou shall not reap to the very edges of your do not glean what is left; it shall be for the alien, the\nfield, or gather the gleanings of your harvest. 10 orphan, and the widow. 22 Remember that you were\nYou shall not strip your vineyard bare, or gather a slave in the land of Egypt; therefore I am\nthe fallen grapes of your vineyard; you shall commanding you to do this. Deut 24:21-22\nleave them for the poor and the alien: I am the\nLORD your God. Lev 19:9-10\n27 As many of you as were baptized into Christ\nPr 22:2 The rich and the poor\nhave clothed yourselves with Christ. 28 There is\nhave this in common:\nno longer Jew or Greek, there is no longer slave\nthe LORD is the\nor free, there is no longer male and female; for all\nmaker of them all.\nof you are one in Christ Jesus. Gal 3:27-28\nEx 20:8 Remember the sabbath day, and keep it holy. 9 Six Lev 19:33 When an alien resides with you in your land,\ndays you shall labor and do all your work. 10 But the you shall not oppress the alien. 34 The alien who\nseventh day is a sabbath to the LORD your God; you shall resides with you shall be to you as the citizen\nnot do any work--you, your son or your daughter, your among you; you shall love the alien as yourself, for\nmale or female slave, your livestock, or the alien resident you were aliens in the land of Egypt: I am the LORD\nin your towns. 11 For in six days the LORD made heaven your God. Lev 19:33-34\nand earth, the sea, and all that is in them, but rested the\nseventh day; therefore the LORD blessed the sabbath day\nand consecrated it. Ex 20:8-11"
    }
}