{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper152016.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 15 – Year C – 2016 – Trinity 15\nOne of the things that is making the news on television and the papers\ninteresting at the moment is watching what Donald Trump, the Republican\ncandidate for the US Presidency, is going to say next. One thing you have to\nsay for him is that you know what he thinks and he is not afraid to say it.\nThe trouble with someone like him is that he must be a nightmare for the PR\npeople in the Republican Party. There is a term often used by PR people in a\nsituation like this – they will refer to their candidate going ‘off message’ and\nthey will revert to ‘damage control’ as they explain to the media that the\ncandidate has been misinterpreted, or that he/she is being quoted out of context,\nthat what was being said was part of a much bigger and more rounded picture.\nBut the sentiment behind it all in the PR room is, ‘Oh why did he/she have to\nsay that? How do we get this person back under control?’\nThese thoughts came to my mind as I read out Gospel reading this morning. as\nwe read of Jesus speaking in very forthright terms such as:\n51Do you think that I have come to bring peace to the earth? No, I tell\nyou, but rather division! Luke 12:51\nand talk of families being divided.\nIt is one of those Gospel readings where I find myself thinking, ‘Lord, I really\nwish you hadn’t said that.’ It hardly fits in with the ‘gentle Jesus, meek and\nmild’ that we sing about in the children’s hymns.\nSo what are we to make of these uncomfortable words of Jesus that are in a\npassage set to be read at public worship?\nPage 2 of 3\nPROPER 15 – Year C – 2016 – Trinity 15\nRather than tackle that question head on I just want to share a not unrelated\nmemory. As I reflected on our Gospel reading my mind went back to a\nmeeting of the Ballymena Clerical in 1997. Around that time we had invited\nvarious political leaders to talk to our group. At one particular meeting we met\nwith David Allderdyce, then leader of the Alliance Party, who had been\nbrought up in a Presbyterian Manse in Ballymena. In the face of some hostility\nhe had, on the previous day, held his first meeting with Gerry Adams, the\nleader of Sinn Fein. He explained that he had always said he would not meet\nGerry Adams until the IRA declared a ceasefire. The ceasefire had held for\nover three months, so he had agreed to meet with Gerry Adams. He then went\non to talk of his hopes for a developing peace in Northern Ireland. We asked\nhim what role he saw for the Churches in Northern Ireland. I will never forget\nhis reply. ‘Too often in the past,’ he said, ‘the churches had acted as chaplains\nto the tribes rather than as prophets declaring the sometimes uncomfortable,\noften unpopular, ‘Thus says the Lord.’’\nThe sometimes uncomfortable, often unpopular, ‘Thus says the Lord.’ – is this\nwhere we begin to get a handle on what Jesus is saying in his difficult words.\nJesus teaching is often inspiring, frequently comforting but on occasions it is\nunashamedly challenging. His commands to forgive, to welcome the outsider,\nto take a stand on issues of justice, on morality can seem hard, can be hard.\nThat can put us at odds with people we love and respect; with friends, with\npeople in power.\nPage 3 of 3\nPROPER 15 – Year C – 2016 – Trinity 15\nThis can happen at a number of levels. It can be in the School playground – do\nwe stand by the one being bullied or do we just quietly stay in the background?\nIn the face of prejudice be it on the basis of gender, race, class, sexual\norientation do we just stay quiet, or do we speak up? For fear of being branded\nas ‘narrow minded’ it is all too easy to fall in with the crowd on issues of\nmorality.\nTo go back to the language of the PR man – we can very easily find ourselves\ngoing ‘Off Message’. For the sake of the quiet life, for the sake of not being\nout on a limb, for the sake of not wanting to be seen as different, we stay quiet,\nwe go with the crowd.\nJust after I came here I recall one of you saying to me, ‘If we are not different\nthen we are irrelevant.’ Sometimes our faith, our discipleship is going to find\nus out on a limb and, yes, divided from those we trust, admire, those we love.\nThat does not mean we are called to be arrogant, it does not mean we have to\nbe rude or antagonistic. We are simply called to be faithful, faithful to Christ,\nfaithful to ourselves. A number of years ago there was a practice among many\nyoung Christians to wear a wristband, with WWJD – which stands for ‘What\nwould Jesus do?’ The idea behind it was very simple; if you found yourself in\na situation where you were not sure what was the right step to take, the\ninscription would serve as a simple reminder to reflect, to pray.\nOur faithfulness can serve as an encouragement to others to be faithful. May\nthe Christ who calls us, enable us to be faithful to our calling, that his name\nmay be glorified and his Kingdom advanced."
    },
    "base": "{\n  \"title\": \"Challenging Faithfulness\",\n  \"date\": \"2016-08-14\",\n  \"blurb\": \"Kevin reflects on the challenging words of Jesus that can divide families and calls for faithfulness even when it's uncomfortable. He draws parallels with current events and historical political dialogues, emphasizing the need for Christians to stand firm in their beliefs and actions, even if it means being at odds with loved ones or society.\",\n  \"raw_text\": \"One of the things that is making the news on television and the papers interesting at the moment is watching what Donald Trump, the Republican candidate for the US Presidency, is going to say next. One thing you have to say for him is that you know what he thinks and he is not afraid to say it. The trouble with someone like him is that he must be a nightmare for the PR people in the Republican Party. There is a term often used by PR people in a situation like this – they will refer to their candidate going 'off message' and they will revert to 'damage control' as they explain to the media that the candidate has been misinterpreted, or that he/she is being quoted out of context, that what was being said was part of a much bigger and more rounded picture. But the sentiment behind it all in the PR room is, 'Oh why did he/she have to say that? How do we get this person back under control?'\n\nThese thoughts came to my mind as I read our Gospel reading this morning. as we read of Jesus speaking in very forthright terms such as:\n\n> 51Do you think that I have come to bring peace to the earth? No, I tell you, but rather division! Luke 12:51\n\nand talk of families being divided.\n\nIt is one of those Gospel readings where I find myself thinking, 'Lord, I really wish you hadn't said that.' It hardly fits in with the 'gentle Jesus, meek and mild' that we sing about in the children's hymns.\n\nSo what are we to make of these uncomfortable words of Jesus that are in a passage set to be read at public worship?\n\nRather than tackle that question head on I just want to share a not unrelated memory. As I reflected on our Gospel reading my mind went back to a meeting of the Ballymena Clerical in 1997. Around that time we had invited various political leaders to talk to our group. At one particular meeting we met with David Allderdyce, then leader of the Alliance Party, who had been brought up in a Presbyterian Manse in Ballymena. In the face of some hostility he had, on the previous day, held his first meeting with Gerry Adams, the leader of Sinn Fein. He explained that he had always said he would not meet Gerry Adams until the IRA declared a ceasefire. The ceasefire had held for over three months, so he had agreed to meet with Gerry Adams. He then went on to talk of his hopes for a developing peace in Northern Ireland. We asked him what role he saw for the Churches in Northern Ireland. I will never forget his reply. 'Too often in the past,' he said, 'the churches had acted as chaplains to the tribes rather than as prophets declaring the sometimes uncomfortable, often unpopular, 'Thus says the Lord.''\n\nThe sometimes uncomfortable, often unpopular, 'Thus says the Lord.' – is this where we begin to get a handle on what Jesus is saying in his difficult words. Jesus teaching is often inspiring, frequently comforting but on occasions it is unashamedly challenging. His commands to forgive, to welcome the outsider, to take a stand on issues of justice, on morality can seem hard, can be hard. That can put us at odds with people we love and respect; with friends, with people in power.\n\nThis can happen at a number of levels. It can be in the School playground – do we stand by the one being bullied or do we just quietly stay in the background? In the face of prejudice be it on the basis of gender, race, class, sexual orientation do we just stay quiet, or do we speak up? For fear of being branded as 'narrow minded' it is all too easy to fall in with the crowd on issues of morality.\n\nTo go back to the language of the PR man – we can very easily find ourselves going 'Off Message'. For the sake of the quiet life, for the sake of not being out on a limb, for the sake of not wanting to be seen as different, we stay quiet, we go with the crowd.\n\nJust after I came here I recall one of you saying to me, 'If we are not different then we are irrelevant.' Sometimes our faith, our discipleship is going to find us out on a limb and, yes, divided from those we trust, admire, those we love. That does not mean we are called to be arrogant, it does not mean we have to be rude or antagonistic. We are simply called to be faithful, faithful to Christ, faithful to ourselves. A number of years ago there was a practice among many young Christians to wear a wristband, with WWJD – which stands for 'What would Jesus do?' The idea behind it was very simple; if you found yourself in a situation where you were not sure what was the right step to take, the inscription would serve as a simple reminder to reflect, to pray.\n\nOur faithfulness can serve as an encouragement to others to be faithful. May the Christ who calls us, enable us to be faithful to our calling, that his name may be glorified and his Kingdom advanced.\"\n}"
}