{
    "title": "Persistent Search for the Lost",
    "date": "2013-09-15",
    "blurb": "This sermon, delivered by Kevin in 2013, discusses the theme of God's persistent search for the lost and His unwavering patience. Drawing from the Old Testament, Kevin explores the concept of 'remnant' and the idea of new beginnings arising from destruction. The sermon emphasizes God's desire not for the death of a sinner, but for their repentance and life.",
    "raw_text": "Last Sunday, in our Old Testament Lesson, we read the story from the Book of the Prophet Jeremiah. The prophet tells of going down to watch a potter at work, making pots on his wheel. He would have watched as the potter patiently prepared the clay, kneading it to exclude any air bubbles, centering it, then firmly and patiently working with the clay as it spins around on the wheel until finally a pot is formed. If something goes wrong, he starts all over again, working the clay with the same patience and firmness.\n\nAs I said there can be nothing rushed about that – any sudden movement and the pot would be all over the place. I offered that as a picture of God’s patience, God’s purpose as he patiently works in and through our frail and wilful humanity. I spoke also of those twin threads of judgement and new beginnings that run through the Old Testament story. Jeremiah brings those twin threads together as he gets us to think of the potter destroying a pot that was not working out and with the same clay starting up all over again.\n\nThat theme of judgement continues in our Old Testament Lesson as we continue to read from Jeremiah. Jeremiah looks at the inevitable catastrophe coming upon a people who had lost their way as individuals and as a community. But even in the midst of the gloom, there is a glimpse of light in the message:\n\nThis is what the LORD says:\n“The whole land will be ruined, though I will not destroy it completely.\n\nThis introduces the whole idea of remnant. In our day to day talk, remnant has connotations of bits left over. There is the off cut from a roll of cloth or carpet, the left overs of a meal that may or may not come in useful. In the Old Testament remnant has a more ominous connotation. It is the left overs of battle, what is left of an army, a city, a country after battle, after invasion.\n\nAlong with the death and destruction of inhabitants, there are the broken city walls, vineyards and olive groves hacked to pieces as the victor seeks to ensure that the vanquished will never threaten them again. It is a sign of defeat, of weakness, of hopelessness. The prophets began to see in the remnant a sign of new beginnings, of hope. Isaiah, possibly with the picture of vineyard destroyed by enemy forces has this lovely picture of hope:\n\nThis is what the LORD says:\n1 A shoot shall come out from the stump of Jesse, and a branch shall grow out of his roots.\n2 The spirit of the LORD shall rest on him, the spirit of wisdom and understanding, the spirit of counsel and might, the spirit of knowledge and the fear of the LORD. Is 11:1,2\n\nThis brings to mind a concept that may be more familiar to us than the field of battle, particularly for gardeners at this time of year – that of pruning, cutting back, removing dead wood, old growth. I recall one lady in the Parish advising me ‘Get your enemy to prune your roses. – cut right back’ We are left gazing at the stumps devoid of leaves and any apparent sign of life. But with the spring come new buds, new life, the growth strong or stronger than ever.\n\nWith these thoughts going through my mind, I set my browser to look through references to remnant in the Old Testament. In the course of this I came across this passage from Isaiah, spoken at the time the Assyrians were at the gate of Jerusalem:\n\n. 31 The surviving remnant of the house of Judah shall again take root downward, and bear fruit upward; 32 for from Jerusalem a remnant shall go out, and from Mount Zion a band of survivors.\nIsaiah 33:31-32\n\n‘take root downward, and bear fruit upward’ This resonates with our picture of a rose bush, fruit bush, pruned right back in the autumn, sprouting new leaves, new shoots in the spring. Out of the chaos of a city besieged, a society in turmoil, the prophet discerns future life, future hope.; but more than that – purpose.\n\nThose of you brought up on the old Service of Morning Prayer may remember the opening words of the prayer of Absolution after the General Confession Almighty God, the Father of our Lord Jesus Christ, who desireth not the death of a sinner, but rather that he may turn from his wickedness, and live;\n\nThis picks up words of the prophet Ezekiel, that prophet of the Exile. The God who judges, the God who makes new beginning is a God who seeks out; seeks out not to destroy but to heal, to restore a God ‘who desireth not the death of a sinner, but rather that he may turn from his wickedness, and live ……’\n\nWhich brings us to our Gospel passage this morning. It is one of those scenarios in which we begin to see the developing conflict between Jesus and the religious authorities of his day. It centered on Jesus’ credibility as a religious teacher. The Pharisees, the ‘separated ones’ could not understand Jesus’ willingness to meet with, to share table fellowship with sinners. In their eyes it amounted to condoning their sinful lie style. Possibly the very fact that these people were drawn to Jesus troubled them. In reply, Jesus tells the two parables that we read in our Gospel passage this morning. His choice of characters in his stories would also have jarred the sensibilities of his hearers. Shepherds in 1st century Palestine did not figure high in the social order, not the sort of fellow you would want your daughter to marry. Much of what they did would have rendered them ritually unclean in the eyes of the purists. And women – well women didn't really figure in the society of that time. So the stories themselves feature people on the edge. It is these who are held up as illustrations of God’s persistent search for that which is lost. The shepherd leaves the 99 to search for the one that is missing. The woman sets aside all other domestic tasks to seek the one coin that is lost. Those who are already safe, those who are already secure, find that concern for the lost unsettling, even offensive. But as I thought about that, I thought back to the potter at his wheel, working, reworking the same bit of clay until he got it right. God never giving up on our frail and wilful humanity.\n\nJesus spent much of his life on the edge, on the margins. In the Gospel narrative we find him born in a stable, a refugee as his parents flee to Egypt. When they come back it is to Galilee. He is never accepted by the religious authorities and he dies the death of a criminal outside the city walls. He calls us, his followers, as individuals, as a community to be prepared to go to the edge, to have a care and concern for justice, for those on the margins of our society. When we take the risk and go there we discover he is there ahead of us:\n\nfor I was hungry and you gave me food, I was thirsty and you gave me something to drink, I was a stranger and you welcomed me, 36 I was naked and you gave me clothing, I was sick and you took care of me, I was in prison and you visited me.' Matt 25:35,36\n\nmay we be living signs of a God who never gives up, a God ‘who desireth not the death of a sinner, but rather that he may turn from his wickedness, and live ……’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper192013.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 19 – 2013 – Year C – Trinity 16\nLast Sunday, in our Old Testament Lesson, we read the story from the Book of\nthe Prophet Jeremiah. The prophet tells of going down to watch a potter at\nwork, making pots on his wheel. He would have watched as the potter\npatiently prepared the clay, kneading it to exclude any air bubbles, centring it,\nthen firmly and patiently working with the clay as it spins around on the wheel\nuntil finally a pot is formed. If something goes wrong, he starts all over again,\nworking the clay with the same patience and firmness.\nAs I said there can be nothing rushed about that – any sudden movement and\nthe pot would be all over the place. I offered that as a picture of God’s\npatience, God’s purpose as he patiently works in and through our frail and\nwilful humanity. I spoke also of those twin threads of judgement and new\nbeginnings that run through the Old Testament story. Jeremiah brings those\ntwin threads together as he gets us to think of the potter destroying a pot that\nwas not working out and with the same clay starting up all over again.\nThat theme of judgement continues in our Old Testament Lesson as we\ncontinue to read from Jeremiah. Jeremiah looks at the inevitable catastrophe\ncoming upon a people who had lost their way as individuals and as a\ncommunity. But even in the midst of the gloom, there is a glimpse of light in\nthe message:\nThis is what the LORD says:\n“The whole land will be ruined,\nthough I will not destroy it completely.\nThis introduces the whole idea of remnant. In our day to day talk, remnant has\nconnotations of bits left over. There is the off cut from a roll of cloth or carpet,\nthe left overs of a meal that may or may not come in useful. In the Old\nTestament remnant has a more ominous connotation. It is the left overs of\nbattle, what is left of an army, a city, a country after battle, after invasion.\nPage 2 of 4\nPROPER 19 – 2013 – Year C – Trinity 16\nAlong with the death and destruction of inhabitants, there are the broken city\nwalls, vineyards and olive groves hacked to pieces as the victor seeks to ensure\nthat the vanquished will never threaten them again. It is a sign of defeat, of\nweakness, of hopelessness. The prophets began to see in the remnant a sign of\nnew beginnings, of hope. Isaiah, possibly with the picture of vineyard\ndestroyed by enemy forces has this lovely picture of hope:\nThis is what the LORD says:\n1 A shoot shall come out from the stump of Jesse,\nand a branch shall grow out of his roots.\n2 The spirit of the LORD shall rest on him,\nthe spirit of wisdom and understanding,\nthe spirit of counsel and might,\nthe spirit of knowledge and the fear of the LORD. Is 11:1,2\nThis brings to mind a concept that may be more familiar to us than the field of\nbattle, particularly for gardeners at this time of year – that of pruning, cutting\nback, removing dead wood, old growth. I recall one lady in the Parish advising\nme ‘Get your enemy to prune your roses. – cut right back’ We are left gazing\nat the stumps devoid of leaves and any apparent sign of life. But with the\nspring come new buds, new life, the growth strong or stronger than ever.\nWith these thoughts going through my mind, I set my browser to look through\nreferences to remnant in the Old Testament. In the course of this I came across\nthis passage from Isaiah, spoken at the time the Assyrians were at the gate of\nJerusalem:\n. 31 The surviving remnant of the house of Judah shall again take root\ndownward, and bear fruit upward; 32 for from Jerusalem a remnant\nshall go out, and from Mount Zion a band of survivors.\nIsaiah 33:31-32\n‘take root downward, and bear fruit upward’ This resonates with our picture of\na rose bush, fruit bush, pruned right back in the autumn, sprouting new leaves,\nnew shoots in the spring. Out of the chaos of a city besieged, a society in\nPage 3 of 4\nPROPER 19 – 2013 – Year C – Trinity 16\nturmoil, the prophet discerns future life, future hope.; but more than that –\npurpose.\nThose of you brought up on the old Service of Morning Prayer may remember\nthe opening words of the prayer of Absolution after the General Confession\nAlmighty God, the Father of our Lord Jesus Christ, who desireth\nnot the death of a sinner, but rather that he may turn from his\nwickedness, and live;\nThis picks up words of the prophet Ezekiel, that prophet of the Exile. The\nGod who judges, the God who makes new beginning is a God who seeks out;\nseeks out not to destroy but to heal, to restore a God ‘who desireth not the\ndeath of a sinner, but rather that he may turn from his wickedness, and live\n……’\nWhich brings us to our Gospel passage this morning. It is one of those\nscenarios in which we begin to see the developing conflict between Jesus and\nthe religious authorities of his day. It centred on Jesus’ credibility as a\nreligious teacher. The Pharisees, the ‘separated ones’ could not understand\nJesus’ willingness to meet with, to share table fellowship with sinners. In\ntheir eyes it amounted to condoning their sinful lie style. Possibly the very\nfact that these people were drawn to Jesus troubled them. In reply, Jesus tells\nthe two parables that we read in our Gospel passage this morning. His choice\nof characters in his stories would also have jarred the sensibilities of his\nhearers. Shepherds in 1st century Palestine did not figure high in the social\norder, not the sort of fellow you would want your daughter to marry. Much of\nwhat they did would have rendered them ritually unclean in the eyes of the\npurists. And women – well women didn't really figure in the society of that\ntime. So the stories themselves feature people on the edge. It is these who are\nPage 4 of 4\nPROPER 19 – 2013 – Year C – Trinity 16\nheld up as illustrations of God’s persistent search for that which is lost. The\nshepherd leaves the 99 to search for the one that is missing. The woman sets\naside all other domestic tasks to seek the one coin that is lost. Those who are\nalready safe, those who are already secure, find that concern for the lost\nunsettling, even offensive. But as I thought about that, I thought back to the\npotter at his wheel, working, reworking the same bit of clay until he got it\nright. God never giving up on our frail and wilful humanity.\nJesus spent much of his life on the edge, on the margins. In the Gospel\nnarrative we find him born in a stable, a refugee as his parents flee to Egypt.\nWhen they come back it is to Galilee. He is never accepted by the religious\nauthorities and he dies the death of a criminal outside the city walls. He calls\nus, his followers, as individuals, as a community to be prepared to go to the\nedge, to have a care and concern for justice, for those on the margins of our\nsociety. When we take the risk and go there we discover he is there ahead of\nus:\nfor I was hungry and you gave me food, I was thirsty and you gave\nme something to drink, I was a stranger and you welcomed me, 36 I\nwas naked and you gave me clothing, I was sick and you took care\nof me, I was in prison and you visited me.' Matt 25:35,36\nmay we be living signs of a God who never gives up, a God ‘who desireth not\nthe death of a sinner, but rather that he may turn from his wickedness, and live\n……’"
    }
}