{
    "title": "The Living Bread",
    "date": "2015-08-16",
    "blurb": "Kevin explores the concept of Jesus as the 'bread of life' and the personal nature of spiritual nourishment. Using the metaphor of choosing a meal, he discusses the significance of the Holy Communion and the act of eating as a personal and intimate act of faith. The sermon reflects on the figurative language used by Jesus and the deeper meaning of the communion as a remembrance of Christ's sacrifice.",
    "raw_text": "PROPER 15 – Year B – 2015 – Trinity 11\n\nI want to begin this morning by using our imagination - I want you to think of going out for a meal. It might be a posh restaurant, or a Chinese or Indian or maybe McDonald's or the local fish and chip shop. We look at the menu, the variety of meals on offer. What will I choose? Will I go for what I always have or will I be a bit more adventurous? How about the sweet and sour prawn? What is satay when it is at home? Or will I have the McBacon? Decisions. And while I work my way through the menu the waiter is waiting, pen hanging over the pad. At last I choose something off the menu - the waiter heads off to the kitchen and a meal is prepared solely for me - this is my choice - this is what I want. Finally my meal is brought and put in front of me - for me to eat - for me to enjoy.\n\nJohn, chapter 6, from which we have read today and last week, is a long discourse on food. It begins with the feeding of the five thousand. There then follows the stilling of the storm and then a long discourse (of which today's Gospel reading is a part) with Jewish leaders who have come to Jesus looking for a sign and they throw up the example of the people being fed with manna in the wilderness during the time of Moses.\n\nJesus describes himself as the bread of life, the true bread that has come down from heaven. He then begins to use language that his hearers find confusing and indeed disturbing. In fact, as we read later on in this same chapter, so disturbing that some who had followed him up to that point fall away - he has gone too far. He declares \"I am the living bread that came down from heaven. If anyone eats of this bread he will live forever. This bread is my flesh, which I will give for the life of the world.\" (v 51)\n\nThis bread is my flesh - what is he talking about? There is something of a flavour of sacrifice about his language. But then he goes further, using language that anyone familiar with Jewish sacrificial practices would have found even more controversial than his previous comments. \"Unless you eat of the flesh of the Son of Man and drink of his blood, you have no life in you.\" (v 53)\n\nBefore we go any further, I think that it is worth gathering a few points together that we need to keep in mind as we reflect on this passage. As I said the language Jesus uses has something of the flavour of sacrifice. In the context of Jewish sacrifice (remember the people he was speaking to were Jews) the blood of the sacrifice was never drunk indeed Orthodox Jews will only eat meat from which all the blood has been drained. The reason is blood represents the life of the animal and life, all life belongs to God. So when Jesus speaks of the need to drink the blood of the Son of Man it just added to the sense of confusion and indignation on the part of his hearers.\n\nSecondly, unlike the other three Gospels, St John, in his account of the Last Supper, makes no mention of Jesus inaugurating the service of Holy Communion. Scholars generally regard this section of St John's Gospel, chapter 6, as giving John's own thinking on the significance of the Holy Communion; they would see the words \"This bread is my flesh which I will give for the life of the world\" as almost equivalent to words of Jesus at the Last Supper, \"Take eat, this is my body ...\"\n\nFinally there is the rather obvious point that, as at the Last Supper, Jesus is here, in the flesh, as he says these words. So the language is figurative - but for all that the image is still very powerful. Even the words John uses for \"eat\" in the original Greek He begins using the word \"esqiw\", which is the ordinary word for eating. As the passage progresses he uses the word \"trwgw\" which means literally \"crunch\" To go back to the illustration I used at the beginning, there is a sense as the passage progresses of a move from tasting a meal to, once you realise you like it, setting about to eat it with relish.\n\nBoth the account of the Last Supper and this 6th chapter of St John's Gospel, contain obvious references to the coming death of Jesus and both contain references to feeding upon his body.\n\nAs I was reflecting at the outset, there is something very personal about eating. It is I who take the food, it is I who eats it and swallows it; it is for the nourishment of my body. And if it is good I will eat it with relish. What we are thinking about here, as we reflect on this 6th chapter of St John, as we recall Jesus words at his Last Supper, is no ordinary meal. This is a meal prepared by God in Christ; the very finest of fare as he offers himself, once and for all, upon the Cross for the life of the world.\n\nLooking at the communion from the perspective of this 6th chapter John's Gospel, there is no longer the argument as to what happens to the bread and wine in the prayer of consecration. The emphasis now falls on the whole action of the service. As together, as members of the Body of Christ, we participate in the breaking of bread, the pouring of the wine; as together in prayer we remember the events of Christ's passion and death, the drama or our redemption; as we come to receive the bread and wine, broken and poured in remembrance of his body broken upon the Cross,; as we hear the words \"The Body of Christ keep you in eternal life. The Blood of Christ keep you in eternal life.\" the very core of the Gospel is proclaimed to us individually.\n\nAs I remember I eat; as I eat I remember. As I eat and drink I feed in my heart on the Body and Blood of Christ, I lay hold of the benefits of his Passion, I look forward to joining with him in the heavenly banquet.\n\nFor as often as you eat the bread and drink the cup you proclaim the Lord's death until he comes.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper152015.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 15 – Year B – 2015 – Trinity 11\nI want to begin this morning by using our imagination - I want you to\nthink of going out for a meal. It might be a posh restaurant, or a Chinese\nor Indian or maybe McDonald's or the local fish and chip shop.\nWe look at the menu, the variety of meals on offer. What will I choose?\nWill I go for what I always have or will I be a bit more adventurous?\nHow about the sweet and sour prawn?\nWhat is satay when it is at home?\nOr will I have the McBacon?\nDecisions. And while I work my way through the menu the waiter is\nwaiting, pen hanging over the pad.\nAt last I choose something off the menu - the waiter heads off to the\nkitchen and a meal is prepared solely for me - this is my choice - this is\nwhat I want.\nFinally my meal is brought and put in front of me - for me to eat - for me\nto enjoy.\nJohn, chapter 6, from which we have read today and last week, is a long\ndiscourse on food. It begins with the feeding of the five thousand. There\nthen follows the stilling of the storm and then a long discourse (of which\ntodays Gospel reading is a part) with Jewish leaders who have come to\nJesus looking for a sign and they throw up the example of the people being\nfed with manna in the wilderness during the time of Moses.\nJesus describes himself as the bread of life, the true bread that has come\ndown from heaven. He then begins to use language that his hearers find\nconfusing and indeed disturbing. In fact, as we read later on in this same\nchapter, so disturbing that some who had followed him up to that point fall\naway - he has gone too far.\nPage 2 of 4\nPROPER 15 – Year B – 2015 – Trinity 11\nHe declares \"I am the living bread that came down from heaven. If\nanyone eats of this bread he will live for ever. This bread is my flesh,\nwhich I will give for the life of the world.\" (v 51)\nThis bread is my flesh - what is he talking about? There is something of a\nflavour of sacrifice about his language. But then he goes further, using\nlanguage that anyone familiar with Jewish sacrificial practices would have\nfound even more controversial than his previous comments. \"Unless you\neat of the flesh of the Son of Man and drink of his blood, you have no life\nin you.\" (v 53)\nBefore we go any further, I think that it is worth gathering a few points\ntogether that we need to keep in mind as we reflect on this passage.\nAs I said the language Jesus uses has something of the flavour of sacrifice.\nIn the context of Jewish sacrifice (remember the people he was speaking\nto were Jews) the blood of the sacrifice was never drunk indeed Orthodox\nJews will only eat meat from which all the blood has been drained. The\nreason is blood represents the life of the animal and life, all life belongs to\nGod. So when Jesus speaks of the need to drink the blood of the Son of\nMan it just added to the sense of confusion and indignation on the part of\nhis hearers.\nSecondly, unlike the other three Gospels, St John, in his account of the\nLast Supper, makes no mention of Jesus inaugurating the service of Holy\nCommunion. Scholars generally regard this section of St John's Gospel,\nchapter 6, as giving John's own thinking on the significance of the Holy\nCommunion; they would see the words \"This bread is my flesh which I\nwill give for the life of the world\" as almost equivalent to words of Jesus\nat the Last Supper, \"Take eat, this is my body ...\"\nPage 3 of 4\nPROPER 15 – Year B – 2015 – Trinity 11\nFinally there is the rather obvious point that, as at the Last Supper, Jesus is\nhere, in the flesh, as he says these words. So the language is figurative -\nbut for all that the image is still very powerful. Even the words John uses\nfor \"eat\" in the original Greek He begins using the word \"esqiw\", which\nis the ordinary word for eating. As the passage progresses he uses the\nword \"trwgw\" which means literally \"crunch\" To go back to the\nillustration I used at the beginning, there is a sense as the passage\nprogresses of a move from tasting a meal to, once you realise you like it,\nsetting about to eat it with relish.\nBoth the account of the Last Supper and this 6th chapter of St John's\nGospel, contain obvious references to the coming death of Jesus and both\ncontain references to feeding upon his body.\nAs I was reflecting at the outset, there is something very personal about\neating. It is I who take the food, it is I who eats it and swallows it; it is\nfor the nourishment of my body. And if it is good I will eat it with relish.\nWhat we are thinking about here, as we reflect on this 6th chapter of St\nJohn, as we recall Jesus words at his Last Supper, is no ordinary meal.\nThis is a meal prepared by God in Christ; the very finest of fare as he\noffers himself, once and for all, upon the Cross for the life of the world.\nLooking at the communion from the perspective of this 6th chapter John's\nGospel, there is no longer the argument as to what happens to the bread\nand wine in the prayer of consecration. The emphasis now falls on the\nwhole action of the service. As together, as members of the Body of\nChrist, we participate in the breaking of bread, the pouring of the wine; as\nPage 4 of 4\nPROPER 15 – Year B – 2015 – Trinity 11\ntogether in prayer we remember the events of Christ's passion and death,\nthe drama or our redemption; as we come to receive the bread and wine,\nbroken and poured in remembrance of his body broken upon the Cross,; as\nwe hear the words \"The Body of Christ keep you in eternal life. The\nBlood of Christ keep you in eternal life.\" the very core of the Gospel is\nproclaimed to us individually.\nAs I remember I eat; as I eat I remember. As I eat and drink I feed in my\nheart on the Body and Blood of Christ, I lay hold of the benefits of his\nPassion, I look forward to joining with him in the heavenly banquet.\nFor as often as you eat the bread and drink the cup you proclaim the Lord's\ndeath until he comes."
    }
}