{
    "title": "Holy Nation Covenant",
    "date": "2014-11-23",
    "blurb": "Kevin's sermon reflects on the covenant between God and His people, emphasizing the themes of obedience, blessing, and being a holy nation. The sermon draws from various biblical texts to illustrate the idea that God's people are called to a special relationship with Him, marked by justice, kindness, and humility. The sermon also touches on the concept of being made in God's image and the responsibility that comes with it.",
    "raw_text": "Exodus 19:5,6\n> 5 Now therefore, if you obey my voice and keep my covenant, you shall be my treasured possession out of all the peoples. Indeed, the whole earth is mine, 6 but you shall be for me a priestly kingdom and a holy nation. These are the words that you shall speak to the Israelites.\n\nLeviticus 26:12\n> 12 And I will walk among you, and will be your God, and you shall be my people.\n\n1 Peter 2:9\n> But you are a chosen race, a royal priesthood, a holy nation, God's own people, in order that you may proclaim the mighty acts of him who called you out of darkness into his marvelous light.\n\nMicah 6:8\n> He has told you, O mortal, what is good; and what does the LORD require of you but to do justice, and to love kindness, and to walk humbly with your God?\n\nJeremiah 7:23\n> \"Obey my voice, and I will be your God, and you shall be my people; and walk only in the way that I command you, so that it may be well with you.\n\nGenesis 12:1-2\n> Now the LORD said to Abram, \"Go from your country and your kindred and your father's house to the land that I will show you. 2 I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing.\n\nGenesis 1:27\n> So God created humankind in his image, in the image of God he created them; male and female he created them.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper252014notes.txt",
        "raw_ocr_content": "HOLY NATION YOU WILL BE MY PEOPLE AND I WILL BE YOUR GOD\nExodus 19:5,6 Ex 6:7..\n5 Now therefore, if you obey my voice and keep my covenant, you 7 I will take you as my people, and I will be your God. You shall\nshall be my treasured possession out of all the peoples. Indeed, the know that I am the LORD your God, who has freed you from the\nwhole earth is mine, 6 but you shall be for me a priestly kingdom burdens of the Egyptians.\nand a holy nation. These are the words that you shall speak to the\nIsraelites.\" Lev 26:12.\n12 And I will walk among you, and will be your God, and you shall\n1 Peter 2:9 be my people. 13 I am the LORD your God who brought you out\n1Pe 2:9 But you are a chosen race, a royal priesthood, a holy nation, of the land of Egypt, to be their slaves no more\nGod's own people, in order that you may proclaim the mighty acts\nof him who called you out of darkness into his marvelous light.\nJer 7:23.\nWHAT DOES THE LORD REQUIRE OF YOU \"Obey my voice, and I will be your God, and you shall be my\nMicah 6:8 people; and walk only in the way that I command you, so that it\nMic 6:8 He has told you, O mortal, what is good; may be well with you\nand what does the LORD require of you\nbut to do justice, and to love kindness, Jer 30:22..\nand to walk humbly with your God? Jer 30:22 And you shall be my people,\nand I will be your God.\nI WILL BLESS YOU ….. SO THAT YOU MAY BE A\nBLESSING Eze 36:28.\nGenesis 12:1-2 28 Then you shall live in the land that I gave to your ancestors; and\nNow the LORD said to Abram, \"Go from your country and your you shall be my people, and I will be your God.\nkindred and your father's house to the land that I will show you. 2\nI will make of you a great nation, and I will bless you, and make MADE IN GOD’S IMAGE\nyour name great, so that you will be a blessing. Gen 1:27\nSo God created humankind in his image,\nin the image of God he created them;\nmale and female he created them."
    }
}