{
    "title": "Incarnation and Challenge",
    "date": "2018-07-08",
    "blurb": "Kevin explores the concept of the Incarnation and how Jesus, by becoming human, invites us to become more like him. He discusses how Jesus' actions and teachings often led to scandal and offense, yet also to transformation and beauty. The sermon encourages Christians to be a positive irritant in society, challenging injustices and modeling a different way of living.",
    "raw_text": "'Who do they think they are?'\n\nThis is the title of a television series that became very popular and was shown in a number of different countries across the world. Celebrities were enabled to track down their roots; where they had come from, what their forbears did, where they lived.\n\nWhen used in a different context it can take on the form of a challenge. Who are you to speak like that, who are you to boss me around? It can be said in the context of putting someone in their place, someone who clearly was getting notions about themselves.\n\nI know who you are, you grew up in the same street as me, we went to the same school. You know - he's no different to us. That could almost read as a paraphrase of the first part of our Gospel reading, the reaction of the congregation in the synagogue in Nazareth.\n\nYou know - he's no different to us. In a very strange way that pinpoints a fundamental truth about the Incarnation, God coming among us in the person of Jesus Christ. Athanasius, one of the key figures in the formulation of our Nicene Creed, said this of the Incarnation:\n\n> He became like us so that we might become more like him.\n\nCould we just park those words for a while and go back to our text?\n\n'Who does he think he is?' 'And they took offence at him.' The word that we have translated as 'took offence' is ἐσκανδαλίζοντο. This has the same root as the word σκανδαλον, from which we derive our word 'scandal'. This is a word that occurs at different points in the New Testament. We read in 1st Peter:\n\n> To you then who believe, he is precious; but for those who do not believe,\n> 'The stone that the builders rejected\n> has become the very head of the corner,'\n> and\n> 'A stone that makes them stumble,\n> and a rock that makes them fall.' 1 Peter 2:7,8\n\nThe rock that makes them fall, the rock of offence, of scandal has become the chief corner stone. Part of Jesus' vocation was to challenge, to question. He stood alongside those on the margins. He touched the leper, he welcomed sinners to eat with him. People looked on shocked as he allowed a woman to wash his feet with her tears of remorse - he calls himself a prophet and he allows her of all people to wash his feet? People, respectable people, were scandalised, were offended.\n\nIt is here that I go back to those words of Athanasius that I parked a few minutes ago:\n\n> He became like us so that we might become more like him.\n\nAs I do that I just want to pick up on that word Prophet used by Jesus in our reading this morning. The people who heard him that day would be have aware of the Prophets of the Old Testament, the role they played in the period leading up to and following the fall of Jerusalem and the Exile in Babylon. In one sense they could be seen as something of an awkward squad. They spoke truth to power, standing before Kings, standing in the public square, asking the uncomfortable question, speaking the challenging word. 'Thus says the Lord ….' This is wrong. Continue this way and your society will crumble.\n\nHe became like us so that we might become more like him.\n\nThey took offence at him. They took offence at what he was doing, took offence at what he was saying, took offence at who he was. We are called as members of the Church, the Body of Christ to be something of an irritant in contemporary society, asking the awkward question on issues of public morality, modelling a different way of living in the world of today, standing alongside those on the margins of our society.\n\nOf course, an irritant can produce something beautiful. A piece of sand or grit may get into an oyster. The oyster, unable to get rid of it, begins coating it, resulting in the production of a beautiful pearl. Faithful witness by Christians in the face of injustice have produced beautiful results, deep rooted changes in society. In the face of fierce opposition at the outset, we have seen the abolition of slavery in Europe and America, the Civil Rights Movement in the 1960's, figures such as Desmond Tutu in the fight against apartheid.\n\nHe became like us so that we might become more like him.\n\nIn John's Gospel, Jesus describes himself as the 'Good Shepherd'. The word that we translate as 'good' is καλὸς, means literally 'beautiful, attractive'. I am the Good Shepherd, I am the beautiful, the attractive shepherd. There was something beautiful, something attractive about the ministry of Jesus that drew people to him.\n\nEven when we challenge those around us, ask fundamental questions of our modern society, even when we cause offence, may there be something beautiful, something attractive, about our lives as Christians that seeing us, hearing us, simply being with us; people may be drawn to find in Jesus the way that leads to eternal life.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper92018.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 9 – year B – 2018 – Trinity 6\n‘Who do they think they are?’\nThis is the title of a television series that became very popular and was shown\nin a number of different countries across the world. Celebrities were enabled\nto track down their roots; where they had come from, what their forbears did,\nwhere they lived.\nWhen used in a different context it can take on the form of a challenge. Who\nare you to speak like that, who are you to boss me around? It can be said in the\ncontext of putting someone in their place, someone who clearly was getting\nnotions about themselves.\nI know who you are, you grew up in the same street as me, we went to the\nsame school. You know - he’s no different to us. That could almost read as a\nparaphrase of the first part of our Gospel reading, the reaction of the\ncongregation in the synagogue in Nazareth.\nYou know – he’s no different to us. In a very strange way that pinpoints a\nfundamental truth about the Incarnation, God coming among us in the person\nof Jesus Christ. Athanasius, one of the key figures in the formulation of our\nNicene Creed, said this of the Incarnation:\nHe became like us so that we might become more like him.\nCould we just park those words for a while and go back to our text?\n‘Who does he think he is?’ ‘And they took offence at him.’ The word that we\nhave translated as ‘took offence’ is ἐσκανδαλίζοντο. This has the same root as\nPage 2 of 3\nPROPER 9 – year B – 2018 – Trinity 6\nthe word σκανδαλον, from which we derive our word ‘scandal’. This is a word\nthat occurs at different points in the New Testament. We read in 1st Peter:\nTo you then who believe, he is precious; but for those who do not\nbelieve,\n“The stone that the builders rejected\nhas become the very head of the corner,”\nand\n“A stone that makes them stumble,\nand a rock that makes them fall.” 1 Peter 2:7,8\nThe rock that makes them fall, the rock of offence, of scandal has become the\nchief corner stone. Part of Jesus’ vocation was to challenge, to question. He\nstood alongside those on the margins. He touched the leper, he welcomed\nsinners to eat with him. People looked on shocked as he allowed a woman to\nwash his feet with her tears of remorse – he calls himself a prophet and he\nallows her of all people to wash his feet? People, respectable people, were\nscandalised, were offended.\nIt is here that I go back to those words of Athanasius that I parked a few\nminutes ago:\nHe became like us so that we might become more like him.\nAs I do that I just want to pick up on that word Prophet used by Jesus in our\nreading this morning. The people who heard him that day would be have\naware of the Prophets of the Old Testament, the role they played in the period\nleading up to and following the fall of Jerusalem and the Exile in Babylon. In\none sense they could be seen as something of an awkward squad. They spoke\ntruth to power, standing before Kings, standing in the public square, asking the\nuncomfortable question, speaking the challenging word. ‘Thus says the Lord\n….’ This is wrong. Continue this way and your society will crumble.\nHe became like us so that we might become more like him.\nPage 3 of 3\nPROPER 9 – year B – 2018 – Trinity 6\nThey took offence at him. They took offence at what he was doing, took\noffence at what he was saying, took offence at who he was. We are called as\nmembers of the Church, the Body of Christ to be something of an irritant in\ncontemporary society, asking the awkward question on issues of public\nmorality, modelling a different way of living in the world of today, standing\nalongside those on the margins of our society.\nOf course, an irritant can produce something beautiful. A piece of sand or grit\nmay get into an oyster. The oyster, unable to get rid of it, begins coating it,\nresulting in the production of a beautiful pearl. Faithful witness by Christians\nin the face of injustice have produced beautiful results, deep rooted changes in\nsociety. In the face of fierce opposition at the outset, we have seen the\nabolition of slavery in Europe and America, the Civil Rights Movement in the\n1960’s, figures such as Desmond Tutu in the fight against apartheid.\nHe became like us so that we might become more like him.\nIn John’s Gospel, Jesus describes himself as the ‘Good Shepherd’. The word\nthat we translate as ‘good’ is καλὸς, means literally ‘beautiful, attractive’. I am\nthe Good Shepherd, I am the beautiful, the attractive shepherd. There was\nsomething beautiful, something attractive about the ministry of Jesus that drew\npeople to him.\nEven when we challenge those around us, ask fundamental questions of our\nmodern society, even when we cause offence, may there be something\nbeautiful, something attractive, about our lives as Christians that seeing us,\nhearing us, simply being with us; people may be drawn to find in Jesus the way\nthat leads to eternal life."
    }
}