{
    "title": "Gifts of Faith and Love",
    "date": "2015-11-08",
    "blurb": "Kevin reflects on the importance of the spirit in which we give, rather than the amount. He shares a touching story of 'Bert', who despite his own hardships, gave his Christmas disability bonus to those in need. The sermon emphasizes that our offerings, whether they be money, time, or compassion, are valuable to God and can make a significant difference in the lives of others.",
    "raw_text": "### 3rd Sunday before Advent – Proper 27 – Year B – 2015 – Family Service\n\nEvery Sunday we gather here in Church we do a number of things. We sing hymns, we hear the Bible read, we pray, and we contribute to running the parish – my salary, upkeep of Church building, payment of Youth Work, giving to charity. This is much more than just paying our bills – it's part of our worship, part of saying thank you to God for all the blessings we enjoy. In Old Testament times, there was the idea of the tithe – people would have given a tenth of all they earned to God.\n\nIt is not just a matter of what we give, but the spirit in which we give it is important to God. I want to tell you a true story about a man who came to see me the first Christmas I was in Finglas – we’ll call him Bert. Bert could not hear very well so he didn’t come to Church. He wasn't very well off, but he and his wife decided to give their Christmas disability bonus to someone who needed it more. That envelope was not the biggest donation that year, but it was the most significant.\n\nOur two lessons have spoken of people who brought gifts, each apparently small and insignificant – yet seen as great in the eyes of God. The faithfulness of the widow in feeding Elijah, the simple sincerity of the widow giving her small coin – they each gave willingly what they could.\n\nI want us to think of other gifts we can offer that can make a difference. Gifts of time, gifts of listening, gifts of compassion. Of themselves, these can seem unimportant, of little value – but God can work in and through all of these. Back in Finglas, Bert brought more than just money – he brought a love and concern for people. May God take our gifts, our money, our time, our compassion, and work in and through them to bring something of his love into the lives of others.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper272015familyservice.txt",
        "raw_ocr_content": "Page 1 of 3\n3rd Sunday before Advent – Proper 27 – Year B – 2015 – Family Service\nEvery Sunday we gather here in Church we do a number of things –\nwhat are they?\nWe sing hymns,\nwe hear the Bible read\nwe pray\nwhat else?\nDo you know what we use it for?\nRunning the parish – my salary, upkeep of Church building, payment\nof Youth Work, giving to charity\nMuch more than just paying our bills – part of our worship, part of\nsaying thank you to God for all the blessings we enjoy – in Old\nTestament times there was the idea of the tithe – people would have\ngiven a tenth of all they earned to God.\nIt is not just a matter of what we give, what is important to God is the\nspirit in which we give it.\nI just want to tell you a true story about a man who came to see me the\nfirst Christmas I was in Finglas – we’ll call him Bert.\nChristmas appeal\nPage 2 of 3\n3rd Sunday before Advent – Proper 27 – Year B – 2015 – Family Service\nBert could not hear very well so he didn’t come to Church\nNot very well off – so I started to think ‘How much do I give?’\nSometimes bet on the horses – most of the time did not go well\nstarted to think – this fund is not for making up\ngambling debts\nBefore I could say anything Bert handed me an envelope\nhis wife and he had decided to give their Christmas\ndisability bonus – I would know someone who needed it\nmore.\nThere were lots of donations to the fund that year – that envelope was\nnot the biggest – but it was the biggest.\nOur two lessons have spoken of people who brought gifts, each\napparently small and insignificant – yet seen as great in the eyes of\nGod. The faithfulness of the widow in feeding Elijah, the simple\nsincerity of the widow giving her small coin – they each gave\nwillingly what they could.\nI want us to think of other gifts we can offer that can make a\ndifference.\ngifts of time\nPage 3 of 3\n3rd Sunday before Advent – Proper 27 – Year B – 2015 – Family Service\ngifts of listening\ngifts of compassion\nOf themselves these can seem unimportant, of little value – but God\ncan work in and through all of these.\nBack in Finglas, all those years ago, Bert brought an envelop to me –\nBert brought far more than £30 – he brought a love and concern for\npeople – I think God worked through that in ways that Bert and I\nnever imagined.\nMay God take our gifts, our money, our time, our compassion and\nwork in and through them to bring something of his love into the lives\nof others."
    }
}