{
    "title": "The Journey of Faith",
    "date": "2018-11-18",
    "blurb": "Kevin discusses the spiritual journey from Baptism to Confirmation, emphasizing the importance of personal responsibility in faith. He reflects on the presence of God in everyday life, through nature, music, and the people around us. The sermon encourages us to be living signs of Christ's presence in the world, embodying his compassion and love in our actions and interactions.",
    "raw_text": "## PROPER 28 – 2018 – Year B – 2nd Sunday before Advent\n\nToday, at our 11 o'clock service we are welcoming a young child into the fellowship of the Church in Baptism. This coming week, I will be meeting with young people who are considering taking the next step at Confirmation. If Baptism is about beginning, then Confirmation is about continuing and taking responsibility for oneself.\n\nParents and godparents will be asked to affirm the Christian faith in the form of the Apostles Creed, which we recite each Sunday, declaring 'I believe in God'. In Confirmation, we delve into what it means to believe in God and how we can know and relate to Him.\n\nAs we approach the end of the season of Trinity and draw closer to Advent, our lessons take on a theme of Advent. Our Gospel reading begins with the disciples in Jerusalem reacting to the Temple and shifts to the Mount of Olives, where Jesus speaks of its coming destruction and presents a clear picture of God's presence.\n\n> The Mount of Olives is a significant place in both the Old and New Testaments, where God is revealed in a decisive, dramatic way. The God who appears there is one of humility and sacrifice, exemplified by Jesus's actions and teachings.\n\nIn our Confirmation Group, we explore how God might make Himself known today. We discuss seeing God in nature, music, the teachings of Jesus, and in other people. This leads to the realization that we, too, can reflect God's presence to others.\n\nI am reminded of Teresa of Avila's prayer, which beautifully expresses the idea that we are Christ's body on Earth, called to be His hands, feet, and eyes, showing compassion and doing good in the world.\n\nJesus tells his disciples to look for signs of His presence around them. Similarly, we are called to be signs of Christ in our daily lives, in our communities, and in our interactions with others. The child we baptize today, and all of us, should be able to see God in each other. I recall my own experiences of God's presence in the welcoming actions of church members during my youth.\n\nWe are all called to be living signs of Christ's presence, embodying the Kingdom of God in the world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper282018.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 28 – 2018 – year B – 2nd Sunday before Advent\nToday, at our 11 o’clock service we are welcoming a young child into the\nfellowship of the Church in Baptism. As it turns out, this coming week I will\nbe meeting up with young people who are thinking in terms of taking the next\nstep, of taking for themselves the promises that are being made on behalf of\nyoung Beauden Harley this morning at Confirmation. If Baptism is about\nbeginning, then Confirmation is about continuing, is about taking responsibility\nfor yourself.\nToday, in the context of Baptism, parents and godparents will be asked to make\na series of promises, will be asked to affirm the Christian faith in the form of\nthe Apostles Creed. Each Sunday in Church we say a creed in one form or\nanother in which we basically say ‘I believe in God’.\nIn Confirmation we try to tease that out; we start by thinking through what it\nmeans to believe in God. And then what sort of God are we believing in. How\ncan we know this God, how can we relate to this God? What sort of signs are\nthere of his presence in the world? How does God make himself known?\nAs we draw towards the end of the season of Trinity, as we draw closer to the\nseason of Advent, our lessons, Sunday by Sunday, are beginning to take on a\ntheme of Advent. Our Gospel reading this morning begins with the disciples in\nJerusalem and their reaction to seeing the Temple, this seat of God’s presence\nthat lay at the heart of Jewish spirituality. We also hear of Jesus talking of its\ncoming destruction. The scene then shifts to the Mount of Olives, overlooking\nPage 2 of 4\nPROPER 28 – 2018 – year B – 2nd Sunday before Advent\nthe city. The disciples start of ask Jesus about what he has meant by this talk\nof destruction, what will be the sign that all this is about to happen.\nIn Mark’s account of the closing week of the ministry of Jesus we find a\nnumber of references to the Mount of Olives. It was from the Mount of Olives\nthat Jesus set out on his triumphal entry into Jerusalem. The Garden is\nevidently a place to which Jesus would go to pray. We then have the episode\nthat we have read of today. Finally, after the Last Supper Jesus lead his\ndisciples out to the Mount of Olives, there to pray, to be betrayed and to be\nlead away prisoner. In placing these events in and around the Mount of Olives,\nthe Gospel writer is presenting us with a very clear picture of God, present in\nthe person of Jesus, on the Mount of Olives, entering into the city, appearing in\nthe Temple.\nThe Mount of Olives is mentioned several times in the Old Testament. It is a\nplace where God is going to make himself known in a very decisive, very\ndramatic way.\nIn sharp contrast with the figure portrayed by the prophet Zechariah and others,\nthe God who makes himself known on the Mount of Olives is one who comes\nriding on a donkey, one who prays ‘Father let this cup pass from me.\nNevertheless not my will but yours be done.’ One who gives of himself,\nempties himself, even unto death, a death on a cross.\nPage 3 of 4\nPROPER 28 – 2018 – year B – 2nd Sunday before Advent\nOne of the questions we ask ourselves in Confirmation Group is how God\nmight make himself known in our own day. Our youngsters come up with\nsome lovely images. Looking back over previous classes, one girl in a class\npainted a lovely picture of seeing an evening sky, the setting sun behind clouds\njust above the horizon and rays of sunlight radiating from the cloud. Others\nspoke of music, some of the songs they sing in the Burrow. There were stories\nof the teaching and ministry of Jesus, we thought of some of the parables, in\nparticular the parable of the Prodigal Son, the unconditional love of a father\ntowards his wayward son.\nThen we start thinking about people, seeing God in other people. We can all\nthink of people who have been important in our own spiritual journey. I think\nof those people who impacted on my own person spiritual journey – the Rector\nand people of St Laurence’s where I had been baptised and to which I returned\n17 years later looking and searching – some of my first insights into God were\nin the faces I met in that place.\nThen we started thinking – If I can see something of God in other people, what\nabout other people being able to see something of God in us? We started to\nthink of the Church as the Body of Christ and in that body everyone has a\nplace, everyone has a part to play. I go back to the prayer of Teresa of Avila:\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nPage 4 of 4\nPROPER 28 – 2018 – year B – 2nd Sunday before Advent\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nThe disciples asked of Jesus, ‘What are the signs that all this is about to\nhappen?’ He basically said, look around you. What are the signs of Christ’s\npresence in the world of today? Look around you. You and I are called to be\nsigns of Christ in the world of today; called to be the feet, the hands, the eyes,\nthe body of Christ. You are called to be signs of Christ on the street in which\nyou live, in the office in which you work, in the club in which you play, in the\ncasual conversations with friend and neighbour; signs of the presence of the\nKingdom of God in the world.\nWill the child we baptise today see God in you or in me? I look back to the\ntime I went as a teenager into St Laurence’s Church in Northfield. I look back\non the people who very simply welcomed me, offered me the sign of peace,\nhelped me find my way around the prayer book. That is where I had my first\nprofound experience of the presence of God."
    }
}