{
    "title": "Inside Matters",
    "date": "2015-06-14",
    "blurb": "Kevin's sermon focuses on looking beyond external appearances to the true value within. He uses a tin of dog food filled with trifle to illustrate not judging by the outside, relating it to the story of David's selection by God and the parable of the seeds from Jesus' teachings. The core message is about growing God's Kingdom within us by being compassionate, understanding, and helpful to others.",
    "raw_text": "PROPER 6 – Trinity 2 – 2015 – year B\nFamily Service\n\nProduce tin of dog food as my breakfast – enthuse how good it is – healthy bones, shiny hair. Open it and start to eat from it – see if anyone else will try it. Go by what is on the inside rather than what is on the outside.\n\nStory of choice of David – man looks at the outside – God looks at the heart.\n\nOther lesson from Mark’s Gospel, one of the Parables Jesus told about seeds. Seeds look pretty plain from the outside – but inside there is the whole beginnings of a plant.\n\nJesus used seed to give us a valuable lesson as he talked about God’s Kingdom. If I plant this seed, something amazing will start to happen. God wants us to be seeds, ones in whom and through whom God’s Kingdom starts to grow. That happens when we start to be the sort of people Jesus wants us to be – when instead of arguing, we start listening and understanding each other – when we see someone in difficulty or lonely, we help them.\n\nJesus told another story – story of the sheep and the goats – as much as you did it for the least of these brothers and sisters of mine – you did it to me.\n\nLet us just think how we can be do things for Jesus this week.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper62015famserv.txt",
        "raw_ocr_content": "Page 1 of 2\nPROPER 6 – Trinity 2 – 2015 – year B\nFamily Service\n(Needed for sermon – tin of dog food emptied from the bottom\nand filled with trifle and resealed and a couple of spoons – also\na seed, say broadbean)\nProduce tin of dog food as my breakfast – enthuse how good it\nis – healthy bones, shiny hair.\nOpen it and start to eat from it – see if anyone else will try it.\nGo by what is on the inside rather than what is on the outside.\nStory of choice of David – man looks at the outside – God\nlooks at the heart\nOther lesson from Mark’s Gospel, one of the Parables Jesus\ntold about seeds.\nSeeds look pretty plain from the outside – but inside there is\nthe whole beginnings of a plant.\nJesus used seed to give us a valuable lesson as he talked about\nGod’s Kingdom\nIf I plant this seed, something amazing will start to happen.\nGod wants us to be seeds, ones in whom and through whom\nGod’s Kingdom starts to grow. That happens when we start to\nbe the sort of people Jesus wants us to be – when instead of\narguing, we start listening and understanding each other –\nwhen we see someone in difficulty or lonely, we help them\nPage 2 of 2\nPROPER 6 – Trinity 2 – 2015 – year B\nFamily Service\nJesus told another story – story of the sheep and the goats – as\nmuch as you did it for the least of these brothers and sisters of\nmine – you did it to me.\nLet us just think how we can be do things for Jesus this week."
    }
}