{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper52016.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 5 – Year C - 2016 – Trinity 2\nOur Old Testament and Gospel lessons set for today both speak of personal\ntragedy, in each case the death of the only son of an elderly widow. In the first\nit is the son of the widow at Zarephath. There is a particular edge to this one as\nshe has willingly shared what little she and her son had with Elijah. In her\nanguish she rails against Elijah, only to acclaim him when her son is raised\nfrom the dead. In the case of our Gospel reading, Jesus comes upon a funeral\nand we have the account of him raising the young man from the dead.\nWe have here powerful images of the power of God in the face of death that\ninspire faith. But as I read over them the thought occurred to me that things do\nnot always work out this way, there are not always the happy endings we see\nportrayed in our readings this morning. But does this mean that God is absent\nin these situations, that God is indifferent to the anguish of those for whom\nthings do not turn out. I recall discussing the Ministry of Healing, the offering\nof prayer for the sick with a colleague in Ballymena. As we chatted, he said it\nis a messy, untidy business with lots of loose ends but he still feels compelled\nto do it. The problem of sickness, the problem of death leaves many\nunanswered, indeed unanswerable questions. From time to time, I find myself\ngoing back to a book written by a Jewish Rabbi, ‘Why do bad things happen to\ngood people?’ He wrote it as he came to terms with the death of his son\nfollowing a long degenerative illness involving the premature ageing of his\nonce healthy son. In a very moving story he comes to see God not as the agent\nof his son’s illness but one who stood by him and his family through the course\nof the illness.\nThere is a great wisdom and spiritual depth in some of the Collects of the Day,\nthese prayers often dating from the earliest days of the Church, crafted into\nEnglish by Cranmer and subsequent liturgical scholars. In a few short lines,\nthey encapsulate deep spiritual truth.\nPage 2 of 3\nPROPER 5 – Year C - 2016 – Trinity 2\nAs I thought through this whole problem of suffering, of illness and death I\nthought of the Collect of the 8th Sunday after Trinity in the old Prayer Book:\nO GOD, whose never-failing providence ordereth all things both in\nheaven and earth; We humbly beseech thee to put away from us all\nhurtful things, and to give us those things which be profitable for us;\nthrough Jesus Christ our Lord. Amen. (p 287 BCP2004)\nA God who orders all things. Do we take that to mean that God controls\neverything as a puppet master might control a puppet? A blind fate that just\ncarries on. Then one day I recall reading a commentary on the collects. The\nauthor pointed out that in the Latin in which the Collect was originally written,\nthe word that was translated as ordereth has the sense not so much of\ncontrolling everything, more that of working through everything.\nAs I reflected once more on that, my mind went back to one of the saddest\nfunerals I conducted during my time in Ahoghill, that of a young boy killed in\na freak accident. It was just coming up to the 12th July. The young lad, just off\nschool, was heading to his summer job. Late as usual he headed down the\nstreet into the village on his bike, only to find it blocked. A pipe bomb had\nbeen left outside a Roman Catholic house. He turned back and rushing out of\nthe top of the street onto the main road he was struck by a car drawing a trailer\n– there was nothing the driver could do. Many, even some close family\nmembers talked loosely of ‘It must have been God’s will – we don’t\nunderstand now but we will in time.’ – Sentiments that I found utterly\nappalling. God did not will the death of that young man – his death was caused\nby the stupid, bigoted fool who planted the pipe bomb thinking he was doing\nsomething wonderful for his twisted image of Ulster.\nAs I looked down the Church on the day of his funeral I saw the driver of the\ncar, a devout member of the local Presbyterian Church. Seated on either side\nof him were Rev Dr Harry Upritchard, his own Presbyterian Minister and on\nPage 3 of 3\nPROPER 5 – Year C - 2016 – Trinity 2\nthe other side his immediate neighbour, Fr Hugh O’Hagan, Parish Priest of\nAhoghill. Each had come to support a man in total despair at what had\nhappened. In a village that did n’t lend itself to formal ecumenical events, the\npresence of those two men in the same pew, in the days leading up to the 12th\ngave a powerful witness of Christian compassion in the face of unbearable\nsadness. It was not the will of God that that young man died – but God did\nwork in and through that situation to bring something of his light and his hope\ninto that Church that afternoon.\nGoing back to our readings; the same God who raised the son of the widow at\nZaraphath, who raised the son of the widow at Nain, works also to bring life\nand hope into our hospices, into our prisons, into situations of sickness, of\ndeath and despair. He will do that through ordinary people. That afternoon in\nAhoghill he did it through the simple presence in the one pew of two men\nseparated by wide theological differences. He will do it through the kind word\nof a hospice attendant, a neighbour dropping in to someone in hospital or\nhousebound. The God who ordereth all things, who works through all things,\neven in situations of unimaginable pain - he will do it through you and me.\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\nPrayer of Saint Francis of Assisi"
    },
    "base": "{\n  \"title\": \"Hope Amidst Tragedy\",\n  \"date\": \"2016-06-05\",\n  \"blurb\": \"Kevin reflects on the power of God in the face of death, using biblical stories of sons being raised from the dead to address the problem of suffering. He challenges the notion of God's will in tragic events, instead suggesting that God works through all situations to bring hope and light. The sermon emphasizes the role of individuals in manifesting God's presence through acts of compassion and support.\",\n  \"raw_text\": \"## PROPER 5 – Year C - 2016 – Trinity 2\\n\\nOur Old Testament and Gospel lessons set for today both speak of personal tragedy, in each case the death of the only son of an elderly widow. In the first, it is the son of the widow at Zarephath. There is a particular edge to this one as she has willingly shared what little she and her son had with Elijah. In her anguish she rails against Elijah, only to acclaim him when her son is raised from the dead. In the case of our Gospel reading, Jesus comes upon a funeral and we have the account of him raising the young man from the dead.\\n\\nWe have here powerful images of the power of God in the face of death that inspire faith. But as I read over them the thought occurred to me that things do not always work out this way, there are not always the happy endings we see portrayed in our readings this morning. But does this mean that God is absent in these situations, that God is indifferent to the anguish of those for whom things do not turn out. I recall discussing the Ministry of Healing, the offering of prayer for the sick with a colleague in Ballymena. As we chatted, he said it is a messy, untidy business with lots of loose ends but he still feels compelled to do it. The problem of sickness, the problem of death leaves many unanswered, indeed unanswerable questions. From time to time, I find myself going back to a book written by a Jewish Rabbi, 'Why do bad things happen to good people?' He wrote it as he came to terms with the death of his son following a long degenerative illness involving the premature ageing of his once healthy son. In a very moving story he comes to see God not as the agent of his son's illness but one who stood by him and his family through the course of the illness.\\n\\nThere is a great wisdom and spiritual depth in some of the Collects of the Day, these prayers often dating from the earliest days of the Church, crafted into English by Cranmer and subsequent liturgical scholars. In a few short lines, they encapsulate deep spiritual truth.\\n\\n> As I thought through this whole problem of suffering, of illness and death I thought of the Collect of the 8th Sunday after Trinity in the old Prayer Book:\\n> O GOD, whose never-failing providence ordereth all things both in heaven and earth; We humbly beseech thee to put away from us all hurtful things, and to give us those things which be profitable for us; through Jesus Christ our Lord. Amen. (p 287 BCP2004)\\n\\nA God who orders all things. Do we take that to mean that God controls everything as a puppet master might control a puppet? A blind fate that just carries on. Then one day I recall reading a commentary on the collects. The author pointed out that in the Latin in which the Collect was originally written, the word that was translated as ordereth has the sense not so much of controlling everything, more that of working through everything.\\n\\nAs I reflected once more on that, my mind went back to one of the saddest funerals I conducted during my time in Ahoghill, that of a young boy killed in a freak accident. It was just coming up to the 12th July. The young lad, just off school, was heading to his summer job. Late as usual he headed down the street into the village on his bike, only to find it blocked. A pipe bomb had been left outside a Roman Catholic house. He turned back and rushing out of the top of the street onto the main road he was struck by a car drawing a trailer – there was nothing the driver could do. Many, even some close family members talked loosely of 'It must have been God's will – we don't understand now but we will in time.' – Sentiments that I found utterly appalling. God did not will the death of that young man – his death was caused by the stupid, bigoted fool who planted the pipe bomb thinking he was doing something wonderful for his twisted image of Ulster.\\n\\nAs I looked down the Church on the day of his funeral I saw the driver of the car, a devout member of the local Presbyterian Church. Seated on either side of him were Rev Dr Harry Upritchard, his own Presbyterian Minister and on the other side his immediate neighbour, Fr Hugh O'Hagan, Parish Priest of Ahoghill. Each had come to support a man in total despair at what had happened. In a village that didn't lend itself to formal ecumenical events, the presence of those two men in the same pew, in the days leading up to the 12th gave a powerful witness of Christian compassion in the face of unbearable sadness. It was not the will of God that that young man died – but God did work in and through that situation to bring something of his light and his hope into that Church that afternoon.\\n\\nGoing back to our readings; the same God who raised the son of the widow at Zaraphath, who raised the son of the widow at Nain, works also to bring life and hope into our hospices, into our prisons, into situations of sickness, of death and despair. He will do that through ordinary people. That afternoon in Ahoghill he did it through the simple presence in the one pew of two men separated by wide theological differences. He will do it through the kind word of a hospice attendant, a neighbour dropping in to someone in hospital or housebound. The God who ordereth all things, who works through all things, even in situations of unimaginable pain - he will do it through you and me.\\n\\n> Lord, make me an instrument of your peace.\\n> Where there is hatred, let me sow love;\\n> where there is injury, pardon;\\n> where there is doubt, faith;\\n> where"
}