{
    "title": "Journey of Holiness",
    "date": "2014-10-26",
    "blurb": "This sermon explores the journey of man from his origins, as depicted in the Old Testament. It emphasizes the concept of holiness as an attribute of God and the call to holiness for mankind. The sermon also highlights the timeless nature of God's presence with his people through all stages of life and calls for justice, hope, and reconciliation in individual and community life.",
    "raw_text": "PROPER 25 – Year A – 2017 – 5th Sunday before Advent\n\nThis year, since Trinity Sunday, our Old Testament Lessons have been following the Old Testament stories of man from his very origins. On Trinity Sunday, in the Genesis account of creation, we are introduced to the idea of man as made in the image of God. From there we followed the Fall, the Flood, the call of Abram to leave his homeland and journey to a distant land and with that the promise of descendants. There then follow the stories of Isaac, of Jacob and Joseph and the captivity in Egypt. Then, more recently we have seen the emergence of Moses, the Exodus, the giving of the Law on Mount Sinai and the wandering in the desert. We will soon read of the entry into the Promised Land.\n\nIt has been a long journey in terms of distance, of time, of spiritual and theological understanding. Sometimes on a long journey it is good to stop, to look back and to take stock. This morning, instead of the Deuteronomy passage, telling of Moses looking into the Promised Land but not entering it, his death and burial in an unmarked grave, we have read from the alternative reading, from the Book Leviticus.\n\n1The LORD spoke to Moses, saying: 2Speak to all the congregation of the people of Israel and say to them: You shall be holy, for I the LORD your God am holy.\n\nHoliness is first and foremost an attribute of God. Any other holiness can only be derived from God. God calls his people into a relationship with himself. This is a thread that runs right through the story we have been reading since last Trinity Sunday.\n\nIn the Genesis account, in creation God calls man into being and endows him with a special place in the created order as he commands him:\n\nBe fruitful and multiply, and fill the earth and subdue it;\n\nThen through the turmoil of Fall and Flood God still maintains his purposes for mankind. The writer of Genesis tells us as Noah and his family came out of the Ark, God again says, as he did at Creation:\n\nGod blessed Noah and his sons, and said to them, \"Be fruitful and multiply, and fill the earth. Gen 9:1\n\nThen we hear of Abram, called to leave his homeland in Ur of the Chaldees, to leave family and all that was familiar.\n\nNow the LORD said to Abram, \"Go from your country and your kindred and your father's house to the land that I will show you. 2 I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing. Gen 12:1,2\n\n‘I will bless you …… so that you will be a blessing.’ Abram, made in the image of God, called by God, called to show something of God to a wider world. We see here an understanding of partnership; God choosing to work in and through man.\n\nWe move forward in time to Moses. In the picture of Moses’ encounter with God at the burning bush, in the loneliness of the desert night he feels a call to speak God’s word into the suffering of a people in slavery, using words that will recur at different stages in their salvation history.\n\n7 I will take you as my people, and I will be your God. You shall know that I am the LORD your God, who has freed you from the burdens of the Egyptians. Ex 6:7\n\n‘You will be my people and I will be your God.’ Words spoken at different stages on the journey. At Sinai, as in the Book Leviticus the people are given the detailed instructions of the ceremonial Law following the giving of the Commandments.\n\n12 And I will walk among you, and will be your God, and you shall be my people. 13 I am the LORD your God who brought you out of the land of Egypt, to be their slaves no more. Lev 26:12\n\nAs the people languish in Exile in Babylon, Ezekiel declares:\n\n28 Then you shall live in the land that I gave to your ancestors; and you shall be my people, and I will be your God. Ezek 36:28\n\nAt different stages on the journey, in times of suffering, on the journey through the desert, in the wake of failure that threw them into Exile, they hear again and again; ‘You shall be my people, and I will be your God.’ God, even in judgement, with his people every step of the road, God calling them into relationship, called to be the People of God.\n\nThere is something timeless about God journeying with his people. The risen Jesus, at the point of his Ascension, declares, ‘And remember, I am with you always, to the end of the age’. God with us, every step of the journey of life.\n\nwith a parent worrying over a child\n\nwith someone as they worry over future employment, security of home\n\nwith someone in remorse over mistakes that have hurt not just themselves but one they love\n\nwith anyone sitting at the bedside of a loved one.\n\nI am with you at all times and in all places.\n\nAt all times, in all places, God calls us to himself, calls us to holiness, to be different. A people who have known slavery, injustice, hopelessness; a people who have known what it is to be redeemed are to model justice, hope, reconciliation in their individual and community life.\n\nThat was their calling, that is our calling – in our homes, our schools, our communities and places of work. The words of the Prophet Micah are as true today as ever they were:\n\nHe has told you, O mortal, what is good;\n\nand what does the LORD require of you\n\nbut to do justice, and to love kindness,\n\nand to walk humbly with your God? Mic 6:8",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper252014.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 25 – Year A – 2017 – 5th Sunday before Advent\nThis year, since Trinity Sunday, our Old Testament Lessons have been\nfollowing the Old Testament stories of man from his very origins. On Trinity\nSunday, in the Genesis account of creation, we are introduced to the idea of\nman as made in the image of God. From there we followed the Fall, the Flood,\nthe call of Abram to leave his homeland and journey to a distant land and with\nthat the promise of descendants. There then follow the stories of Isaac, of Jacob\nand Joseph and the captivity in Egypt. Then, more recently we have seen the\nemergence of Moses, the Exodus, the giving of the Law on Mount Sinai and\nthe wandering in the desert. We will soon read of the entry into the Promised\nLand.\nIt has been a long journey in terms of distance, of time, of spiritual and\ntheological understanding. Sometimes on a long journey it is good to stop, to\nlook back and to take stock. This morning, instead of the Deuteronomy\npassage, telling of Moses looking into the Promised Land but not entering it,\nhis death and burial in an unmarked grave, we have read from the alternative\nreading, from the Book Leviticus.\n1The LORD spoke to Moses, saying: 2Speak to all the congregation of\nthe people of Israel and say to them: You shall be holy, for I the LORD\nyour God am holy.\nHoliness is first and foremost an attribute of God. Any other holiness can only\nbe derived from God. God calls his people into a relationship with himself.\nThis is a thread that runs right through the story we have been reading since\nlast Trinity Sunday.\nIn the Genesis account, in creation God calls man into being and endows him\nwith a special place in the created order as he commands him:\nBe fruitful and multiply, and fill the earth and subdue it;\nPage 2 of 4\nPROPER 25 – Year A – 2017 – 5th Sunday before Advent\nThen through the turmoil of Fall and Flood God still maintains his purposes for\nmankind. The writer of Genesis tells us as Noah and his family came out of\nthe Ark, God again says, as he did at Creation:\nGod blessed Noah and his sons, and said to them, \"Be fruitful and\nmultiply, and fill the earth. Gen 9:1\nThen we hear of Abram, called to leave his homeland in Ur of the Chaldees, to\nleave family and all that was familiar.\nNow the LORD said to Abram, \"Go from your country and your\nkindred and your father's house to the land that I will show you. 2 I\nwill make of you a great nation, and I will bless you, and make your\nname great, so that you will be a blessing. Gen 12:1,2\n‘I will bless you …… so that you will be a blessing.’ Abram, made in the\nimage of God, called by God, called to show something of God to a wider\nworld. We see here an understanding of partnership; God choosing to work in\nand through man.\nWe move forward in time to Moses. In the picture of Moses’ encounter with\nGod at the burning bush, in the loneliness of the desert night he feels a call to\nspeak God’s word into the suffering of a people in slavery, using words that\nwill recur at different stages in their salvation history.\n7 I will take you as my people, and I will be your God. You shall know\nthat I am the LORD your God, who has freed you from the burdens of\nthe Egyptians. Ex 6:7\n‘You will be my people and I will be your God.’ Words spoken at different\nstages on the journey. At Sinai, as in the Book Leviticus the people are given\nthe detailed instructions of the ceremonial Law following the giving of the\nCommandments.\n12 And I will walk among you, and will be your God, and you shall be\nmy people. 13 I am the LORD your God who brought you out of the\nland of Egypt, to be their slaves no more. Lev 26:12\nPage 3 of 4\nPROPER 25 – Year A – 2017 – 5th Sunday before Advent\nAs the people languish in Exile in Babylon, Ezekiel declares:\n28 Then you shall live in the land that I gave to your ancestors; and you\nshall be my people, and I will be your God. Ezek 36:28\nAt different stages on the journey, in times of suffering, on the journey through\nthe desert, in the wake of failure that threw them into Exile, they hear again\nand again; ‘You shall be my people, and I will be your God.’ God, even in\njudgement, with his people every step of the road, God calling them into\nrelationship, called to be the People of God.\nThere is something timeless about God journeying with his people. The risen\nJesus, at the point of his Ascension, declares, ‘And remember, I am with you\nalways, to the end of the age’. God with us, every step of the journey of life.\nwith a parent worrying over a child\nwith someone as they worry over future employment, security of home\nwith someone in remorse over mistakes that have hurt not just themselves\nbut one they love\nwith anyone sitting at the bedside of a loved one.\nI am with you at all times and in all places.\nAt all times, in all places, God calls us to himself, calls us to holiness, to be\ndifferent. A people who have known slavery, injustice, hopelessness; a people\nwho have known what it is to be redeemed are to model justice, hope,\nreconciliation in their individual and community life.\nThat was their calling, that is our calling – in our homes, our schools, our\ncommunities and places of work. The words of the Prophet Micah are as true\ntoday as ever they were:\nHe has told you, O mortal, what is good;\nPage 4 of 4\nPROPER 25 – Year A – 2017 – 5th Sunday before Advent\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God? Mic 6:8"
    }
}