{
    "title": "Hope in Times of Uncertainty",
    "date": "2010-09-26",
    "blurb": "Kevin draws parallels between the financial struggles of the Irish Government and the biblical story of Jeremiah's land purchase during Jerusalem's siege. He emphasizes the importance of hope and confidence in the future, as exemplified by the baptism of a child in the congregation. The sermon underlines the need to invest in the future through education and health, and to instill values that will shape the next generation.",
    "raw_text": "PROPER 21 – 2010 – year C – Trinity 17\n\nThis week much of the news coverage was taken up with the lengths the Irish Government was having to go to raise 1.5 billion euro on the bond markets. We were all suddenly becoming experts in the differential in the rates paid by the German Government and the rate the Irish Government was going to have to pay. This was attributed to uncertainties regarding how much more we were going to have to spend on Anglo Irish Bank as well as the view that may be being taken on the stability of the Government overseas.\n\nIn the event the necessary funds were raised, albeit at the higher interest rates. To buy those bonds represents a belief that the money will be repaid, that the interest payments will be met. It represents a belief that there is a future for this country, that this country will emerge from its present troubles.\n\nIn our Old Testament Lesson Jeremiah is conducting what on the surface would be a fairly routine transaction. His cousin Hanamel has come to him in his prison cell with a proposition:\n\n> 'Buy my field that is at Anathoth in the land of Benjamin, for the right of possession and redemption is yours; buy it for yourself.' Jer 32:8\n\nWhat would in other circumstances be a routine transaction is taking place in very difficult circumstances. Jerusalem is under siege and anyone with property is trying to off load it, convert it into cash to enable them to make a new start in whatever place they end up in. Jeremiah’s actions were a statement of confidence, indeed reckless confidence that there was a future for the city of Jerusalem, as he will declare before witnesses in his prison cell:\n\n> Thus says the LORD of hosts, the God of Israel: Take these deeds, both this sealed deed of purchase and this open deed, and put them in an earthenware jar, in order that they may last for a long time. For thus says the LORD of hosts, the God of Israel: Houses and fields and vineyards shall again be bought in this land. Jer 32:14-15\n\nThis morning, in the context of the 11:00 service we are welcoming a child into the fellowship of the Christian Church in Baptism. To bring a child into the world is a great responsibility but also a sign of great hope. In this child there is a life destined to live long after most of us here.\n\nWho knows what lies ahead? Her Mum and Dad, her grandparents will have dreams, hopes, plans, fears, anxieties but here is life and life is future. So this young child is a living sign of the continuation of the Watson and Joyce families. She will be drawn into the history of this family and will become part of the story of this family to be recounted in years to come. We hold up this child and her family in our service today.\n\nThis young life is also a sign of continuity of a wider community. Communities need their young among them. One of the most serious effects of the First World War upon many village communities in England was that in the carnage of the trenches a whole generation of young men were lost; they never came back to follow in the footsteps of their fathers. Something similar is being experienced in East Africa as a result of the AIDS epidemic – a whole generation of young children being reared by grandparents as their parents fall victim to AIDS.\n\nAs they are a sign of our future, so we must ensure their future in building a society in which they can develop to their full potential. So even in these straightened times, education and health must remain as one of the key priorities in the allocation of funding. Not just that, we must also be aware that the values they adopt will be very much influenced by the values of those they see around them, the values that you and I maintain in our private life, in the whole field of relationships, in business, in politics, in the importance we place on community, both here in Church and in the world outside. We hold up this child and the community in our service today.\n\nIsla’s Baptism this morning is a sign of continuity of the community that is this Parish. Baptism is a sacrament of membership, a sacrament of inclusion, a sacrament of continuity as on each occasion new individuals are added to the membership of the Church of Christ. In the course of the service we will express our support to Isla’s parents and godparents. After the baptism we will express our welcome to this child. And so in Baptism we express our commitment to Christ and to one another. This child is a member of the Church not at some point in the distant future but now. She has a place in the life of the Church now, she is part of the Body of Christ.\n\nAn ongoing question for any Christian community is how we model inclusion in the life and witness of the Church. We are the Body of Christ. We who gather here Sunday by Sunday are a varied group – looking around us we see differences in age, in temperament and personality, in preferences in worship styles. But just as the body needs its varied parts so we need each other, we honour one another, at times deferring to one another.\n\nJeremiah, in an act of reckless confidence bought his cousin’s field as Jerusalem stood on the brink of destruction. It was a sign that God had a continuing purpose for that city, that Jerusalem had a future. As we baptise this child this morning we are reminded that there is a future for this family that goes beyond us; there is a future for our society and there is a future for God’s Church. It is up to us to ensure that she is able to take her place in her family, in our society and in the Church and so be enabled to make her own unique contribution.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper212010.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 21 – 2010 – year C – Trinity 17\nThis week much of the news coverage was taken up with the lengths the Irish Government\nwas having to go to raise 1.5 billion euro on the bond markets. We were all suddenly\nbecoming experts in the differential in the rates paid by the German Government and the\nrate the Irish Government was going to have to pay. This was attributed to uncertainties\nregarding how much more we were going to have to spend on Anglo Irish Bank as well as\nthe view that may be being taken on the stability of the Government overseas.\nIn the event the necessary funds were raised, albeit at the higher interest rates. To buy\nthose bonds represents a belief that the money will be repaid, that the interest payments\nwill be met. It represents a belief that there is a future for this country, that this country\nwill emerge from its present troubles.\nIn our Old Testament Lesson Jeremiah is conducting what on the surface would be a fairly\nroutine transaction. His cousin Hanamel has come to him in his prison cell with a\nproposition:\n‘Buy my field that is at Anathoth in the land of Benjamin, for\nthe right of possession and redemption is yours; buy it for\nyourself.’ Jer 32:8\nWhat would in other circumstances be a routine transaction is taking place in very difficult\ncircumstances. Jerusalem is under siege and anyone with property is trying to off load it,\nconvert it into cash to enable them to make a new start in whatever place they end up in.\nJeremiah’s actions were a statement of confidence, indeed reckless confidence that there\nwas a future for the city of Jerusalem, as he will declare before witnesses in his prison cell:\n14Thus says the LORD of hosts, the God of Israel: Take these\ndeeds, both this sealed deed of purchase and this open deed, and\nput them in an earthenware jar, in order that they may last for a\nlong time. 15For thus says the LORD of hosts, the God of Israel:\nHouses and fields and vineyards shall again be bought in this\nland. Jer 32:14-15\nPage 2 of 3\nPROPER 21 – 2010 – year C – Trinity 17\nThis morning, in the context of the 11:00 service we are welcoming a child into the\nfellowship of the Christian Church in Baptism. To bring a child into the world is a great\nresponsibility but also a sign of great hope. In this child there is a life destined to live long\nafter most of us here.\nWho knows what lies ahead? Her Mum and Dad, her grandparents will have dreams,\nhopes, plans, fears, anxieties but here is life and life is future. So this young child is a\nliving sign of the continuation of the Watson and Joyce families. She will be drawn into\nthe history of this family and will become part of the story of this family to be recounted in\nyears to come. We hold up this child and her family in our service today.\nThis young life is also a sign of continuity of a wider community. Communities need their\nyoung among them. One of the most serious effects of the First World War upon many\nvillage communities in England was that in the carnage of the trenches a whole generation\nof young men were lost; they never came back to follow in the footsteps of their fathers.\nSomething similar is being experienced in East Africa as a result of the AIDS epidemic – a\nwhole generation of young children being reared by grandparents as their parents fall\nvictim to AIDS.\nAs they are a sign of our future, so we must ensure their future in building a society in\nwhich they can develop to their full potential. So even in these straightened times,\neducation and health must remain as one of the key priorities in the allocation of funding.\nNot just that, we must also be aware that the values they adopt will be very much\ninfluenced by the values of those they see around them, the values that you and I maintain\nin our private life, in the whole field of relationships, in business, in politics, in the\nimportance we place on community, both here in Church and in the world outside. We\nhold up this child and the community in our service today.\nPage 3 of 3\nPROPER 21 – 2010 – year C – Trinity 17\nIsla’s Baptism this morning is a sign of continuity of the community that is this Parish.\nBaptism is a sacrament of membership, a sacrament of inclusion, a sacrament of continuity\nas on each occasion new individuals are added to the membership of the Church of Christ.\nIn the course of the service we will express our support to Isla’s parents and godparents.\nAfter the baptism we will express our welcome to this child. And so in Baptism we\nexpress our commitment to Christ and to one another. This child is a member of the\nChurch not at some point in the distant future but now. She has a place in the life of the\nChurch now, she is part of the Body of Christ.\nAn ongoing question for any Christian community is how we model inclusion in the life\nand witness of the Church. We are the Body of Christ. We who gather here Sunday by\nSunday are a varied group – looking around us we see differences in age, in temperament\nand personality, in preferences in worship styles. But just as the body needs its varied\nparts so we need each other, we honour one another, at times deferring to one another.\nJeremiah, in an act of reckless confidence bought his cousin’s field as Jerusalem stood on\nthe brink of destruction. It was a sign that God had a continuing purpose for that city, that\nJerusalem had a future. As we baptise this child this morning we are reminded that there\nis a future for this family that goes beyond us; there is a future for our society and there is\na future for God’s Church. It is up to us to ensure that she is able to take her place in her\nfamily, in our society and in the Church and so be enabled to make her own unique\ncontribution."
    }
}