{
    "title": "The Heart of Forgiveness",
    "date": "2020-09-13",
    "blurb": "Kevin's sermon on Proper 19, Year A, reflects on the complexities of forgiveness, using examples from Northern Ireland's reconciliation efforts and the biblical story of the Unmerciful Servant. He emphasizes that forgiveness is not about keeping score but a matter of the heart, requiring inner healing and a recognition of our own forgiven status through Jesus.",
    "raw_text": "## PROPER 19 – Year A - 2020 – Trinity 14\n\nA number of years ago, I was at a clergy day retreat that was lead by the then leader of the Corrymeela Community, the late Rev Dr John Morrow. He was talking about reconciliation in Northern Ireland that was still in the grip of the troubles. He remarked that we can be too glib at times about reconciliation, about forgiveness – as if it is something that just flows automatically out of a Christian life.\n\nHe spoke of the amazing witness of the late Gordon Wilson on the death of his daughter Marie in the Remembrance Day bomb planted by the IRA at the War Memorial in Enniskillen in 1987. There is no doubt that his declaration of his intention to pray for those who had planted the bomb that day forestalled Loyalist retaliation. His words that day saved lives.\n\nJohn Morrow went on to remind us that there were other people killed that day; other people left mourning the death of loved ones. Not all of them were able to make that same response. For them the pain of their loss was heightened by the fact that they could not – some felt guilty, some felt anger that people expected this.\n\nTo go to our Gospel reading, the question Peter asks of Jesus, which is a kind of follow on from our reading last week.\n\n> 'Lord, if another member of the church sins against me, how often should I forgive? As many as seven times?' 22Jesus said to him, 'Not seven times, but, I tell you, seventy-seven times.' Matt 18;21,22\n\nPassages like that can be hard to hear read out in Church sometimes. Particularly if the hearer has been hurt by someone they trusted, maybe a friend or partner, maybe a business colleague. That person can be left confused and angry. Then to be told one must forgive, one must let go of the pain, does not itself bring about change – it sometimes just adds guilt on to all the other emotions.\n\nSo how are people to navigate through all this in the light of our reading today? Peter, in his question, is trying to do what we all do. He is trying to get a handle on what is involved in this matter of forgiveness. What is Jesus asking of him, what is Jesus asking of us? Peter’s suggestion of seven times went beyond what was required of people under the Law. When Jesus says seventy seven times, his is not talking about another, higher target. What he is saying is that forgiveness can never be understood in terms of numbers, of targets; it is something that goes beyond calculation.\n\nThat is the point of the Parable of the Unmerciful Servant that Jesus goes on to tell. It is a well known story of two servants. The first owed his master a debt beyond all hope of payment. In the face of the inevitable retribution, slavery for him and his household, he pleads for mercy and his whole debt is written off. The same man, on encountering a fellow servant who owed him but a fraction of the debt he had owed his master, insists the whole rigour of the law is applied in order to retrieve the debt.\n\nThe master, on hearing of this, reinstates the original penalty. Jesus concludes the parable:\n\n> 'So my heavenly Father will also do to every one of you, if you do not forgive your brother or sister from your heart.' Matt 18:35\n\nForgive from your heart. Therein lies the key.\n\nThe first servant’s heart was not changed. Deep down he did not see himself as one who had been forgiven. He knew he was excused but he did not see himself as forgiven. Forgiveness is not, cannot be, a matter of calculation.\n\nI recall when the war time Japanese Emperor Hirohito paid a State visit to Britain. A number of men who had been held as prisoners of war by the Japanese during the war held a protest outside Buckingham Palace. The Duke of Edinburgh, who had just met the Emperor, was asked, 'Should they not forgive, put the past behind them?' The Duke replied, 'It is not for me to tell another person that they must forgive.'\n\nForgiveness is a matter fundamentally of the heart. We know we should; we pray in the Lord’s prayer; 'Forgive us our sins as we forgive those who sin against us.' Which of us has not known the pain, the inner turmoil involved in that?\n\nIt is a matter of the heart; and hearts are sometimes broken by hurt, by betrayal of trust and with that comes confusion, anger. So forgiveness begins with healing, an inner healing. For this hurts need to be expressed, need to be heard. This was the rationale behind the Commission for Truth and Reconciliation, the brainchild of Archbishop Desmond Tutu, set up in South Africa at the end of the era of Apartheid, in which both perpetrators and victims listened to each other.\n\nBeing a matter of the heart, I must also acknowledge that I am one forgiven in and through the life, death and resurrection of Jesus. Forgiveness is nothing less than a work of healing, a work of the Spirit.\n\nMay God work in us and through us to bring healing into relationships, into communities, into the Church.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper1920.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 19 – Year A - 2020 – Trinity 14\nA number of years ago, I was at a clergy day retreat that was lead by the then\nleader of the Corrymeela Community, the late Rev Dr John Morrow. He was\ntalking about reconciliation in Northern Ireland that was still in the grip of the\ntroubles. He remarked that we can be too glib at times about reconciliation,\nabout forgiveness – as if it is something that just flows automatically out of a\nChristian life.\nHe spoke of the amazing witness of the late Gordon Wilson on the death of his\ndaughter Marie in the Remembrance Day bomb planted by the IRA at the War\nMemorial in Enniskillen in 1987. There is no doubt that his declaration of his\nintention to pray for those who had planted the bomb that day forestalled\nLoyalist retaliation. His words that day saved lives.\nJohn Morrow went on to remind us that there were other people killed that day;\nother people left mourning the death of loved ones. Not all of them were able\nto make that same response. For them the pain of their loss was heightened by\nthe fact that they could not – some felt guilty, some felt anger that people\nexpected this.\nTo go to our Gospel reading, the question Peter asks of Jesus, which is a kind\nof follow on from our reading last week.\n‘Lord, if another member of the church sins against me, how often\nshould I forgive? As many as seven times?’ 22Jesus said to him, ‘Not\nseven times, but, I tell you, seventy-seven times. Matt 18;21,22\nPassages like that can be hard to hear read out in Church sometimes.\nParticularly if the hearer has been hurt by someone they trusted, maybe a friend\nPage 2 of 4\nPROPER 19 – Year A - 2020 – Trinity 14\nor partner, maybe a business colleague. That person can be left confused and\nangry. Then to be told one must forgive, one must let go of the pain, does not\nitself bring about change – it sometimes just adds guilt on to all the other\nemotions.\nSo how are people to navigate through all this in the light of our reading today?\nPeter, in his question,\n‘Lord, if another member of the church sins against me, how often\nshould I forgive? As many as seven times?’\nis trying to do what we all do. He is trying to get a handle on what is involved\nin this matter of forgiveness. What is Jesus asking of him, what is Jesus asking\nof us? Peter’s suggestion of seven times went beyond what was required of\npeople under the Law. When Jesus says seventy seven times, his is not talking\nabout another, higher target. What he is saying is that forgiveness can never be\nunderstood in terms of numbers, of targets; it is something that goes beyond\ncalculation.\nThat is the point of the Parable of the Unmerciful Servant that Jesus goes on to\ntell. It is a well known story of two servants. The first owed his master a debt\nbeyond all hope of payment. In the face of the inevitable retribution, slavery\nfor him and his household, he pleads for mercy and his whole debt is written\noff. The same man, on encountering a fellow servant who owed him but a\nfraction of the debt he had owed his master, insists the whole rigour of the law\nis applied in order to retrieve the debt.\nPage 3 of 4\nPROPER 19 – Year A - 2020 – Trinity 14\nThe master, on hearing of this, reinstates the original penalty. Jesus concludes\nthe parable:\n35So my heavenly Father will also do to every one of you, if you do\nnot forgive your brother or sister from your heart. Matt 18:35\nForgive from your heart. Therein lies the key.\nThe first servant’s heart was not changed. Deep down he did not see himself as\none who had been forgiven. He knew he was excused but he did not see\nhimself as forgiven. Forgiveness is not, cannot be, a matter of calculation.\nI recall when the war time Japanese Emperor Hirohito paid a State visit to\nBritain. A number of men who had been held as prisoners of war by the\nJapanese during the war held a protest outside Buckingham Palace. The Duke\nof Edinburgh, who had just met the Emperor, was asked, ‘Should they not\nforgive, put the past behind them?’ The Duke replied, ‘It is not for me to tell\nanother person that they must forgive.’\nForgiveness is a matter fundamentally of the heart. We know we should; we\npray in the Lord’s prayer; ‘Forgive us our sins as we forgive those who sin\nagainst us.’ Which of us has not known the pain, the inner turmoil involved in\nthat?\nIt is a matter of the heart; and hearts are sometimes broken by hurt, by betrayal\nof trust and with that comes confusion, anger. So forgiveness begins with\nhealing, an inner healing. For this hurts need to be expressed, need to be heard.\nThis was the rationale behind the Commission for Truth and Reconciliation,\nthe brainchild of Archbishop Desmond Tutu, set up in South Africa at the end\nPage 4 of 4\nPROPER 19 – Year A - 2020 – Trinity 14\nof the era of Apartheid, in which both perpetrators and victims listened to each\nother.\nBeing a matter of the heart, I must also acknowledge that I am one forgiven in\nand through the life, death and resurrection of Jesus. Forgiveness is nothing\nless than a work of healing, a work of the Spirit.\nMay God work in us and through us to bring healing into relationships, into\ncommunities, into the Church."
    }
}