{
    "title": "Uncharted Territory",
    "date": "2016-11-13",
    "blurb": "This sermon, delivered on the 2nd Sunday before Advent in 2016, reflects on the election of Donald Trump and the uncertainties that come with it. It draws parallels with other historical events and emphasizes the importance of faith and hope in times of change and uncertainty. The sermon also highlights the significance of Remembrance Sunday and the enduring power of God's purposes.",
    "raw_text": "PROPER 28 – Year C – 2016 – 2nd Sunday before Advent.\n\nLast Wednesday morning, along with many others, I watched Donald Trump, as President elect of the United States, make his acceptance speech to supporters after Hilary Clinton had phoned him to offer her congratulations. It was something of a surreal moment. There were of course swift reactions. There was a very understandable jubilation among his supporters. International leaders sent messages of congratulation with varying degrees of enthusiasm. The stock markets had a period of panic but later recovered. Others in the United States were appalled and marched in protest to express their dismay.\n\nWe are certainly moving into uncharted territory. People are unsure about the new President’s attitude to global trade, to climate change, towards Russia. Comments made during the campaign concerning minority groups, racial stereotyping have raised concern in many quarters. We are left asking was this just campaign rhetoric or are we seeing the basis of future policy?\n\nLater that day, talking to staff in the White House, President Obama spoke characteristic words of wisdom as he spoke of democracy, that in a democracy people will still campaign for what they believe in, with that comes disappointment when people lose an election. He reminded them of the importance of the peaceful transfer of power from one administration to another. Then he said ‘Remember the sun will still come up tomorrow.’ Life still goes on and we continue to meet the challenges of life.\n\nAs I thought of all this, I reflected on the context of other events that are being remembered at this time. Today is Remembrance Sunday, as we recall the end of the First World War, the dead in both World Wars and subsequent conflicts. In the carnage of the trenches, in the unimaginable horror of Auschwitz and other camps, men, women and children endured utter darkness, signs of light and hope shone through.\n\nWhile we are rightly concerned about events in the United States, we are not facing fascist dictatorship, we are not watching the wholesale slaughter of a whole people. As President Obama reminded his staff, ‘The sun will come up tomorrow’. Political life, political argument will go on. The events we remember on Remembrance Day remind us of the cost of our freedoms, the importance of building a society with standards and values worthy of those who gave their all.\n\nA month ago we were celebrating the 200th anniversary of the first church on this site and the 150th anniversary of the consecration of this church. As the Archbishop of Armagh reminded us, this Church was built in a time of uncertainty for the Church of Ireland. The preparations for the Disestablishment of the Church of Ireland were under way. In the Archbishop’s house in Dublin there is a table that came out of the house of William Gladstone. It now bears the inscription ‘Around this table Gladstone and his associates plotted the destruction of the Ancient and Apostolic Church of Ireland.’ Contrary to the fears of many, the Disestablishment of our Church and with it the loss of wealth, of status, of privilege, did not result in the destruction of our Church, rather the renewal of our Church. As President Obama might have reminded our people at that time, ‘The sun will come up tomorrow.’\n\nOr is all this just wishful thinking – ‘Sure won’t it all work out in the end?’ It is as this point that I just turn to the provisions made in our lectionary and Prayer Book for this 2nd Sunday before Advent. In the portion we used instead of our Psalm this morning, the canticle Song of Isaiah, we have a passage written at a very troubling time in the history of the Kingdom of Judah as it entered that chaotic period that ended up with Jerusalem being overrun, the Temple destroyed, the leaders being lead off into exile in Babylon. In the midst of all this, the Prophet declares. ‘Surely God is my salvation, I will trust and not be afraid.’ Even in the midst of judgement, the prophets still speak of God’s continuing care, God’s continuing purposes for his people.\n\nOur post communion prayer this morning is short and to the point.\n\n> Gracious Lord,\n> in this holy sacrament you give substance to our hope.\n\nWhat is that substance? As we break the bread and drink the cup we remember the death and resurrection of our Lord Jesus Christ. In a seemingly pointless and cruel death, in a forgotten corner of the Roman Empire, something crucial happened that has impacted on the life of this earth ever since, that has inspired men and women, that has transformed societies. It has been dismissed as irrelevant, his followers have been mocked, abused, persecuted.\n\nHymns, poetry have a way of encapsulating deep and profound truth. There is a hymn in our book, hymn 669, that I confess is not among my favourites, but the refrain always speaks to me.\n\n> Because He lives, I can face tomorrow.\n> Because He lives, All fear is gone.\n> Because I know He holds the future,\n> And life is worth the living just because He lives.\n\nThings may happen that may make us doubt, that may drive us to despair. Things go wrong, communities, societies make mistakes; people, innocent people suffer. The events we recall in Remembrance, in the Disestablishment of our Church remind me of the importance of keeping faith with our convictions, with our commitment to justice, to peace, to reconciliation. The figure of the broken and battered, risen and glorified Jesus serves as a constant inspiration and reminder of God’s abiding purposes for us and for all men.\n\nIn place of Barak Obama’s reminder, ‘The sun will still come up in the morning’, in union with all who have gone before us in the faith, we proclaim in the words of the 3rd Eucharistic Prayer :\n\n> dying, you destroyed our death,\n> rising, your restored our life;\n> Lord Jesus, come in glory.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/proper282016.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 28 – Year C – 2016 – 2nd Sunday before Advent.\nLast Wednesday morning, along with many others, I watched Donald Trump,\nas President elect of the United States, make his acceptance speech to\nsupporters after Hilary Clinton had phoned him to offer her congratulations.\nIt was something of a surreal moment. There were of course swift reactions.\nThere was a very understandable jubilation among his supporters.\nInternational leaders sent messages of congratulation with varying degrees of\nenthusiasm. The stock markets had a period of panic but later recovered.\nOthers in the United States were appalled and marched in protest to express\ntheir dismay.\nWe are certainly moving into uncharted territory. People are unsure about the\nnew President’s attitude to global trade, to climate change, towards Russia.\nComments made during the campaign concerning minority groups, racial\nstereotyping have raised concern in many quarters. We are left asking was this\njust campaign rhetoric or are we seeing the basis of future policy?\nLater that day, talking to staff in the White House, President Obama spoke\ncharacteristic words of wisdom as he spoke of democracy, that in a democracy\npeople will still campaign for what they believe in, with that comes\ndisappointment when people lose an election. He reminded them of the\nimportance of the peaceful transfer of power from one administration to\nanother. Then he said ‘Remember the sun will still come up tomorrow.’ Life\nstill goes on and we continue to meet the challenges of life.\nPage 2 of 4\nPROPER 28 – Year C – 2016 – 2nd Sunday before Advent.\nAs I thought of all this, I reflected on the context of other events that are being\nremembered at this time. Today is Remembrance Sunday, as we recall the end\nof the First World War, the dead in both World Wars and subsequent conflicts.\nIn the carnage of the trenches, in the unimaginable horror of Auschwitz and\nother camps, men, women and children endured utter darkness, signs of light\nand hope shone through.\nWhile we are rightly concerned about events in the United States, we are not\nfacing fascist dictatorship, we are not watching the wholesale slaughter of a\nwhole people. As President Obama reminded his staff, ‘The sun will come up\ntomorrow’. Political life, political argument will go on. The events we\nremember on Remembrance Day remind us of the cost of our freedoms, the\nimportance of building a society with standards and values worthy of those\nwho gave their all.\nA month ago we were celebrating the 200th anniversary of the first church on\nthis site and the 150th anniversary of the consecration of this church. As the\nArchbishop of Armagh reminded us, this Church was built in a time of\nuncertainty for the Church of Ireland. The preparations for the\nDisestablishment of the Church of Ireland were under way. In the\nArchbishop’s house in Dublin there is a table that came out of the house of\nWilliam Gladstone. It now bears the inscription ‘Around this table Gladstone\nand his associates plotted the destruction of the Ancient and Apostolic Church\nof Ireland.’ Contrary to the fears of many, the Disestablishment of our Church\nand with it the loss of wealth, of status, of privilege, did not result in the\ndestruction of our Church, rather the renewal of our Church. As President\nPage 3 of 4\nPROPER 28 – Year C – 2016 – 2nd Sunday before Advent.\nObama might have reminded our people at that time, ‘The sun will come up\ntomorrow.’\nOr is all this just wishful thinking – ‘Sure won’t it all work out in the end?’ It\nis as this point that I just turn to the provisions made in our lectionary and\nPrayer Book for this 2nd Sunday before Advent. In the portion we used instead\nof our Psalm this morning, the canticle Song of Isaiah, we have a passage\nwritten at a very troubling time in the history of the Kingdom of Judah as it\nentered that chaotic period that ended up with Jerusalem being overrun, the\nTemple destroyed, the leaders being lead off into exile in Babylon. In the\nmidst of all this, the Prophet declares. ‘Surely God is my salvation, I will trust\nand not be afraid.’ Even in the midst of judgement, the prophets still speak of\nGod’s continuing care, God’s continuing purposes for his people.\nOur post communion prayer this morning is short and to the point.\nGracious Lord,\nin this holy sacrament you give substance to our hope.\nWhat is that substance? As we break the bread and drink the cup we remember\nthe death and resurrection of our Lord Jesus Christ. In a seemingly pointless\nand cruel death, in a forgotten corner of the Roman Empire, something crucial\nhappened that has impacted on the life of this earth ever since, that has inspired\nmen and women, that has transformed societies. It has been dismissed as\nirrelevant, his followers have been mocked, abused, persecuted.\nPage 4 of 4\nPROPER 28 – Year C – 2016 – 2nd Sunday before Advent.\nHymns, poetry have a way of encapsulating deep and profound truth. There is\na hymn in our book, hymn 669, that I confess is not among my favourites, but\nthe refrain always speaks to me.\nBecause He lives, I can face tomorrow.\nBecause He lives, All fear is gone.\nBecause I know He holds the future,\nAnd life is worth the living just because He lives.\nThings may happen that may make us doubt, that may drive us to despair.\nThings go wrong, communities, societies make mistakes; people, innocent\npeople suffer. The events we recall in Remembrance, in the Disestablishment\nof our Church remind me of the importance of keeping faith with our\nconvictions, with our commitment to justice, to peace, to reconciliation. The\nfigure of the broken and battered, risen and glorified Jesus serves as a constant\ninspiration and reminder of God’s abiding purposes for us and for all men.\nIn place of Barak Obama’s reminder, ‘The sun will still come up in the\nmorning’, in union with all who have gone before us in the faith, we proclaim\nin the words of the 3rd Eucharistic Prayer :\ndying, you destroyed our death,\nrising, your restored our life;\nLord Jesus, come in glory."
    }
}