{
    "title": "The Potter's Lesson",
    "date": "2013-09-08",
    "blurb": "In this sermon, Kevin draws parallels between a potter's work and God's relationship with us. He emphasizes that God, like a patient potter, shapes us into useful and beautiful beings, never giving up on us even when we go off course. He also highlights the importance of full commitment in our service to God, likening it to a man building a tower or a king planning a battle.",
    "raw_text": "Our Old Testament lesson comes from a very troubled time in the history of Jerusalem – it comes not long before the city is attacked by the Babylonians and the people are taken off into slavery. One day Jeremiah senses he has to go down to a potter’s workshop. This is where the mugs, the plates, the bowls that people used in their homes would have been made. This is probably very close to what he would have seen. [Show video of potter’s wheel](http://youtu.be/P8styuac15I)\n\nVery skilled – the potter, gently but very firmly forms the clay into the pot. Nothing rushed – any sudden movement and the pot would wobble all over the place and he would have to start all over again. Jeremiah saw that as an image, a picture of the way God works with us. Until I watched this film I used to think of the illustration of the potter as quite a violent image – I now see a more patient picture of God. We start up with an ugly lump of clay – we end up with something useful, something beautiful. If you look at the story of the people of Israel, there are disasters, there are setbacks, but God never gives up on them and he will never give up on you. As I watch that video I see. God working with us, making us into the sort of people he wants us to be. Something goes wrong, we go off course – he’ll start again with us. That is what confession and forgiveness is all about – God making new starts, new beginnings.\n\nGospel reading – Jesus tells story of a man building a tower, a king planning to go into battle. There is no room for half measures or the tower will only end up half built, the king will end up defeated. Jesus goes on to tell us that there is no room for half measures in our service of him. He is following a path that will lead to the cross – there will be nothing held back. What he asks of us is that we will give of our best in following him; That we are going to be prepared to forgive people who are annoying us; that we are going to be prepared to say sorry when we have done wrong; that we are going to be loving and caring of other people. In other words we are going to let him make us into the sort of people he wants us to be.\n\nWhen ever I baptise someone, as we make the sign of the cross on the baby’s head, we say this:\n\n> Christ claims you for his own.\n> Receive the sign of the cross.\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n\nLet us do that this week, let Jesus make us into the sort of people he wants us to be, let’s finish the race, let’s keep the faith.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper182013famserv.txt",
        "raw_ocr_content": "Page 1 of 2\nPROPER 18 – 2013 – year C – Trinity 15\nFamily Service\nOur Old Testament lesson comes from a very troubled time in the history of\nJerusalem – it comes not long before the city is attacked by the Babylonians\nand the people are taken off into slavery.\nOne day Jeremiah senses he has to go down to a potter’s workshop. This is\nwhere the mugs, the plates, the bowls that people used in their homes would\nhave been made.\nThis is probably very close to what he would have seen. (Show video of\npotter’s wheel)\nhttp://youtu.be/P8styuac15I\nVery skilled – the potter, gently but very firmly forms the clay into the pot.\nNothing rushed – any sudden movement and the pot would wobble all over the\nplace and he would have to start all over again.\nJeremiah saw that as an image, a picture of the way God works with us. Until I\nwatched this film I used to think of the illustration of the potter as quite a\nviolent image – I now see a more patient picture of God. We start up with an\nugly lump of clay – we end up with something useful, something beautiful. If\nyou look at the story of the people of Israel, there are disasters, there are set\nbacks, but God never gives up on them and he will never give up on you. As I\nwatch that video I see. God working with us, making us into the sort of people\nhe wants us to be. Something goes wrong, we go off course – he’ll start again\nPage 2 of 2\nPROPER 18 – 2013 – year C – Trinity 15\nFamily Service\nwith us. That is what confession and forgiveness is all about – God making\nnew starts, new beginnings.\nGospel reading – Jesus tells story of a man building a tower, a king planning to\ngo into battle. There is no room for half measures or the tower will only end\nup half built, the king will end up defeated. Jesus goes on to tell us that there is\nno room for half measures in our service of him. He is following a path that\nwill lead to the cross – there will be nothing held back. What he asks of us is\nthat we will give of our best in following him; That we are going to be\nprepared to forgive people who are annoying us; that we are going to be\nprepared to say sorry when we have done wrong; that we are going to be\nloving and caring of other people. In other words we are going to let him make\nus into the sort of people he wants us to be.\nWhen ever I baptise someone, as we make the sign of the cross on the baby’s\nhead, we say this:\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nLet us do that this week, let Jesus make us into the sort of people he wants us\nto be, let’s finish the race, let’s keep the faith."
    }
}