{
    "title": "Reflections on Righteousness",
    "date": "2011-07-03",
    "blurb": "Kevin's sermon on Proper 8, year A, emphasizes the transformative power of the Gospel in our lives. He draws on St. Francis of Assisi's teachings to illustrate the importance of living the Gospel beyond words, and cites C.S. Lewis on the pervasive influence of faith. The sermon encourages us to reflect Christ's light in the world, to see through His eyes, and to act justly and lovingly in His name.",
    "raw_text": "Proper 8 – 2011 – year A – Trinity 1\n\nIf you were asked to name anything attributed to St Francis of Assisi, before long someone would mention the prayer of St Francis, that forms the basis of our hymn, 'Make me a channel of your peace.' There is another saying attributed to St Francis, 'Preach the Gospel at all times and if necessary use words.'\n\nThis second saying came to my mind as I reflected on the second reading and Gospel reading set for today. I find it always instructive to look at the context of the passages we read as our lessons in our Sunday worship. Our second reading, a portion from Paul’s letter to the Romans, with its injunction to be slaves not to sin but to righteousness, comes immediately after Paul’s teaching on Baptism, symbolising as it does our union with Christ in his death and resurrection; a passage that in the APB was one of those set for use at a Baptism.\n\nOur Gospel reading, with a command to welcome and include, comes after Matthew’s account of Jesus’ demand for allegiance that cuts across ties of family and a call to take up the cross and follow him, adding that those who find their life will lose it and those who lose their life for his sake will find it. When we look at our lessons from the Letter to the Romans and St Matthew’s Gospel in the light of the passages that precede them, we see calls to allow our lives to be touched, to be transformed by the Gospel we have received.\n\nC. S. Lewis, a distinguished son of the Church of Ireland, in writing of the influence of his faith on his own life said:\n\n> \"I believe in Christianity as I believe that the sun has risen: not only because I see it, but because by it I see everything else.\" - C.S. Lewis\n\nThe Christ I meet in the Gospels, the Christ I encounter in worship, in prayer, in my fellow Christians illuminates my life. Jesus, In St John’s Gospel, says of himself:\n\n\"I am the light of the world. Whoever follows me will never walk in darkness but will have the light of life.\" - John 8:12\n\nAs the light of the sun outside enables us to see the wonders of this world, the beauty of flower, of mountain, of sea, the face of one we love, so may the light of Christ enable us, who have been touched by his love, to see the world, and all that is in it, as he would see them. May we look at each other through the eyes of Christ. May we see the poor, the marginalised as he would see them and serve them in his name. May we look on those who have hurt us through the eyes of his forgiving love and be enabled to show something of that some reconciling love. May we look, as he would look, at situations of injustice, whether at home or overseas, may his Church be faithful in its witness to truth and justice.\n\nIn this we become not just recipients of his light. For as the moon reflects the light of the sun to light up the night sky, so we are called to reflect the light of Christ in the world. In St Matthew’s Gospel, in a passage following closely on the Beatitudes, Jesus tells his followers:\n\n\"You are the light of the world. A city built on a hill cannot be hid. No one after lighting a lamp puts it under the bushel basket, but on the lampstand, and it gives light to all in the house. In the same way, let your light shine before others, so that they may see your good works and give glory to your Father in heaven.\" - Matt 5:14-16\n\n'Preach the Gospel at all times and if necessary use words.' In another, very practical piece of advice, St Francis tells his brothers, \"It is no use walking anywhere to preach unless our walking is our preaching.\" We are the ones through whom, in whom Christ not only speaks but walks and acts in the world of today. Unless people experience Christ acting in and through us, they will not hear his words that we speak, however eloquent and polished they may be. For there is a power to simple witness that transcends words, that empowers any subsequent words. Amidst all the horrors found by troops liberating the concentration camps of the last war, the following prayer was found near the body of a dead child in Ravensbrook concentration camp.\n\nO Lord, remember not only the men and women of good will, but also those of ill will. But do not remember all the sufferings they have inflicted on us; remember the fruits we have bought, thanks to this suffering; our comradeship, our humility, our courage, our generosity, the greatness of heart which has grown out of all this; and when they come to judgement let all the fruits we have born be their forgiveness.\n\nWords that bear witness to a power that has outlasted the awful brutality of Ravensbrook and so many camps like it. Between Christmas and Pentecost we have been reflecting on the story of our redemption, the incarnation, the ministry of word and healing, the life, the death and resurrection of our Lord Jesus Christ. As we move into the season of Trinity we move into a period of reflection of what this means for us as we seek to respond in word, in deed, in life to his redeeming love.\n\nIn words the Bishop often uses in blessing at a Service of Confirmation, may we\n\nGo forth into the world in peace;\nbe of good courage;\nhold fast that which is good;\nrender to no one evil for evil;\nstrengthen the fainthearted; support the weak;\nhelp the afflicted; honour everyone;\nlove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand receive the blessing of God almighty,\nthe Father, the Son, and the Holy Spirit,\nand may he remain with us always.\n\nAmen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper82011.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 8 – 2011 – year A – Trinity 1\nIf you were asked to name anything attributed to St Francis of Assisi, before\nlong someone would mention the prayer of St Francis, that forms the basis of\nour hymn, ‘Make me a channel of your peace.’ There is another saying\nattributed to St Francis, ‘Preach the Gospel at all times and if necessary use\nwords.’\nThis second saying came to my mind as I reflected on the second reading and\nGospel reading set for today. I find it always instructive to look at the context\nof the passages we read as our lessons in our Sunday worship. Our second\nreading, a portion from Paul’s letter to the Romans, with its injunction to be\nslaves not to sin but to righteousness, comes immediately after Paul’s teaching\non Baptism, symbolising as it does our union with Christ in his death and\nresurrection; a passage that in the APB was one of those set for use at a\nBaptism.\nOur Gospel reading, with a command to welcome and include, comes after\nMatthew’s account of Jesus’ demand for allegiance that cuts across ties of\nfamily and a call to take up the cross and follow him, adding that those who\nfind their life will lose it and those who lose their life for his sake will find it.\nWhen we look at our lessons from the Letter to the Romans and St Matthew’s\nGospel in the light of the passages that precede them, we see calls to allow our\nlives to be touched, to be transformed by the Gospel we have received.\nC. S. Lewis, a distinguished son of the Church of Ireland, in writing of the\ninfluence of his faith on his own life said:\n“I believe in Christianity as I believe that the sun has risen: not only\nbecause I see it, but because by it I see everything else.” CS Lewis\nThe Christ I meet in the Gospels, the Christ I encounter in worship, in prayer,\nin my fellow Christians illuminates my life. Jesus, In St John’s Gospel, says of\nhimself:\nPage 2 of 3\nProper 8 – 2011 – year A – Trinity 1\n12 Again Jesus spoke to them, saying, \"I am the light of the world. Whoever\nfollows me will never walk in darkness but will have the light of life.\"\nJohn 8:12\nAs the light of the sun outside enables us to see the wonders of this world, the\nbeauty of flower, of mountain, of sea, the face of one we love, so may the light\nof Christ enable us, who have been touched by his love, to see the world, and\nall that is in it, as he would see them. May we look at each other through the\neyes of Christ. May we see the poor, the marginalised as he would see them\nand serve them in his name. May we look on those who have hurt us through\nthe eyes of his forgiving love and be enabled to show something of that some\nreconciling love. May we look, as he would look, at situations of injustice,\nwhether at home or overseas, may his Church be faithful in its witness to truth\nand justice.\nIn this we become not just recipients of his light. For as the moon reflects the\nlight of the sun to light up the night sky, so we are called to reflect the light of\nChrist in the world. In St Matthew’s Gospel, in a passage following closely on\nthe Beatitudes, Jesus tells his followers:\n14 \"You are the light of the world. A city built on a hill cannot be hid. 15 No\none after lighting a lamp puts it under the bushel basket, but on the\nlampstand, and it gives light to all in the house. 16 In the same way, let your\nlight shine before others, so that they may see your good works and give\nglory to your Father in heaven. Matt 5:14-16\n‘Preach the Gospel at all times and if necessary use words.’ In another, very\npractical piece of advice, St Francis tells his brothers, “It is no use walking\nanywhere to preach unless our walking is our preaching.” We are the ones\nthrough whom, in whom Christ not only speaks but walks and acts in the world\nof today. Unless people experience Christ acting in and through us, they will\nnot hear his words that we speak, however eloquent and polished they may be.\nFor there is a power to simple witness that transcends words, that empowers\nany subsequent words. Amidst all the horrors found by troops liberating the\nPage 3 of 3\nProper 8 – 2011 – year A – Trinity 1\nconcentration camps of the last war, the following prayer was found near the\nbody of a dead child in Ravensbrook concentration camp.\nO Lord, remember not only the men and women of good will, but also\nthose of ill will. But do not remember all the sufferings they have inflicted\non us; remember the fruits we have bought, thanks to this suffering; our\ncomradeship, our humility, our courage, our generosity, the greatness of\nheart which has grown out of all this; and when they come to judgement let\nall the fruits we have born be their forgiveness.\nWords that bear witness to a power that has outlasted the awful brutality of\nRavensbrook and so many camps like it. Between Christmas and Pentecost we\nhave been reflecting on the story of our redemption, the incarnation, the\nministry of word and healing, the life, the death and resurrection of our Lord\nJesus Christ. As we move into the season of Trinity we move into a period of\nreflection of what this means for us as we seek to respond in word, in deed, in\nlife to his redeeming love.\nIn words the Bishop often uses in blessing at a Service of Confirmation, may\nwe\nGo forth into the world in peace;\nbe of good courage;\nhold fast that which is good;\nrender to no one evil for evil;\nstrengthen the fainthearted; support the weak;\nhelp the afflicted; honour everyone;\nlove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand receive the blessing of God almighty,\nthe Father, the Son, and the Holy Spirit,\nand may he remain with us always.\nAmen."
    }
}