{
    "title": "Breaking and Remaking",
    "date": "2018-10-21",
    "blurb": "Kevin discusses the concept of 'breaking and remaking' through the story of a Japanese general and the art of kintsugi, where broken pottery is repaired with silver and lacquer, embracing its history. He relates this to the Gospel's message of servanthood and the transformation through baptism, calling for a community of servants, following Christ's example of humility and service.",
    "raw_text": "PROPER 24 – Year B – 2018 – Trinity 21\nChristchurch Cathedral\n\nThere is the story of a Japanese general that I heard on a recording of the BBC Radio 4 series 'Something Understood' that was dealing with the topic of 'Fragility'. This general had a favourite tea bowl which was broken in an accident. He sent it off for repair and when it came back he was not impressed with the job that had been done. He sent it off to a different craftsman who, instead of clumsily trying to conceal the cracks employed a mixture of silver and lacquer to form a glue to hold the pieces together. This is reputed to be the origin of the Japanese art of kintsugi. Rather than throw away a piece of pottery that has shattered, it's possible to give a new lease of life to pottery that becomes even more refined thanks to its \"scars\". The technique of kintsugi, rather than seeking to conceal damage, recognises brokenness as part of the history of the object.\n\nI just want to stay with that image of breaking and remaking as we go on to reflect on our Gospel reading for today. It is one of those readings in which two disciples of Jesus are angling for status over and above the others. Jesus takes the disciples aside and reminds them, 'You know that among the Gentiles those whom they recognize as their rulers lord it over them, and their great ones are tyrants over them. But it is not so among you; but whoever wishes to become great among you must be your servant, and whoever wishes to be first among you must be slave of all.' (Mark 10:42ff)\n\nThat is a mould, a mindset that has to be broken. The mindset needs to be remade in the model of servanthood, of identification with Jesus. And so he tells James and John, 'You do not know what you are asking. Are you able to drink the cup that I drink, or be baptized with the baptism that I am baptized with?' (Mark 10:38)\n\nMindsets, by their very nature, are deep rooted. Being deep-rooted, they come to the surface on a number of occasions. Luke tells us, that even in the context of the Last Supper, the disciples argue among themselves. But the other occasion I want to refer to comes a little earlier in Mark than the passage we have just read. Here, after he has spoken of his coming suffering and death, we read of this ongoing dispute about status among the disciples. Mark goes on, 'He took a little child whom he placed among them. Taking the child in his arms, he said to them, \"Whoever welcomes one of these little children in my name welcomes me; and whoever welcomes me does not welcome me but the one who sent me.\"' (Mark 9:36,37)\n\nHere, in the context of the Eucharist, as Stanley and Ngozi bring their beautiful daughter Joanna for Baptism, a little child is set among us. Christ is with us in a very special way today. Within the context of the promises, the sacrament of Baptism, picks up this theme of breaking and making. In baptism, God calls us from darkness into his marvellous light. To follow Christ means dying to sin and rising to new life with him.\n\nTherefore I ask:\nDo you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?\n\nJoanna will be signed with the sign of the Cross – Christ claims you for his own, receive the sign of the Cross. We bear on our brow the sign of the Cross, a sign of making and breaking, a sign of dying and rising.\n\nReturning to the Japanese art of Kintsugi that I started off with, rather than throw away a piece of pottery that has shattered, it's possible to give a new lease of life to pottery that becomes even more refined thanks to its \"scars\". There is a recognition of the beauty of fragility. The technique of kintsugi, rather than seeking to conceal damage, recognises brokenness as part of the history of the object.\n\nWhen the Gospel writers tell us of the appearance of the risen Christ in their midst, we read 'He showed them his hands and his feet.' In his risen glory, the marks of his suffering are not hidden, they are retained, emblems of his brokenness, of his vulnerability, which he assumed for our redemption.\n\nThe risen and glorified Christ, bearing his own scars, says to us, as he said to his disciples, 'But it is not so among you; but whoever wishes to become great among you must be your servant, and whoever wishes to be first among you must be slave of all.' (Mark 10:43,44)\n\nYou are called to be different. In your life together, you are called to model a different type of community; a community of servants; servants of God, servants of one another. We go out from this place bearing on our own brow the sign of the Cross, the sign of our own breaking and remaking, recalling the words of dismissal as Joanna is handed her baptismal candle:\n\nGod has delivered us from the dominion of darkness and has given us a place with the saints in light. You have received the light of Christ; walk in this light all the days of your life. Shine as a light in the world to the glory of God the Father.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper242018 cathedral.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 24 – Year B – 2018 – Trinity 21\nChristchurch Cathedral\nThere is the story of a Japanese general that I heard on a recording of the BBC\nRadio 4 series ‘Something Understood’ that was dealing with the topic of\n‘Fragility’. This general had a favourite tea bowl which was broken in an\naccident. He sent it off for repair and when it came back he was not impressed\nwith the job that had been done. He sent it off to a different craftsman who,\ninstead of clumsily trying to conceal the cracks employed a mixture of silver\nand lacquer to form a glue to hold the pieces together. This is reputed to be the\norigin of the Japanese art of kintsugi\nRather than throw away a piece of pottery that has shattered, it’s possible to\ngive a new lease of life to pottery that becomes even more refined thanks to its\n“scars”. The technique of kintsugi, rather than seeking to conceal damage,\nrecognises brokenness as part of the history of the object.\nI just want to stay with that image of breaking and remaking as we go on to\nreflect on our Gospel reading for today. It is one of those readings in which\ntwo disciples of Jesus are angling for status over and above the others.\nJesus takes the disciples aside and reminds them\n‘You know that among the Gentiles those whom they recognize as\ntheir rulers lord it over them, and their great ones are tyrants over\nthem. 43But it is not so among you; but whoever wishes to become\ngreat among you must be your servant, 44and whoever wishes to be\nfirst among you must be slave of all. Mark 10:42ff\nThat is a mould, a mindset that has to be broken. The mindset needs to be\nremade in the model of servanthood, of identification with Jesus. And so he\ntells James and John:\nPage 2 of 4\nPROPER 24 – Year B – 2018 – Trinity 21\nChristchurch Cathedral\n‘You do not know what you are asking. Are you able to drink the cup\nthat I drink, or be baptized with the baptism that I am baptized with?’\nMark 10:38\nMindsets, by their very nature, are deep rooted. Being deep-rooted, they come\nto the surface on a number of occasions. Luke tells us, that even in the context\nof the Last Supper, the disciples argue among themselves.\nBut the other occasion I want to refer to comes a little earlier in Mark than the\npassage we have just read. Here, after he has spoken of his coming suffering\nand death, we read of this ongoing dispute about status among the disciples.\nMark goes on:\nHe took a little child whom he placed among them. Taking the child in\nhis arms, he said to them, “Whoever welcomes one of these little\nchildren in my name welcomes me; and whoever welcomes me does\nnot welcome me but the one who sent me.” Mark 9:36,37\nHere, in the context of the Eucharist, as Stanley and Ngozi bring their beautiful\ndaughter Joanna for Baptism, a little child is set among us. Christ is with us in\na very special way today.\nWithin the context of the promises, the sacrament of Baptism, picks up this\ntheme of breaking and making.\nIn baptism, God calls us from darkness into his marvellous light.\nTo follow Christ means dying to sin and rising to new life with him.\nTherefore I ask:\nDo you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?\nPage 3 of 4\nPROPER 24 – Year B – 2018 – Trinity 21\nChristchurch Cathedral\nBCP2004 p361\nI reject, I renounce, I repent – these all speak of breaking, changing mindsets,\nbreaking down all that separates me from God. I turn, I submit, I come – these\nin turn speak of making, of renewal, of new life in Christ.\nJoanna will be signed with the sign of the Cross – Christ claims you for his\nown, receive the sign of the Cross. We bear on our brow the sign of the Cross,\na sign of making and breaking, a sign of dying and rising.\nReturning to the Japanese art of Kintsugi that I started off with, rather than\nthrow away a piece of pottery that has shattered, it’s possible to give a new\nlease of life to pottery that becomes even more refined thanks to its “scars”.\nThere is a recognition of the beauty of fragility. The technique of kintsugi,\nrather than seeking to conceal damage, recognises brokenness as part of the\nhistory of the object.\nWhen the Gospel writers tell us of the appearance of the risen Christ in their\nmidst, we read ‘He showed them his hands and his feet.’. In his risen glory, the\nmarks of his suffering are not hidden, they are retained, emblems of his\nbrokenness, of his vulnerability, which he assumed for our redemption.\nThe risen and glorified Christ, bearing his own scars, says to us, as he said to\nhis disciples:\n43But it is not so among you; but whoever wishes to become great\namong you must be your servant, 44and whoever wishes to be first\namong you must be slave of all. Mark 10:43,44\nPage 4 of 4\nPROPER 24 – Year B – 2018 – Trinity 21\nChristchurch Cathedral\nYou are called to be different. In your life together, you are called to model a\ndifferent type of community; a community of servants; servants of God,\nservants of one another.\nWe go out from this place bearing on our own brow the sign of the Cross, the\nsign of our own breaking and remaking, recalling the words of dismissal as\nJoanna is handed her baptismal candle:\nGod has delivered us from the dominion of darkness\nand has given us a place with the saints in light.\nYou have received the light of Christ;\nwalk in this light all the days of your life.\nShine as a light in the world\nto the glory of God the Father.\nBCP2004 p367"
    }
}