{
    "title": "The Great Banquet",
    "date": "2020-10-11",
    "blurb": "Kevin reflects on the Parable of the Great Banquet, emphasizing the themes of thankfulness and the pain of ingratitude. He draws parallels between the parable and our own experiences of being taken for granted. The sermon concludes with a call to respond to God's invitation to be part of His kingdom, to offer ourselves in love and service, and to live to His praise and glory.",
    "raw_text": "### PROPER 23 – Year A – 2020 – Trinity 18\n\nFamily Communion Service on Zoom\n\nWhen Elke and I were reflecting on this service and the Gospel reading set for today, the Parable of the Great Banquet, we hit on the idea of making this service a service of Holy Communion. Then continuing on from our Service of Harvest Thanksgiving last week, we decided to continue with this theme of thankfulness.\n\n> Of course, the opposite of thankfulness is ingratitude. That is what is at the heart of our Gospel reading, the Parable of the Great Banquet and the simple video that followed it – the friends that would not come to the birthday party.\n\nAnother expression that we might use in this regard is that of being taken for granted. If we take someone or something for granted then, when all is said and done, we don’t think them to be of value or importance. We can all recognise the hurt that would have been felt by the host of the banquet.\n\nI remember being at a birthday party as a child. We had all brought presents. At the end of the party as we were all going home, the birthday boy handed a present, a construction kit, back. He explained that he didn’t actually collect these particular kits so he might as well have it back. I can still see the look of hurt on Anthony Palmer’s face as he took it back.\n\n> Jesus was talking about a lot more than just a man putting on big dinner party for his ungrateful friends. He is talking about God’s invitation to each one of us to be part of his kingdom. He has gone to great lengths to prepare a place for us. He has sent his son Jesus Christ to live among us, to teach, to suffer, die and rise again.\n\nThe invitation is there for us to follow. Sometimes we don’t hear because there is so much else on our mind – we’ll get around to it when we have got school, work, hobbies or whatever all sorted out. Or maybe life is difficult at the minute and it is hard sometimes to believe that God wants me, God cares for me.\n\nBut the call goes out, and goes out, and goes out yet again as God looks for people to enter into the life and work of his Kingdom. God loves us; he loves us not because we are extra good, extra talented. He loves us simply because he loves us – how do we show our love and thankfulness to him?\n\n> We offer you our souls and bodies to be a living sacrifice.\nSend us out in the power of your Spirit to live and work to your praise and glory. Amen.\n\nWe offer ourselves in love and service; to say the things, to do the things he wants us to do and say; to be the people he wants us to be in our care for people, in our sharing of the Gospel in all that we say and do; in our commitment to justice, in our care for this beautiful world he has given us to enjoy.\n\nThat his name be glorified and his kingdom come.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper232020familycommunion.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 23 – Year A – 2020 – Trinity 18\nFamily Communion Service on Zoom\nWhen Elke and I were reflecting on this service and the Gospel\nreading set for today, the Parable of the Great Banquet, we hit on the\nidea of making this service a service of Holy Communion. Then\ncontinuing on from our Service of Harvest Thanksgiving last week,\nwe decided to continue with this theme of thankfulness. Some of our\nyoung people have offered some pointers to this in this short clip.\nFilm clip\nOf course, the opposite of thankfulness is ingratitude. That is what is\nat the heart of our Gospel reading, the Parable of the Great Banquet\nand the simple video that followed it – the friends that would not\ncome to the birthday party.\nAnother expression that we might use in this regard is that of being\ntaken for granted. If we take someone or something for granted then,\nwhen all is said and done, we don’t think them to be of value or\nimportance. We can all recognise the hurt that would have been felt\nby the host of the banquet. Banquets, wedding banquets in the society\nof that day would have been very public affairs – if the banquet had\nbeen a flop then the host would not just have been hurt, he would have\nlost face. He had gone to great trouble; he had laid on the best of food\nPage 2 of 3\nPROPER 23 – Year A – 2020 – Trinity 18\nFamily Communion Service on Zoom\nand all the extras. But for those invited – it was nice to get the\ninvitation but people were busy, they had better things to be doing.\nWe all know what it feels like if we feel friends have let us down.\nSomething inside us hurts – they don’t even see that they have hurt us.\nI remember being at a birthday party as a child. We had all brought\npresents. At the end of the party as we were all going home, the\nbirthday boy handed a present, a construction kit, back. He explained\nthat he didn’t actually collect these particular kits so he might as well\nhave it back. I can still see the look of hurt on Anthony Palmer’s face\nas he took it back.\nOf course, Jesus was talking about a lot more than just a man putting\non big dinner party for his ungrateful friends. He is talking about\nGod’s invitation to each one of us to be part of his kingdom. He has\ngone to great lengths to prepare a place for us. He has sent his son\nJesus Christ to live among us, to teach, to suffer, die and rise again.\nThe invitation is there for us to follow. Sometimes we don’t hear\nbecause there is so much else on our mind – we’ll get around to it\nwhen we have got school, work, hobbies or whatever all sorted out.\nOr maybe life is difficult at the minute and it is hard sometimes to\nbelieve that God wants me, God cares for me.\nPage 3 of 3\nPROPER 23 – Year A – 2020 – Trinity 18\nFamily Communion Service on Zoom\nBut the call goes out, and goes out, and goes out yet again as God\nlooks for people to enter into the life and work of his Kingdom. God\nloves us; he loves us not because we are extra good, extra talented.\nHe loves us simply because he loves us – how do we show our love\nand thankfulness to him? I often think that the words that come near\nthe end of our Service of Holy Communion sum things up rather\nnicely as we say:\nwe offer you our souls and bodies to be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen.\nWe offer ourselves in love and service; to say the things, to do the\nthings he wants us to do and say; to be the people he wants us to be in\nour care for people, in our sharing of the Gospel in all that we say and\ndo; in our commitment to justice, in our care for this beautiful world\nhe has given us to enjoy.\nThat his name be glorified and his kingdom come."
    }
}