{
    "title": "The Mustard Seed Parable",
    "date": "2017-07-30",
    "blurb": "Kevin delves into the parables of the Kingdom from Matthew's Gospel, focusing on the mustard seed's symbolism. He explains how God values the small and seemingly insignificant, teaching that faith, even as tiny as a mustard seed, can lead to great things. The sermon emphasizes the importance of simple acts of kindness and service, empowered by the Spirit, to bring the Kingdom of God closer to our world.",
    "raw_text": "PROPER 12 – 2017 – Year A – Trinity 7\n\nI get great value out of my car radio – compared to the North of Ireland, I find that the Irish radio programmes are far more engaging. The week before last, I found myself listening to a programme on the classic film director Orson Wells. In discussing one particular film, the person spoke of Orson Wells stringing together a succession of scenes 'like pearls on a necklace'. Each one was a gem, each one sets off the others, counterbalances the others and taken together they were magnificent.\n\nOver these last three Sundays, our Gospel readings have been drawn from chapter 13 of Matthew’s Gospel. In this chapter Matthew has grouped together a whole string of parables of the Kingdom into one block of teaching. Parables were very much part of the teaching method of Jesus as he took themes and images that would have struck a chord with his hearers. The Kingdom of heaven may be compared to ..., the Kingdom of heaven is like. The Kingdom of heaven would have struck a chord in contemporary Jewish spirituality. The hope that was expressed in this was not of a distant prospect, of 'pie in the sky when you die'. No, it is more immediate and upon this hope is built the certainty that God is Lord of this puzzling world; he will not always remain far off, but will reveal himself and make good his word.\n\nIn Matthew’s Gospel, Jesus’ own public ministry begins with the proclamation of the nearness of the Kingdom, declaring, 'Repent, for the Kingdom of heaven has come near.' In this 13th chapter we have a string of these parables. The Kingdom of heaven is like a sower sowing seed, like good seed and bad sown together, like a mustard seed that once planted grows into a large bush, like a woman mixing in a small amount of yeast into a batch of bread, like treasure being found in a field, like a merchant finding a pearl of great price and selling everything to get hold of it, like a fisherman separating out the good fish from the bad in a catch. These are parables of the littleness, the hiddeness of the Kingdom, of the value of the kingdom, an element of judgement. Like the string of scenes in that Orson Wells film, the string of pearls on a necklace, each one is a gem, each one sets off the others, counterbalances the others and taken together they are magnificent.\n\nThis morning I just want to look at one of those gems, the parable of the mustard seed:\n\nThe kingdom of heaven is like a mustard seed that someone took and sowed in his field; it is the smallest of all the seeds, but when it has grown it is the greatest of shrubs and becomes a tree, Matt 13:31,32\n\nWhat I draw from this is that God works, through the small and the seemingly insignificant. He who taught his disciples that they are to become as a little child if they are to inherit the Kingdom, takes us as we are, in our strengths and our weaknesses, takes our witness and acts of service in all their imperfection and works in and through those.\n\nI want to set it alongside that other reference to mustard seed that we find in Matthew’s Gospel:\n\nFor truly I tell you, if you have faith the size of a mustard seed, you will say to this mountain, 'Move from here to there,' and it will move; and nothing will be impossible for you.\" Matt 17:20\n\nI’ve spoken before of Brother Roger of Taize speaking of mustard seed faith. We can only offer God the faith we have and he will accept that and honour that, and work through that. This is something of what Paul is talking about in the opening part of the lesson we read from his letter to the Romans:\n\nThe Spirit helps us in our weakness; for we do not know how to pray as we ought, but that very Spirit intercedes with sighs too deep for words. Romans 8:26\n\nThe Spirit helps us in our weakness - helps us as we are. The Spirit takes our simple acts of service, our imperfect and disjointed prayers and empowers them.\n\nThe poet Wordsworth, in his poem 'Lines written a few miles above Tintern Abbey' wrote this:\n\nIn hours of weariness, sensations sweet,\nFelt in the blood, and felt along the heart,\nAnd passing even into my purer mind\nWith tranquil restoration:—feelings too\nOf unremembered pleasure; such, perhaps,\nAs may have had no trivial influence\nOn that best portion of a good man's life;\nHis little, nameless, unremembered acts\nOf kindness and of love.\n\nthat best portion of a good man’s life. His little, nameless, unremembered acts of kindness and of love. The mustard seed offered to God, sown by God, producing effects in the lives of others we may not even know; in them, through them, in the power of the Spirit, the Kingdom draws near, in the world, in the community in which we live.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper122017.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 12 – 2017 – Year A – Trinity 7\nI get great value out of my car radio – compared to the North of Ireland, I find\nthat the Irish radio programmes are far more engaging. The week before last, I\nfound myself listening to a programme on the classic film director Orson\nWells. In discussing one particular film, the person spoke of Orson Wells\nstringing together a succession of scenes ‘like pearls on a necklace’. Each one\nwas a gem, each one sets off the others, counterbalances the others and taken\ntogether they were magnificent.\nOver these last three Sundays, our Gospel readings have been drawn from\nchapter 13 of Matthew’s Gospel. In this chapter Matthew has grouped together\na whole string of parables of the Kingdom into one block of teaching.\nParables were very much part of the teaching method of Jesus as he took\nthemes and images that would have struck a chord with his hearers. The\nKingdom of heaven may be compared to ….. , the Kingdom of heaven is like.\nThe Kingdom of heaven would have struck a chord in contemporary Jewish\nspirituality. The hope that was expressed in this was not of a distant prospect,\nof ‘pie in the sky when you die’. No, it is more immediate and upon this hope\nis built the certainty that God is Lord of this puzzling world; he will not always\nremain far off, but will reveal himself and make good his word.\nIn Matthew’s Gospel, Jesus’ own public ministry begins with the proclamation\nof the nearness of the Kingdom, declaring, ‘Repent, for the Kingdom of heaven\nhas come near.’ In this 13th chapter we have a string of these parables.\nThe Kingdom of heaven is like:\nlike a sower sowing seed,\nlike good seed and bad sown together,\nPage 2 of 3\nPROPER 12 – 2017 – Year A – Trinity 7\nlike a mustard seed that once planted grows into a large bush,\nlike a woman mixing in a small amount of yeast into a batch of bread\nlike treasure being found in a field\nlike a merchant finding a pearl of great price and selling everything to get hold\nof it.\nlike a fisherman separating out the good fish from the bad in a catch.\nThese are parables of the littleness, the hiddeness of the Kingdom, of the value\nof the kingdom, an element of judgement. Like the string of scenes in that\nOrson Wells film, the string of pearls on a necklace, each one is a gem, each\none sets off the others, counterbalances the others and taken together they are\nmagnificent.\nThis morning I just want to look at one of those gems, the parable of the\nmustard seed:\nThe kingdom of heaven is like a mustard seed that someone took and\nsowed in his field; 32it is the smallest of all the seeds, but when it has\ngrown it is the greatest of shrubs and becomes a tree, Matt 13:31,32\nWhat I draw from this is that God works, through the small and the seemingly\ninsignificant. He who taught his disciples that that they are to become as a\nlittle child if they are to inherit the Kingdom, takes us as we are, in our\nstrengths and our weaknesses, takes our witness and acts of service in all their\nimperfection and works in and through those.\nI want to set it alongside that other reference to mustard seed that we find in\nMatthew’s Gospel:\nPage 3 of 3\nPROPER 12 – 2017 – Year A – Trinity 7\nFor truly I tell you, if you have faith the size of a mustard seed, you\nwill say to this mountain, 'Move from here to there,' and it will move;\nand nothing will be impossible for you.\" Matt 17:20\nI’ve spoken before of Brother Roger of Taize speaking of mustard seed faith.\nWe can only offer God the faith we have and he will accept that and honour\nthat, and work through that. This is something of what Paul is talking about in\nthe opening part of the lesson we read from his letter to the Romans:\n26The Spirit helps us in our weakness; for we do not know how to pray\nas we ought, but that very Spirit intercedes with sighs too deep for\nwords. Romans 8:26\nThe Spirit helps us in our weakness - helps us as we are. The Spirit takes our\nsimple acts of service, our imperfect and disjointed prayers and empowers\nthem.\nThe poet Wordsworth, in his poem ‘Lines written a few miles above Tintern\nAbbey’ wrote this:\nIn hours of weariness, sensations sweet,\nFelt in the blood, and felt along the heart,\nAnd passing even into my purer mind\nWith tranquil restoration:—feelings too\nOf unremembered pleasure; such, perhaps,\nAs may have had no trivial influence\nOn that best portion of a good man's life;\nHis little, nameless, unremembered acts\nOf kindness and of love.\nthat best portion of a good man’s life. His little, nameless, unremembered acts\nof kindness and of love. The mustard seed offered to God, sown by God,\nproducing effects in the lives of others we may not even know; in them,\nthrough them, in the power of the Spirit, the Kingdom draws near, in the world,\nin the community in which we live."
    }
}