{
    "title": "Wisdom and Understanding",
    "date": "2018-09-16",
    "blurb": "Kevin reflects on the true meaning of wisdom and understanding, contrasting it with mere knowledge. He shares the story of Lilly Leggett, a woman of profound insight and care, who exemplified wisdom in her simple yet impactful life. The sermon draws from the Letter of James and the teachings of Jesus to emphasize a life of service and humility, challenging the worldly pursuit of status and power.",
    "raw_text": "PROPER 20 – Year B - 2015 – Trinity 16.\n\nWho is wise and understanding among you? James 3:13\n\nKevin speaks of the privilege of meeting a variety of people in his ministry, particularly recalling Lilly Leggett, a caring woman with deep wisdom. He distinguishes between knowledge and wisdom, suggesting that wisdom involves a new way of living and thinking, aligned with God's values rather than worldly wisdom.\n\n> 20 Where is the one who is wise? Where is the scribe? Where is the debater of this age? Has not God made foolish the wisdom of the world? 1 Cor 1:20-21\n\nKevin discusses the hierarchical nature of society and how Jesus taught his disciples to adopt a different perspective, valuing service and humility over status.\n\n> 33 Then they came to Capernaum; and when he was in the house he asked them, 'What were you arguing about on the way?' 34 But they were silent, for on the way they had argued with one another who was the greatest. Mark 9:33-34\n\nTo follow Jesus is to embrace a different worldview, one that reaches out to the marginalized and teaches selflessness. Kevin concludes by reflecting on the wisdom of Lilly Leggett, whose life was a testament to the kind of wisdom that comes from a warm humanity and a simple, uncomplicated faith.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper202018.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 20 – Year B - 2015 – Trinity 16.\nWho is wise and understanding among you? James 3:13\nAs I remarked earlier in the year, one of the privileges of my job over the last\nsince I was ordained back in 1978, serving in Parishes in both an urban and\nrural environment, North and South is to meet and to get to know the rich\nvariety of people who worship in our Parish Churches. As you can imagine,\nover the years I have had many a cause to pause and think of some of the\npeople it has been my privilege to work among. In so many ways their\nministry to me has enriched my own life and faith. Most, if not all, would be\nsurprised to hear me speak in such terms about them.\nAs I read that opening verse of that letter from James that we heard this\nmorning my mind went back to a lady called Lilly Leggett. Lilly lived in a\nHousing Executive house in Ahoghill and had worked initially in the linen\nfactory in Ballymena and latterly in Gallaher’s Cigarette factory. She was one\nof the carers of this world. Lilly never married and she looked after her parents\nto the end. She was a wonderful babysitter and surrogate grand mother to our\nchildren.\nWhen you first met Lilly she would have come across as something of an\neccentric and you would be forgiven for thinking that she wasn’t really\nfollowing what you were talking about. I soon came to recognise the depths\nthere were to this lovely lady. I remember visiting her niece one afternoon and\nshe began talking of Lilly with great affection. Then she said, ‘You know Mr\nBrew, Lily is very wise – not everyone realises that.’ I knew exactly what she\nmeant. She had a wonderful insight into people who were hurting. I remember\nPage 2 of 4\nPROPER 20 – Year B - 2015 – Trinity 16.\nwhen some of the very contentious issues were coming up at the start of the\npeace process, sitting in her kitchen as she recalled some of the things Terence\nO’Neill had been trying to do before he was driven out of office. I saw what\nAnne meant, ‘You know, Mr Brew, Lilly is very wise.’\nAs I say, Lilly came to my mind as I read those words from the Letter of\nJames. ‘Who is wise and understanding among you?’ It set me thinking, what\nis the difference between wisdom and knowledge. We can accumulate a list of\nfacts and call it knowledge, but wisdom is something very different. Wisdom\nhas more to do with what we do with whatever knowledge we may have.\nThe wisdom that the writer of this letter is talking about is going even further\nthan that. It is more than just a matter of attitude, it is more about a new way\nof thinking, a different set of values, a new way of living that we are called to\nembrace in our discipleship. At various points in the New Testament, a sharp\ndistinction is drawn between the wisdom of this world and the wisdom of God.\nSo, Paul, in writing to the Corinthians, asks:\n20 Where is the one who is wise? Where is the scribe? Where is the\ndebater of this age? Has not God made foolish the wisdom of the\nworld? 21 For since, in the wisdom of God, the world did not know\nGod through wisdom, God decided, through the foolishness of our\nproclamation, to save those who believe. 1 Cor 1:20-21\nand further on\n18 Do not deceive yourselves. If you think that you are wise in this\nage, you should become fools so that you may become wise. 19 For\nthe wisdom of this world is foolishness with God. 1 Cor 3:18,19\nThis was a very hierarchical world. It is in the context of hierarchies that we\nlook at our Gospel reading for today.\nPage 3 of 4\nPROPER 20 – Year B - 2015 – Trinity 16.\n33Then they came to Capernaum; and when he was in the house he\nasked them, ‘What were you arguing about on the way?’ 34But they\nwere silent, for on the way they had argued with one another who\nwas the greatest. Mark 9:33-34\nSet in the wider context of Jesus’ teaching on self giving and his own coming\nrejection and death, they confess they had been talking of their relative status.\nThese men who were following Jesus were ordinary fallible human beings.\nLike ourselves they were products of the society into which they had been born\nand in which they grew up; their attitudes, their way of thinking moulded by\nthat environment. As I say, it was very much a hierarchical society. In\nhierarchies it is important to establish where you stand. When we move into\nnew situations it is natural to carry over the attitudes and priorities with which\nwe are familiar. And so as they settle in to this new kind of living to which\nJesus has called them, they bring some of the baggage of their old way of life –\nwho is on the top of the heap, who is on the bottom. So Jesus sets them down\n35 He sat down, called the twelve, and said to them, \"Whoever\nwants to be first must be last of all and servant of all.\" 36 Then he\ntook a little child and put it among them; and taking it in his arms,\nhe said to them, 37 \"Whoever welcomes one such child in my\nname welcomes me, and whoever welcomes me welcomes not me\nbut the one who sent me.\" Mark 9:35-37\nTo follow Jesus is to follow one who looks at the world differently and calls\nhis followers to do the same. He is one who reached out and touched the leper,\nwho allowed a woman to wash his feet with her tears and wipe them with her\nhair; who taught his followers to turn the other cheek, to walk the second mile,\nto give away the coat.\nOf course in this horribly practical world it doesn’t make sense. It makes sense\nto close our borders, it makes sense to look after our own. Where does it all\nPage 4 of 4\nPROPER 20 – Year B - 2015 – Trinity 16.\nstop? And yet in the news bulletins and in our newspapers - the pictures, the\nscenes - speak to our humanity, as ones made in God’s image. In a very real\nsense Christ is there; in those who are suffering; in those who are trying to\nmake sense of it all; in those, in all the constraints placed upon them, are\nseeking to do what is right and what is just.\n‘Who is wise and understanding among you?’ I often think back on Lilly\nLeggett. I sensed in her and in many like her a wisdom that you do not find in\nbooks, a wisdom that had its roots in a warm humanity and a simple\nuncomplicated faith in the God she served in word and deed. I often left her\ndoor, as I have left many before and since all the richer for the time I spent in\ntheir presence."
    }
}