{
    "title": "Identity and Grace",
    "date": "2014-09-21",
    "blurb": "Kevin discusses the intersection of politics, identity, and faith in the context of the Scottish Referendum and Paul's teachings to the Philippians. He explores the concept of grace as an undeserved gift that challenges our notions of fairness, especially in the Parable of the Labourers in the Vineyard. The sermon emphasizes the importance of forgiveness and the dangers of judgment within the Christian community.",
    "raw_text": "PROPER 20 – Year A – 2014\n\n'Only live your life in a manner worthy of the Gospel of Christ.' Phil 1.27\n\nAnd who said politics is boring? We have just come to the end of the campaign for the Scottish Referendum on independence. It was certainly a close fought fight with the result uncertain until the very end. It raised passions on this side of the water. Someone asked me 'Are you looking forward to the People’s Republic of Scotland?' Former American Presidents, pop stars all made their contribution.\n\nWhen it came down to it, the core question, whichever way the vote was cast, was one of identity. How did each individual voter see themselves, their society, their country and which political arrangement was going to give best expression to that?\n\nSo what has this talk of politics, of referenda, of national identity, got to do with Paul’s injunction to the Philippians: 'Only live your life in a manner worthy of the Gospel of Christ.'? The word that we have translated as 'live your life' politeuvesqe has its roots in the word polis, city, words from which we derive our word politics and has connotations of citizenship. What Paul is addressing here are issues of our fundamental identity, our citizenship.\n\nThe Gospel is not a side issue, an interest to be considered among other interests. It cuts right to our identity, our understanding of who we are.\n\nOver the last couple of weeks, we have addressed issues of forgiveness. Last week, as he spoke on the Parable of the Wicked Servant, David underlined the radical, the generous, the shocking nature of forgiveness as the king remitted a totally staggering debt – the problem lay not with that but with the servant’s unwillingness to model that generous forgiveness, as he turned on a fellow servant who owed him but a tiny fraction of the debt that he had been discharged from.\n\nA forgiven people must be a forgiving people. It must be part of who we are, part of our identity as members of the Body of Christ.\n\nIt is with these thoughts of identity, who we are, what we are, that I want to move on to reflect on our Gospel reading this morning, the Parable of the Labourers in the Vineyard.\n\nThis parable of Jesus is both familiar and troubling in that at the heart of the story there seems to lie a fundamental unfairness, dare I say injustice, as those who spent the day lying in the sun are paid the same as those who worked all through the heat of the day. To rub salt into the wound, when the latter complain they are rebuked. People will rationalise it by saying, 'Oh, the owner would know that these are family men with families to feed.' That may be true but it actually misses the point. At the heart of this story is the injustice of grace.\n\nWhen I say the injustice of grace, it is to emphasise the point that God’s grace, God’s love for you and for me is not dependent on my own worth or deserving. We acknowledge that every time we come to the communion rails in the Prayer of Humble Access, 'We do not presume to come to this your table trusting in our own righteousness but in your manifold and great mercies.' Grace is by its very nature gift. It actually cuts across all lines of justice to new beginnings, new starts, in our life before God.\n\nThis parable takes us into the whole issue of accepting each other before God. It addresses issues of grace – not just in how they apply to us in our own relationship with God but also in our relationship with others before God. The issue that troubled the first workers was not their wages – for those had been agreed. What troubled them was that those who appeared later received the same – they are envious of the generosity shown to others. We have no problem with God’s grace shown to us – the problem comes when we contemplate who else God seems to be showing grace to – people who don’t seem to be measuring up.\n\nIt is of course an old story repeated several times in Scripture. Jonah sat on the hill overlooking the ancient city of Nineveh and fumed when God spared the city – in his eyes they did not deserve God’s mercy. In the Parable of the Prodigal Son, the older brother thought the father a doting old fool when he welcomed the younger Prodigal son home with open arms – as far as he was concerned he had had his chances and he had blown them. The Pharisee at prayer in the parable of the Pharisee and the Publican thanks God that he at least is not like the sinful publican. All these testify to a lingering feeling of merit in our own understanding of our position before God that flies in the face of grace as God’s gift. Yet we continue to say: 'We do not presume to come to this your table …'\n\nThis story with its message of God’s choice of those he chooses to welcome or reward and with it our failure to recognise that grace really is a gift and not a reward for good behaviour, these all raise other issues. There is that very human tendency to pass comment, pass judgement on others who differ from us. We can all be a bit smug, a bit condescending at times on issues that do not lie at the heart of the Gospel. Within a Christian community such as ours there are people with a wide range of experiences, of worship preferences, of theological views, of views on political and lifestyle issues, what I have referred to in the past as the 'grey areas' of Christian life. Issues on which it is perfectly possible for Christians to hold sincerely held, differing opinions.\n\nThis does not mean we cannot argue, even passionately, about these things. What we cannot do is pass judgement on one another.\n\nTo quote the words of that well known woolly headed liberal, Oliver Cromwell, as he argued with some even more hard headed Scots; 'I beseech you, in the bowels of Christ, think it possible you may be mistaken.' None of us has the total picture, we all see through a glass darkly. We each stand before God as ones made in the image of God, each with our own individual strengths and weaknesses, our own insights, our own blindspots, each recipients of his grace. So whether we have come to labour in the vineyard early or late, let us honour one another in the name of Christ and encourage and build each other up as members of the Body of Christ in this place.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper202014.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 20 – Year A – 2014\n‘Only live your life in a manner worthy of the Gospel of Christ. Phil 1.27\nAnd who said politics is boring? We have just come to the end of the\ncampaign for the Scottish Referendum on independence. It was certainly a\nclose fought fight with the result uncertain until the very end. It raised\npassions on this side of the water. Someone asked me ‘Are you looking\nforward to the People’s Republic of Scotland?’ Former American Presidents,\npop stars all made their contribution.\nWhen it came down to it, the core question, whichever way he vote was cast,\nwas one of identity. How did each individual voter see themselves, their\nsociety, their country and which political arrangement was going to give best\nexpression to that?\nSo what has this talk of politics, of referenda, of national identity, got to do\nwith Paul’s injunction to the Philippians: ‘Only live your life in a manner\nworthy of the Gospel of Christ.’? The word that we have translated as ‘live\nyour life’ politeuvesqe It has its roots in the word polis, city, words from\nwhich we derive our word politics and has connotations of citizenship. What\nPaul is addressing here are issues of our fundamental identity, our citizenship.\nThe Gospel is not a side issue, an interest to be considered among other\ninterests. It cuts right to our identity, our understanding of who we are.\nOver the last couple of weeks, we have addressed issues of forgiveness. Last\nweek, as he spoke on the Parable of the Wicked Servant, David underlined the\nradical, the generous, the shocking nature of forgiveness as the king remitted a\ntotally staggering debt – the problem lay not with that but with the servant’s\nunwillingness to model that generous forgiveness, as he turned on a fellow\nPage 2 of 4\nPROPER 20 – Year A – 2014\nservant who owed him but a tiny fraction of the debt that he had been\ndischarged from.\nA forgiven people must be a forgiving people. It must be part of who we are,\npart of our identity as members of the Body of Christ.\nIt is with these thoughts of identity, who we are, what we are, that I want to\nmove on to reflect on our Gospel reading this morning, the Parable of the\nLabourers in the Vineyard.\nThis parable of Jesus is both familiar and troubling in that at the heart of the\nstory there seems to lie a fundamental unfairness, dare I say injustice, as those\nwho spent the day lying in the sun are paid the same as those who worked all\nthrough the heat of the day. To rub salt into the wound, when the latter\ncomplain they are rebuked. People will rationalise it by saying, ‘Oh, the owner\nwould know that these are family men with families to feed.’ That may be true\nbut it actually misses the point. At the heart of this story is the injustice of\ngrace.\nWhen I say the injustice of grace, it is to emphasise the point that God’s grace,\nGod’s love for you and for me is not dependant on my own worth or deserving.\nWe acknowledge that every time we come to the communion rails in the Prayer\nof Humble Access, ‘We do not presume to come to this your table trusting in\nour own righteousness but in your manifold and great mercies.’ Grace is by its\nvery nature gift. It actually cuts across all lines of justice to new beginnings,\nnew starts, in our life before God.\nThis parable takes us into the whole issue of accepting each other before God.\nIt addresses issues of grace – not just in how they apply to us in our own\nPage 3 of 4\nPROPER 20 – Year A – 2014\nrelationship with God but also in our relationship with others before God. The\nissue that troubled the first workers was not their wages – for those had been\nagreed. What troubled them was that those who appeared later received the\nsame – they are envious of the generosity shown to others. We have no\nproblem with God’s grace shown to us – the problem comes when we\ncontemplate who else God seems to be showing grace to – people who don’t\nseem to be measuring up.\nIt is of course an old story repeated several times in Scripture. Jonah sat on the\nhill overlooking the ancient city of Nineveh and fumed when God spared the\ncity – in his eyes they did not deserve God’s mercy. In the Parable of the\nProdigal Son, the older brother thought the father a doting old fool when he\nwelcomed the younger Prodigal son home with open arms – as far as he was\nconcerned he had had his chances and he had blown them. The Pharisee at\nprayer in the parable of the Pharisee and the Publican thanks God that he at\nleast is not like the sinful publican. All these testify to a lingering feeling of\nmerit in our own understanding of our position before God that flies in the face\nof grace as God’s gift. Yet we continue to say: ‘We do not presume to come to\nthis your table ……’\nThis story with its message of God’s choice of those he chooses to welcome or\nreward and with it our failure to recognise that grace really is a gift and not a\nreward for good behaviour, these all raise other issues. There is that very\nhuman tendency to pass comment, pass judgement on others who differ from\nus. We can all be a bit smug, a bit condescending at times on issues that do not\nlie at the heart of the Gospel. Within a Christian community such as ours there\nare people with a wide range of experiences, of worship preferences, of\ntheological views, of views on political and lifestyle issues, what I have\nreferred to in the past as the ‘grey areas’ of Christian life. Issues on which it is\nPage 4 of 4\nPROPER 20 – Year A – 2014\nperfectly possible for Christians to hold sincerely held, differing opinions.\nThis does not mean we cannot argue, even passionately, about these things.\nWhat we cannot do is pass judgement on one another.\nTo quote the words of that well known woolly headed liberal, Oliver\nCromwell, as he argued with some even more hard headed Scots; ‘I beseech\nyou, in the bowels of Christ, think it possible you may be mistaken.’ None of\nus has the total picture, we all see through a glass darkly. We each stand\nbefore God as ones made in the image of God, each with our own individual\nstrengths and weaknesses, our own insights, our own blindspots, each\nrecipients of his grace. So whether we have come to labour in the vineyard\nearly or late, let us honour one another in the name of Christ and encourage and\nbuild each other up as members of the Body of Christ in this place."
    }
}