{
    "title": "Moving On from Disappointment",
    "date": "2003-10-05",
    "blurb": "Kevin discusses the challenge of addressing difficult passages in the lectionary, particularly concerning marriage and divorce. He reflects on personal stories and the broader context of overcoming disappointment and failure. The sermon emphasizes the importance of facing up to past events, starting afresh, and the role of the Church in helping individuals make new beginnings, grounded in the forgiveness offered through Christ's sacrifice.",
    "raw_text": "Proper 21 – Year B - 2003 – Trinity 16\n\nI have often remarked that one of the strengths of our tradition lies in our lectionary, our ordered reading of scripture; so that Sunday by Sunday, month by month, we engage in a structured reading of the Bible. This means that the preacher is restrained from sticking to just his own pet topics and indeed is required on occasion to address passages he might otherwise avoid. It ensures, as St Paul said as he prepared to take his leave of the leaders of the Church at Ephesus, that we preach the whole counsel of God.\n\nThen every so often I open my Bible at the lessons set for the following Sunday and think that maybe this is not such a good idea. This week was one such week - our Gospel passage gives very stark teaching on the whole issue of marriage. This is an issue that causes great pain and heartache to many within the Church. To be frank I did seriously think of quietly choosing a different passage altogether.\n\nAs I read and re-read the passage during this week, my mind went back to the day I was moving house from Finglas to Mountmellick. As the removal men were loading the last of our belongings into the lorry a young mother called at my door. Her husband had just walked out to go and live with another woman, leaving her to fend for herself and their three young children, the youngest less than three months old. I can still see the pain in her face as she said, \"What future is there for me and the kids? Paul won't give us anything - I can't even get married again in this country.\" Then she looked me straight in the eye and asked, \"Does the Church and the State expect me to grow into a frustrated and bitter old women?\" What could I say? There was no divorce at that stage in the South and the Church did not re-marry divorcees.\n\nThe more I thought about that over the years, the more I have seen that what lay at the heart of her anguish that day was the fundamental question, \"How do I move on in my life from here?\"\n\nAgain as I read that Gospel lesson I thought of another story of Jesus. I refer to that occasion when a woman taken in adultery was hauled before him. The lawyers in the crowd declared, \"Moses said that we should stone such women. What do you say?\" We know the story well. Jesus turned to the crowd and said \"Let him without sin cast the first stone.\" And they all slipped away. Turning to the woman he asked where were those who had accused her. She said they had gone and he said, \"Neither do I condemn you. Go and sin no more.\" The lawyers were focused on stigma and condemnation. Jesus spoke about moving on, about making a new beginning. He did not say that what had happened did not matter. He said, \"Go and sin no more.\"\n\nYes, Jesus did set high standards and called us to follow. But Jesus set high standards in all sorts of areas of life. He says for example that if we do not forgive someone who has wronged us then neither will our heavenly Father forgive us - and which of us has not had a problem with that one from time to time? - the burden, the pain of a resentment that will not go away.\n\nSo I want to look at this in the broader context of how do we move on from a situation of disappointment, of failure. Not only that, how do we as a community enable others to move on from their situations of disappointment and failure?\n\nAny moving on must involve a facing up to and dealing with what has happened and then starting afresh. As we are reminded in the communion service:\n\n> God so loved the world that he gave his only Son Jesus Christ\nto save us from our sins,\nto intercede for us in heaven\nand to bring us to eternal life.\n\nAt the heart of the Gospel is a proclamation of the Cross, the declaration that there is no sin, no failure, no setback that is not covered by the Cross of Christ. The Cross stands as a challenge to repent and an invitation to make a fresh start, trusting not in ourselves but in the Christ who redeemed us.\n\nThe Cross must lie at the heart of how we see ourselves as a community. Do we see ourselves as a community of the perfect, erecting barriers to protect ourselves from the imperfect? Or do we see ourselves as a school for sinners, recognizing that we all fail at times, we are all in need of Christ's forgiving love.\n\nA few years ago, a Presbyterian minister and myself were discussing this whole issue over a cup of coffee and he said, \"I find that I am reviewing my doctrine of marriage in the light of my doctrine of forgiveness.\"\n\nThis is what we as a Church have been doing in recent years as we have reviewed our whole approach to the remarriage of divorced people in Church. As a Church we continue to uphold the lifelong nature of marriage but we recognize that there are situations where it does not work for a whole number of reasons. The question we are left with is one of asking how do we enable people to move on, to make a fresh start within the life of the Church. Yes of course there are tensions, there are inconsistencies but in a fallen and hurting world even our best solutions are going to bear the mark of the imperfect.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Proper 22 - 2003.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 21 – year B -2003 – Trinity 16\nI have often remarked that one of the strengths of our tradition lies in our lectionary,\nour ordered reading of scripture; so that Sunday by Sunday, month by month, we\nengage in a structured reading of the Bible. This means that the preacher is\nrestrained from sticking to just his own pet topics and indeed is required on occasion\nto address passages he might otherwise avoid. It ensures, as St Paul said as he\nprepared to take his leave of the leaders of the Church at Ephesus, that we preach the\nwhole counsel of God.\nThen every so often I open my Bible at the lessons set for the following Sunday and\nthink that maybe this is not such a good idea. This week was one such week - our\nGospel passage gives very stark teaching on the whole issue of marriage. This is an\nissue that causes great pain and heart ache to many within the Church. To be frank I\ndid seriously think of quietly choosing a different passage altogether.\nAs I read and re-read the passage during this week, my mind went back top the day I\nwas moving house from Finglas to Mountmellick. As the removal men were loading\nthe last of our belongings into the lorry a young mother called at my door. Her\nhusband had just walked out to go and live with another woman, leaving her to fend\nfor herself and their three young children, the youngest less than three months old. I\ncan still see the pain in her face as she said, \"What future is there for me and the\nkids? Paul won't give us anything - I can't even get married again in this country.\"\nThen she looked me straight in the eye and asked, \"Does the Church and the State\nexpect me to grow into a frustrated and bitter old women?\" What could I say? There\nwas no divorce at that stage in the South and the Church did not re-marry divorcees.\nThe more I thought about that over the years, the more I have seen that what lay at\nthe heart of her anguish that day was the fundamental question, \"How do I move on\nin my life from here?\"\nPage 2 of 3\nProper 21 – year B -2003 – Trinity 16\nAgain as I read that Gospel lesson I thought of another story of Jesus. I refer to that\noccasion when a women taken in adultery was hauled before him. The lawyers in the\ncrowd declared, \"Moses said that we should stone such women. What do you say?\"\nWe know the story well. Jesus turned to the crowd and said \"Let him without sin\ncast the first stone.\" And they all slipped away. Turning to the woman he asked\nwhere were those who had accused her. She said they had gone and he said, \"Neither\ndo I condemn you. Go and sin no more.\" The lawyers were focussed on stigma and\ncondemnation. Jesus spoke about moving on, about making a new beginning. He\ndid not say that what had happened did not matter. He said, \"Go and sin no more.\"\nYes, Jesus did set high standards and called us to follow. But Jesus set high\nstandards in all sorts of areas of life. He says for example that if we do not forgive\nsomeone who has wronged us then neither will our heavenly Father forgive us - and\nwhich of us has not had a problem with that one from time to time? - the burden, the\npain of a resentment that will not go away.\nSo I want to look at this in the broader context of how do we move on from a\nsituation of disappointment, of failure. Not only that, how do we as a community\nenable others to move on from their situations of disappointment and failure?\nAny moving on must involve a facing up to and dealing with what has happened and\nthen startin afresh. As we are reminded in the communion service:\nGod so loved the world that he gave his only Son Jesus Christ\nto save us from our sins,\nto intercede for us in heaven\nand to bring us to eternal life.\nAt the heart of the Gospel is a proclamation of the Cross, the declaration that there is\nno sin, no failure, no set back that is not covered by the Cross of Christ. The Cross\nPage 3 of 3\nProper 21 – year B -2003 – Trinity 16\nstands as a challenge to repent and an invitation to make a fresh start, trusting not in\noursleves but in the Christ who redeemed us.\nThe Cross must lie at the heart of how we see oursleves as a community. Do we see\nourselves as a community of the perfect, erecting barriers to protect ourselves from\nthe imperfect? Or do we see ourselves as a school for sinners, recognising that we all\nfail at times, we are all in need of Christ's forgiving love.\nA few years ago, a Presbyterian minister and myself were discussing this whole issue\nover a cup of coffee and he said, \"I find that I am reviewing my doctrine of marriage\nin the light of my doctrine of forgiveness.\"\nThis is what we as a Church have been doing in recent years as we have reviewed our\nwhole approach to the remarriage of divorced people in Church. As a Church we\ncontinue to uphold the life long nature of marriage but we recognise that are\nsituations where it does not work for a whole number of reasons. The question we\nare left with is one of asking how do we enable people to move on, to make a fresh\nstart within the life of the Church. Yes of course there are tensions, there are\ninconsistencies but in a fallen and hurting world even our best solutions are going to\nbear the mark of the imperfect."
    }
}