{
    "title": "Little Before God",
    "date": "2022-09-06",
    "blurb": "In this sermon, Kevin reflects on the Magnificat and the importance of humility before God. He uses the example of Hyacinth Bucket from the television series 'Keeping up Appearances' to illustrate the futility of social climbing and the importance of acknowledging that we have no claim on God's love. He emphasizes that we must become 'little' before God, acknowledging that everything we have is a gift, and this attitude should extend to our interactions with others, particularly the marginalized and oppressed.",
    "raw_text": "Back in 1989 I left the Parish of Mountmellick in Co Laois to be Rector of Ahoghill & Portglenone, just outside Ballymena. I followed a Rector who had cherished the old Book of Common Prayer, affectionally referred to as the 'Black Book'. He had resisted all efforts by the wider Church to introduce any of the modern language service books.\n\nI quickly realised that any changes would have to be made gently and with sensitivity. We began by introducing on a monthly basis a more informal order of evening service without the traditional canticles.\n\nOn one of these evenings, a couple turned up who would usually come to our morning service. Chatting after the service, Bernie said to me that he had enjoyed the service but 'I missed the Magnificat'. (This Canticle is based on the Gospel passage that we read this morning.) The Magnificat, he went on, reminded him of his childhood, attending Evening Prayer in his home Parish of Ballycastle.\n\nThen as we continued to talk, Bernie remarked, 'When you think about it, the Magnificat may be traditional – but when you read it, it is in fact very radical.' It reminded me that there are passages in the Bible that we know so well that we can stop listening to them. For those of us brought up in the tradition of the Church of Ireland this passage, as it did Bernie, reminds us of Evening Prayer, a quieter, more peaceful service, with not so many attending.\n\nBut when you do take the trouble to take a closer look at it, the Magnificat, the Gospel passage we read this morning, is about a God who turns things upside down, who challenges all efforts to assert our position, our status.\n\nI ask you to leave that thought in your mind and come with me in your imagination to the home of Hyacinth Bucket (Bookay) from the old television series 'Keeping up Appearances'. An invitation has arrived in the morning post to attend a meal in the Town Hall. Poor long-suffering Richard is simply rather pleased that it has come. Such simple pleasures are not enough for Hyacinth – she wants to know what this invitation represents in her long struggle for acceptance in higher society. 'Who else will be there?' – perhaps just as important is the question 'Who won't be there?' After all, if all the neighbours were invited, there won't be much prestige in going. Then there is the question of what she will wear in order to match the social status to which she aspires. Of course, always lurking in the background are her sisters and that dreadful brother-in-law, Onslow, constant reminders of her origins. Of course, her social climbing never quite comes off – she is always left on the edge.\n\nWe laugh at her foolishness but realise that she is a parody of many attitudes that lie just below the surface in ourselves – a striving for acceptance, a striving for prestige, for status.\n\nOf course, this is not a modern phenomenon we see plenty of examples of it in the Gospels. Jesus tells the story of the guest invited to dinner who on arrival assumes one of the better seats, only to be told he needs to make way for someone more important and Jesus' advice 'Whoever humbles themselves will be exalted and whoever exalts himself will be humbled.' The disciples themselves were not immune to this. On occasions we hear of them arguing among themselves as to who will be greatest in the Kingdom of Heaven. On such occasions, Jesus gives them a model of humility – he washes their feet, the task of the lowest household servant; he sets a little child in their midst, saying except you become as a little child, you will not enter the Kingdom of heaven. The model of the servant, of the child, of taking the lowest place at the feast.\n\nWhat he is talking about here is the importance of becoming little before God. The child, the servant, the little ones accept the lowest place, accept direction. To be little before God is to accept that we have no claim on God's love, on God's grace. To be little before God is to acknowledge the reality of grace – that whatever we have, whatever we are, is ultimately a gift.\n\nThis fundamental shift in attitude before God must then go on to be reflected in our attitudes towards others. It is only as we become little before God, that we become sensitive to others who are little – little not by choice but by the harsh realities of life – the poor, the marginalised, the oppressed. In his day, Jesus highlighted those who were little in the society of his day, the poor, the crippled, the blind, the leper, those who were excluded from polite society. A mark of Jesus' ministry was a care and a concern for the very ones society despised. Not a dismissive or condescending care that tossed a few crumbs or spare change their way. But a care that embraced the leper, that reached out to the sinner, that raised the lame to their feet. This is the Jesus of the Magnificat, who lifts up the humble and poor, who sends the rich empty handed away.\n\nAt the heart of Jesus' ministry lies the cross – his ultimate care for humanity, a care that reaches down and raises us up with hands that have born the mark of the nails. As the old hymn reminds us, 'Nothing in my hand I bring, simply to thy cross I cling.'\n\nPassages like the Magnificat, like Jesus washing feet, putting a little child in the midst of the disciples have the effect of leaving me just a little uncomfortable. Like poor Cynthia we can get so caught up in 'Keeping Up Appearances', that we lose sight of the fact that we stand before God simply and solely on the basis of grace. We need, as I say, to become little before God so that we may, in his name and in his power, be enabled to reach out and draw into the Kingdom those who have nothing or, perhaps more important, those who are thought to be nothing in the eyes of the world.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/COGS/Proper/Year C/proper182022Thursday.txt",
        "raw_ocr_content": "Page 1 of 4\nWeek of Proper 18 – Thursday 6th September 2022 – ‘Magnificat – little before God’ - COGS\nBack in 1989 I left the Parish of Mountmellick in Co Laois to be Rector of\nAhoghill & Portglenone, just outside Ballymena. I followed a Rector who had\ncherished the old Book of Common Prayer, affectionally referred to as the\n‘Black Book’. He had resisted all efforts by the wider Church to introduce any\nof the modern language service books.\nI quickly realised that any changes would have to be made gently and with\nsensitivity. We began by introducing on a monthly basis a more informal order\nof evening service without the traditional canticles.\nOn one of these evenings, a couple turned up who would usually come to our\nmorning service. Chatting after the service, Bernie said to me that he had\nenjoyed the service but ‘I missed the Magnificat’. (This Canticle is based on\nthe Gospel passage that we read this morning.) The Magnificat, he went on,\nreminded him of his childhood, attending Evening Prayer in his home Parish of\nBallycastle.\nThen as we continued to talk, Bernie remarked, ‘When you think about it, the\nMagnificat may be traditional – but when you read it, it is in fact very radical.’\nIt reminded me that there are passages in the Bible that we know so well that\nwe can stop listening to them. For those of us brought up in the tradition of the\nChurch of Ireland this passage, as it did Bernie, reminds us of Evening Prayer,\na quieter, more peaceful service, with not so many attending.\nPage 2 of 4\nWeek of Proper 18 – Thursday 6th September 2022 – ‘Magnificat – little before God’ - COGS\nBut when you do take the trouble to take a closer look at it, the Magnificat, the\nGospel passage we read this morning, is about a God who turns things upside\ndown, who challenges all efforts to assert our position, our status.\nI ask you to leave that thought in your mind and come with me in your\nimagination to the home of Hyacinth Bucket (Bookay) from the old television\nseries ‘Keeping up Appearances’. An invitation has arrived in the morning\npost to attend a meal in the Town Hall. Poor long-suffering Richard is simply\nrather pleased that it has come. Such simple pleasures are not enough for\nHyacinth – she wants to know what this invitation represents in her long\nstruggle for acceptance in higher society. ‘Who else will be there?’ – perhaps\njust as important is the question ‘Who won’t be there?’ After all, if all the\nneighbours were invited, there won’t be much prestige in going. Then there is\nthe question of what she will wear in order to match the social status to which\nshe aspires. Of course, always lurking in the background are her sisters and\nthat dreadful brother-in-law, Onslow, constant reminders of her origins. Of\ncourse, her social climbing never quite comes off – she is always left on the\nedge.\nWe laugh at her foolishness but realise that she is a parody of many attitudes\nthat lie just below the surface in ourselves – a striving for acceptance, a striving\nfor prestige, for status.\nOf course, this is not a modern phenomenon we see plenty of examples of it in\nthe Gospels. Jesus tells the story of the guest invited to dinner who on arrival\nassumes one of the better seats, only to be told he needs to make way for\nPage 3 of 4\nWeek of Proper 18 – Thursday 6th September 2022 – ‘Magnificat – little before God’ - COGS\nsomeone more important and Jesus’ advice ‘Whoever humbles themselves will\nbe exalted and whoever exalts himself will be humbled.’ The disciples\nthemselves were not immune to this. On occasions we hear of them arguing\namong themselves as to who will be greatest in the Kingdom of Heaven. On\nsuch occasions, Jesus gives them a model of humility – he washes their feet,\nthe task of the lowest household servant; he sets a little child in their midst,\nsaying except you become as a little child, you will not enter the Kingdom of\nheaven. The model of the servant, of the child, of taking the lowest place at the\nfeast.\nWhat he is talking about here is the importance of becoming little before God.\nThe child, the servant, the little ones accept the lowest place, accept direction.\nTo be little before God is to accept that we have no claim on God’s love, on\nGod’s grace. To be little before God is to acknowledge the reality of grace –\nthat whatever we have, whatever we are, is ultimately a gift.\nThis fundamental shift in attitude before God must then go on to be reflected in\nour attitudes towards others. It is only as we become little before God, that we\nbecome sensitive to others who are little – little not by choice but by the harsh\nrealities of life – the poor, the marginalised, the oppressed. In his day, Jesus\nhighlighted those who were little in the society of his day, the poor, the\ncrippled, the blind, the leper, those who were excluded from polite society. A\nmark of Jesus’ ministry was a care and a concern for the very ones society\ndespised. Not a dismissive or condescending care that tossed a few crumbs or\nspare change their way. But a care that embraced the leper, that reached out to\nPage 4 of 4\nWeek of Proper 18 – Thursday 6th September 2022 – ‘Magnificat – little before God’ - COGS\nthe sinner, that raised the lame to their feet. This is the Jesus of the Magnificat,\nwho lifts up the humble and poor, who sends the rich empty handed away.\nAt the heart of Jesus’ ministry lies the cross – his ultimate care for humanity, a\ncare that reaches down and raises us up with hands that have born the mark of\nthe nails. As the old hymn reminds us, ‘Nothing in my hand I bring, simply to\nthy cross I cling.’\nPassages like the Magnificat, like Jesus washing feet, putting a little child in\nthe midst of the disciples have the effect of leaving me just a little\nuncomfortable. Like poor Cynthia we can get so caught up in ‘Keeping Up\nAppearances’, that we lose sight of the fact that we stand before God simply\nand solely on the basis of grace. We need, as I say, to become little before God\nso that we may, in his name and in his power, be enabled to reach out and draw\ninto the Kingdom those who have nothing or, perhaps more important, those\nwho are thought to be nothing in the eyes of the world."
    }
}