{
    "title": "Who Am I?",
    "date": "2015-09-13",
    "blurb": "Kevin explores the question 'Who do you say that I am?' through the lens of personal inspiration and influence. He compares admiration of public figures to the deeper, more personal impact of family and individuals who shape our lives. Ultimately, he points to Jesus as the Christ, whose life, death, and resurrection bring us closest to encountering God himself.",
    "raw_text": "### PROPER 19 – Year B – 2015 – Trinity 15\n\n**Family Service**\n\nWho do you say that I am? - We've been following the story of Jesus from his birth – what is special about him. People admire him – but then we admire lots of people – let's look at some. We might recognise these people, we might admire them – Jesus is looking for more than that.\n\nThere are people who inspire us, who make us think deeply about life, about issues. This can be very personal – the person who inspires me might not be the one who inspires you. Here are three people who have inspired me down through the years:\n\n> Michael Ramsey\n> Ernest Walton\n> Gordon Wilson\n\nJesus certainly inspired people – but again there is more to him than that. Then there are those people who have made us the people we are. Our parents, Mum and Dad, quite apart from inheriting their looks, something of their mannerisms, their character – it is from our parents, in our families, that we first learn the basic lessons of life – they are the ones who have encouraged, have loved.\n\nIt is in this family relationship that we start getting close to an answer to that question, 'Who do you say that I am?' As Peter answers 'You are the Christ, the Messiah.' In Jesus, in his life, death and resurrection we come close to, we encounter God himself. There are people we admire, there are people who inspire us – but there is something about this Jesus that compels me to declare – Jesu, Jesu, I thee adore. Help me love thee more and more.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper192015famserv.txt",
        "raw_ocr_content": "Page 1 of 2\nPROPER 19 – Year B – 2015 – Trinity 15\nFamily Service\nNeed Powerpoint – proper192015 – Family Service – Who am I\nStart with slide – Jesus – Who do you say that I am\nWho do you say that I am? - We’ve been following the story of Jesus\nfrom his birth – what is special about him.\nPeople admire him – but then we admire lots of people – let’s look at\nsome\nSlides of Paul O’Connell, Bing Crosby, Elvis, Wayne Rooney, One\nDirection\nWe might recognise these people, we might admire them – Jesus is\nlooking for more than that.\nThere are people who inspire us, who make us think deeply about life,\nabout issues. This can be very personal – the person who inspires me\nmight not be the one who inspires you – here are three people who\nhave inspired me down through the years.\nMichael Ramsey\nErnest Walton\nGordon Wilson\nJesus certainly inspired people – but again there is more to him than\nthat.\nThen there are those people who have made us the people we are.\nThere are our parents.\nMum and Dad\nQuite apart from inheriting their looks, something of their\nmannerisms, their character – it is from our parents, in our families,\nPage 2 of 2\nPROPER 19 – Year B – 2015 – Trinity 15\nFamily Service\nNeed Powerpoint – proper192015 – Family Service – Who am I\nthat we first learn the basic lessons of life – they are the ones who\nhave encouraged, have loved.\nIt is in this family relationship that we start getting close to an answer\nto that question, ‘Who do you say that I am?’\nJesus – who do you say that I am?\nAs Peter answers ‘You are the Christ, the Messiah.’\nIn Jesus, in his life, death and resurrection we come close to, we\nencounter God himself.\nThere are people we admire, there are people who inspires us – but\nthere is something about this Jesus that compels me to declare –\nJesu, Jesu, I thee adore. Help me love thee more and more."
    }
}