{
    "title": "The Music of Eternity",
    "date": "2010-09-19",
    "blurb": "In this sermon, Kevin discusses the role of faith and the Church in contemporary society, drawing on the writings of Chief Rabbi Dr Jonathan Sacks. He explores the dangers of faith groups becoming too close to power, citing historical examples, and emphasizes the importance of faith voices being heard in places of power. The sermon concludes with a call for individuals to be attentive to 'the music of eternity' in their daily lives.",
    "raw_text": "While we were away, I took the opportunity to start re-reading a book by the Chief Rabbi of Great Britain and the Commonwealth, Dr Jonathan Sacks, 'The Dignity of Difference'. This book was written in the aftermath of terrible happenings of 9/11 in New York and the growing polarisation of religious communities and the pressures of globalisation not just in the economic sphere but in the sphere society and faith.\n\nHe drew a comparison between the range of communications that are available to us now compared to fifty years ago. In the UK there were two TV channels which were watched by everybody so everyone was exposed to a whole range of political, social and religious opinions. Now in the era of multichannel TV you watch the channels that will reinforce your own view – for example those who have a sympathy for 'Tea Party' politics in the United States will watch Fox News, which will tell them how awful Obama is. Jonathan Sacks argues the importance of listening, of dialogue, of recognising truth in one who may hold a radically different position to me.\n\nAs I read over our Gospel reading and reflected on what Jonathan Sacks is saying in this book, I find myself asking what is the place of faith, what is the place of Church in contemporary society? Do we have anything to offer and how can we offer it? History provides us with a host of examples of faith groups that have got this horribly wrong as they have become too close to the seat of power.\n\nIn pre-War Germany, the message of the national Church, the Reichskirke, was broadly supportive of the philosophy of National Socialism, provoking the formation of the 'Confessing Church' lead by Dietrich Boenhoffer. In post-War South Africa the Dutch Reformed Church, arguing from the story of the Tower of Babel, provided theological support for the system of Apartheid – a position it has now formally repented of. The Church distorted its message to suit the dominant political philosophy of the day.\n\nIn the Ireland of the 1950’s the Church was too powerful, demanding a dominant voice in the formation of social policy, which triggered the downfall of the then Minister of Health, the late Dr Noel Browne over the very modest provisions of the 'Mother and Child Scheme' when the Hierarchy informed the Government that the Scheme was contrary to Catholic Social Teaching.\n\nSo what is to be the contribution of the of the voice of faith in contemporary society and how is it to be delivered. At the start of his book, Jonathan Sacks refers to a multifaith meeting he attended at the headquarters of the United Nations 8 months before the tragic events of 9/11. He was struck by the variety of those present; in the same chamber there were imams, rabbis like himself, Buddhists, Hindus, Sikhs, native Americans along with the whole panoply of Christian groups, each in their own traditional dress. It all took place in the debating chamber of the United Nations headquarters. The contrast between that group and the politicians that usually met there made a deep impression on Jonathan Sacks. He wrote of that occasion;\n\n>'In the great conference chamber normally reserved for politicians debating the issues of the day, here were men and women who devoted their lives not to the noise of now but to the music of eternity, not to the shifting sands of the international arena but to the inner landscape of the human spirit.' (The Dignity of Difference Jonathan Sacks p5)\n\nI just want to stay with that contrast between 'the noise of now' and 'the music of eternity'. As I said the faith leaders met in the main debating chamber of the United Nations in New York in which the political leaders of the world conduct their sometimes acrimonious debates. That in itself emphasises for me that the voices of faith need to go to the places of power, that the music of eternity may be heard alongside the noise of now in the places where decisions are made that affect us all. There is a long scriptural tradition of this:\n\nMoses appeared before Pharaoh to demand the freedom of his people.\n\nNathan went to rebuke David about his adulterous relationship with Bathsheba.\n\nThe prophets delivered their often uncomfortable message in the courts of kings.\n\nBut they went not to wield power but to speak the word of truth, 'Thus says the Lord …'.\n\nSo let us turn for a moment to our Gospel reading, the parable of the dishonest manager. This raises a whole range of issues and leaves room for endless discussion. But in the light of what we have been thinking about, I just want to make the observation that here was a man in a position of great trust and responsibility, whose values had been skewed. Priority was given to self rather than to faithfulness. It is a timeless story of human frailty in the face of temptation, of greed played out in every generation. To go back to the language of the Chief Rabbi, the man was more attuned to the noise of now rather than the music of eternity.\n\nHow is the music of eternity to be heard in the offices, the shops, the board rooms, the streets and homes of our community? Over the past few days, in the course of the Pope’s visit to Britain, religious leaders of all denominations have spoken of the need for the voice of faith to be heard in the public square.\n\nFew of us have access to the places of power, be they political or economic but we live in communities, we raise our families, we work in offices, we invest our savings, we participate in the political process – so we are the ones through whom the music of eternity may be heard in communities, the places of business and commerce, the homes of our country.\n\nBut if we are to be the ones through whom the music of eternity is to sound, we must be attentive to that music ourselves – set time aside of worship, for reflection, for quiet. But not only that, it is to recognise the presence of God in the other, in the different, to acknowledge that this world is God’s world, to treat the creation with respect - this world is given for our use not our abuse. It is to realise that we encounter God in the people we live with, in those we love, in those we find it more difficult to love – they like us are created in the image of God. We must encourage each other, provide opportunities for each other, whether it be in the context of a quiet reflective service or in the more informal structure of a Family Service, that each may hear and respond to the God who made us and calls us to his service.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/proper202010.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 20 – 2010 – year C – Trinity 16\nWhile we were away, I took the opportunity to start re-reading a book by the Chief Rabbi\nof Great Britain and the Commonwealth, Dr Jonathan Sacks, ‘The Dignity of Difference’.\nThis book was written in the aftermath of terrible happenings of 9/11 in New York and the\ngrowing polarisation of religious communities and the pressures of globalisation not just\nin the economic sphere but in the sphere society and faith. He drew a comparison between\nthe range of communications that are available to us now compared to fifty years ago. In\nthe UK there were two TV channels which were watched by everybody so everyone was\nexposed to a whole range of political, social and religious opinions. Now in the era of\nmultichannel TV you watch the channels that will reinforce your own view – for example\nthose who have a sympathy for ‘Tea Party’ politics in the United States will watch Fox\nNews, which will tell them how aweful Obama is. Jonathan Sacks argues the importance\nof listening, of dialogue, of recognising truth in one who may hold a radically different\nposition to me.\nAs I read over our Gospel reading and reflected on what Jonathan Sacks is saying in this\nbook, I find myself asking what is the place of faith, what is the place of Church in\ncontemporary society? Do we have anything to offer and how can we offer it? History\nprovides us with a host of examples of faith groups that have got this horribly wrong as\nthey have become too close to the seat of power.\nIn pre-War Germany, the message of the national Church, the Reichskirke, was broadly\nsupportive of the philosophy of National Socialism, provoking the formation of the\n‘Confessing Church’ lead by Dietrich Boenhoffer. In post-War South Africa the Dutch\nReformed Church, arguing from the story of the Tower of Babel, provided theological\nsupport for the system of Apartheid – a position it has now formally repented of. The\nChurch distorted its message to suit the dominant political philosophy of the day.\nIn the Ireland of the 1950’s the Church was too powerful, demanding a dominant voice in\nthe formation of social policy, which triggered the downfall of the then Minister of Health,\nthe late Dr Noel Browne over the very modest provisions of the ‘Mother and Child\nScheme’ when the Hierarchy informed the Government that the Scheme was contrary to\nCatholic Social Teaching.\nPage 2 of 3\nPROPER 20 – 2010 – year C – Trinity 16\nSo what is to be the contribution of the of the voice of faith in contemporary society and\nhow is it to be delivered. At the start of his book, Jonathan Sacks refers to a multifaith\nmeeting he attended at the headquarters of the United Nations 8 months before the tragic\nevents of 9/11. He was struck by the variety of those present; in the same chamber there\nwere imams, rabbis like himself, Budhists, Hindus, Sikhs, native Americans along with the\nwhole panoply of Christian groups, each in their own traditional dress. It all took place in\nthe debating chamber of the United Nations headquarters. The contrast between that\ngroup and the politicians that usually met there made a deep impression on Jonathan\nSacks. He wrote of that occasion;\n‘In the great conference chamber normally reserved for politicians\ndebating the issues of the day, here were men and women who\ndevoted their lives not to the noise of now but to the music of\neternity, not to the shifting sands of the international arena but to the\ninner landscape of the human spirit.’ (The Dignity of Difference\nJonathan Sacks p5)\nI just want to stay with that contrast between ‘the noise of now’ and ‘the music of\neternity’. As I said the faith leaders met in the main debating chamber of the United\nNations in New York in which the political leaders of the world conduct their sometimes\nacrimonious debates. That in itself emphasises for me that the voices of faith need to go to\nthe places of power, that the music of eternity may be heard alongside the noise of now in\nthe places where decisions are made that affect us all. There is a long scriptural tradition\nof this:\nMoses appeared before Pharaoh to demand the freedom of his people.\nNathan went to rebuke David about his adulterous relationship with Bathsheba.\nThe prophets delivered their often uncomfortable message in the courts of kings.\nBut they went not to wield power but to speak the word of truth, ‘Thus says the Lord …’.\nSo let us turn for a moment to our Gospel reading, the parable of the dishonest manager.\nThis raises a whole range of issues and leaves room for endless discussion. But in the\nlight of what we have been thinking about, I just want to make the observation that here\nwas a man in a position of great trust and responsibility, whose values had been skewed.\nPage 3 of 3\nPROPER 20 – 2010 – year C – Trinity 16\nPriority was given to self rather than to faithfulness. It is a timeless story of human frailty\nin the face of temptation, of greed played out in every generation. To go back to the\nlanguage of the Chief Rabbi, the man was more attuned to the noise of now rather than the\nmusic of eternity.\nHow is the music of eternity to be heard in the offices, the shops, the board rooms, the\nstreets and homes of our community? Over the past few days, in the course of the Pope’s\nvisit to Britain, religious leaders of all denominations have spoken of the need for the\nvoice of faith to be heard in the public square.\nFew of us have access to the places of power, be they political or economic but we live in\ncommunities, we raise our families, we work in offices, we invest our savings, we\nparticipate in the political process – so we are the ones through whom the music of eternity\nmay be heard in communities, the places of business and commerce, the homes of our\ncountry.\nBut if we are to be the ones through whom the music of eternity is to sound, we must be\nattentive to that music ourselves – set time aside of worship, for reflection, for quiet. But\nnot only that, it is to recognise the presence of God in the other, in the different, to\nacknowledge that this world is God’s world, to treat the creation with respect - this world\nis given for our use not our abuse. It is to realise that we encounter God in the people we\nlive with, in those we love, in those we find it more difficult to love – they like us are\ncreated in the image of God. We must encourage each other, provide opportunities for\neach other, whether it be in the context of a quiet reflective service or in the more informal\nstructure of a Family Service, that each may hear and respond to the God who made us and\ncalls us to his service."
    }
}