{
    "title": "Finding God in Suffering",
    "date": "2015-10-18",
    "blurb": "In the wake of tragedies, Kevin reflects on the presence of God during times of suffering. Drawing from the book of Job and personal stories, he emphasizes the importance of seeking God's presence rather than explanations. He highlights the Christian belief that meaning is found in the life, death, and resurrection of Christ, and the comfort of approaching God with our pain.",
    "raw_text": "In the midst of all the excitement of the Rugby World Cup, last weekend was marked by two tragedies that have left their mark on this country this week. First there was that tragic fire in the halting site in Carrickmines in which five adults and five children lost their lives. Then there was the killing of a young Garda officer as he sought to secure the safety of a young woman in a situation of domestic violence, leaving behind a young wife and small children.\n\nWhat do you say to people who have suffered such tragic loss? What does our faith have to say in such situations? Where is God? Where is God when it hurts? That is one of the questions that lies behind the book Job that our Old Testament Lesson is drawn from, that we would have read from last Sunday if it had not been our Harvest Thanksgiving. It is a story of a man facing unjust suffering - running through this whole book is a search for meaning, why is this happening, where is God. At its heart is a series of dialogues between Job and friends who have come to comfort him, to help his understand what is happening to him. All this is of no help to Job - they cannot answer his basic quest for meaning, where is God in all this.\n\nAs I thought on this, my mind turned to one of the stories that came out of the Holocaust. It is told by Elie Wiesel. He recalled a time when the inmates of the camp were force to watch the hanging of a young Jewish boy.\n\n> Just before the hanging, Elie heard someone standing behind him ask;\n> 'Where is God? Where is he?' The prisoners were forced to watch the hanging and then were marched past the gallows on which the young boy was hanging. Behind him, Elie heard the same voice ask, 'Where is God now?' Wiesel writes: 'And I heard a voice within me, answer him, 'Where is he? Here he is - he is hanging here on this gallows.'\n\nThere is a profound truth in that remark, that cuts through all those awful platitudes that are often offered to those facing great suffering - it's all in his plan; God must love them very much to spare them any more pain on earth. I think back on the father of a young man who had committed suicide telling me of a neighbour who he hardly knew, coming across to him and simply taking him by the hand and saying 'I'm hurting for you.' He wasn't offering explanations, he was simply identifying with Ed in his pain.\n\nSo we are not talking of God as the source of all our pain. Rather we come to see God as with us, alongside us, identifying with us in our pain. That gives me a freedom to come before God in my pain, to express my pain, to pour out all the hurt and confusion. I often find myself turning to a little book I have at home, 'Out of the deep'. It is a series of reflections on finding God in the dark places of life. While he was still at school, the author suffered the loss of his father. For a while he seemed to cope. He speaks of one afternoon when he was studying music in Rome; it all seemed to come in on him when he was visiting the magnificent Church of St Paul without the walls one wet December afternoon.\n\n> 'When I went there ... teenagers were playing football in the park and hurtling around the piazza on motor scooters. I was suddenly gripped by a terrible loneliness; and when I entered the vast and dimly lit basilica with its eighty marble columns and gorgeous mosaics I was overwhelmed, not just with awe but with anger, at the God who had taken away my father and yet seemed to enjoy dwelling in buildings of such icy magnificence; anger too at a world which could go happily about its business as heedless of my loss as God was. I gave vent to my feelings in tears of fury and self pity; and neither the laughing footballers nor the God of the great basilica took any notice. Yet I was left with a strangely clear awareness that it was all right to be angry and lonely and to say so - and that, in some inexplicable sense, what I had said had been heard.' (Out of the Deep - page 2)\n\nIt was alright to be angry ... and that in some inexplicable sense, what I had said had been heard. Like Job he didn't get any answers, but he felt he had been heard by God. He had broken through the isolation of the opening words of Psalm 22, 'My God, my God, why have you abandoned me?', that cry of loneliness attributed to Jesus in the darkness of Calvary.\n\nTherein lies our point of contact. As we are reminded as we continue in our reading from the letter to the Hebrews this morning. The God we worship is not remote from our experiences of pain and suffering, he is a God who knows what it is all about, who has experienced in the person of Jesus all the trials and tribulations of this mortal life. Some one we can indeed approach in confidence to find grace and mercy in time of need.\n\nJob's friends were encouraging Job to look for meaning to his suffering in something that had happened in Job's life. Job knew instinctively that that was the wrong approach - he sought meaning by seeking the presence of God. At the core of the Christian Gospel is a similar recognition that ultimately meaning and purpose are not to be found in anything that has happened in my life - rather we find that ultimately that meaning is to be found in something that happened in God's life, in the death and resurrection of Christ, in fellowship with him, trusting in him, we approach with confidence the throne of grace.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper242015.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 24 Year B – 2015 – Trinity 20\nIn the midst of all the excitement of the Rugby World Cup, last weekend was\nmarked by two tragedies that have left their mark on this country this week.\nFirst there was that tragic fire in the halting site in Carrickmines in which five\nadults and five children lost their lives. Then there was the killing of a young\nGarda officer as he sought to secure the safety of a young woman in a situation\nof domestic violence, leaving behind a young wife and small children.\nWhat do you say to people who have suffered such tragic loss? What does our\nfaith have to say in such situations? Where is God? Where is God when it\nhurts? That is one of the questions that lies behind the book Job that our Old\nTestament Lesson is drawn from, that we would have read from last Sunday if\nit had not been our Harvest Thanksgiving. It is a story of a man facing unjust\nsuffering – running through this whole book is a search for meaning, why is\nthis happening, where is God. At its heart is a series of dialogues between Job\nand friends who have come to comfort him, to help his understand what is\nhappening to him. All this is of no help to Job – they cannot answer his basic\nquest for meaning, where is God in all this.\nAs I thought on this, my mind turned to one of the stories that came out of the\nHolocaust. It is told by Elie Wiesel. He recalled a time when the inmates of\nthe camp were force to watch the hanging of a young Jewish boy.\nJust before the hanging, Elie heard someone standing behind him ask;\n‘Where is God? Where is he?’ The prisoners were forced to watch the\nhanging and then were marched past the gallows on which the young\nboy was hanging. Behind him, Elie heard the same voice ask, ‘Where\nis God now?’ Wiesel writes: ‘And I heard a voice within me, answer\nhim, ‘Where is he? Here he is – he is hanging here on this gallows.’\nPage 2 of 3\nPROPER 24 Year B – 2015 – Trinity 20\nThere is a profound truth in that remark, that cuts through all those awful\nplatitudes that are often offered to those facing great suffering – its all in his\nplan; God must love them very much to spare them any more pain on earth. I\nthink back on the father of a young man who had committed suicide telling me\nof a neighbour who he hardly knew, coming across to him and simply taking\nhim by the hand and saying ‘I’m hurting for you.’. He wasn’t offering\nexplanations, he was simply identifying with Ed in his pain.\nSo we are not talking of God as the source of all our pain. Rather we come to\nsee God as with us, alongside us, identifying with us in our pain. That gives\nme a freedom to come before God in my pain, to express my pain, to pour out\nall the hurt and confusion. I often find myself turning to a little book I have at\nhome, ‘Out of the deep’. It is a series of reflections on finding God in the dark\nplaces of life. While he was still at school, the author suffered the loss of his\nfather. For a while he seemed to cope. He speaks of one afternoon when he\nwas studying music in Rome; it all seemed to come in on him when he was\nvisiting the magnificent Church of St Paul without the walls one wet December\nafternoon.\n‘When I went there …. teenagers were playing football in the park and\nhurtling around the piazza on motor scooters. I was suddenly gripped\nby a terrible loneliness; and when I entered the vast and dimly lit\nbasilica with its eighty marble columns and gorgeous mosaics I was\noverwhelmed, not just with awe but with anger, at the God who had\ntaken away my father and yet seemed to enjoy dwelling in buildings of\nsuch icy magnificence; anger too at a world which could go happily\nabout its business as heedless of my loss as God was. I gave vent to\nmy feelings in tears of fury and self pity; and neither the laughing\nfootballers nor the God of the great basilica took any notice. Yet I was\nleft with a strangely clear awareness that it was all right to be angry\nand lonely and to say so – and that, in some inexplicable sense, what I\nhad said had been heard.’ (Out of the Deep – page 2)\nPage 3 of 3\nPROPER 24 Year B – 2015 – Trinity 20\nIt was alright to be angry … and that in some inexplicable sense, what I had\nsaid had been heard. Like Job he didn’t get any answers, but he felt he had\nbeen heard by God. He had broken through the isolation of the opening words\nof Psalm 22, ‘My God, my God, why have you abandoned me?’, that cry of\nloneliness attributed to Jesus in the darkness of Calvary.\nTherein lies our point of contact. As we are reminded as we continue in our\nreading from the letter to the Hebrews this morning. The God we worship is\nnot remote from our experiences of pain and suffering, he is a God who knows\nwhat it is all about, who has experienced in the person of Jesus all the trials and\ntribulations of this mortal life. Some one we can indeed approach in\nconfidence to find grace and mercy in time of need.\nJob’s friends were encouraging Job to look for meaning to his suffering in\nsomething that had happened in Job’s life. Job knew instinctively that that was\nthe wrong approach – he sought meaning by seeking the presence of God. At\nthe core of the Christian Gospel is a similar recognition that ultimately\nmeaning and purpose are not to be found in anything that has happened in my\nlife – rather we find that ultimately that meaning is to be found in something\nthat happened in God’s life, in the death and resurrection of Christ, in\nfellowship with him, trusting in him, we approach with confidence the throne\nof grace."
    }
}