{
    "title": "The Essence of Prayer",
    "date": "2019-07-28",
    "blurb": "Kevin explores the concept of prayer as more than just talking to oneself. He delves into the expectations and feelings associated with unanswered prayers and the idea of 'thinking things through before God.' He discusses the different levels of thinking in prayer—passionate, compassionate, and responsible—and how these lead to action and a life aligned with God's purposes.",
    "raw_text": "PROPER 12 – 2019 – Trinity 6\n\nI remember many years ago going to see a film one night starring Peter O’Toole, called 'The Ruling Class'. The story was a caricature of an English aristocratic family that had lost all touch with reality. The father, who longed for the return of Empire when foreigners knew their place dies suddenly in dubious circumstances and he is succeeded by his eldest son, a charming young man apart from the fact that he is convinced he is God. As the film progressed his understanding of who he was swung from what he perceived as the New Testament God of love and forgiveness and more towards the sterner, Old Testament God of judgement and punishment. During a stay in an upmarket, private clinic he was asked by his doctor why he thought he was God. To which he replied, 'I find that when I pray, I realise I am simply talking to myself.'\n\nOur Gospel lesson has raised this whole topic of prayer and with it the question in our own minds, 'What are we doing when we pray?' Is it really more than just a matter of simply talking to ourselves?\n\nWhat are our expectations? What are our feelings when we perceive that our prayers have not worked, have gone unanswered, and have been ignored? We can get annoyed with God. Or, if we feel that we cannot do that, we then feel that there must be something wrong with us – my faith is not strong enough, I am not worthy. We get confused and, in truth, we often just give up on prayer altogether.\n\nI often find myself going back to a conversation I had with the late Canon Billy Wynne. Billy, who was Vicar of St Ann’s at the time, was a great encourager of younger clergy at the time. I remember chatting to him on the edge of a clergy conference. He said he had come more and more to the conclusion that for him a big bit of prayer was a matter of 'thinking things through before God'. Today I just want to explore the concept of prayer in terms of thinking things through before God.\n\nA lot of our thinking in this technical age is analytical – but there is a whole area of thinking that engages at a different level – a thinking that looks at things as they are and how they might have been; that reflects not just on facts but also on values and ideals; a type of thinking that has been called passionate thinking. At times there is a sense of wonder and thankfulness in the face of some great achievement or possibility – at others a sense of disappointment or regret at what could have been, perhaps tinged with a sense of shame at our own shortcomings. In the context of prayer this passionate thinking manifests itself in thanksgiving and penitence.\n\nBut prayer goes further than this – it extends into what has been called compassionate thinking. In this we go out from ourselves to stand alongside the other in their feelings of aspiration and need. In Christian prayer this involves the whole business of intercessory prayer, a compassionate confrontation with the needs of the other in the presence of God. There is no doubt such prayer opens our hearts and minds to the needs of others – but what about the person for whom we pray? Are we just trying to manipulate God, to get him to see things our way?\n\nWhat am I doing when I pray for someone? I suppose fundamentally, in intercessory prayer, I bring those people and concerns for which I pray into the context of the creative and healing power of God. I came across a lovely expression; 'Prayer, as petition and intercession, helps to make human reality porous to the divine reality.' Now in many ways that sort of activity is a dangerous activity. Intercessory prayer, compassionate thinking, expressing real concern for the other, is not for those who are wrapped up in themselves; it opens me up to claims upon myself to follow through on my prayer in terms of action – action in terms of changed attitudes, in terms of personal commitment.\n\nPrayer then moves from passionate thinking, through to compassionate thinking, through to responsible thinking. I need to be prepared to be one through whom prayer is answered, one through whom God acts in a particular situation or set of circumstances. It is not enough just to pray for peace, I must be prepared to be one who promotes peace. I may pray for healing of divisions in our society but such prayers are empty if I am not prepared in my own situation to reach out to those who are different, to the stranger, to the difficult.\n\nWe are getting here a picture of prayer that takes us out of ourselves – if I am serious in prayer, I am going to be looking beyond myself, beyond my immediate interests, beyond my immediate concerns (though these will form a proper part of my prayer) towards the needs of others and the claim of God upon my life.\n\nPrayer then, as passionate thinking, as compassionate thinking, as responsible thinking is thinking big. It is setting my life, my hopes and my fears, the things that happen, the big and small tragedies that I really do not understand, the people and situations for whom I pray within the overall context of the purposes of God.\n\nGracious God, take our minds and think through them; take our hands and work through them; take our hearts and set them on fire. Amen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper122019.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 12 – 2019 – Trinity 6\nI remember many years ago going to see a film one night starring Peter\nO’Toole, called ‘The Ruling Class’. The story was a caricature of an English\naristocratic family that had lost all touch with reality. The father, who longed\nfor the return of Empire when foreigners knew their place dies suddenly in\ndubious circumstances and he is succeeded by his eldest son, a charming young\nman apart from the fact that he is convinced he is God. As the film progressed\nhis understanding of who he was swung from what he perceived as the New\nTestament God of love and forgiveness and more towards the sterner, Old\nTestament God of judgement and punishment. During a stay in an upmarket,\nprivate clinic he was asked by his doctor why he thought he was God. To\nwhich he replied, ‘I find that when I pray, I realise I am simply talking to\nmyself.’\nOur Gospel lesson has raised this whole topic of prayer and with it the question\nin our own minds, ‘What are we doing when we pray?’ Is it really more than\njust a matter of simply talking to ourselves?\nWhat are our expectations? What are our feelings when we perceive that our\nprayers have not worked, have gone unanswered, and have been ignored? We\ncan get annoyed with God. Or, if we feel that we cannot do that, we then feel\nthat there must be something wrong with us – my faith is not strong enough, I\nam not worthy. We get confused and, in truth, we often just give up on prayer\naltogether.\nI often find myself going back to a conversation I had with the late Canon Billy\nWynne. Billy, who was Vicar of St Ann’s at the time, was a great encourager\nof younger clergy at the time. I remember chatting to him on the edge of a\nclergy conference. He said he had come more and more to the conclusion that\nPage 2 of 3\nPROPER 12 – 2019 – Trinity 6\nfor him a big bit of prayer was a matter of ‘thinking things through before\nGod’. Today I just want to explore the concept of prayer in terms of thinking\nthings through before God.\nA lot of our thinking in this technical age is analytical – but there is a whole\narea of thinking that engages at a different level – a thinking that looks at\nthings as they are and how they might have been; that reflects not just on facts\nbut also on values and ideals; a type of thinking that has been called passionate\nthinking. At times there is a sense of wonder and thankfulness in the face of\nsome great achievement or possibility – at others a sense of disappointment or\nregret at what could have been, perhaps tinged with a sense of shame at our\nown shortcomings. In the context of prayer this passionate thinking manifests\nitself in thanksgiving and penitence.\nBut prayer goes further than this – it extends into what has been called\ncompassionate thinking. In this we go out from ourselves to stand alongside\nthe other in their feelings of aspiration and need. In Christian prayer this\ninvolves the whole business of intercessory prayer, a compassionate\nconfrontation with the needs of the other in the presence of God. There is no\ndoubt such prayer opens our hearts and minds to the needs of others – but what\nabout the person for whom we pray? Are we just trying to manipulate God, to\nget him to see things our way?\nWhat am I doing when I pray for someone? I suppose fundamentally, in\nintercessory prayer, I bring those people and concerns for which I pray into the\ncontext of the creative and healing power of God. I came across a lovely\nexpression; ‘Prayer, as petition and intercession, helps to make human reality\nporous to the divine reality.’ Now in many ways that sort of activity is a\nPage 3 of 3\nPROPER 12 – 2019 – Trinity 6\ndangerous activity. Intercessory prayer, compassionate thinking, expressing\nreal concern for the other, is not for those who are wrapped up in themselves; it\nopens me up to claims upon myself to follow through on my prayer in terms of\naction – action in terms of changed attitudes, in terms of personal commitment.\nPrayer then moves from passionate thinking, through to compassionate\nthinking, through to responsible thinking. I need to be prepared to be one\nthrough whom prayer is answered, one through whom God acts in a particular\nsituation or set of circumstances. It is not enough just to pray for peace, I must\nbe prepared to be one who promotes peace. I may pray for healing of divisions\nin our society but such prayers are empty if I am not prepared in my own\nsituation to reach out to those who are different, to the stranger, to the difficult\nWe are getting here a picture of prayer that takes us out of ourselves – if I am\nserious in prayer, I am going to be looking beyond myself, beyond my\nimmediate interests, beyond my immediate concerns (though these will form a\nproper part of my prayer) towards the needs of others and the claim of God\nupon my life.\nPrayer then, as passionate thinking, as compassionate thinking, as responsible\nthinking is thinking big. It is setting my life, my hopes and my fears, the\nthings that happen, the big and small tragedies that I really do not understand,\nthe people and situations for whom I pray within the overall context of the\npurposes of God.\nGracious God, take our minds and think through them; take our hands and\nwork through them; take our hearts and set them on fire. Amen."
    }
}