{
    "title": "Sunday Prayers",
    "date": "2022-10-02",
    "blurb": "This sermon is a series of prayers for peace, unity, salvation, the Church, the world, and the local community. It includes prayers for the environment, the vulnerable, the oppressed, and the dying. The sermon also acknowledges the ongoing struggles in Ukraine and the personal loss of the Rector.",
    "raw_text": "Sunday 2nd October 2022\n\nPrayers\n\nFor the peace that comes from God alone,\nfor the unity of all peoples,\nand for our salvation,\nLord in your mercy\nHear our prayer\n\nFor the Church of Christ, for George our Bishop, for this Parish and all churches in this area and for the whole people of God,\nLord in your mercy\nHear our prayer\n\nFor the nations of the world, we continue in prayer for the people of Ukraine in their continued suffering. We bring before God the growing uncertainties and the threats to peace. We pray for all who work for peace and justice in the world of today. We pray for Charles our King, for all in authority, for all who are called to leadership in our Province\nLord in your mercy\nHear our prayer\n\nFor this area in which we live for our neighbours and our friends,\nLord in your mercy\nHear our prayer\n\nFor the good earth which God has given us, and for the wisdom and will to conserve it,\nLord in your mercy\nHear our prayer\n\nFor the aged and infirm, for the widowed and orphans, for the sick and suffering, remembering any known to us and for all in any need,\nLord in your mercy\nHear our prayer\n\nFor the poor and the oppressed, for the unemployed and the destitute, for prisoners and captives, and for all who remember and care for them,\nLord in your mercy\nHear our prayer\n\nFor the dying, for our Rector mourning the death of his mother for the faithful whom we entrust to the Lord in hope, as we look forward to the day when we share the fullness of the resurrection,\nLord in your mercy\nHear our prayer\n\nRejoicing in the communion of the saints, let us commend ourselves, and one another, and all our life, to God.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/COGS/Proper/Year C/proper222022Sunday Prayers.txt",
        "raw_ocr_content": "Sunday 2nd October 2022\nPrayers\nFor the peace that comes from God alone,\nfor the unity of all peoples,\nand for our salvation,\nLord in your mercy\nHear our prayer\nFor the Church of Christ, for George our Bishop, for this Parish and all churches in\nthis area\nand for the whole people of God,\nLord in your mercy\nHear our prayer\nFor the nations of the world,\nwe continue in prayer for the people of Ukraine in their continued suffering.\nWe bring before God the growing uncertainties and the threats to peace.\nWe pray for all who work for peace and justice in the world of today.\nWe pray for Charles our King, for all in authority, for all who are called to\nleadership in our Province\nLord in your mercy\nHear our prayer\nFor this area in which we live\nfor our neighbours and our friends,\nLord in your mercy\nHear our prayer\nFor the good earth which God has given us,\nand for the wisdom and will to conserve it,\nLord in your mercy\nHear our prayer\nFor the aged and infirm,\nfor the widowed and orphans,\nfor the sick and suffering,\nremembering any known to us and for all in any need,\nLord in your mercy\nHear our prayer\nFor the poor and the oppressed,\nfor the unemployed and the destitute,\nfor prisoners and captives,\nand for all who remember and care for them,\nLord in your mercy\nHear our prayer\nFor the dying, for our Rector mourning the death of his mother\nfor the faithful whom we entrust to the Lord in hope,\nas we look forward to the day when we share\nthe fullness of the resurrection,\nLord in your mercy\nHear our prayer\nRejoicing in the communion of the saints,\nlet us commend ourselves, and one another,\nand all our life, to God."
    }
}