{
    "title": "Love and Reconciliation",
    "date": "2014-09-07",
    "blurb": "Kevin explores the contrast between contemporary employment disciplinary procedures and the teachings of Jesus on dealing with sin and wrongdoing. He emphasizes that God's love and compassion are inexhaustible, and that as followers of Christ, we are called to embody that same love, seeking reconciliation rather than dismissal. The sermon encourages us to be instruments of peace and to reflect God's redeeming love in all situations.",
    "raw_text": "PROPER 18 – Year A – 2014 – Trinity 12\n\nOne of the features of the modern world in which we live is the contract of employment. This will provide the terms under which we are expected to perform at our place of work, the duties that are required of us, the remuneration that we may expect. There will be other clauses covering areas such as confidentiality. Then towards the end there are the disciplinary and grievance procedures that are meant to guarantee fairness of treatment. The grievance procedure includes the steps that are open to us if we feel that our employer or fellow employees are treating us unreasonably. The disciplinary procedure provides the employer, among other things, with a mechanism for the removal of an employee without leaving themselves open to legal challenge in a subsequent tribunal.\n\nAs we read the opening part of our Gospel reading this morning, this seems to have the air of the disciplinary procedures I have been talking about. 'If a brother sins against you...' First, we are to try to deal with it one to one – keep it local, keep it simple. Then if that fails, involve a couple of others – let them see what you are having to deal with. If all else fails take it to the whole community – if that fails then 'let such a one be to you as a Gentile and a tax-collector.' It seems to carry with it the implication of dismissal, removal from the firm – 'go to your office, clear your desk and don’t come back.' We’ve done our best with this difficult individual – we don’t have to try any more.\n\nBut let us just stay with those words: 'let such a one be to you as a Gentile and a tax-collector.' Do they strike a chord with you? I found myself going back to the Gospels. In Mark’s Gospel we read:\n\n> 15 And as he sat at dinner in Levi's house, many tax collectors and sinners were also sitting with Jesus and his disciples--for there were many who followed him. 16 When the scribes of the Pharisees saw that he was eating with sinners and tax collectors, they said to his disciples, \"Why does he eat with tax collectors and sinners?\"\n> 17 When Jesus heard this, he said to them, \"Those who are well have no need of a physician, but those who are sick; I have come to call not the righteous but sinners.\" Mark 2:15-17\n\nSo when I read those words, 'let such a one be to you as a Gentile and a tax-collector,' I find myself asking, 'What was Jesus’ attitude to the tax collector and the sinner?' This is where the passage we read this morning parts company with the disciplinary procedures of the contemporary employment contract with its mechanisms for clean, trouble free exits.\n\nIt is not that sin and wrong doing is not important, it is how Jesus chooses to deal with it. For Jesus, for God, there is no exit, no point at which the love, the compassion stops. You, I, we may all at times turn our back on God but God never turns his back on us. It is from that perspective that I turn to those oft quoted, maybe even over quoted words of Jesus from John’s Gospel:\n\n> 16 \"For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life.\n> 17 \"Indeed, God did not send the Son into the world to condemn the world, but in order that the world might be saved through him.\" John 3:16-17\n\nGod so loved the world, God’s purpose is to redeem the world – not the world of beautiful flowers and sunsets, not the world of idealised communities but the world as it is; in all its messiness, it sinfulness, its suffering, its brokenness. God so loved this world of which we are a part. We are to be the ones in whom, through whom that love is shown.\n\nWe are to be as Christ, as the one who turns the other cheek, who goes the second mile, who, to the disgust of the polite and the religious, sat at table with the sinner and the tax collector, who accepted the service of the woman who sat at his feet and washed them with her tears of regret and remorse.\n\nAnd so I go back to our Gospel reading and I see not the disciplinary procedure of a contemporary contract of employment, but rather a call to reconciliation with even the most difficult and obdurate and, even when they are set on rejection of all attempts make peace, the door remains open. That can be difficult, that can be painful. But that is God’s way with us. In the coming of his Son, in his birth, his life and ministry, his suffering and death\n\n> 7 (he) emptied himself,\n> taking the form of a slave,\n> being born in human likeness.\n> And being found in human form,\n> 8 he humbled himself\n> and became obedient to the point of death--\n> even death on a cross. Phil 2:7-8\n\nIn the passage immediately following on from our Gospel reading, Peter will ask of Jesus, 'Lord, if another member of the church sins against me, how often should I forgive? As many as seven times?' Jesus calls Peter to a fuller more extravagant love.\n\nAs ones who have known God’s love in Christ, may we be enabled to be instruments of that same healing, reconciling, redeeming love in whatever situation God places us.\n\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\n\nO Divine Master, grant that I may not so much seek to be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\n\nPrayer of Saint Francis of Assisi",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper182014.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 18 – Year A – 2014 – Trinity 12\nOne of the features of the modern world in which we live is the contract of\nemployment. This will provide the terms under which we are expected to\nperform at our place of work, the duties that are required us, the remuneration\nthat we may expect. There will be other clauses covering areas such as\nconfidentiality. Then towards the end there are the disciplinary and grievance\nprocedures that are meant to guarantee fairness of treatment. The grievance\nprocedure include the steps that are open to us if we feel that our employer or\nfellow employees are treating us unreasonably. The disciplinary procedure\nprovides the employer, among other things, with a mechanism for the removal\nof an employee without leaving themselves open to legal challenge in a\nsubsequent tribunal.\nAs we read the opening part of our Gospel reading this morning, this seems to\nhave the air of the disciplinary procedures I have been talking about. ‘If a\nbrother sins against you …’. First, we are to try to deal with it one to one –\nkeep it local, keep it simple. Then if that fails, involve a couple of others – let\nthem see what you are having to deal with. If all else fails take it to the whole\ncommunity – if that fails then ‘let such a one be to you as a Gentile and a tax-\ncollector.’ It seems to carry with it the implication of dismissal, removal from\nthe firm – ‘go to your office, clear your desk and don’t come back.’ We’ve\ndone our best with this difficult individual – we don’t have to try any more.\nBut let us just stay with those words: ‘let such a one be to you as a Gentile and\na tax-collector.’ Do they strike a chord with you? I found myself going back\nto the Gospels. In Mark’s Gospel we read:\n15 And as he sat at dinner in Levi's house, many tax collectors and\nsinners were also sitting with Jesus and his disciples--for there were\nmany who followed him. 16 When the scribes of the Pharisees saw\nthat he was eating with sinners and tax collectors, they said to his\ndisciples, \"Why does he eat with tax collectors and sinners?\"\nPage 2 of 3\nPROPER 18 – Year A – 2014 – Trinity 12\n17 When Jesus heard this, he said to them, \"Those who are well have\nno need of a physician, but those who are sick; I have come to call not\nthe righteous but sinners.\" Mark 2:15-17\nSo when I read those words, ‘let such a one be to you as a Gentile and a tax-\ncollector.’, I find myself asking, ‘What was Jesus’ attitude to the tax collector\nand the sinner?’ This is where the passage we read this morning parts\ncompany with the disciplinary procedures of the contemporary employment\ncontract with its mechanisms for clean, trouble free exits.\nIt is not that sin and wrong doing is not important, it is how Jesus chooses to\ndeal with it. For Jesus, for God, there is no exit, no point at which the love, the\ncompassion stops. You, I, we may all at times turn our back on God but God\nnever turns his back on us. It is from that perspective that I turn to those oft\nquoted, maybe even over quoted words of Jesus from John’s Gospel:\n16 \"For God so loved the world that he gave his only Son, so that\neveryone who believes in him may not perish but may have eternal\nlife.\n17 \"Indeed, God did not send the Son into the world to condemn the\nworld, but in order that the world might be saved through him.\nJohn 3:16-17\nGod so loved the world, God’s purpose is to redeem the world – not the world\nof beautiful flowers and sunsets, not the world of idealised communities but the\nworld as it is; in all its messiness, it sinfulness, its suffering, its brokenness.\nGod so loved this world of which we are a part. We are to be the ones in\nwhom, through whom that love is shown.\nWe are to be as Christ, as the one who turns the other cheek, who goes the\nsecond mile, who, to the disgust of the polite and the religious, sat at table with\nthe sinner and the tax collector, who accepted the service of the woman who\nsat at his feet and washed them with her tears of regret and remorse.\nPage 3 of 3\nPROPER 18 – Year A – 2014 – Trinity 12\nAnd so I go back to our Gospel reading and I see not the disciplinary procedure\nof a contemporary contract of employment, but rather a call to reconciliation\nwith even the most difficult and obdurate and, even when they are set on\nrejection of all attempts make peace, the door remains open. That can be\ndifficult, that can be painful. But that is God’s way with us. In the coming of\nhis Son, in his birth, his life and ministry, his suffering and death\n7 (he) emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8 he humbled himself\nand became obedient to the point of death--\neven death on a cross. Phil 2:7-8\nIn the passage immediately following on from our Gospel reading, Peter will\nask of Jesus, ‘Lord, if another member of the church sins against me, how often\nshould I forgive? As many as seven times?’ Jesus calls Peter to a fuller more\nextravagant love.\nAs ones who have known God’s love in Christ, may we be enabled to be\ninstruments of that same healing, reconciling, redeeming love in whatever\nsituation God places us.\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\nPrayer of Saint Francis of Assisi"
    }
}