{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper122014.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 12 – Trinity 6 – 2014 – Anniversary of landing of Asgard – Remembering our past\nEven I only have vague memories of the French singer Maurice Chevalier but the\nfollowing song he sang with Hermione Gingold is still played on the radio from time\nto time.\nH: We met at nine\nM: We met at eight\nH: I was on time\nM: No, you were late\nH: Ah, yes, I remember it well\nWe dined with friends\nM: We dined alone\nH: A tenor sang\nM: A baritone\nH: Ah, yes, I remember it well\nThat dazzling April moon!\nM: There was none that night\nAnd the month was June\nH: That's right. That's right.\nM: It warms my heart to know that you\nremember still the way you do\nH: Ah, yes, I remember it well\nOur memories are precious - but they are not always reliable.\nThey are precious in the context of family life – memories passed down from one\ngeneration to another. They tell us something of our background, our history – they\nactually help us understand who we are, the people, the circumstances that moulded\nus. That is part of the reason that people research their ancestry and also explains\nthe popularity of programmes like ‘Who do they think they are?’ In this celebrities\nare given the chance to delve into their past – some find they have ancestors who\nwere of the nobility, some were criminal, some were abandoned by their families or\nsubjected to grave injustices – some like Jeremy Paxman became quite emotional at\nsome points in their search.\nMemory – helping us understand who we are.\nPage 2 of 3\nPROPER 12 – Trinity 6 – 2014 – Anniversary of landing of Asgard – Remembering our past\nCommunities have memories. This community has its own memories. We look\nback to the time this Church was built in 1866. It is here we gather for worship\nSunday by Sunday. To this place we bring our children for baptism, our dead for\nburial; here we come with those we love to be united in marriage. The tablets and\nplaques on the wall remind us of former Parishioners, some who died in war, some\nmade a distinguished contribution to the life of our city and nation. There is a list at\nthe back of former clergy and near the door up to the choir there are memorials to\nformer organists. Each in their own way have contributed to the life of this place,\nhave helped make us the community we are today. That is to forget a far more\nfundamental memory which binds us to Christians of different traditions and\ndifferent ages. There is the lectern from which the Scriptures are read Sunday by\nSunday, this unique body of literature reflecting on God’s dealings with humanity\nexpressed in poetry, in history, in drama and wisdom, through which and in which\nGod continues to speak afresh to us in our own day. The table around which we\ngather at his command, to share bread and wine in memory of the death and\nresurrection of our Lord Jesus Christ. As we read the Scriptures, as we share the\nbread and wine we are drawn into a deeper understanding of who we are, as\nmembers of the Body of Christ, separated not by creed nor culture, race nor class.\nOf course nations have memories – we call that history. On this island we are\ncurrently in the midst of a decade of centenaries, events North and South that have\nleft their mark on our collective history. Whether we like it or not these event have\nmoulded political life and community relationships North and South that have left us\nin our present state.\nOver this weekend, there are ceremonies to recall the events surrounding the landing\nof the Asgard and the landing of weaponry. There has been a recognition by\nGovernments North and South and in Britain that the events that occurred between\n1912 (the signing of the Ulster Covenant) and 1922 which marked the Anglo Irish\nTreaty and the beginning of the Civil War should be remembered by all\ncommunities, not in a spirit of uncritical glorification but in a spirit of seeking to\nunderstand, not only the actions of our own community but of all.\nPage 3 of 3\nPROPER 12 – Trinity 6 – 2014 – Anniversary of landing of Asgard – Remembering our past\nThe events we remember this weekend did not happen in isolation. They occurred\nin the context of the passing into law of the Irish Home Rule Act, the signing of the\nUlster Covenant pledging armed opposition to the introduction of Home Rule, the\npromulgation of the Ne Temere decree, the landing of arms in Larne by the UVF.\nNone of these events can be understood in isolation from the others. If we are to\nlearn from our past, we need to understand our past. The Spanish philosopher\nGeorge Santayana observed: ‘Those who cannot remember the past are condemned\nto repeat it.’.\nIn this regard, one of the most memorable events in Queen Elizabeth’s visit to\nDublin was her speech at the State Dinner in Dublin Castle and her observation:\n‘With the benefit of historical hindsight we can all see things we would wish had\nbeen done differently, or not at all.’ So we remember, as we remember we honour\nthe ideals and the sacrifices of those who shaped this nation’s history. But we do\nnot do so uncritically for even in the midst of the ideals there were fallible men and\nwomen with their own blind spots, their own limited vision.\nThe Churches need to look back to the period of those events we are remembering\nand reflect. I will always recall a meeting of the Ballymena clerical held just as the\npeace process was getting under way. We had invited a number of the political\nleaders to talk to us. On this particular day we were meeting with the leader of the\nAlliance Party, Dr John Allderdyce. He had been brought up in a Presbyterian\nManse in Ballymena. We had asked him how he saw the role of the Churches over\nthe next few years. ‘Too often in the past,’ he said, ‘the Churches had acted as\nchaplains to the tribe instead of the prophet willing to say the unpopular ‘Thus saith\nthe Lord’.’\nSo as we remember we would do worse than ponder on the words of Queen\nElizabeth: ‘With the benefit of historical hindsight we can all see things we would\nwish had been done differently, or not at all.’ and resolve to do our part in learning\nfrom the past and building a better future for all sections of our society."
    },
    "base": "{\n  \"title\": \"Remembering Our Past\",\n  \"date\": \"2014-07-27\",\n  \"blurb\": \"Kevin reflects on the importance of memory in shaping our identity, both personally and collectively. He discusses the role of memories in family life, the community, and the nation, emphasizing the need to understand and learn from our past. The sermon also touches on historical events, such as the landing of Asgard, and the role of the church in society, urging a critical reflection on history to build a better future.\",\n  \"raw_text\": \"PROPER 12 – Trinity 6 – 2014 – Anniversary of landing of Asgard – Remembering our past\\n\\nEven I only have vague memories of the French singer Maurice Chevalier but the following song he sang with Hermione Gingold is still played on the radio from time to time.\\n\\n> H: We met at"
}