{
    "title": "Remembrance and Memory",
    "date": "2012-11-11",
    "blurb": "Kevin's sermon on Proper 27 in 2012 reflects on the act of remembering, particularly in the context of Remembrance Sunday. He draws parallels between personal memories of loss and the collective memory of war's cost. The sermon emphasizes the importance of recalling past sacrifices to shape a better future and connects this act of remembrance to the Christian practice of commemorating Jesus' life, death, and resurrection in weekly worship.",
    "raw_text": "## Proper 27 – Remembrance – 2012 – Year B\n\nDo you remember when? That is an invitation to join with someone on a trip back into the past. With memories come a whole load of associations, associations with people, with places. Memories can be happy, can be painful.\n\nEarlier this week the people of Enniskillen remembered the events of 25 years ago. The memories I am sure were very varied. There were those who were present on that day who remember the explosion and the chaos; those who were injured, those who were bereaved. There are some who have been able to move on and embrace the changes that have come in Northern Ireland – others for whom the memories of loved ones have made this too big a step. I thought of the response of the late Gordon Wilson, his amazing words of reconciliation in the wake of the death of his daughter. I recalled at the same time talking to a lady in Ahoghill some ten years later for whom Gordon Wilson’s response was still incomprehensible.\n\nI want to think a bit this morning about memories and the process of remembering. On this Remembrance Sunday, in Church services, at War memorials people are remembering. For some the memories are still personal as families remember parents, grandparents, siblings who served, who were injured, who died. For others there is the more general remembering of the awful cost of war. So lest we become too glib about war, the awful cost of war in human suffering, we pause to remember.\n\nSunday by Sunday, we remember. In bread and wine we remember the death and resurrection of our Lord Jesus Christ. In Bible readings we remember our salvation history. In our prayers for the Church, the nations, the sick, the marginalized, we remember before God. Each Sunday we remember before God those who have gone before us in the faith, whose anniversaries occur at this time, we give thanks to God for those who have been lights on our own path of faith.\n\nAt the 11:00 service we will be welcoming two young children, Eliza McGrath and Leo Ryan, into the fellowship of the Church in Baptism. In the context of the Service of Baptism we will be remembering. Their grandparents may well be remembering Baptisms in earlier years, thinking of the time these parents were themselves children, with their lives before them. In the prayer over the water we recall God’s saving acts in the history of Israel, in the person of Jesus Christ. I will sign these children with the sign of the Cross and as I do so the congregation will enjoin them to confess Christ crucified, proclaim his resurrection, look for his coming in glory.\n\nAnd so we remember. We remember the victims of conflicts in the past; the awful cost of war in broken lives, the cost of the freedoms we enjoy in our own day.\n\nSunday by Sunday, in bread and wine, in word and sacrament, in prayer, in silence we remember our faith story, the journey God makes with his people Israel, God’s encounter with man in the life, death and resurrection of Christ.\n\nWhat does the remembering do? We remember the past – what impact is that to have. It is said that those who forget the past are likely to repeat the mistakes of the past. And so the leaders who emerged from the horror of the last war resolved that never again would the world be consumed by war on such a scale. The immediate post war years saw the emergence of the United Nations Organization, the fledgling European Common Market. Society must resolve to make the future better than the past or else the sacrifices of the past will be for nothing. For me, our response as individuals and as a society is summed up in the inscription on the war cemetery in Kohima in North East India,\n\n> When You Go Home, Tell Them of Us And Say,\n> For Your Tomorrow, We Gave Our Today\n\nWe remember our faith story. In bread and wine we remember, we re-present, we bring into the present, the life, the death, the resurrection of Jesus. We hear once again the faith story, the encounter of God with his people. We hear stories of great faithfulness, stories of failure and judgement and redemption. We hear once again of the ministry of Jesus in word and deed. In his presence, drawing on his strength, we go back out into the world to live our lives as in his presence and in his service.\n\nToday, in Baptism, we will hear parents and godparents make undertakings on behalf of their children. These or equivalent undertakings were made by us or on our behalf at confirmation and baptism. Michael Ramsey, Archbishop of Canterbury as I was growing up, used to refer to the promises of Baptism as his ‘yard stick for life’, of his life as ‘lived in response to my Baptism’\n\nToday we remember. On this Remembrance Sunday we remember the sacrifice of those who died in the great and awful conflicts of the last century. May we as a society, the way we use a freedom that is so often taken for granted, the way we protect those on the margins of our society be our ongoing tribute to those who suffered.\n\nOn this and every Sunday we remember in Word and Sacrament our faith story. Strengthened and inspired to go back out into the world to live true to the promises of our Baptism, as servants of the God and Father of our Lord Jesus Christ.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper272012.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 27 – Remembrance – 2012 – year B\nDo you remember when ? That is an invitation to join with someone on a trip back\ninto the past. With memories come a whole load of associations, associations with\npeople, with places. Memories can be happy, can be painful.\nEarlier this week the people of Enniskillen remembered the events of 25 years ago.\nThe memories I am sure were very varied. There were those who were present on\nthat day who remember the explosion and the chaos; those who were injured, those\nwho were bereaved. There are some who have been able to move on and embrace\nthe changes that have come in Northern Ireland – others for whom the memories of\nloved ones have made this too big a step. I thought of the response of the late\nGordon Wilson, his amazing words of reconciliation in the wake of the death of his\ndaughter. I recalled at the same time talking to a lady in Ahoghill some ten years\nlater for whom Gordon Wilson’s response was still incomprehensible.\nI want to think a bit this morning about memories and the process of remembering.\nOn this Remembrance Sunday, in Church services, at War memorials people are\nremembering. For some the memories are still personal as families remember\nparents, grandparents, siblings who served, who were injured, who died. For others\nthere is the more general remembering of the awful cost of war. So lest we become\ntoo glib about war, the awful cost of war in human suffering, we pause to remember.\nSunday by Sunday, we remember. In bread and wine we remember the death and\nresurrection of our Lord Jesus Christ. In Bible readings we remember our salvation\nhistory. In our prayers for the Church, the nations, the sick, the marginalised, we\nremember before God. Each Sunday we remember before God those who have gone\nbefore us in the faith, whose anniversaries occur at this time, we give thanks to God\nfor those who have been lights on our own path of faith..\nPage 2 of 3\nProper 27 – Remembrance – 2012 – year B\nAt the 11:00 service we will be welcoming two young children, Eliza McGrath and\nLeo Ryan, into the fellowship of the Church is Baptism. In the context of the\nService of Baptism we will be remembering. Their grandparents may well be\nremembering Baptisms in earlier years, thinking of the time these parents were\nthemselves children, with their lives before them. In the prayer over the water we\nrecall God’s saving acts in the history of Israel, in the person of Jesus Christ. I will\nsign these children with the sign of the Cross and as I do so the congregation will\nenjoin them to\nconfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\nAnd so we remember. We remember the victims of conflicts in the past; the awful\ncost of war in broken lives, the cost of the freedoms we enjoy in our own day.\nSunday by Sunday, in bread and wine, in word and sacrament, in prayer, in silence\nwe remember our faith story, the journey God makes with his people Israel, God’s\nencounter with man in the life, death and resurrection of Christ.\nWhat does the remembering do? We remember the past – what impact is that to\nhave. It is said that hose who forget the past are likely to repeat the mistakes of the\npast. And so the leaders who emerged from the horror of the last war resolved that\nnever again would the world be consumed by war on such a scale. The immediate\npost war years saw the emergence of the United Nations Organisation, the fledgling\nEuropean Common Market. Society must resolve to make the future better than the\npast or else the sacrifices of the past will be for nothing. For me, our response as\nindividuals and as a society is summed up in the inscription on the war cemetery in\nKohima in North East India,\nWhen You Go Home, Tell Them of Us And Say,\nPage 3 of 3\nProper 27 – Remembrance – 2012 – year B\nFor Your Tomorrow, We Gave Our Today\nWe remember our faith story. In bread and wine we remember, we re-present, we\nbring into the present, the life, the death, the resurrection of Jesus. We hear once\nagain the faith story, the encounter of God with his people. We hear stories of great\nfaithfulness, stories of failure and judgement and redemption. We hear once again\nof the ministry of Jesus in word and deed. In his presence, drawing on his strength,\nwe go back out into the world to live our lives as in his presence and in his service.\nToday, in Baptism, we will hear parents and godparents make undertakings on\nbehalf of their children. These or equivalent undertakings were made by us or on\nour behalf at confirmation and baptism. Michael Ramsey, Archbishop of\nCanterbury as I was growing up, used to refer to the promises of Baptism as his\n‘yard stick for life’, of his life as ‘lived in response to my Baptism’\nToday we remember. On this Remembrance Sunday we remember the sacrifice of\nthose who died in the great and awful conflicts of the last century. May we as a\nsociety, the way we use a freedom that is so often taken for granted, the way we\nprotect those on the margins of our society be our ongoing tribute to those who\nsuffered.\nOn this and every Sunday we remember in Word and Sacrament our faith story.\nStrengthened and inspired to go back out into the world to live true to the promises\nof our Baptism, as servants of the God and Father of our Lord Jesus Christ."
    }
}