{
    "title": "Understanding Grace",
    "date": "2017-07-02",
    "blurb": "Kevin reflects on the human condition and the struggles of life, drawing from the Old Testament and the teachings of Paul. He emphasizes the concept of grace, the internal tug of war we face, and the comfort found in Jesus' invitation to learn the 'unforced rhythms of grace'. The sermon reassures us that in our weaknesses and contradictions, we are understood and accepted by God.",
    "raw_text": "### PROPER 9 – Year A – 2017 – Trinity 4\n\nOver the last couple of weeks we have been following the Old Testament stories of the call of Abraham, the birth of Isaac and Sarah’s demand that Hagar and Ishmael be driven out into the wilderness. Then there was the call on Abraham to sacrifice his son. As I reflected these stories involve real human beings, with all their strengths and failings, with all their virtues and flaws, living out life in the presence of the God who called them.\n\nAs we reflected on them, we recognised in our own experience that we all face situations in life where life is hard to understand. As I observed last week there are times when life is a bitch, when it is hard to see God living and active in the sufferings of ourselves, of loved ones, of the innocent and defenceless. We also discover as we look at that wonderful collection of hymns of praise, of complaint, of protest that is the Psalms that God understands our pain, feels our pain and in a profound sense shares our pain. Even if we don’t understand God, God does understand us.\n\nJust as we have been seeking to understand God, this morning we face that equally intractable problem of trying to understand ourselves. As I said those Old Testament stories involved real human beings in all their strengths and weaknesses. In trying to understand ourselves, Paul in our reading today from his letter to the Romans, takes as his starting point the reality of our humanity.\n\n> \"What I don’t understand about myself is that I decide one way, but then I act another, doing things I absolutely despise. So if I can’t be trusted to figure out what is best for myself and then do it,\" - Romans 7:15,16\n\nIt speaks of that internal tug of war that we all know only too well. It is put rather nicely in that Peanuts cartoon that I have included on the lesson sheet. It may be at the minor level of keeping to that diet, sticking to that exercise routine. But there are more serious issues of morality and integrity as we are torn between what we know is right and the easier option of taking the path of least resistance. We all know something of the helplessness that Paul is talking about in this passage, that perpetual feeling of guilt at falling for the same temptation over and over again.\n\nWe feel lonely and God seems so very far away. It is at that point that verse 15 of our psalm speaks to me today.\n\n> \"The Lord upholds all those who fall and lifts up all those who are bowed down.\" - Psalm 145:14\n\nThis is at the heart of what Jesus is saying in our Gospel reading today:\n\n> \"Are you tired? Worn out? Burned out on religion? Come to me. Get away with me and you’ll recover your life. I’ll show you how to take a real rest. Walk with me and work with me—watch how I do it. Learn the unforced rhythms of grace. I won’t lay anything heavy or ill-fitting on you. Keep company with me and you’ll learn to live freely and lightly.\" - Matthew 11:28-30\n\nThis is grace. And grace is fundamentally about realising not only that I cannot do all this by myself but that I am not expected to do all this by myself. To go back to our reading from Romans, Paul finishes our passage with a cry of anguish that turns into a sudden vision of the answer.\n\n> \"I’ve tried everything and nothing helps. I’m at the end of my rope. Is there no one who can do anything for me? Isn’t that the real question? The answer, thank God, is that Jesus Christ can and does.\" - Romans 7:24-25\n\nGod is there. Even in his apparent absence he is there at our side. For God has found us in the person of Jesus Christ; in Christ God has experienced what it is to be human; in Christ we have encountered God as one who knows what it is to be me, what it is to be tempted, what it is to be lonely, to be misunderstood; knowing me he accepts me in all my weaknesses and contradictions and invites me to embrace him in trust and commitment. And it is as I am, that Christ says to me 'Are you tired? Worn out? ……Come to me. Get away with me…... I’ll show you how to take a real rest. Walk with me and work with me—watch how I do it. Learn the unforced rhythms of grace. Learn to walk step by step with the Christ who accompanies us through life, whether it be in the office, the sports club, in the shops, in our homes or in the street. When we slip, as we will, he is there ready to forgive, ready to continue this journey of a lifetime.\n\nLearn the unforced rhythms of grace. Let go, give God space to work in and through our lives – then we might even begin to understand what life is all about.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper92017.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 9 – Year A – 2017 – Trinity 4\nOver the last couple of weeks we have been following the Old Testament\nstories of the call of Abraham, the birth of Isaac and Sarah’s demand that\nHagar and Ishmael be driven out into the wilderness. Then there was the call\non Abraham to sacrifice his son. As I reflected these stories involve real\nhuman beings, with all their strengths and failings, with all their virtues and\nflaws, living out life in the presence of the God who called them.\nAs we reflected on them, we recognised in our own experience that we all face\nsituations in life where life is hard to understand. As I observed last week there\nare times when life is a bitch, when it is hard to see God living and active in the\nsufferings of ourselves, of loved ones, of the innocent and defenceless. We\nalso discover as we look at that wonderful collection of hymns of praise, of\ncomplaint, of protest that is the Psalms that God understands our pain, feels our\npain and in a profound sense shares our pain. Even if we don’t understand\nGod, God does understand us.\nJust as we have been seeking to understand God, this morning we face that\nequally intractable problem of trying to understand ourselves. As I said those\nOld Testament stories involved real human beings in all their strengths and\nweaknesses. In trying to understand ourselves, Paul in our reading today from\nhis letter to the Romans, takes as his starting point the reality of our humanity.\nReading, as we did this morning from the translation The Message\nWhat I don’t understand about myself is that I decide one way, but then\nI act another, doing things I absolutely despise. So if I can’t be trusted\nto figure out what is best for myself and then do it, Romans 7:15,16\nPage 2 of 3\nPROPER 9 – Year A – 2017 – Trinity 4\nIt speaks of that internal tug of war that we all know only too well. It is put\nrather nicely in that Peanuts cartoon that I have included on the lesson sheet. It\nmay be at the minor level of keeping to that diet, sticking to that exercise\nroutine. But there are more serious issues of morality and integrity as we are\ntorn between what we know is right and the easier option of taking the path of\nleast resistance. We all know something of the helplessness that Paul is talking\nabout in this passage, that perpetual feeling of guilt at falling for the same\ntemptation over and over again.\nWe feel lonely and God seems so very far away. It is at that point that verse 15\nof our psalm speaks to me today.\n15 The Lord upholds all those who fall ♦\nand lifts up all those who are bowed down.\nThis is at the heart of what Jesus is saying in our Gospel reading today:\n28-30“Are you tired? Worn out? Burned out on religion? Come to me.\nGet away with me and you’ll recover your life. I’ll show you how to\ntake a real rest. Walk with me and work with me—watch how I do it.\nLearn the unforced rhythms of grace. I won’t lay anything heavy or ill-\nfitting on you. Keep company with me and you’ll learn to live freely\nand lightly.” Matt 11:28-30\nThis is grace. And grace is fundamentally about realising not only that I\ncannot do all this by myself but that I am not expected to do all this by myself.\nTo go back to our reading from Romans, Paul finishes our passage with a cry\nof anguish that turns into a sudden vision of the answer.\n24 I’ve tried everything and nothing helps. I’m at the end of my rope. Is\nthere no one who can do anything for me? Isn’t that the real question?\n25 The answer, thank God, is that Jesus Christ can and does.\nPage 3 of 3\nPROPER 9 – Year A – 2017 – Trinity 4\nGod is there. Even in his apparent absence he is there at our side. For God\nhas found us in the person of Jesus Christ; in Christ God has experienced what\nit is to be human; in Christ we have encountered God as one who knows what\nit is to be me, what it is to be tempted, what it is to be lonely, to be\nmisunderstood; knowing me he accepts me in all my weaknesses and\ncontradictions and invites me to embrace him in trust and commitment. And it\nis as I am, that Christ says to me ‘Are you tired? Worn out? ……Come to me.\nGet away with me…... I’ll show you how to take a real rest. Walk with me and\nwork with me—watch how I do it. Learn the unforced rhythms of grace.\nLearn the unforced rhythms of grace. Learn to walk step by step with the\nChrist who accompanies us through life, whether it be in the office, the sports\nclub, in the shops, in our homes or in the street. When we slip, as we will, he is\nthere ready to forgive, ready to continue this journey of a lifetime.\nLearn the unforced rhythms of grace. Let go, give God space to work in and\nthrough our lives – then we might even begin to understand what life is all\nabout."
    }
}