{
    "title": "Kairos Moments",
    "date": "2007-07-08",
    "blurb": "This sermon discusses the concept of 'Kairos' moments - specific opportunities to be grasped, which may not present themselves again. It reflects on the importance of seizing these moments, both in our personal lives and in our interactions with others. The sermon also highlights how these moments can bring about change and fulfillment, as exemplified in the biblical stories of Naaman and the sending out of the seventy.",
    "raw_text": "One of the glories of the Revised Common Lectionary, a scheme of readings shared by Churches of all traditions right across the world, is the practice of reading sequentially stories in Scripture. So in our Old Testament Lessons of late we have been reading the stories of Elijah and Elisha; this year in our Gospel readings we are predominantly following the story as told to us by the writer of Luke’s Gospel. This Sunday we are finishing a sequence of readings from Paul’s letter to the Galatians.\n\nIn our passage today we have quite personal features as Paul points to the fact that this letter is in his own handwriting – this is not the work of a scribe or secretary writing on Paul’s behalf – this is Paul himself encouraging, chiding, teaching. Paul, of course, is also writing to a particular community set in a particular time, place and cultural environment.\n\nGalatia was Graeco-Roman colony in the heart of what is now modern Turkey. The original population would have been Celts who were eventually subdued by Pompey and the area incorporated into the Roman Empire. It is generally accepted that this letter would have been addressed to Christians in the southern end of the Province who were coming under some pressure from Jewish Christians to conform with Jewish customs.\n\nThey would have spoken and thought in Greek, conducted their business and community life through Greek and, prior to their conversion, many would have been familiar with the thought patterns of Greek philosophy.\n\nIn the passage we read, Paul entreats them:\n\n> 'So let us not grow weary in doing what is right, for we will reap at harvest time*, if we do not give up. So then, whenever we have an opportunity*, let us work for the good of all,’ Gal 6:9,10\n\nIn this passage, ‘harvest time’ (other translations have ‘due season’) and ‘opportunity’ are both translations of the single Greek word ‘kairos’. So we have expressed in this single word ‘kairos’ themes of opportunity and fulfillment. ‘Kairos’ is one of the Greek words for ‘time’, the other is ‘chronos’ from which we derive our word ‘chronology’, denoting continuous time. ‘Kairos’, on the other hand, denotes a particular point in time, time as an event.\n\nSo as Paul is writing to the Galatians he is thinking of opportunity and fulfillment in terms of ‘kairos’ time, particular time, particular opportunities to be grasped, opportunities that may not present themselves again.\n\nSo let us now look at our two other passages in the light of Kairos, opportunities to be grasped, and times of fulfillment (times of harvest).\n\nOur Old Testament Lesson is the well known story of the healing of Naaman. We have that lovely picture of Naaman, in all his grandeur, turning up outside the house of Elisha. In a scene that would not be out of place in a Monty Python picture, the servant is sent out to tell Naaman to go and wash in the Jordan. Naaman is affronted at being fobbed off with a mere servant and he prepares to stomp off in disgust, only to be restrained by his servant’s advice to at least try what he was told to do.\n\nIn this account, that was a’Kairos’ moment for Naaman, an opportunity that, in his pride and self importance, he could easily have let slip. In the story he grasps it, albeit reluctantly, and it finds its fulfillment in healing and in changed attitudes on the part of Naaman.\n\nOur Gospel reading is Luke’s account of Jesus’ sending out of the seventy to go and in a ministry of preaching and healing, to proclaim the coming of the kingdom. He warns them in advance that some will accept them whereas others will reject them and their message. On their return we are told they recount results beyond their wildest expectations and Jesus talks of watching Satan fall from heaven.\n\nIn this narrative, the seventy had been sent out by Jesus to offer ‘Kairos’ moments, moments of opportunity, moments of encounter with the Kingdom, which some would grasp and others would ignore. These opportunities, when grasped, issue in changed lives; as the kingdom breaks into lives so the power of Satan is seen to be driven back.\n\nIn our own day, one of the fundamental tasks of the Church in its witness, in its own ministry of word, of sacrament, of service, is that of presenting Christ to the world in which we live. The German theologian, Rudolph Bultmann, as he reflected on the relationship between the written scriptures and the life of faith, once wrote; “Christ, the Crucified and Risen one, meets us in the word of proclamation.” Those words provide a link between the Mission of the Seventy, that we have read of in our Gospel reading, and the ongoing ministry of the Church in every age – that it provides points of encounter with the Risen and Crucified Christ. Our times of worship, Sunday by Sunday, are times of encounter with the God who made us, who redeemed us in his Son, who strengthens us by his Spirit – from these we go out into the world to present Christ, the crucified and risen one.\n\nThis set me thinking about ‘Kairos’ moments in my own life – those opportunities that come my way – some that I may seize, others I may let slip by. We tell our children to take advantage of their opportunities – for education, new experiences – opportunities that, if they are allowed to slip by, may not come their way again – but if grasped can open up whole new possibilities of personal advancement and development.\n\n‘Kairos’ moments of course are not just moments to be grasped, they also have to be offered. For life of course is more that what we take – it is also about what we offer, what we contribute. What ‘Kairos’ moments can I open up in the lives of others. As parents we try to present our children with a range of opportunities to develop in terms of life experiences and education – we know the frustration of watching them let them slip by – maybe making similar mistakes to those we made ourselves.\n\nThis is why I think teachers have a tremendous role to play in the development of individuals. If you think back over your own life, a good teacher was not just the one who imparted blocks of information, but one who opened our minds and inspired us to embark upon our own journey of discovery.\n\nBut we often think, ‘What difference can I make in the life of another person?’ We often seriously underestimate the impact the individual. I will often think back to the Sunday morning I made my way as a teenager into my local parish Church for the first time. I looked around not sure where to sit; the prayer book that had been handed to me was a total mystery to me. A delightful old couple, Mr & Mrs Bennett invited me to join them in their pew and gently guided me through the service. As much by their gentleness as by their words, they encouraged me to return the next week. They probably never realized the impact that made – it was for me a ‘Kairos’ moment that opened up a whole new dimension in my life. In a very real sense Christ met me in them and through them began to draw me into the fellowship of his Church.\n\nSo let us go out from this service today, from our own time of encounter with the Crucified and Risen One, to be ones through whom Christ is present in the world in which we live; that in us others may have their own particular encounter with the Risen Christ, that in and through our lives his Kingdom may be advanced.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper92007.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 9 – year C – 2007\nOne of the glories of the Revised Common Lectionary, a scheme of readings shared by\nChurches of all traditions right across the world, is the practice of reading sequentially\nstories in Scripture. So in our Old Testament Lessons of late we have been reading the\nstories of Elijah and Elisha; this year in our Gospel readings we are predominantly\nfollowing the story as told to us by the writer of Luke’s Gospel. This Sunday we are\nfinishing a sequence of readings from Paul’s letter to the Galatians.\nIn our passage today we have quite personal features as Paul points to the fact that this\nletter is in his own handwriting – this is not the work of a scribe or secretary writing on\nPaul’s behalf – this is Paul himself encouraging, chiding, teaching. Paul, of course, is also\nwriting to a particular community set in a particular time, place and cultural environment.\nGalatia was Graeco-Roman colony in the heart of what is now modern Turkey. The\noriginal population would have been Celts who were eventually subdued by Pompey and\nthe area incorporated into the Roman Empire. It is generally accepted that this letter\nwould have been addressed to Christians in the southern end of the Province who were\ncoming under some pressure from Jewish Christians to conform with Jewish customs.\nThey would have spoken and thought in Greek, conducted their business and community\nlife through Greek and, prior to their conversion, many would have been familiar with the\nthought patterns of Greek philosophy.\nIn the passage we read, Paul entreats them:\n‘9So let us not grow weary in doing what is right, for we will reap at harvest time*, if we\ndo not give up. 10So then, whenever we have an opportunity*, let us work for the good of\nall,’ Gal 6:9,10\nIn this passage, ‘harvest time’ (other translations have ‘due season’) and ‘opportunity’ are\nboth translations of the single Greek word ‘kairos’. So we have expressed in this single\nword ‘kairos’ themes of opportunity and fulfillment. ‘Kairos’ is one of the Greek words\nPage 2 of 4\nProper 9 – year C – 2007\nfor ‘time’, the other is ‘chronos’ from which we derive our word ‘chronology’, denoting\ncontinuous time. ‘Kairos’, on the other hand, denotes a particular point in time, time as an\nevent.\nSo as Paul is writing to the Galatians he is thinking of opportunity and fulfillment in terms\nof ‘kairos’ time, particular time, particular opportunities to be grasped, opportunities that\nmay not present themselves again.\nSo let us now look at our two other passages in the light of Kairos, opportunities to be\ngrasped, and times of fulfillment (times of harvest).\nOur Old Testament Lesson is the well known story of the healing of Naaman. We have\nthat lovely picture of Naaman, in all his grandeur, turning up outside the house of Elisha.\nIn a scene that would not be out of place in a Monty Python picture, the servant is sent out\nto tell Naaman to go and wash in the Jordan. Naaman is affronted at being fobbed off with\na mere servant and he prepares to stomp off in disgust, only to be restrained by his\nservant’s advice to at least try what he was told to do.\nIn this account, that was a’Kairos’ moment for Naaman, an opportunity that, in his pride\nand self importance, he could easily have let slip. In the story he grasps it, albeit\nreluctantly, and it finds its fulfillment in healing and in changed attitudes on the part of\nNaaman.\nOur Gospel reading is Luke’s account of Jesus’ sending out of the seventy to go and in a\nministry of preaching and healing, to proclaim the coming of the kingdom. He warns\nthem in advance that some will accept them whereas others will reject them and their\nmessage. On their return we are told they recount results beyond their wildest\nexpectations and Jesus talks of watching Satan fall from heaven.\nPage 3 of 4\nProper 9 – year C – 2007\nIn this narrative, the seventy had been sent out by Jesus to offer ‘Kairos’ moments,\nmoments of opportunity, moments of encounter with the Kingdom, which some would\ngrasp and others would ignore. These opportunities, when grasped, issue in changed lives;\nas the kingdom breaks into lives so the power of Satan is seen to be driven back.\nIn our own day, one of the fundamental tasks of the Church in its witness, in its own\nministry of word, of sacrament, of service, is that of presenting Christ to the world in\nwhich we live. The German theologian, Rudolph Bultmann, as he reflected on the\nrelationship between the written scriptures and the life of faith, once wrote; “Christ, the\nCrucified and Risen one, meets us in the word of proclamation.” Those words provide a\nlink between the Mission of the Seventy, that we have read of in our Gospel reading, and\nthe ongoing ministry of the Church in every age – that it provides points of encounter with\nthe Risen and Crucified Christ. Our times of worship, Sunday by Sunday, are times of\nencounter with the God who made us, who redeemed us in his Son, who strengthens us by\nhis Spirit – from these we go out into the world to present Christ, the crucified and risen\none.\nThis set me thinking about ‘Kairos’ moments in my own life – those opportunities that\ncome my way – some that I may seize, others I may let slip by. We tell our children to\ntake advantage of their opportunities – for education, new experiences – opportunities that,\nif they are allowed to slip by, may not come their way again – but if grasped can open up\nwhole new possibilities of personal advancement and development.\n‘Kairos’ moments of course are not just moments to be grasped, they also have to be\noffered. For life of course is more that what we take – it is also about what we offer, what\nwe contribute. What ‘Kairos’ moments can I open up in the lives of others. As parents we\ntry to present our children with a range of opportunities to develop in terms of life\nexperiences and education – we know the frustration of watching them let them slip by –\nmaybe making similar mistakes to those we made ourselves.\nPage 4 of 4\nProper 9 – year C – 2007\nThis is why I think teachers have a tremendous role to play in the development of\nindividuals. If you think back over your own life, a good teacher was not just the one who\nimparted blocks of information, but one who opened our minds and inspired us to embark\nupon our own journey of discovery.\nBut we often think, ‘What difference can I make in the life of another person?’ We often\nseriously underestimate the impact the individual. I will often think back to the Sunday\nmorning I made my way as a teenager into my local parish Church for the first time. I\nlooked around not sure where to sit; the prayer book that had been handed to me was a\ntotal mystery to me. A delightful old couple, Mr & Mrs Bennett invited me to join them\nin their pew and gently guided me through the service. As much by their gentleness as by\ntheir words, they encouraged me to return the next week. They probably never realized\nthe impact that made – it was for me a ‘Kairos’ moment that opened up a whole new\ndimension in my life. In a very real sense Christ met me in them and through them began\nto draw me into the fellowship of his Church.\nSo let us go out from this service today, from our own time of encounter with the\nCrucified and Risen One, to be ones through whom Christ is present in the world in which\nwe live; that in us others may have their own particular encounter with the Risen Christ,\nthat in and through our lives his Kingdom may be advanced."
    }
}