{
    "title": "Grace and Inner Turmoil",
    "date": "2014-07-06",
    "blurb": "Kevin explores the tension between our intentions and actions, drawing on Paul's reflections in Romans and C.S. Lewis's conversion experience. He emphasizes the importance of allowing God space in our lives and the concept of finding and being found by God. The sermon concludes with an invitation to exchange our burdens for the rest and peace offered by Christ.",
    "raw_text": "### PROPER 9 – Year A – 2014 – Trinity 3\n\n\"_I do not understand my own actions. For I do not do what I want, but I do the very thing I hate... For I do not do the good I want, but the evil I do not want is what I do._\" (Romans 7:15,19-20)\n\nPaul's letter to the Romans reflects on an inner turmoil that is familiar to many of us—the tension between knowing what is right and succumbing to our own weaknesses. This passage is part of a larger discussion on grace versus Law, and the importance of allowing God the space to act in our lives.\n\nKevin discusses the limitations we place on God in our minds and how Jesus, through his life and teachings, challenges those preconceptions. He cites C.S. Lewis's journey from skepticism to faith, highlighting the divine humility that accepts a convert even on reluctant terms.\n\nThe sermon delves into the Apostle Paul's mission and his teachings on the presence of God, even in his apparent absence. Kevin emphasizes that in Christ, God has experienced humanity, and through Him, we find acceptance despite our weaknesses.\n\nThe message concludes with Jesus's invitation to those weary and burdened to find rest in Him, exchanging their heavy burdens for His yoke, which is light and offers rest for the soul. Kevin encourages embracing the unforced rhythms of grace and allowing God to work in and through our lives.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper92014.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 9 – Year A – 2014 – Trinity 3\n15I do not understand my own actions. For I do not do what I want, but I do the very thing I\nhate. ……….19For I do not do the good I want, but the evil I do not want is what I do.\n20Now if I do what I do not want, it is no longer I that do it, but sin that dwells within me.\nRomans 7:15,19-20\nSo Paul in his letter to the Romans reflects on an inner turmoil that I would\nsuspect that all of us can identify with at some stage in our lives – that tension\nbetween attitudes, actions that I know are right and the weakness in my own\ninner being to which I end up giving in as I say and think and do what I know\nin my heart is not right. With it there come the regrets, the feeling of failure\nwith which we are all familiar.\nThis passage is part of a much larger discussion on the whole issue of grace as\nopposed to Law. I don’t intend to launch into a detailed analysis of Paul’s\ntheology at this point – what I do want to do is to set grace in the context of\nallowing God space, allowing God scope to act in our lives.\nNow God gave us minds to think, to reflect but sometimes in our thinking, in\nour reflecting we can erect barriers in our minds in which we place limitations\non how God, the maker of all that is, can act, can be understood. We see a hint\nof this in the first part of our Gospel reading as Jesus points to those who\nrejected both John the ascetic who neither ate nor drank and the more convivial\nJesus – God does not speak or act through people who behave like that.\nSo let’s go back to this idea of allowing God space. In his early days the\nChristian writer C.S. Lewis was quite antagonistic to Christian faith. In his\nbook ‘Surprised by Joy’ he recalls the time he finally gave in and let God in.\nPage 2 of 4\nPROPER 9 – Year A – 2014 – Trinity 3\n“You must picture me alone in that room in Magdalen, night after night,\nfeeling, whenever my mind lifted even for a second from my work, the\nsteady, unrelenting approach of Him whom I so earnestly desired not to\nmeet. That which I greatly feared had at last come upon me. In the\nTrinity Term of 1929 I gave in, and admitted that God was God, and\nknelt and prayed: perhaps, that night, the most dejected and reluctant\nconvert in all England. I did not then see what is now the most shining\nand obvious thing; the Divine humility which will accept a convert even\non such terms.\nThe words “compelle intrare,” compel them to come in, have been so\nabused by wicked men that we shudder at them; but, properly\nunderstood, they plumb the depth of the Divine mercy. The hardness of\nGod is kinder than the softness of men, and His compulsion is our\nliberation.”\n‘His compulsion is our liberation’.\nThis brings me to that whole idea of ‘finding and being found by God.’ God as\npresent even in his apparent absence. There is something in each one of us,\nthat seeks to look beyond ourselves for meaning, even if we do not want to put\nthe name ‘God’ on it; that is clear in C.S. Lewis’ reflections. The Apostle\nPaul, as he moved out from Jerusalem into the Greco-Roman world, found\nhimself in Athens. Taking as his starting point their own search for meaning,\nthe presence of an altar to ‘an unknown god’ he made the following\nobservation:\n26 From one ancestor he made all nations to inhabit the whole earth, and\nhe allotted the times of their existence and the boundaries of the places\nwhere they would live, 27 so that they would search for God and perhaps\ngrope for him and find him--though indeed he is not far from each one\nof us. 28 For 'In him we live and move and have our being'; Acts\n17:26ff\n‘so that they would search for God and perhaps grope for him and find him--\nthough indeed he is not far from each one of us.’\nPage 3 of 4\nPROPER 9 – Year A – 2014 – Trinity 3\nIt is our conviction that God has found us in the person of Jesus Christ – that in\nChrist God has experienced what it is to be human; in Christ we have\nencountered God as one who knows what it is to be me, knowing me he\naccepts me in all my weaknesses and contradictions. Again and again I find\nmyself returning to Paul’s words as he wrote to his beloved Philippians:\n10 I want to know Christ and the power of his resurrection and the\nsharing of his sufferings by becoming like him in his death, 11 if\nsomehow I may attain the resurrection from the dead.\n12 Not that I have already obtained this or have already reached the\ngoal; but I press on to make it my own, because Christ Jesus has made\nme his own. 13 Beloved, I do not consider that I have made it my own;\nbut this one thing I do: forgetting what lies behind and straining\nforward to what lies ahead, 14 I press on toward the goal for the prize\nof the heavenly call of God in Christ Jesus. Phil 3:10-14\nNot that I have already obtained this or have already reached the goal; but I\npress on to make it my own, because Christ Jesus has made me his own.\nIt is from this, that I come to the second part of our Gospel reading this\nmorning, with its invitation ‘Come to me, all you that are weary and carrying\nheavy burdens and I will give you rest.’\nAt its heart there is an invitation to exchange burdens. The sense of the Greek\nin which the Gospel is written is that of exhaustion under a burden from which\nthere seems to be no hope of release. How often do we find ourselves\nphysically, mentally, spiritually exhausted? - as we carry the burdens of our\nown regrets, disappointments, hurts – and I will give you rest, peace,\nrefreshment in your inner being.\nPage 4 of 4\nPROPER 9 – Year A – 2014 – Trinity 3\nTake up instead my yoke. The yoke is a throw back from earlier times, a cross\nbar across the shoulders that spread the load being carried, that made it easier\nto bear. It would have a similar function to the collar that would be put on a\nhorse drawing a carriage, that spreads the load across the shoulders.\nI thought of another invitation of Christ, ‘take up your cross and follow me’.\nThe cross, not as a burden to be avoided, but as a way of life, a discipleship, a\nhealing to be embraced – and you will find rest for your souls.\nI will sometimes in our family services take our readings from a translation\ncalled The Message. It is a bit more than a translation, it includes an element\nof reflection. The following is how it renders these closing verses of our\nGospel reading, it is included in the box on your sheets:\n“Are you tired? Worn out? Burned out on religion? Come to me. Get\naway with me and you’ll recover your life. I’ll show you how to take\na real rest. Walk with me and work with me—watch how I do it.\nLearn the unforced rhythms of grace. I won’t lay anything heavy or\nill-fitting on you. Keep company with me and you’ll learn to live\nfreely and lightly.”\nLearn the unforced rhythms of grace. Let go, give God space to work in and\nthrough our lives."
    }
}