{
    "title": "Reflections on Faith and Art",
    "date": "2014-09-28",
    "blurb": "Kevin explores the role of stained glass and icons in learning and reflecting on faith, drawing parallels with the Christian call to be Christ-like in daily life. He discusses the power of art as a storytelling medium in times when literacy was rare, and the personal impact of visual aids in spiritual practice. Kevin also touches on the importance of embodying Christ's teachings in marriage and community, emphasizing the transformative potential of being Christ for one another.",
    "raw_text": "One of the features of many of our churches is our use of stained glass. We have beautiful windows here in St Mary's. The one over the communion table is the one most of us see every Sunday. It is magnificent, rich in symbolism, expressing the historic links between this Parish and the St Lawrence family in Howth Castle as well as references to ancient Irish Church in this land, featuring both local saints such as St Fintan and St Assam and the national figures of Patrick and Brigid, all focusing on the figure of the risen Christ in the centre.\n\nOne of the other great artistic traditions was the design and painting of icons, which are very much a feature of the orthodox tradition. These stylized pictures of great figures of the Old Testament, of Christ and his disciples are designed as aids to prayer and reflection. There is one that I very much associate with the Taize community in France, it is the figure of Christ standing alongside a disciple with an arm around his shoulder, which is included in our lesson sheet.\n\nThe figure of Christ holds a copy of the Gospels, the right hand of the disciple is raised in blessing and both are looking at us. As I look at that I think of Christ with me, accompanying me in daily life, as a companion, an encourager, as a friend. Then I look at the first of the two passages we read today from the letter of Paul to the Philippians. Here Paul is not talking about listening to Christ, not even admiring Christ, he is talking about being Christ-like, having the same mind, being Christ for one another.\n\nYesterday was one of those occasions that I enjoy - I was officiating at a wedding as Peter Spendlove married Sharon Foong. It is lovely watching a couple prepare for their big day and talking over with them some of their hopes and plans for their life ahead. We also talk about facing problems, resolving difficulties, supporting each other, standing alongside each other in the sorrows we all have to face in life.\n\nWe have gathered together and we worship together and in that space there is room for listening to one another, encouraging one another and simply enjoying one another - who knows what simple gifts are given and received in those times we share together, in which we can be Christ, encounter Christ, receive from Christ.\n\nI leave you with that picture on your lesson sheet and the injunction of Paul to his readers:\n\n> Let the same mind be in you that was in Christ Jesus,\n> who, though he was in the form of God,\n> did not regard equality with God\n> as something to be exploited,\n> but emptied himself,\n> taking the form of a slave,\n> being born in human likeness.\n> And being found in human form,\n> he humbled himself\n> and became obedient to the point of death -\n> even death on a cross.\n\nAnd with it a question - who can I be Christ to in this coming week, this coming month, in my home, my community, my school or place of work. May God take each one of us and use us to show something of his love in this world in which we live.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper212014.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 21 – 2011 – Year A – Trinity 14\nOne of the features of many of our churches is our use of stained glass. We\nhave beautiful windows here in St Mary’s. The one over the communion table\nis the one most of us see every Sunday. It is magnificent, rich in symbolism,\nexpressing the historic links between this Parish and the St Lawrence family in\nHowth Castle as well as references to ancient Irish Church in this land,\nfeaturing both local saints such as St Fintan and St Assam and the national\nfigures of Patrick and Brigid, all focussing on the figure of the risen Christ in\nthe centre. I must admit I love the window at the font and also the one behind\nthe communion table at the back. Of course if you go into the great cathedrals\nof Europe such as Chatres or Notre Dame in Paris the windows are even more\nmagnificent, as in a series of pictures a particular window will tell the story of\na parable of Jesus, or the life of a particular saint. They have their origins in a\ntime when few people could read – the windows were the story book through\nwhich people learned and reflected on the faith.\nOne of the other great artistic traditions was the design and painting of icons,\nwhich are very much a feature of the orthodox tradition. These stylised\npictures of great figures of the Old Testament, of Christ and his disciples are\ndesigned as aids to prayer and reflection. There is one that I very much\nassociate with the Taize community in France, it is the figure of Christ standing\nalongside a disciple with an arm around his shoulder, which is included in our\nlesson sheet.\nPage 2 of 3\nPROPER 21 – 2011 – Year A – Trinity 14\nThe figure of Christ holds a copy of the Gospels, the right hand of the disciple\nis raised in blessing and both are looking at us. As I look at that I think of\nChrist with me, accompanying me in daily life, as a companion, an encourager,\nas a friend.\nThen I look at the first of the two passages we read today – from the letter of\nPaul to the Philippians. Here Paul is not talking about listening to Christ, not\neven admiring Christ, he is talking about being Christ-like, having the same\nmind, being Christ for one another. Look back at that picture, the figure of\nChrist, holding the Gospel arm around another. How can I be Christ for\nsomeone in this coming week?\nLet’s just think of a couple of examples in daily living. Yesterday was one of\nthose occasions that I enjoy – I was officiating at a wedding as Peter Spendlove\nmarried Sharon Foong. It is lovely watching a couple prepare for their big day\nand talking over with them some of their hopes and plans for their life ahead.\nWe also talk about facing problems, resolving difficulties, supporting each\nother, standing alongside each other in the sorrows we all have to face in life. I\noften think back to the time Rachel and I were married and I red a book, ‘The\nCourage to be Married’. One expression that has stayed with me ever since, as\nthe author spoke of a man and wife making Christ present for one another;\nbeing Christ for one another; presenting each other with an image of Christ.\nThen there are just those times we come together here in Church to worship\ntogether and to enjoy each others company in the Parish Centre and outside.\nPage 3 of 3\nPROPER 21 – 2011 – Year A – Trinity 14\nWe have gather together and we worshipp together and in that space there is\nroom for listening to one another, encouraging one another and simply\nenjoying one another – who knows what simple gifts are given and received in\nthose times we share together, in which we can be Christ, encounter Christ,\nreceive from Christ.\nI leave you with that picture on your lesson sheet and the injunction of Paul to\nhis readers\n5Let the same mind be in you that was in Christ Jesus,\n6who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7but emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8he humbled himself\nand became obedient to the point of death –\neven death on a cross..\nAnd with it a question – who can I be Christ to in this coming week, this\ncoming month, in my home, my community, my school or place of work. May\nGod take each one of us and use us to show something of his love in this world\nin which we live."
    }
}