{
    "title": "Beyond Appearances",
    "date": "2009-06-14",
    "blurb": "Kevin's sermon challenges preconceived notions and emphasizes the importance of looking beyond outward appearances to see the true character of individuals. Drawing from the story of David's anointment in the Old Testament, he illustrates how God's perception differs from man's, focusing on the heart rather than external qualities. The sermon encourages us to align our purposes with God's, seeking substance over form for lasting peace and prosperity.",
    "raw_text": "They say appearances can be deceptive. Our perceptions of people and situations can be equally misleading. I recall my school days in Birmingham, 1966, when a new student, Lakbir, joined us. Initially judged for his Indian heritage and appearance, Lakbir proved to be hardworking and integral, teaching us the value of seeing beyond stereotypes.\n\nAnother instance involved a seemingly respectable man visiting the Rectory in Finglas, who turned out to be a con artist. These experiences remind us that judgments based on appearances and preconceived notions can be flawed.\n\nOur Old Testament Lesson from the First Book of Samuel tells of David's selection as King of Israel. It contrasts human perception with God's, highlighting that while man looks at the outward appearance, God looks at the heart. Samuel's human agenda sought a king who looked the part, but God chose David, who was the part.\n\nDavid's anointment and subsequent reign represent a golden era in Jewish history, a time when human actions aligned with divine purposes. However, the decline that followed serves as a cautionary tale of the consequences when man's and God's purposes diverge. It's a reminder that a society in sync with God prospers, while one that strays faces decline.\n\nIn conclusion, the convergence of divine and human intentions brought about a Golden Age for Israel. We are called to seek a similar alignment in our own lives, pursuing God's will not just in form, but in substance, for therein lies our true peace.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Proper 6 - 2009.txt",
        "raw_ocr_content": "Page 1 of 4\nTrinity 1 – 2006 – Proper 6 – year B\nThey say appearances can be deceptive. I would go on to say that our\nperceptions of people and situations can be deceptive. I often think back to my\nLower Sixth class in Birmingham in 1966. One morning at registration our\nForm Master that a new boy was joining our class – the new boy was Indian,\nhe wore a turban and he had a beard.\nMany of the reactions were hostile – ‘Why should he be allowed to have a\nbeard and we can’t? I’m becoming a Sikh!’ The reactions were based not on\nLakbir as a person but on our perceptions of what Indians were like – devious,\nlazy. We were told not to treat him as an Indian but as an individual.\nWe soon learned that Lakbir worked a darn sight harder than we did, was a\ndelightful person of great integrity who rapidly became part of our group. That\nhas always served as an example to me of the distance between our\npreconceived ideas and reality.\nI remember another man calling to me at the Rectory in Finglas with all the\nappearances and demeanour of a gentleman. He seemed to know several of the\nclergy in Dublin, wore a nice suit, spoke well – I subsequently discovered that\nhe was a con man. Of course we often judge people by our experiences of\nthem but very often our judgements are coloured by preconceived ideas.\nOutward appearances on which we set great store, on which we often base our\njudgements, can be so deceptive. We look at someone and we see an Indian, a\nProtestant, working class, upper class – and we leave it at that. We don’t\ntrouble ourselves to see the person behind the image we have of them.\nPage 2 of 4\nTrinity 1 – 2006 – Proper 6 – year B\nThis is one of the features that runs through our Old Testament Lesson this\nmorning from the First Book of Samuel, that tells of the choice of David to\nreplace Saul as King of Israel. It is a story of two perceptions – man’s\nperception and God’s perception.\nSamuel experiences God’s command to go and anoint one from among the\nsons of Jesse as a successor to Saul. Saul had failed in the task to which God\nhad called him. As I often remark, God chooses to work through people – but\nman’s failure can never ultimately frustrate God’s purposes. God will raise up\nother individuals to do his work.\nDespite his misgivings about the whole trip – he was aware that a jealous King\nSaul would not view kindly anyone anointing a rival to his throne – Samuel\narrives at the home of Jesse in Bethlehem. In the context of worship, the\noffering of sacrifice, Samuel sees the sons of Jesse.\nIt is at this point we come to the kernel of the story. Both God and Samuel are\nlooking for a king from among Jesse’s sons. Samuel comes to the task with a\nhuman agenda. He is looking for someone who LOOKS the part – God seeks\nsomeone who IS the part. When the oldest is brought before Samuel, he thinks\n‘That’s the one’ but he is aware of God’s warning voice in his heart; ‘Man\nlooks at the outside – I look at the heart’ and so on for seven of Jesse’s eight\nsons.\nPage 3 of 4\nTrinity 1 – 2006 – Proper 6 – year B\nThere was another son David. Jesse had obviously not thought it worth\nbringing David along to this gathering at all. He was the youngest, a child –\nthey were about men’s business.\nWhen David is at last brought it, Samuel is now convinced that David is the\nfuture King that God is seeking and he anoints him as a sign that he has been\nset apart for great things. God, for his part, we are told, empowers him with his\nSpirit.\nIn the anointing of David we have a coming together of man’s actions and\nGod’s purposes. David was no plaster caste saint but his reign marked a\ngolden era in the history of the Jewish people. It was under his reign that\nJerusalem was established as the capital of Israel and Israel’s influence was to\nbe at its height. It was from the house of David that God’s Messiah was\nexpected.\nHis son Solomon managed to hold things together but, after his death, the\nKingdom of Israel split into the two separate kingdoms of Israel and Judah that\nDavid had brought together. There followed a period of progressive decline as\nman’s purposes and God’s purposes again parted. They still saw themselves as\nGod’s people. They went through the motions of seeking God’s will.\nAt the giving of the Law on Mount Sinai, we read of God declaring\npunishment for those who went against him for three and four generations and\nsteadfast love for those who obeyed him. In other words a society that goes\nwith God prospers; a society that goes against God can go into serious decline.\nPage 4 of 4\nTrinity 1 – 2006 – Proper 6 – year B\nI actually think that it is not really a matter of God directly inflicting\npunishment, as a society bringing all that down upon itself.\nAs I said earlier, in the episode we read of this morning, we had a coming\ntogether of God’s purposes and man’s purposes. Samuel sought and listened to\nGod and his people enjoyed a Golden Age in their history. David’s successors\nkept the externals of religion but in their hearts drifted away and the\ncommunity declined. Each generation needs to seek in its own time and\ncircumstances a similar convergence between God’s purposes and ours, a\nseeking of God not just in form but in substance. In that lies our peace. May\nGod give us the grace to seek it."
    }
}