{
    "title": "Journey with Jesus",
    "date": "2010-06-27",
    "blurb": "This sermon discusses the journey of Jesus towards Jerusalem, accompanied by his disciples. It draws parallels between this journey and our own life journey with Jesus, highlighting the challenges and the discoveries made along the way. The sermon emphasizes Jesus' inclusive approach, reaching out to all, and the need for immediate commitment to follow Him.",
    "raw_text": "Our Gospel passage this morning marks the beginning of a whole new section of St Luke's Gospel that tells of the journey of Jesus towards Jerusalem. It is a journey that is going to reach its climax in the cross and resurrection of Jesus.\n\nIt is a journey on which Jesus will be accompanied by his newly appointed disciples - in the course of this journey they will enter into a deeper understanding of Jesus and also a deeper understanding of themselves in relationship with Jesus.\n\nThis journey with Jesus will at times be a confusing one as they find Jesus increasingly at odds with many people and institutions they would have been brought up to respect and defer to. There were those occasions told to us by St John when people who had been sympathetic felt enough was enough and they drifted away. On one such occasion Jesus turned to the Twelve and asked \"Are you going to leave me as well?\" Peter, speaking for the Twelve, replied, \"Lord to whom shall we go? You alone have the words of eternal life.\"\n\nThis journey that the disciples undertook with Jesus in some ways models our own journey with Jesus through life. It too is a journey of discovery. In the course of which we learn more of Jesus, more about ourselves in relationship with Jesus. It too can be a confusing journey at times as Jesus seems to challenge attitudes and values that seem to be second nature to us. We find ourselves in situations where following Jesus seems to set us at odds with people around us.\n\nI think of his attitudes to those who were different, or on the margins of society. In his day it was the leper, the tax collector, the sinner. In our own day the drug addict, the single parent, the immigrant, the asylum seeker. Jesus makes uncomfortable demands upon us in the whole area of relationships, of reconciliation - to turn the other cheek, to forgive those who have wronged us, who have received God's forgiveness through the death of his Son on the Cross.\n\nMaybe at times we fell like giving up, maybe we even imagine him asking, \"Are you going to leave me as well?\" Confusing and perplexing though the Christian life is at times, we know in our heart that there is no other way, there is no other person to whom we can go, for he alone has the words of eternal life.\n\nTurning to our Gospel reading, we come across different groups of people who, for different reasons, distance themselves from Jesus. First of all there are the inhabitants of the Samaritan village to which Jesus had sent his disciples. The people did not welcome him because he was heading for Jerusalem. This highlights the tensions between Jews and Samaritans; the one group the descendants of the Southern Kingdom of Judah, the other descendants of the Northern Kingdom of Israel.\n\nThe Jews saw the Samaritans as ones who had compromised on the faith when, after the fall of the Northern Kingdom, they had watered down the faith. The Samaritans view of the Jews probably coloured by memories of the injustices meted out by the dominant tribe of Judah prior to the break up of the Kingdom of Israel following the death of Solomon.\n\nFor them the content of Jesus' message was irrelevant, he was \"the other sort\", not to be entertained or listened to. For their part, this probably confirmed the disciples views about the Samaritans and they seek authority to call down hell fire upon them. But Jesus rebukes them. The Samaritans may not be ready to receive him but he has not given up on them. We read in the Acts of the Apostles (also written by Luke) that after his resurrection, as he prepares to return to the Father, Jesus commissions his disciples, telling them that they are to be his witnesses in Jerusalem, in Judea AND Samaria, to the very ends of the earth. No one is to be excluded from the proclamation of the Gospel.\n\nJesus will not be limited by our expectations, our preconceived ideas about how he will, or will not, act. Over and over again in his ministry he reached out across barriers of prejudice, of ignorance, of pride. This he continues to do in our own day and we must be prepared to encounter him in the poor, the marginalised, in the different, in \"the other sort\".\n\nAlong the road, Jesus is approached by others who express a desire to follow. Two of them express reservations that would find a sympathy in our own hearts - they have their root in a commitment to family. \"First let me go and bury my father - First let me go back and say good-bye to my family.\" I think what lies at the heart of Jesus' reproach of these individuals is the idea of an either/or approach. Our family relationships, our family responsibilities are lived not in isolation from a commitment to Christ but in the context of our commitment to Christ.\n\nBut this episode addresses a much wider issue than that of family commitments. It addresses the more fundamental attitude of \"I'll start to follow Jesus - but not just yet.\" \"I'll do it when I finish school - I'll do it when I am settled in a job - I'll do it when I'm married and settled down - I'll do it when I have kids - I'll do it when the kids have left home - and so on\"\n\nThere is always a reason. I think of St Augustine's prayer as he struggled with faith, before he finally committed himself. \"Lord make me holy - but not just yet.\" It is as if we see fellowship with Jesus as life diminishing rather than a life enhancing commitment. Jesus invites us to join him on the road now. As we journey through life with him, we can share with him our hopes and our fears, our concerns and our anxieties for our families and those we love, our studies, our careers, our plans and hopes for the future.\n\nAs the incident surrounding the Samaritan village reminds us, we journey with him as our Lord, not as our assistant, simply to be invoked at our individual or communal beck and call. Jesus will not fit into any categories we may seek to place upon him. He comes to us as our Lord and invites us to follow as his disciples.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper82010.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 8 – 2010 – year C – Trinity 4\nOur Gospel passage this morning marks the beginning of a whole new section of St\nLuke's Gospel that tells of the journey of Jesus towards Jerusalem. It is a journey\nthat is going to reach its climax in the cross and resurrection of Jesus.\nIt is a journey on which Jesus will be accompanied by his newly appointed disciples -\nin the course of this journey they will enter into a deeper understanding of Jesus and\nalso a deeper understanding of themselves in relationship with Jesus.\nThis journey with Jesus will at times be a confusing one as they find Jesus\nincreasingly at odds with many people and institutions they would have been\nbrought up to respect and defer to. There were those occasions told to us by St John\nwhen people who had been sympathetic felt enough was enough and they drifted\naway. On one such occasion Jesus turned to the Twelve and asked \"Are you going\nto leave me as well?\" Peter, speaking for the Twelve, replied, \"Lord to whom shall\nwe go? You alone have the words of eternal life.\"\nThis journey that the disciples undertook with Jesus in some ways models our own\njourney with Jesus through life. It too is a journey of discovery. In the course of\nwhich we learn more of Jesus, more about ourselves in relationship with Jesus. It too\ncan be a confusing journey at times as Jesus seems to challenge attitudes and values\nthat seem to be second nature to us. We find ourselves in situations where following\nJesus seems to set us at odds with people around us.\nI think of his attitudes to those who were different, or on the margins of society. In\nhis day it was the leper, the tax collector, the sinner. In our own day the drug addict,\nthe single parent, the immigrant, the asylum seeker. Jesus makes uncomfortable\ndemands upon us in the whole area of relationships, of reconciliation - to turn the\nother cheek, to forgive those who have wronged us, who have received God's\nforgiveness through the death of his Son on the Cross.\nPage 2 of 4\nProper 8 – 2010 – year C – Trinity 4\nMaybe at times we fell like giving up, maybe we even imagine him asking, \"Are you\ngoing to leave me as well?\" Confusing and perplexing though the Christian life is at\ntimes, we know in our heart that there is no other way, there is no other person to\nwhom we can go, for he alone has the words of eternal life.\nTurning to our Gospel reading, we come across different groups of people who, for\ndifferent reasons, distance themselves from Jesus. First of all there are the\ninhabitants of the Samaritan village to which Jesus had sent his disciples. The people\ndid not welcome him because he was heading for Jerusalem. This highlights the\ntensions between Jews and Samaritans; the one group the descendants of the\nSouthern Kingdom of Judah, the other descendants of the Northern Kingdom of\nIsrael.\nThe Jews saw the Samaritans as ones who had compromised on the faith when, after\nthe fall of the Northern Kingdom, they had watered down the faith. The Samaritans\nview of the Jews probably coloured by memories of the injustices meted out by the\ndominant tribe of Judah prior to the break up of the Kingdom of Israel following the\ndeath of Solomon.\nFor them the content of Jesus' message was irrelevant, he was \"the other sort\", not to\nbe entertained or listened to. For their part, this probably confirmed the disciples\nviews about the Samaritans and they seek authority to call down hell fire upon them.\nBut Jesus rebukes them. The Samaritans may not be ready to receive him but he has\nnot given up on them. We read in the Acts of the Apostles (also written by Luke)\nthat after his resurrection, as he prepares to return to the Father, Jesus commissions\nhis disciples, telling them that they are to be his witnesses in Jerusalem, in Judea\nAND Samaria, to the very ends of the earth. No one is to be excluded from the\nproclamation of the Gospel.\nPage 3 of 4\nProper 8 – 2010 – year C – Trinity 4\nJesus will not be limited by our expectations, our preconceived ideas about how he\nwill, or will not, act. Over and over again in his ministry he reached out across\nbarriers of prejudice, of ignorance, of pride. This he continues to do in our own day\nand we must be prepared to encounter him in the poor, the marginalised, in the\ndifferent, in \"the other sort\".\nAlong the road, Jesus is approached by others who express a desire to follow. Two\nof them express reservations that would find a sympathy in our own hearts - they\nhave their root in a commitment to family. \"First let me go and bury my father - First\nlet me go back and say good-bye to my family.\" I think what lies at the heart of\nJesus' reproach of these individuals is the idea of an either/or approach. Our family\nrelationships, our family responsibilities are lived not in isolation from a commitment\nto Christ but in the context of our commitment to Christ.\nBut this episode addresses a much wider issue than that of family commitments. It\naddresses the more fundamental attitude of \"I'll start to follow Jesus - but not just\nyet.\" \"I'll do it when I finish school - I'll do it when I am settled in a job - I'll do it\nwhen I'm married and settled down - I'll do it when I have kids - I'll do it when the\nkids have left home - and so on\"\nThere is always a reason. I think of St Augustine's prayer as he struggled with faith,\nbefore he finally committed himself. \"Lord make me holy - but not just yet.\" It is as\nif we see fellowship with Jesus as life diminishing rather than a life enhancing\ncommitment. Jesus invites us to join him on the road now. As we journey through\nlife with him, we can share with him our hopes and our fears, our concerns and our\nanxieties for our families and those we love, our studies, our careers, our plans and\nhopes for the future.\nPage 4 of 4\nProper 8 – 2010 – year C – Trinity 4\nAs the incident surrounding the Samaritan village reminds us, we journey with him\nas our Lord, not as our assistant, simply to be invoked at our individual or communal\nbeck and call. Jesus will not fit into any categories we may seek to place upon him.\nHe comes to us as our Lord and invites us to follow as his disciples."
    }
}