{
    "title": "Chosen by God",
    "date": "2013-11-10",
    "blurb": "Kevin reflects on the concept of being chosen, drawing parallels between the selection process in sports and God's selection of individuals. He emphasizes that everyone is special and has a purpose in God's eyes, using Paul's second letter to the Thessalonians and the call of Jeremiah as scriptural references. The sermon reassures that we are all chosen by God, and therefore, should be special to one another.",
    "raw_text": "Anyone see the rugby match yesterday?\nDidn't England do well? No, I think we were all watching the Ireland match.\nBefore the game, we were all waiting to see who was going to be on the team – who was going to be left out.\n\nI want to start by thinking a bit about this business of picking teams. In youth club, I notice Tim goes down the line 1 – 2 – 1 – 2 – 1 – 2. Not always the way it is done – some of you may have experienced something like this:\n\n> Video – Jeremy Lin Picked last\n\nThe man left feeling left out, humiliated, that he didn't matter to anyone. Our second lesson, Paul's 2nd letter to the Thessalonians, has a very different message. God picked you out as his from the very start. Each of us matters, each of us is special in God's sight. I often find myself thinking back on two passages of Scripture and the context in which I heard them, that bring this home to me.\n\nThe first was in the context of a sermon that Desmond Tutu preached at a service in Capetown, long before the end of the Apartheid regime in South Africa. He quoted from the call of Jeremiah.\n\n> Jer 1:5 \"Before I formed you in the womb I knew you,\nand before you were born I consecrated you;\nI appointed you a prophet to the nations.\"\n\nJeremiah, you were no accident; Jeremiah you mean something to me; Jeremiah I have a purpose for you.\n\nAll of you, young, not so young, male, female, tall, not so tall, thin, not so thin – none of you is an accident, all of you are special, special to God, special to those who love you.\n\nThe other passage I think of comes from Jesus' teaching to his disciples on the night before he died. He says to them, 'You did not choose me, I chose you, that you should bear fruit, fruit that will last.'\n\nEach of us chosen, each of us special to God, each of us having a purpose in God's sight.\n\nIf you are special to God and you are special to God, and you are special to God – that should mean that we are special to each other.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper27famserv2013.txt",
        "raw_ocr_content": "Page 1 of 2\nproper27famserv2013\nAnyone see the rugby match yesterday?\nDidn’t England do well? No I think we were all watching the Ireland\nmatch.\nBefore the game we were all waiting to see who was going to be on\nthe team – who was going to be left out.\nWant to start by thinking a bit about this business of picking teams.\nIn youth club I notice Tim goes down the line 1 – 2 – 1 – 2 – 1 – 2\nNot always the way it is done – some of you may have experienced\nsomething like this:-\nVideo – Jeremy Lin Picked last\nThe man left feeling left out, humiliated, that he didn’t matter to\nanyone. Our second lesson, Paul’s 2nd letter to the Thessalonians, has\na very different message.\nGod picked you out as his from the very start.\nEach of us matters, each of us is special in God’s sight. I often find\nmyself thinking back on two passages of Scripture and the context in\nwhich I heard them, that bring this home to me.\nPage 2 of 2\nproper27famserv2013\nThe first was in the context of a sermon that Desmond Tutu preached\nat a service in Capetown, long before the end of the Apartheid regime\nin South Africa. He quoted from the call of Jeremiah.\nJer 1:5 \"Before I formed you in the womb I knew you,\nand before you were born I consecrated you;\nI appointed you a prophet to the nations\n.\"\nJeremiah, you were no accident; Jeremiah you mean something to\nme; Jeremiah I have a purpose for you.\nAll of you, young, not so young, male, female, tall, not so tall, thin,\nnot so thin – none of you is an accident, all of you are special, special\nto God, special to those who love you.\nThe other passage I think of comes form Jesus’ teaching to his\ndisciples on the night before he died. He says to them, ‘You did not\nchoose me, I chose you, that you should bear fruit, fruit that will last.’\nEach of us chosen, each of us special to God, each of us having a\npurpose in God’s sight.\nIf you are special to God and you are special to God, and you are\nspecial to God – that should mean that we are special to each other."
    }
}