{
    "title": "Farewell and Gratitude",
    "date": "2021-07-18",
    "blurb": "In his retirement speech, Kevin expresses heartfelt thanks for the support received over his 43-year ministry. He reflects on the diversity and unity within the Church of Ireland, his journey through different parishes, and the significance of ending his ministry in Howth. He acknowledges the contributions of various individuals and the importance of family, ending his speech with a hopeful look towards the future.",
    "raw_text": "Howth Retirement – Thank you speech\n\nFirst of all, I want to say a huge thank you for the generosity of the many messages we have received since I announced my retirement and for everything today. It has been a privilege, as a blow in from the Church of England, to have served in the Church of Ireland over the last 43 years. I have seen the Church of Ireland, North and South, urban and rural. I have come to love this Church, in all its strengths and weaknesses, and in it I have found my spiritual home.\n\nWe are the Church of Ireland. North and South we are an all Ireland institution. We hold within our ranks, all classes of people, the full range of political allegiances, of theological and social views. We may argue the bit out, but within the discord and diversity, there is a fundamental unity – that in itself is a significant contribution to this island of Ireland. I have enjoyed all the Parishes in which I have served. I have learned much about faith and about life from all of them as I have come to appreciate the people who sit in the pews in every corner of this land.\n\nAs a young boy on holidays in Bray, I used to look out across the bay to the Hill of Howth, so it is perhaps fitting that it is here that I end my time in the Parochial ministry.\n\nI was particularly pleased when I heard that Andrew Mayes was to speak today. He has been at every stage of my journey through ministry. He was a member of the Selection Board that accepted me for training – though I gather they never asked you to do that again! He was assigned as my tutor as I entered the Divinity School and lectured me in Old Testament. He is one of the few lecturers whose notes I kept. He was one of the first to ring me after my appointment was announced – though I do recall saying that I would never, ever again, preach on the Old Testament. I have valued your support and encouragement, especially in the way you assisted at the 9:30 services of Holy Communion. He does however sit as a living reminder of my failure to learn Hebrew.\n\nSo many of you as Church Wardens, Vestry members, Sunday School Teachers, members of the Parish, have helped and enriched me in so many ways as you have worked with me, welcomed me into your homes, shared your lives with me. I cannot mention everyone by name, but I will mention a couple. Ron and Maud Bass have been an inspiration to so many people in this Parish. Ron was one of the nominators and was the one who attracted me to this place. Like so many I have appreciated his gentle ministry of word and prayer. Ron you have been a Father in God to more people than you can realise.\n\nOne of my memories of this place has been the Youth Worker programme and I just want to pay tribute to Louise Fuller’s commitment in bringing this to fruition and has overseen it since. As we all said last weekend Elke has left her own particular mark on this place.\n\nComing from England, I’ve always been intrigued at how connected Ireland is. We are moving into the Parish of Jordanstown where the Rector’s wife remembers me as a Curate in Raheny. When Fr Gerry came to Howth, we were sharing family histories. I remarked that my grandfather had been electrical consultant to Dublin Corporation for the building of the first Pigeon House Power Station, only for Gerry to say that his grandfather had been the first Chief Engineer. We have long enjoyed good ecumenical relationships in this area but your gesture, Fr Gerry, of coming forward to receive communion from Archbishop Michael at our Bicentenary Service was appreciated more that you will ever realise by the people of this Parish.\n\nAnd now my family, the ones who have loved me, put up with me, who have seen the other side of me. My two sons, Anthony and Benjamin. Growing up in a Rectory has its own pressures in terms of expectations of others (some of them unreasonable); family life is not the same when Dad works every Sunday, Christmas and Easter, when phone calls have on occasions called me away from family time together. Being clergy sons in Ballymena was particularly challenging. I am immensely proud of both of you, the men you have become, the careers you have forged for yourselves, the partners you have found in Angie and P, the beautiful children, Ryan, Ruairi, Liam, Lorcan, Maeve, Isaac, Edward and Joshua, you are rearing.\n\nRachel, my wife, my lover, my very best friend. You are, you always have been, you always will be the love of my life. If being a clergy child is difficult, being a clergy wife, particularly my wife, has its own challenges and sacrifices in so many ways. Dear bless you, reared in a Manse and then you married me! I am so looking forward to the time we will have together in our own home, our time, time when the phone may well at times be left to ring. So farewell and thank you to the Parish of Howth, and hello to the next stage of our life together.\n\nI was never a great fan of the last First Minister of Northern Ireland, but I can’t beat the end of her last speech in the Stormont Assembly;\n\n'Over and out.'\n\nGod bless you all.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper72021 - retirement - thank you speech.txt",
        "raw_ocr_content": "Page 1 of 3\nHowth Retirement – Thank you speech\nFirst of all, I want to say a huge thank you for the generosity of the many\nmessages we have received since I announced my retirement and for\neverything today.\nIt has been a privilege, as a blow in from the Church of England, to have\nserved in the Church of Ireland over the last 43 years. I have seen the Church\nof Ireland, North and South, urban and rural. I have come to love this Church,\nin all its strengths and weaknesses, and in it I have found my spiritual home.\nWe are the Church of Ireland. North and South we are an all Ireland\ninstitution. We hold within our ranks, all classes of people, the full range of\npolitical allegiances, of theological and social views. We may argue the bit\nout, but within the discord and diversity, there is a fundamental unity – that in\nitself is a significant contribution to this island of Ireland. I have enjoyed all\nthe Parishes in which I have served. I have learned much about faith and about\nlife from all of them as I have come to appreciate the people who sit in the\npews in every corner of this land.\nAs a young boy on holidays in Bray, I used to look out across the bay to the\nHill of Howth, so it is perhaps fitting that it is here that I end my time in the\nParochial ministry.\nI was particularly pleased when I heard that Andrew Mayes was to speak\ntoday. He has been at every stage of my journey through ministry. He was a\nmember of the Selection Board that accepted me for training – though I gather\nthey never asked you to do that again! He was assigned as my tutor as I\nentered the Divinity School and lectured me in Old Testament. He is one of\nthe few lecturers whose notes I kept. He was one of the first to ring me after\nmy appointment was announced – though I do recall saying that I would never,\never again, preach on the Old Testament. I have valued your support and\nencouragement, especially in the way you assisted at the 9:30 services of Holy\nPage 2 of 3\nHowth Retirement – Thank you speech\nCommunion. He does however sit as a living reminder of my failure to learn\nHebrew.\nSo many of you as Church Wardens, Vestry members, Sunday School\nTeachers, members of the Parish, have helped and enriched me in so many\nways as you have worked with me, welcomed me into your homes, shared your\nlives with me. I cannot mention everyone by name, but I will mention a\ncouple. Ron and Maud Bass have been an inspiration to so many people in this\nParish. Ron was one of the nominators and was the one who attracted me to\nthis place. Like so many I have appreciated his gentle ministry of word and\nprayer. Ron you have been a Father in God to more people than you can\nrealise.\nOne of my memories of this place has been the Youth Worker programme and\nI just want to pay tribute to Louise Fuller’s commitment in bringing this to\nfruition and has overseen it since. As we all said last weekend Elke has left her\nown particular mark on this place.\nComing from England, I’ve always been intrigued at how connected Ireland is.\nWe are moving into the Parish of Jordanstown where the Rector’s wife\nremembers me as a Curate in Raheny. When Fr Gerry came to Howth, we\nwere sharing family histories. I remarked that my grandfather had been\nelectrical consultant to Dublin Corporation for the building of the first Pigeon\nHouse Power Station, only for Gerry to say that his grandfather had been the\nfirst Chief Engineer. We have long enjoyed good ecumenical relationships in\nthis area but your gesture, Fr Gerry, of coming forward to receive communion\nfrom Archbishop Michael at our Bicentenary Service was appreciated more\nthat you will ever realise by the people of this Parish.\nPage 3 of 3\nHowth Retirement – Thank you speech\nAnd now my family, the ones who have loved me, put up with me, who have\nseen the other side of me. My two sons, Anthony and Benjamin. Growing up\nin a Rectory has its own pressures in terms of expectations of others (some of\nthem unreasonable); family life is not the same when Dad works every\nSunday, Christmas and Easter, when phone calls have on occasions called me\naway from family time together. Being clergy sons in Ballymena was\nparticularly challenging. I am immensely proud of both of you, the men you\nhave become, the careers you have forged for yourselves, the partners you have\nfound in Angie and P, the beautiful children, Ryan, Ruairi, Liam, Lorcan,\nMaeve, Isaac, Edward and Joshua, you are rearing.\nRachel, my wife, my lover, my very best friend. You are, you always have\nbeen, you always will be the love of my life. If being a clergy child is difficult,\nbeing a clergy wife, particularly my wife, has its own challenges and sacrifices\nin so many ways. Dear bless you, reared in a Manse and then you married me!\nI am so looking forward to the time we will have together in our own home,\nour time, time when the phone may well at times be left to ring. So farewell\nand thank you to the Parish of Howth, and hello to the next stage of our life\ntogether.\nI was never a great fan of the last First Minister of Northern Ireland, but I can’t\nbeat the end of her last speech in the Stormont Assembly;\n‘Over and out.’\nGod bless you all."
    }
}