{
    "title": "The Good Samaritan",
    "date": "2013-07-28",
    "blurb": "This sermon is centered around the parable of the Good Samaritan from Luke 10:30-37. It challenges the listeners to measure their lives against the promises of baptism, using the metaphor of a plumbline. The sermon also presents a practical challenge, urging the listeners to live out their faith in their daily lives.",
    "raw_text": "Do you reject the devil and all proud rebellion against God?\nI reject them.\nDo you renounce the deceit and corruption of evil?\nI renounce them.\nDo you repent of the sins that separate us from God and neighbour?\nI repent of them.\nDo you turn to Christ as Saviour?\nI turn to Christ.\nDo you submit to Christ as Lord?\nI submit to Christ.\nDo you come to Christ, the Way, the Truth and the Life?\nI come to Christ.\n\nThe good Samaritan. Luke 10:30-37.\n\nLook at powerpoint of man building a wall\nTower of Pisa\nPlumb line against the city – Coventry Cathedral\npromises of baptism – often spoken of them as a measuring stick – think of them today as a plumbline set against our own life\ncan get very theoretical – our Gospel reading presents with a very practical challenge",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper102013.txt",
        "raw_ocr_content": "Do you reject the devil and all proud rebellion against God?\nI reject them.\nDo you renounce the deceit and corruption of evil?\nI renounce them.\nDo you repent of the sins that separate us from God and\nneighbour?\nI repent of them.\nDo you turn to Christ as Saviour?\nI turn to Christ.\nDo you submit to Christ as Lord?\nI submit to Christ.\nDo you come to Christ, the Way, the Truth and the Life?\nI come to Christ.\n\nThe good Samaritan. Luke 10:30-37.\n\naor Tae WLS\n\nLook at powerpoint of man building a wall\nTower of Pisa\nPlumb line against the city – Coventry Cathedral\npromises of baptism – often spoken of them as a measuring stick –\nthink of them today as a plumbline set against our own life\ncan get very theoretical – our Gospel reading presents with a very\npractical challenge"
    }
}