{
    "title": "Imitation Beyond Externals",
    "date": "2020-09-27",
    "blurb": "Kevin's sermon on Proper 21 of Year A emphasizes the call to embody the mindset of Christ Jesus, as stated in Philippians 2:5. He draws parallels between fans emulating their favorite characters and Christians imitating Christ, highlighting that true imitation involves a deep conversion of heart and mind. In times of pandemic and societal division, Kevin urges solidarity and service, inspired by the example of Christ and the teachings of St. Francis.",
    "raw_text": "PROPER 21 – Year A – 2020 – Trinity 16\n\n\"Let the same mind be in you that was in Christ Jesus,\" Philippians 2:5\n\nKevin discusses the phenomenon of cult movies or TV series fans dressing up as their favorite characters, comparing this to Christians' call to imitate Christ. However, he clarifies that this imitation should go beyond mere external appearances to a transformation of the heart and mind.\n\nPaul's 'Christ Hymn' in Philippians speaks of Christ's self-emptying love, and Kevin echoes this call for us to embody the same mindset. He warns against self-righteous legalism and instead promotes a conversion that affects every aspect of life.\n\nReflecting on St. Francis' words, Kevin emphasizes the importance of living out the Gospel in all life situations, especially during challenging times like the pandemic. He speaks to the need for hope and solidarity, and the simple acts of service we can offer to support one another.\n\nKevin concludes with the Prayer of St. Francis, which serves as a guide for bringing Christ's light and presence into dark and troubling times.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper212020.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 21 – Year A – 2020 – Trinity 16\nLink to a simple act of worship - https://youtu.be/JBkFkZvTABY\n5Let the same mind be in you that was in Christ Jesus, Philippians 2:5\nThere are a number of what I would call cult movies or TV series that have\nattracted a group of dedicated fans that go to the point of seeking to enter into\nthe lives of their favourite characters. So, anyone taking a walk through\nTollymore Forest Park outside Newcastle, County Down could well encounter\na group dressed as Viking warriors on a ‘Game of Thrones’ tour. Such a\ngroup, dressed in the costume of a favourite character, is being guided around\nthe various spots where particular scenes in the series will have been filmed.\nOr on the first night of the latest ‘Star Wars’ movie, you may well see\ndedicated ‘Star Wars’ followers moving around dressed as Luke Skywalker,\nDarth Vader or such like. They may look like Darth Vader wielding a light\nsabre, they may talk like Darth Vader – but Darth Vader they are not.\nBelieve it or not, all of this came to my mind as I read over the passage\nappointed to be read today from Paul’s Letter to the Philippians. This passage\nis often referred to as the ‘Christ Hymn’. Paul moves into the language of\npoetry as he speaks of Christ emptying himself in total love – for God, for\nmankind – letting go of status, of dignity, of life itself.\nPaul calls his readers across all generations to be like Christ.\n5Let the same mind be in you that was in Christ Jesus,\nThis is an imitation of Christ that goes beyond mere externals.\nPage 2 of 4\nPROPER 21 – Year A – 2020 – Trinity 16\nWe are not talking here about Jesus look-alikes. And it is more than just doing\nand saying the things that Jesus did and said. That can just end up in a pious\nself-righteous legalism.\n5Let the same mind be in you that was in Christ Jesus.\nThis is a matter of the heart. This is conversion; conversion of mind, of soul,\nof heart, of life. This is a matter of what I am, who I am in my life before God.\nPaul encourages us:\nbe of the same mind, having the same love, being in full accord and of\none mind. 3Do nothing from selfish ambition or conceit, but in\nhumility regard others as better than yourselves. 4Let each of you look\nnot to your own interests, but to the interests of others. 5Let the same\nmind be in you that was in Christ Jesus. Phil 2:2-5\nI often find myself reflecting on words of St Francis. ‘Preach the Gospel at all\ntimes – and if necessary, use words.’ This is about bringing Christ into all\nsituations of life, into situations of darkness, of fear, of hopelessness. We are\ncalled to be people of hope in the time and place in which we live.\nHope is a very precious commodity at this particular time. The re-imposition\nof restrictions, as first Dublin and then Donegal moved to level 3, has been\nalmost harder to take than the original lock-down. People embraced the earlier\nrestrictions; there was a feeling that if we stick to this we will beat this thing.\nWith the resurgence in infections, we find ourselves asking; ‘Oh no- what will\nit take to beat this thing?’ Our health workers, still exhausted by the original\nsurge in infections, now find themselves bracing for another. There is a danger\nof society dividing, one sector blaming another. Different groups in the\nPage 3 of 4\nPROPER 21 – Year A – 2020 – Trinity 16\neconomy, such as inner-city traders, pubs and restaurants, feeling that they are\nbeing asked to shoulder a disproportionate burden. There are people seeing\ntheir livelihoods disappear and all that that entails for personal and family\nsecurity. Then of course there are those who are living alone, those who\nendured the period of cocooning, some at considerable cost to their mental and\nphysical health; these are now looking anxiously at the coming darker winter\nmonths.\nWhat is needed now, more so perhaps than at the beginning, is a sense of\nsolidarity one with another. This is where I find the injunction of Paul to ‘5Let\nthe same mind be in you that was in Christ Jesus’ strikes a chord with me at\nthis particular time and place in which we find ourselves.\nI referred earlier to those Darth Vader look-alikes you may see outside a Star\nWars Film Premier, wielding their light sabres, talking in that Darth Vader\nvoice. They may look and sound like Darth Vader but Darth Vader they are\nnot. And so we are not talking about being Christ look-alikes; we are talking\nof bringing the light and presence of Christ into the world in which we live and\nwork.\nIt may not fall to me to be working in a lab developing a vaccine. You and I\nmay not be working in the front line services (though many in our Parish do)\nbut we can offer those simple acts of solidarity with those who do – wash the\nhands, wear the mask, maintain social distance when we are out and about.\nThen there is the simple phone call, knock on the door, the word of\nencouragement to those who are struggling at the minute, the isolated, those\nPage 4 of 4\nPROPER 21 – Year A – 2020 – Trinity 16\nwho are anxious for whatever reason, the lonely. The Prayer of St Francis,\nwhich I often refer to provides a lovely framework for these simple acts of\nsolidarity as we seek to bring the light and presence of Christ into these dark\nand troubling times.\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen"
    }
}