{
    "title": "Grace in Human Frailty",
    "date": "2005-07-10",
    "blurb": "Kevin explores the biblical story of Jacob, emphasizing the theme of grace throughout the narrative. He illustrates how God's grace works through human imperfection, as seen in the lives of biblical figures like Jacob, David, Peter, and Paul. The sermon reassures that God's love is unmerited and constant, and that through grace, we are empowered to become children of God, despite our weaknesses.",
    "raw_text": "Genesis 25 – beginning of the Jacob cycle\n\nA number of years ago, the now thankfully defunct 'News of the World' had as its advertising slogan 'All human life is here'. I remember one of our lecturers at the time remarking that this could more truthfully be applied to the Bible. For in the Bible we see humanity at its best and at its worst, the full range of human emotions from deep despair to exultation.\n\nIn our reading from the Old Testament we now move on to the story of Jacob and we will be following it for the next few weeks. This is a story that encompasses all aspects of our human nature. The Jacob story is part of that bigger saga, the story of the relationship of an emerging people with the God of Abraham, the God of Isaac, the God of Jacob.\n\nIt is a very human story and God is involved at each stage in that story, beginning with God's call to Abram to leave his homeland and to travel to a distant land; with the call there is the promise of descendants. Almost from the outset the promise seems to stall, for Sarai his wife is barren. But after a long wait, and Abram trying to force the pace by having a son Ishmael by his wife's hand-maid Hagar, Sara conceives and bears a son Isaac.\n\nAgain the promise seems to stall. First there is the demand on Abraham to sacrifice his son Isaac and then Isaac's wife, Rebekah herself proves to be barren. But she in turn conceives and, as we read this morning, gives birth to twins, Esau and Jacob.\n\nEach stage in this story involves a gracious act of God, each stage is an outworking of God's grace.\n\nSo begins the complex story of Jacob of his relationship with his twin brother Esau, with his father in law Laban. It is a story of intrigues, of jealousies, of resentments. Jacob, the younger of the brothers obtains the birthright and the blessing due to Esau, leaving a rift between the two brothers. Jacob, captivated by Rachel's beauty, is tricked into marrying her ugly older sister; such is his devotion to Rachel, he works for another seven years.\n\nJacob, in common with his forebears, is presented as a real human being, with all his strengths and failings. Yet it is through Jacob that God chooses to act. The key to it all lies in that word \"grace\". As I said, every stage in this saga of Abraham and Isaac and Jacob involves an outworking of God's grace. God is not limited by human frailty, God works in and through the imperfection of human nature.\n\nThere is a profound statement in a book by Philip Yanci that we have at home, \"What is so amazing about grace?\" It is something of a polemic against a spirituality that on the one hand proclaims justification by faith and then piles on a whole catalogue of rules. It is this; \"There is nothing I can do to make God love me more and there is nothing I can do to make God love me less.\" That is grace, that is the free unmerited love of God, to which I can only respond.\n\nGod can and does work through us, he is not limited by our own particular frailties or failings. This was recognised by the Anglican Reformers as they drew up the 39 Articles – that nestle in small print at the back of our Prayer Books. Article 26 concerns the ministry of unworthy Ministers.\n\n\"Although in the visible Church the evil be mingled with the good, and sometimes the evil have chief authority in the ministration of the Word and Sacraments, yet forasmuch as they do not the same in their own name, but in Christ's, and do minister by his commission and authority, we may use their Ministry, both in hearing the Word of God, and in the receiving of the Sacraments. Neither is the effect of their ordinance taken away by their wickedness, nor is the grace of God's gifts diminished from such as by faith and rightly do receive the Sacraments ministered unto them; which be effectual because of Christ's institution and promise, although they be ministered by evil men.\"\n\nGod did work through Jacob, in all his frailty, as he did through David, through Peter, through Paul in all their ambiguities. All of these found themselves in service almost despite of themselves – David the youngest of the sons of Jesse, who knew his own times of failure before God; Peter, so enthusiastic and at times so weak; Paul – arch persecutor of the Church, severe and hard to work with at times – and at other times so caring. God could take each of them and make up what is lacking.\n\nGod takes us. As we are reminded each Christmas as we hear those wonderful words of the Prologue of St John's Gospel:\n\n\"But to all who received him, who believed in his name, he gave power to become children of God, who were born not of blood, or of the will of the flesh, or of the will of man, but of God.\" (John 1:12-13)\n\nAnd so we stand before God, the one 'in whom we live and move and have our being.', thankful for, in the words of the General Thanksgiving, for our 'creation, preservation and all the blessings of this life; …. for thine inestimable love in the redemption of the world by our Lord Jesus Christ; for the means of grace, and for the hope of glory.' In short, objects of his grace.\n\nStanding before him, we offer ourselves, as we are in his service in all our strengths and weaknesses. We pray that he make take our service in all its inadequacy; that he may make up what is lacking in the power of his Holy Spirit; that is kingdom may be advanced in our homes and in our community.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper102005.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 10 – 2014 – year A – Trinity 4\nGenesis 25 – beginning of the Jacob cycle\nA number of years ago, the now thankfully defunct ‘News of the World’ had as\nits advertising slogan ‘All human life is here’. I remember one of our lecturers\nat the time remarking that this could more truthfully be applied to the Bible.\nFor in the Bible we see humanity at its best and at its worst, the full range of\nhuman emotions from deep despair to exultation.\nIn our reading from the Old Testament we now move on to the story of Jacob\nand we will be following it for the next few weeks. This is a story that\nencompasses all aspects of our human nature. The Jacob story is part of that\nbigger saga, the story of the relationship of an emerging people with the God of\nAbraham, the God of Isaac, the God of Jacob.\nIt is a very human story and God is involved at each stage in that story,\nbeginning with God’s call to Abram to leave his homeland and to travel to a\ndistant land; with the call there is the promise of descendants. Almost from\nthe outset the promise seems to stall, for Sarai his wife is barren. But after a\nlong wait, and Abram trying to force the pace by having a son Ishmael by his\nwife’s hand-maid Hagar, Sara conceives and bears a son Isaac.\nAgain the promise seems to stall. First there is the demand on Abraham to\nsacrifice his son Isaac and then Isaac’s wife, Rebekah herself proves to be\nbarren. But she in turn conceives and, as we read this morning, gives birth to\ntwins, Esau and Jacob.\nEach stage in this story involves a gracious act of God, each stage is an\noutworking of God’s grace.\nPage 2 of 4\nProper 10 – 2014 – year A – Trinity 4\nGenesis 25 – beginning of the Jacob cycle\nSo begins the complex story of Jacob of his relationship with his twin brother\nEsau, with his father in law Laban. It is a story of intrigues, of jealousies, of\nresentments. Jacob, the younger of the brothers obtains the birthright and the\nblessing due to Esau, leaving a rift between the two brothers. Jacob, captivated\nby Rachel’s beauty, is tricked into marrying her ugly older sister; such is his\ndevotion to Rachel, he works for another seven years.\nJacob, in common with his forebears, is presented as a real human being, with\nall his strengths and failings. Yet it is through Jacob that God chooses to act.\nThe key to it all lies in that word “grace” As I said, every stage in this saga of\nAbraham and Isaac and Jacob involves an outworking of God’s grace. God is\nnot limited by human frailty, God works in and through the imperfection of\nhuman nature.\nThere is a profound statement in a book by Philip Yanci that we have at home,\n“What is so amazing about grace?” It is something of a polemic against a\nspirituality that on the one hand proclaims justification by faith and then piles\non a whole catalogue of rules. It is this; “There is nothing I can do to make\nGod love me more and there is nothing I can do to make God love me less.”\nThat is grace, that is the free unmerited love of God, to which I can only\nrespond.\nGod can and does work through us, he is not limited by our own particular\nfrailties or failings. This was recognised by the Anglican Reformers as they\ndrew up the 39 Articles – that nestle in small print at the back of our Prayer\nPage 3 of 4\nProper 10 – 2014 – year A – Trinity 4\nGenesis 25 – beginning of the Jacob cycle\nBooks. Article 26 concerns the ministry of unworthy Ministers. (page 784)\n“Although in the visible Church the evil be mingled with the good, and\nsometimes the evil have chief authority in the ministration of the Word and\nSacraments, yet forasmuch as they do not the same in their own name, but in\nChrist’s, and do minister by his commission and authority, we may use their\nMinistry, both in hearing the Word of God, and in the receiving of the\nSacraments. Neither is the effect of their ordinance taken away by their\nwickedness, nor is the grace of God’s gifts diminished from such as by faith\nand rightly do receive the Sacraments ministered unto them; which be\neffectual because of Christ’s institution and promise, although they be\nministered by evil men.”\nGod did work through Jacob, in all his frailty, as he did through David, through\nPeter, through Paul in all their ambiguities. All of these found themselves in\nservice almost despite of themselves – David the youngest of the sons of Jesse,\nwho knew his own times of failure before God; Peter, so enthusiastic and at\ntimes so weak; Paul – arch persecutor of the Church, severe and hard to work\nwith at times – and at other times so caring. God could take each of them and\nmake up what is lacking.\nGod takes us. As we are reminded each Christmas as we hear those wonderful\nwords of the Prologue of St John’s Gospel:\n“But to all who received him, who believed in his name, he gave power to\nbecome children of God, who were born not of blood, or of the will of the\nflesh, or of the will of man, but of God.” (John 1:12-13)\nPage 4 of 4\nProper 10 – 2014 – year A – Trinity 4\nGenesis 25 – beginning of the Jacob cycle\nAnd so we stand before God, the one ‘in whom we live and move and have our\nbeing.’, thankful for, in the words of the General Thanksgiving, for our\n‘creation, preservation and all the blessings of this life; …. for thine\ninestimable love in the redemption of the world by our Lord Jesus Christ; for\nthe means of grace, and for the hope of glory.’ In short, objects of his grace.\nStanding before him, we offer ourselves, as we are in his service in all our\nstrengths and weaknesses. We pray that he make take our service in all its\ninadequacy; that he may make up what is lacking in the power of his Holy\nSpirit; that is kingdom may be advanced in our homes and in our community."
    }
}