{
    "title": "When God Seems Absent",
    "date": "2019-06-23",
    "blurb": "This sermon discusses the feeling of abandonment by God, especially during times of hardship and suffering. It draws from the experiences of Elijah and a Jewish Rabbi, Harold Kushner, to illustrate that God's presence is often felt not in the spectacular, but in the quiet and in the midst of trauma. The sermon encourages believers to be instruments of God's presence in the lives of others, especially during their darkest times.",
    "raw_text": "PROPER 7 – Year C – 2019 - Trinity 1\n\n'I say to God my rock,\n‘Why have you forgotten me?' Ps 42:11\n\nI recall a few years ago talking with a member of the Parish who had been supporting a cousin as she went through a long and debilitating illness. It was one of those situations in which the quality of life was very poor, when both sufferer and loved ones alike just longed for it to be all over. We sat in silence for a while and then he said, ‘Kevin, I’m afraid God has gone AWOL on this one and I’m cross.’\n\nThis memory came to the surface as I reflected on our lessons set for today, particularly the account of Elijah hiding in the cave, feeling utterly alone and our Psalmist as he complains to God:\n\n'I say to God my rock,\n‘Why have you forgotten me?' Ps 42:11\n\nWhat we are looking at here is that sense of total ‘alone-ness’ that runs deeper than loneliness, that we have all experienced to one degree or another, when life has gone dark, when in the words of my friend, ‘God has gone AWOL’ and we feel hurt and abandoned. Perhaps we could paraphrase the words of the Psalm I took as my text\n\n'I say to God my rock,\n‘Why have you forgotten me?' Ps 42:11\n\nTo read ‘Where is God when the lights go out?’\n\nFrom time to time I find myself reflecting on a little book by Harold Kushner, ‘When bad things happen to good people’. Kushner, a Jewish Rabbi in New York, with wife and child, used to telling others of God’s all embracing love, suddenly discovers that his son has a rare degenerative disease which will cause him to prematurely age and die young. The lights went out and God did not seem to be around. As prayer seems to go unanswered, he finds himself questioning the faith he has proclaimed, the very God he had sought to serve.\n\nThe lights went out for Elijah. After the highs of the victory over the prophets of Baal on Mount Carmel related in the previous chapter, threatened with the revenge of Queen Jezebel, he has fled into the wilderness and we come across him cowering in a cave. Again, there is an ‘alone-ness’ rather than a loneliness. He senses a voice asking what is he doing there, and he gives voice to this alone-ness, as he complains\n\n‘I have been very zealous for the LORD, the God of hosts; for the Israelites have forsaken your covenant, thrown down your altars, and killed your prophets with the sword. I alone am left, and they are seeking my life, to take it away.’ 1 Kings 19:10\n\nThe answer comes not in the spectacular, in the wind, the earthquake, the fire that shook the mountain but in a ‘sound of sheer silence’. And Elijah knows that God is there, that he is not alone, that he has not been abandoned.\n\nKushner and his family find God not in the spectacular, in a dramatic reversal of their son’s decline into a premature old age, but in a deep realisation of God’s presence with them, God’s love for them, for their son, in the midst of their trauma.\n\nThere is a poem that expresses something of this\n\nOne night a man had a dream. He dreamed\nhe was walking along the beach with the LORD.\nAcross the sky flashed scenes from his life.\nFor each scene he noticed two sets of\nfootprints in the sand: one belonging\nto him, and the other to the LORD.\nWhen the last scene of his life flashed before him,\nhe looked back at the footprints in the sand.\nHe noticed that many times along the path of\nhis life there was only one set of footprints.\nHe also noticed that it happened at the very\nlowest and saddest times in his life.\nThis really bothered him and he\nquestioned the LORD about it:\n\n\"LORD, you said that once I decided to follow\nyou, you'd walk with me all the way.\nBut I have noticed that during the most\ntroublesome times in my life,\nthere is only one set of footprints.\nI don't understand why when\nI needed you most you would leave me.\"\n\nThe LORD replied:\n\n\"My son, my precious child,\nI love you and I would never leave you.\nDuring your times of trial and suffering,\nwhen you see only one set of footprints,\nit was then that I carried you.\"\n\nFootprints Author: Carolyn Joyce Carty\n\nWhile a piece of its particular time and culture, this does give expression to the promise of the Risen Christ to his disciples in the closing verses of Matthew’s Gospel:\n\nGo therefore and make disciples of all nations, baptizing them in the\nname of the Father and of the Son and of the Holy Spirit, and teaching\nthem to obey everything that I have commanded you. And remember,\nI am with you always, to the end of the age.” Matt 28:19,20\n\nI am with you always. I am left asking ‘How is that presence experienced?’\n\nThere are those occasions when we experience ‘that sound of sheer silence’, a presence breaking into our ‘alone-ness’. Now ours is an incarnational faith. By that I mean that God can and does work in and through people, ordinary people in simple acts of presence in times of trauma, loneliness, sickness and bereavement.\n\nI paraphrased that verse from our Psalm in the words: ‘Where is God when the lights go out?’ We can be that presence with someone. But we say, ‘I don’t know what to do, I don’t know what to say.’ I go back to that experience of Elijah in the cave as the wind blew, the earthquake struck, and the fire raged. God was there in the ‘sound of sheer silence’. People who have come through some traumatic experience don’t so much remember what was done or what was said; what they do remember is who was there by their side; who was there when the lights went out.\n\nMay God enable us to be open to be instruments of his presence in the life of another.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/proper72019.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 7 – Year C – 2019 - Trinity 1\n11 I say to God my rock,\n‘Why have you forgotten me? Ps 42:11\nI recall a few years ago talking with a member of the Parish who had been\nsupporting a cousin as she went through a long and debilitating illness. It was\none of those situations in which the quality of life was very poor, when both\nsufferer and loved ones alike just longed for it to be all over. We sat in silence\nfor a while and then he said, ‘Kevin, I’m afraid God has gone AWOL on this\none and I’m cross.’\nThis memory came to the surface as I reflected on our lessons set for today,\nparticularly the account of Elijah hiding in the cave, feeling utterly alone and\nour Psalmist as he complains to God:\n11 I say to God my rock,\n‘Why have you forgotten me? Ps 42:11\nWhat we are looking at here is that sense of total ‘alone-ness’ that runs deeper\nthan loneliness, that we have all experienced to one degree or another, when\nlife has gone dark, when in the words of my friend, ‘God has gone AWOL’ and\nwe feel hurt and abandoned. Perhaps we could paraphrase the words of the\nPsalm I took as my text\n11 I say to God my rock,\n‘Why have you forgotten me? Ps 42:11\nTo read ‘Where is God when the lights go out?’\nFrom time to time I find myself reflecting on a little book by Harold Kushner,\n‘When bad things happen to good people’. Kushner, a Jewish Rabbi in New\nYork, with wife and child, used to telling others of God’s all embracing love,\nsuddenly discovers that his son has a rare degenerative disease which will\ncause him to prematurely age and die young. The lights went out and God did\nPage 2 of 4\nPROPER 7 – Year C – 2019 - Trinity 1\nnot seem to be around. As prayer seems to go unanswered, he finds himself\nquestioning the faith he has proclaimed, the very God he had sought to serve.\nThe lights went out for Elijah. After the highs of the victory over the prophets\nof Baal on Mount Carmel related in the previous chapter, threatened with the\nrevenge of Queen Jezebel, he has fled into the wilderness and we come across\nhim cowering in a cave. Again, there is an ‘alone-ness’ rather than a\nloneliness. He senses a voice asking what is he doing there, and he gives voice\nto this alone-ness, as he complains\n‘I have been very zealous for the LORD, the God of hosts; for the\nIsraelites have forsaken your covenant, thrown down your altars, and\nkilled your prophets with the sword. I alone am left, and they are\nseeking my life, to take it away.’ 1 Kings 19:10\nThe answer comes not in the spectacular, in the wind, the earthquake, the fire\nthat shook the mountain but in a ‘sound of sheer silence’. And Elijah knows\nthat God is there, that he is not alone, that he has not been abandoned.\nKushner and his family find God not in the spectacular, in a dramatic reversal\nof their son’s decline into a premature old age, but in a deep realisation of\nGod’s presence with them, God’s love for them, for their son, in the midst of\ntheir trauma.\nThere is a poem that expresses something of this\nOne night a man had a dream. He dreamed\nhe was walking along the beach with the LORD.\nAcross the sky flashed scenes from his life.\nFor each scene he noticed two sets of\nfootprints in the sand: one belonging\nto him, and the other to the LORD.\nWhen the last scene of his life flashed before him,\nPage 3 of 4\nPROPER 7 – Year C – 2019 - Trinity 1\nhe looked back at the footprints in the sand.\nHe noticed that many times along the path of\nhis life there was only one set of footprints.\nHe also noticed that it happened at the very\nlowest and saddest times in his life.\nThis really bothered him and he\nquestioned the LORD about it:\n\"LORD, you said that once I decided to follow\nyou, you'd walk with me all the way.\nBut I have noticed that during the most\ntroublesome times in my life,\nthere is only one set of footprints.\nI don't understand why when\nI needed you most you would leave me.\"\nThe LORD replied:\n\"My son, my precious child,\nI love you and I would never leave you.\nDuring your times of trial and suffering,\nwhen you see only one set of footprints,\nit was then that I carried you.\"\nFootprints Author: Carolyn Joyce Carty\nWhile a piece of its particular time and culture, this does give expression to the\npromise of the Risen Christ to his disciples in the closing verses of Matthew’s\nGospel:\nGo therefore and make disciples of all nations, baptizing them in the\nname of the Father and of the Son and of the Holy Spirit, and teaching\nthem to obey everything that I have commanded you. And remember,\nI am with you always, to the end of the age.” Matt 28:19,20\nI am with you always. I am left asking ‘How is that presence experienced?’\nThere are those occasions when we experience ‘that sound of sheer silence’, a\npresence breaking into our ‘alone-ness’. Now ours is an incarnational faith.\nPage 4 of 4\nPROPER 7 – Year C – 2019 - Trinity 1\nBy that I mean that God can and does work in and through people, ordinary\npeople in simple acts of presence in times of trauma, loneliness, sickness and\nbereavement.\nI paraphrased that verse from our Psalm in the words: ‘Where is God when the\nlights go out?’ We can be that presence with someone. But we say, ‘I don’t\nknow what to do, I don’t know what to say.’ I go back to that experience of\nElijah in the cave as the wind blew, the earthquake struck, and the fire raged.\nGod was there in the ‘sound of sheer silence’. People who have come through\nsome traumatic experience don’t so much remember what was done or what\nwas said; what they do remember is who was there by their side; who was there\nwhen the lights went out.\nMay God enable us to be open to be instruments of his presence in the life of\nanother."
    }
}