{
    "title": "Journey of Faith and Baptism",
    "date": "2018-08-05",
    "blurb": "Kevin's sermon on Proper 15, Year B, focuses on the themes of baptism, dying to sin, and rising to new life in Christ. He emphasizes the ongoing process of letting go of the past and embracing a future in Christ, highlighting the trust and obedience required in the life of faith. The sermon also explores the symbolism in the Gospel of John, particularly the language of eating and drinking the body and blood of Christ, and how this relates to the intimacy of our relationship with Jesus.",
    "raw_text": "This morning we welcome Ronan and Adele as they bring their daughter Everleigh to be baptised. Baptism is one of the great Gospel sacraments and we find its meaning in the death and resurrection of Jesus Christ. In the early days when total immersion was the norm, the person to be baptised went right down into the water. The old person went down and the new person came up.\n\n>If anyone is in Christ, he is a new creation, ...\n\nAnd so the promises are introduced with those lovely words\n\n>In baptism, God calls us from darkness into his marvellous light.\n>To follow Christ means dying to sin and rising to new life with him.\n\nDying, rising, these are ongoing processes that continues through life, as we let go of the old and lay hold of the new. Elsewhere, we read those lovely words from the Letter to the Ephesians – of growing into Christ, becoming more and more like Christ.\n\nDying to sin – rising to new life ...The life of faith is a movement between the 'no longer' of the past and the 'not yet' of the future. A letting go of past fears, past regrets, past failures, past resentments and reaching out to a new future in Christ who has made me his own. This is the basis of the trust in our trusting obedience of faith; a handing over of our cares, our anxieties; a placing of our plans, our projects into the hands of God.\n\nThe life of faith – a life of trusting obedience of the God who has encountered me and redeemed me in Christ. An integral part of that trusting obedience is a willingness be serve coupled with a willingness to be served; a willingness to offer myself in service of God and his Church coupled with that willingness to be waited upon, to be ministered to, by Christ himself.\n\nThere is something of the dynamic of the communion service in all this. We come not trusting in our own righteousness but in God's manifold and great mercy, not worthy to gather up the crumbs under his table and yet, in hands outstretched at the communion rails, we seek God's reconciling and renewing strength.\n\nOur Gospel reading continues in our reading of the 6th chapter of John's Gospel. Following on from the feeding of the multitude, there is a long discourse on feeding, the contrast between the manna given in the desert of Sinai and God's provision in Jesus as the true bread that comes down from heaven. There follows the passage we read as our Gospel reading today. This whole chapter is couched in language rich in symbolism, that needs to be set in the context of the approaching Passover Festival, with its themes of sacrifice.\n\nLanguage that also needs to be set in the context of Jesus' approaching death and resurrection and also the Christian Eucharist.\n\nAnd so we have read this 6th chapter, John tells us of Jesus saying,\n\n>'Jesus said to the Jews: 51'I am the living bread that came down from heaven. Whoever eats of this bread will live for ever; and the bread that I will give for the life of the world is my flesh.'\n\nIn our portion today he goes on to say:\n\n>'Very truly, I tell you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in you. ... 55for my flesh is true food and my blood is true drink. 56Those who eat my flesh and drink my blood abide in me, and I in them.'\n\nEating and drinking ... abiding in me and I in you ... this speaks of intimacy, of identification. To eat of the body is to identify with the death of Jesus – the body of Christ given for you. To drink of the blood is to identify with the risen life of Jesus – the blood of Christ shed for you. There is something life giving, life enhancing in this identification that goes beyond the formality of the Communion Service into a daily walk with Christ, a journey with Christ, a journey into Christ.\n\nBaptism, with its themes of dying and rising with Christ, is an invitation to embark on this journey of a lifetime. As so this morning we welcome Everleigh into the fellowship of the Church in Baptism. May she, with the encouragement of her parents and the support of this community, come to know in her own life, in all that lies ahead of her, the life giving, life enhancing presence of Christ in her life.\n\nMay we go out from this place to live the faith we profess, in trusting obedience of the one who has met us in Christ, as ones sent out in the power of the Spirit to live and work to the praise and glory of God.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper152018.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 15 – Year B – 2015 – Trinity 12\nThis morning we welcome Ronan and Adele as they bring their daughter\nEverleigh to be baptised. Baptism is one of the great Gospel sacraments and\nwe find its meaning in the death and resurrection of Jesus Christ. In the early\ndays when total immersion was the norm, the person to be baptised went right\ndown into the water. The old person went down and the new person came up.\nIf anyone is in Christ, he is a new creation, ……\nAnd so the promises are introduced with those lovely words\nIn baptism, God calls us from darkness into his marvellous light.\nTo follow Christ means dying to sin and rising to new life with him.\nDying, rising, these are ongoing processes that continues through life, as we let\ngo of the old and lay hold of the new. Elsewhere, we read those lovely words\nfrom the Letter to the Ephesians – of growing into Christ, becoming more and\nmore like Christ.\nDying to sin – rising to new life …The life of faith is a movement between the\n‘no longer’ of the past and the ‘not yet’ of the future. A letting go of past fears,\npast regrets, past failures, past resentments and reaching out to a new future in\nChrist who has made me his own. This is the basis of the trust in our trusting\nobedience of faith; a handing over of our cares, our anxieties; a placing of our\nplans, our projects into the hands of God.\nThe life of faith – a life of trusting obedience of the God who has encountered\nme and redeemed me in Christ. An integral part of that trusting obedience is a\nwillingness be serve coupled with a willingness to be served; a willingness to\nPage 2 of 3\nPROPER 15 – Year B – 2015 – Trinity 12\noffer myself in service of God and his Church coupled with that willingness to\nbe waited upon, to be ministered to, by Christ himself..\nThere is something of the dynamic of the communion service in all this. We\ncome not trusting in our own righteousness but in God’s manifold and great\nmercy, not worthy to gather up the crumbs under his table and yet, in hands\noutstretched at the communion rails, we seek God’s reconciling and renewing\nstrength.\nOur Gospel reading continues in our reading of the 6th chapter of John’s\nGospel. Following on from the feeding of the multitude, there is a long\ndiscourse on feeding, the contrast between the manna given in the desert of\nSinai and God’s provision in Jesus as the true bread that comes down from\nheaven. There follows the passage we read as our Gospel reading today. This\nwhole chapter is couched in language rich in symbolism, that needs to be set in\nthe context of the approaching Passover Festival, with its themes of sacrifice.\nLanguage that also needs to be set in the context of Jesus’ approaching death\nand resurrection and also the Christian Eucharist.\nAnd so we have read this 6th chapte, John tells us of Jesus saying,\n‘Jesus said to the Jews: 51‘I am the living bread that came down from\nheaven. Whoever eats of this bread will live for ever; and the bread\nthat I will give for the life of the world is my flesh.’\nIn our portion today he goes on to say:\n….‘Very truly, I tell you, unless you eat the flesh of the Son of Man\nand drink his blood, you have no life in you. ….. 55for my flesh is true\nfood and my blood is true drink. 56Those who eat my flesh and drink\nmy blood abide in me, and I in them.’\nPage 3 of 3\nPROPER 15 – Year B – 2015 – Trinity 12\nEating and drinking … abiding in me and I in you ….. this speaks of intimacy,\nof identification. To eat of the body is to identify with the death of Jesus – the\nbody of Christ given for you. To drink of the blood is to identify with the risen\nlife of Jesus – the blood of Christ shed for you. There is something life giving,\nlife enhancing in this identification that goes beyond the formality of the\nCommunion Service into a daily walk with Christ, a journey with Christ, a\njourney into Christ.\nBaptism, with its themes of dying and rising with Christ, is an invitation to\nembark on this journey of a lifetime. As so this morning we welcome\nEverleigh into the fellowship of the Church in Baptism. May she, with the\nencouragement of her parents and the support of this community, come to\nknow in her own life, in all that lies ahead of her, the life giving, life enhancing\npresence of Christ in her life.\nMay we go out from this place to live the faith we profess, in trusting\nobedience of the one who has met us in Christ, as ones sent out in the power of\nthe Spirit to live and work to the praise and glory of God."
    }
}