{
    "title": "Rediscovering Faith",
    "date": "2016-06-19",
    "blurb": "In this sermon, Kevin discusses the influence of various individuals on his life and faith journey, particularly highlighting the impact of Bishop Richard Holloway. He relates his experiences to the biblical story of Elijah, emphasizing moments of doubt and rediscovery in one's faith journey. The sermon encourages the congregation to find God in the stillness and quiet places of their hearts, assuring them of God's constant presence and understanding.",
    "raw_text": "Every so often I will find myself discussing with people different people who have left a mark on their lives, who have influenced their way of thinking. Many of us will look back to particular teachers in school or college. I have often referred to my Physics teacher, total eccentric, brilliant teacher, devout Anglican who got me thinking about issues of faith. Over the years, as I have developed my own thinking, I have come to be indebted to a number of Christian leaders. One of these for me is Bishop Richard Holloway, former Primus of the Church of Scotland. He is a writer who has appealed to me since I first heard him speak at a post Easter Clergy Conference shortly after I went to Ahoghill. After his retirement he wrote a particular book, 'Leaving Alexandria'. When I first heard of it I thought it referred to a shift in his theological thinking – Alexandria was one of the centres of theological thinking in the early Church.\n\nAs I discovered when the book arrived through the post, the Alexandria Bishop Holloway is referring to is, in fact, the district in Glasgow where he had grown up, the son of working class parents with little or no Church connection. He remembers the poverty of Glasgow in those days, the distances his father had to travel to obtain work. He had been drawn into the life of the local Parish and, encouraged by the Rector, Richard had been sent to school with a religious community in England and for a while he had joined the community and they sent him to Ghana. During his time there he left the community and returned to Scotland to be ordained in the Episcopal Church of Scotland. Apart from a short period in Union Theological College in New York, he spent his early years working in the Gorbals district of Glasgow.\n\nHis book is a very honest book in which he confronts his times of failure, his strengths and weaknesses, his disappointments and frustrations with himself, his unease with the structures of the Church, his experience of doubt. As I read it, I realised why this man’s writings had appealed to me, how I could see something of my own haphazard journey to faith in his.\n\nHe recalls one particular period early in his ministry when, in his own words, 'God went absent'. To the outsider his had been a successful ministry. He had taken over a Parish and breathed new life into it; he had reordered the Church, developed the worship; he had involved the Parish in social action in the community.\n\nAnd in the midst of it, 'God went absent'. He didn’t seem to be there anymore, in prayer, in worship, in what he was doing. He felt he had two choices. He could abandon all idea of God, to take the view that there was nothing beyond our own experience – or he could seek to rediscover. He rejected the first option of radical disbelief and embarked upon the second. His subsequent ministry and writings bear witness to his journey of rediscovery.\n\nThis particular section struck a chord with me as I reflected on Old Testament lesson set for today, as we continue to follow the story of Elijah. In previous readings we have seen a strong and confident Elijah; the prophet who confronted the prophets of Baal, who denounced Ahab. Today we see a different Elijah as he flees from the wrath of Jezebel. He had been in danger before – but this is different and we find him hiding in a cave on Mount Horeb.\n\nAt the heart of the story is the question, 'What are you doing here Elijah?' It is a question of someone who is not in the right place, someone who is on the run, on the run from Jezebel, from God, from himself. Elijah pours out a string of complaints. 'This job is too hard, I can’t do it by myself.'\n\nWe have that wonderful account of God revealing himself – not in wind, or earthquake or fire but in a gentle whisper, a still small voice.\n\nWhich of us cannot at some time identify with Elijah as he hides in the desert cave; with Richard Holloway as he felt 'God had gone absent'? There may be a particular reason, a personal crisis, a serious illness or bereavement – or it may just come upon us. We may hear that voice, we may ask ourselves, 'What am I doing here?' This is not where I should be, this is not where I want to be. We feel a loneliness within ourselves, going through the motions of worship, of prayer, of service.\n\nAs I re-read the passage we read this morning, the thought struck me that it was not Elijah who sought out God it was God who had sought out Elijah. 'Be still', the psalmist said, 'and know that I am God'. The God we seek, the God we serve, the God we seek to avoid is present. Present at the mouth of whatever cave we may be sheltering in; present even in his apparent absence.\n\nIt is in the stillness, when the striving and the fretting stops, that we sense his presence, that we are present to him. We realise that we are heard, that we are understood, and that we are not alone. I will close with the blessing I will often use at the end of our services, which I will always use with confirmation groups at the end of our last session and with each 6th class at the end of their end of year service.\n\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place of your heart, where he will speak with you;\nknow that he watches over you – that he listens to you in gentle understanding, that he is with you always, wherever you are and however you may feel:\nand the blessing of God Almighty, the Father, the Son and the Holy Spirit be upon you and remain with you always.\nAmen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper72016 - rehash of 2013.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 7 – 2016 – Year C – Trinity 4\nEvery so often I will find myself discussing with people different people who\nhave left a mark on their lives, who have influenced their way of thinking.\nMany of us will look back to particular teachers in school or college. I have\noften referred to my Physics teacher, total eccentric, brilliant teacher, devout\nAnglican who got me thinking about issues of faith. Over the years, as I have\ndeveloped my own thinking, I have come to be indebted to a number of\nChristian leaders. One of these for me is Bishop Richard Holloway, former\nPrimus of the Church of Scotland. He is a writer who has appealed to me since\nI first heard him speak at a post Easter Clergy Conference shortly after I went\nto Ahoghill. After his retirement he wrote a particular book, ‘Leaving\nAlexandria’. When I first heard of it I thought it referred to a shift in his\ntheological thinking – Alexandria was one of the centres of theological\nthinking in the early Church.\nAs I discovered when the book arrived through the post, the Alexandria Bishop\nHolloway is referring to is, in fact, the district in Glasgow where he had grown\nup, the son of working class parents with little or no Church connection. He\nremembers the poverty of Glasgow in those days, the distances his father had\nto travel to obtain work. He had been drawn into the life of the local Parish\nand, encouraged by the Rector, Richard had been sent to school with a\nreligious community in England and for a while he had joined the community\nand they sent him to Ghana. During his time there he left the community and\nreturned to Scotland to be ordained in the Episcopal Church of Scotland. Apart\nfrom a short period in Union Theological College in New York, he spent his\nearly years working in the Gorbals district of Glasgow.\nPage 2 of 4\nPROPER 7 – 2016 – Year C – Trinity 4\nHis book is a very honest book in which he confronts his times of failure, his\nstrengths and weaknesses, his disappointments and frustrations with himself,\nhis unease with the structures of the Church, his experience of doubt. As I read\nit, I realised why this man’s writings had appealed to me, how I could see\nsomething of my own haphazard journey to faith in his.\nHe recalls one particular period early in his ministry when, in his own words,\n‘God went absent’. To the outsider his had been a successful ministry. He had\ntaken over a Parish and breathed new life into it; he had reordered the Church,\ndeveloped the worship; he had involved the Parish in social action in the\ncommunity.\nAnd in the midst of it, ‘God went absent’. He didn’t seem to be there anymore,\nin prayer, in worship, in what he was doing. He felt he had two choices. He\ncould abandon all idea of God, to take the view that there was nothing beyond\nour own experience – or he could seek to rediscover. He rejected the first\noption of radical disbelief and embarked upon the second. His subsequent\nministry and writings bear witness to his journey of rediscovery.\nThis particular section struck a chord with me as I reflected on Old Testament\nlesson set for today, as we continue to follow the story of Elijah. In previous\nreadings we have seen a strong and confident Elijah; the prophet who\nconfronted the prophets of Baal, who denounced Ahab. Today we see a\ndifferent Elijah as he flees from the wrath of Jezebel. He had been in danger\nbefore – but this is different and we find him hiding in a cave on Mount Horeb.\nPage 3 of 4\nPROPER 7 – 2016 – Year C – Trinity 4\nAt the heart of the story is the question, ‘What are you doing here Elijah?’ It is\na question of someone who is not in the right place, someone who is on the run,\non the run from Jezebel, from God, from himself. Elijah pours out a string of\ncomplaints. ‘This job is too hard, I can’t do it by myself.’\nWe have that wonderful account of God revealing himself – not in wind, or\nearthquake or fire but in a gentle whisper, a still small voice.\nWhich of us cannot at some time identify with Elijah as he hides in the desert\ncave; with Richard Holloway as he felt ‘God had gone absent’? There may be\na particular reason, a personal crisis, a serious illness or bereavement – or it\nmay just come upon us. We may hear that voice, we may ask ourselves, ‘What\nam I doing here?’ This is not where I should be, this is not where I want to be.\nWe feel a loneliness within ourselves, going through the motions of worship, of\nprayer, of service.\nAs I re-read the passage we read this morning, the thought struck me that it was\nnot Elijah who sought out God it was God who had sought out Elijah. ‘Be\nstill’, the psalmist said, ‘and know that I am God’. The God we seek, the God\nwe serve, the God we seek to avoid is present. Present at the mouth of\nwhatever cave we may be sheltering in; present even in his apparent absence.\nIt is in the stillness, when the striving and the fretting stops, that we sense his\npresence, that we are present to him. We realise that we are heard, that we are\nunderstood, and that we are not alone. I will close with the blessing I will often\nuse at the end of our services, which I will always use with confirmation\nPage 4 of 4\nPROPER 7 – 2016 – Year C – Trinity 4\ngroups at the end of our last session and with each 6th class at the end of their\nend of year service.\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen."
    }
}