{
    "title": "Faith and Worldly Values",
    "date": "2009-09-20",
    "blurb": "Kevin reflects on the tension between faith and life in the world, as exemplified in the Gospel reading where Jesus's disciples discuss their status. He emphasizes the importance of Christian values over worldly hierarchies and individualism, and the role of the church community in supporting each other to live as disciples of Christ. The sermon also highlights the significance of Baptism and the Christian conviction of Incarnation.",
    "raw_text": "In his final address as Prime Minister to the people of Northern Ireland, as the Province began to slide into the turmoil that was to last over thirty years, the late Terence O'Neill made the following observation: 'Our religion could have enriched our politics; instead we have allowed our politics to demean our religion.' He was talking about a tension that was far from unique to Northern Ireland, that in truth has manifested itself in maybe subtler ways in the whole of Ireland and societies right across the world, the tension between the life of faith and life in the world.\n\nWe have seen it in our Gospel reading set for today as Jesus asks the disciples what they were discussing as they walked along. Set in the wider context of Jesus' teaching on self-giving and his own coming rejection and death, they confess they had been talking of their relative status. These men who were following Jesus were ordinary fallible human beings. Like ourselves they were products of the society into which they had been born and in which they grew up; their attitudes, their way of thinking moulded by that environment. It was very much a hierarchical society. In hierarchies it is important to establish where you stand. When we move into new situations it is natural to carry over the attitudes and priorities with which we are familiar. And so as they settle in to this new kind of living to which Jesus has called them, they bring some of the baggage of their old way of life – who is on the top of the heap, who is on the bottom.\n\nA large part of discipleship was that of learning a new, different set of values. There is an ongoing tension that has run right through history as to which set of values, the values of faith or the values of the world, which is going to predominate. That realisation is what lay at the heart of what Terence O'Neill said back before the Troubles as he challenged people to examine where the balance lay at that particular point in the history of Northern Ireland. 'Our religion could have enriched our politics; instead we have allowed our politics to demean our religion.'\n\nThis morning, at the 11:00 service, we are celebrating the great Gospel Sacrament of Baptism. At the heart of this sacrament lies an understanding of membership expressed in terms of the Body of Christ along with fundamental questions about values. What are the values we are going to teach this child; what are the values that motivate our own lives as individuals, as families, as a community as we undertake our own journey through life?\n\nOne of the core convictions of the Christian faith is expressed in the idea of Incarnation, that in the person of Jesus man encounters God. As Bishop David Jenkins once said, 'Jesus is the face of God towards us'. But not only that, in the Incarnation, God experiences what it is to be human. So Paul, in writing to the Philippians will talk of God in Christ 'emptying himself, taking the form of a servant...humbling himself.' In turn Augustine speaks of God 'becoming like us so that we might become like him.'\n\nAs members of the Body of Christ, making our own response of faith to the God we meet in the life and ministry of Jesus, we are called to become like him, signs of the presence of God in the world in which we live and work, in all the ambiguities in which we find ourselves. As we seek to live the life of faith in this flawed and imperfect word in which we find ourselves I know many of you face choices in your place of work, maybe none of which you feel totally comfortable with. Maybe all we can offer is our Christian integrity as we seek the best, the most honourable way forward.\n\nIn a world of increasing individualism, in which the bonds of community and even family are under increasing stress, it is important to remind ourselves that we do this, not as isolated individuals, but as members of a community that meets together, worships together and cares for one another. And so there is not just the witness of the individual, there is the witness of the community. We are the Body of Christ in this place; or, as I once heard said at a Diocesan Retreat, 'a community of friends drawn together by the friendship of Jesus'. In our common life of worship, of service, of mutual care and friendship we are called to demonstrate to the world a different way of living in the world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Proper 20 - 2009.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 20 – year B – 2009 – Trinity 15\nIn his final address as Prime Minister to the people of Northern Ireland, as the Province\nbegan to slide into the turmoil that was to last over thirty years, the late Terence O’Neill\nmade the following observation: ‘Our religion could have enriched our politics; instead\nwe have allowed our politics to demean our religion.’ He was talking about a tension that\nwas far from unique to Northern Ireland, that in truth has manifested itself in maybe\nsubtler ways in the whole of Ireland and societies right across the world, the tension\nbetween the life of faith and life in the world.\nWe have seen it in our Gospel reading set for today as Jesus asks the disciples what they\nwere discussing as they walked along. Set in the wider context of Jesus’ teaching on self\ngiving and his own coming rejection and death, they confess they had been talking of their\nrelative status. These men who were following Jesus were ordinary fallible human beings.\nLike ourselves they were products of the society into which they had been born and in\nwhich they grew up; their attitudes, their way of thinking moulded by that environment. It\nwas very much a hierarchical society. In hierarchies it is important to establish where you\nstand. When we move into new situations it is natural to carry over the attitudes and\npriorities with which we are familiar. And so as they settle in to this new kind of living to\nwhich Jesus has called them, they bring some of the baggage of their old way of life – who\nis on the top of the heap, who is on the bottom.\nA large part of discipleship was that of learning a new, different set of values. There is an\nongoing tension that has run right through history as to which set of values, the values of\nfaith or the values of the world, which is going to predominate. That realisation is what lay\nat the heart of what Terence O’Neill said back before the Troubles as he challenged people\nto examine where the balance lay at that particular point in the history of Northern Ireland.\n‘Our religion could have enriched our politics; instead we have allowed our politics to\ndemean our religion.’\nPage 2 of 4\nProper 20 – year B – 2009 – Trinity 15\nThis morning, at the 11:00 service, we are celebrating the great Gospel Sacrament of\nBaptism. At the heart of this sacrament lies an understanding of membership expressed in\nterms of the Body of Christ along with fundamental questions about values. What are the\nvalues we are going to teach this child; what are the values that motivate our own lives as\nindividuals, as families, as a community as we undertake our own journey through life?\nOne of the core convictions of the Christian faith is expressed in the idea of Incarnation,\nthat in the person of Jesus man encounters God. As Bishop David Jenkins once said,\n‘Jesus is the face of God towards us’. But not only that, in the Incarnation, God\nexperiences what it is to be human. So Paul, in writing to the Philippians will talk of God\nin Christ ‘emptying himself, taking the form of a servant….humbling himself.’ In turn\nAugustine speaks of God ‘becoming like us so that we might become like him.’\nAs members of the Body of Christ, making our own response of faith to the God we meet\nin the life and ministry of Jesus, we are called to become like him, signs of the presence of\nGod in the world in which we live and work, in all the ambiguities in which we find\nourselves. As we seek to live the life of faith in this flawed and imperfect word in which\nwe find ourselves I know many of you face choices in your place of work, maybe none of\nwhich you feel totally comfortable with. Maybe all we can offer is our Christian integrity\nas we seek the best, the most honourable way forward.\nIn a world of increasing individualism, in which the bonds of community and even family\nare under increasing stress, it is important to remind ourselves that we do this, not as\nisolated individuals, but as members of a community that meets together, worships\ntogether and cares for one another. And so there is not just the witness of the individual,\nthere is the witness of the community. We are the Body of Christ in this place; or, as I\nonce heard said at a Diocesan Retreat, ‘a community of friends drawn together by the\nfriendship of Jesus’. In our common life of worship, of service, of mutual care and\nfriendship we are called to demonstrate to the world a different way of living in the world.\nPage 3 of 4\nProper 20 – year B – 2009 – Trinity 15\nI would often say that a Baptism is a good time to reflect on our own individual lives\nbefore God as we hear the Baptismal promises made on behalf of the child being baptised.\nThere is another undertaking in the Service of Baptism made not by the parents and\ngodparents but by the Church community. After the parents and godparents have given\ntheir undertakings on behalf of the child, the following question is put to the congregation:\n‘You have heard these our brothers and sisters respond to Christ.\nWill you support them in this calling?’\nThe congregation answers; ‘We will support them.’\nThe Service then continues with the ‘Signing of the Cross’ as the priest says\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nHow do we as a community support not only the children being baptised, not only their\nparents and godparents? How do we support one another as we seek to live as disciples of\nChrist, as we try to fight the good fight; as at times we struggle to finish the race, keep the\nfaith?\nWe are now moving into the next stage of the Church 21 process that we started with the\nmeetings over the course of Lent. At this stage in the process we are asking ourselves two\nquestions. First, ‘What things are we doing well?’ There is a great deal that is positive\nthat we want to affirm. Secondly ‘Are there things we are doing that we would like to do\nbetter?’ To do this it would be good to get a ‘snap shot’ of where we are, who we are as a\ncommunity. So over the next couple of weeks we are placing a board in the porch that\nwill have on it a Time Line. We would invite you to place upon that maybe pictures,\nPage 4 of 4\nProper 20 – year B – 2009 – Trinity 15\ndrawings, a few comments of events that you consider important in your own life, the life\nof the Parish, of Howth, or wider. There will be another board on which I am placing two\nsimple questions ‘What does God mean to me?’ and ‘What does the Church mean to me?’\nWe are just looking for simple comments that need not be signed. The idea is that before\nwe embark upon any journey we reflect on who we are as a community before God. so\nthat we may move forward together as the Body of Christ in this place that we may be\nliving and effectual signs of God’s presence in this place and time in which God has\nplaced us."
    }
}