{
    "title": "Witness and Forgiveness",
    "date": "2013-06-16",
    "blurb": "Kevin discusses the importance of witness in the Christian faith, using the story of Elijah and the clash of cultures in the Old Testament as a backdrop. He emphasizes the need for Christians to live as disciples of Christ, bearing witness not only with words but also through their lives. The sermon also touches on the themes of inclusion, forgiveness, and self-awareness, contrasting the judgmental attitude of Simon the Pharisee with the welcoming and forgiving approach of Jesus.",
    "raw_text": "PROPER 6 – 2013 – year C – Trinity 3\n\nAs I said a couple of weeks ago, during these Sundays of the season of Trinity we are, in the course of our Old Testament readings following some of the big stories of the Old Testament. We are currently following the story of Elijah who lived and worked in the Kingdom of Israel after the break up of the Kingdom of Israel following the death of Solomon. Ahab was king, married to Jezebel, who was of Phoenician origin. Jezebel had brought different religious practices with her to Samaria and a different understanding about royal power and prerogatives.\n\nA couple of weeks ago, as we read of Elijah confronting the prophets of Baal on Mount Carmel, I remarked that this was a clash of two cultures. Our Old Testament lesson today presents us with another example of this clash of cultures. For Ahab and Jezebel, the King’s word, the King’s desires were law. Nobody and nothing – and certainly not an insignificant little man who owned a vineyard the King had his eyes on – could stand in the way. But Elijah spoke of a different culture, in which everyone, Kings included, were subject to the God of Israel.\n\nThe two cultures met in Naboth’s vineyard – and truth speaks to power. What we are talking about here is witness. This morning, at our 11:00am service we are welcoming a child into the fellowship of the Church in Baptism. As members of the Church we all have a vocation of witness, to show Christ to the world, to be the Body of Christ in our homes, our places of work and recreation; bearing our witness not only with our lips but with our lives. As I sign the child with the sign of the Cross I will say:\n\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n\nand the congregation will join in\n\n> Confess Christ crucified,\n> proclaim his resurrection,\n> look for his coming in glory.\n\nWitness, Christian witness, of course can be a word loaded with all sorts of associations. It can summon up in our thoughts other words – judgemental, condescending, superior. Our Gospel reading gives us the story of Jesus being invited to share a meal in the house of Simon the Pharisee and the reactions of Simon to the arrival of a highly undesirable intruder. Simon views both the woman and Jesus through the lenses of his training and discipline as a Pharisee. In the woman he sees a sinner and in Jesus he sees a teacher of dubious credentials. Jesus sees the same woman and sees one who, acutely aware of her sin in the past is moving on from her brokenness. Simon’s body language no doubt spoke of rejection; Jesus spoke words of inclusion and forgiveness.\n\nAs I read this passage I think of the Parable told by Jesus of the Pharisee and the Tax Collector, both of whom had gone to the Temple to pray. The Pharisee, so full of his own self importance, self-righteousness, sees only the sin of the other. It is the tax collector, who sees only too clearly his own sin, who goes home at peace with God. Then of course there was that ridiculous but pointed illustration of the futility of taking a speck out of our brother’s eye while we still have a plank in our own.\n\nWhich brings me back to the topic of witness. We can only witness out of a realisation of our own brokenness. We can only address the faults of others if we aware of our own need of inner healing and forgiveness.\n\nAs parents rearing our own children, particularly as they move into their teenage years, we learn the importance of ‘Do as I do’ if the ‘Do as I say’ is to have any authority. In the context of Confirmation Classes, as we discuss the commandment ‘Honour your father and your mother’, I will often point out to the young people as they resist their parents to remember that their parents were once too their age and made their own mistakes – and they don’t want them to make the same mistakes as they did.\n\nTo go back to our Gospel reading; two people looking at the woman at Jesus’ feet. Simon sees a woman who has made a mess of her life and views her and Jesus with contempt. Jesus sees the same woman, but he brings her out of the darkness of her past to a point of profound inner healing.\n\nIf the Church is to have any authority to speak to the world of today, we too must first find ourselves in our own weakness and failure at the feet of Christ so that, knowing for ourselves his love and forgiveness, we might speak and act in his name in the world of today.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper62013.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 6 – 2013 – year C – Trinity 3\nAs I said a couple of weeks ago, during these Sundays of the season of Trinity\nwe are, in the course of our Old Testament readings following some of the big\nstories of the Old Testament. We are currently following the story of Elijah\nwho lived and worked in the Kingdom of Israel after the break up of the\nKingdom of Israel following the death of Solomon. Ahab was king, married to\nJezebel, who was of Phoenician origin. Jezebel had brought different religious\npractices with her to Samaria and a different understanding about royal power\nand prerogatives.\nA couple of weeks ago, as we read of Elijah confronting the prophets of Baal\non Mount Carmel, I remarked that this was a clash of two cultures. Our Old\nTestament lesson today presents us with another example of this clash of\ncultures.\nFor Ahab and Jezebel, the King’s word, the King’s desires were law. Nobody\nand nothing – and certainly not an insignificant little man who owned a\nvineyard the King had his eyes on – could stand in the way. But Elijah spoke\nof a different culture, in which everyone, Kings included, were subject to the\nGod of Israel.\nThe two cultures met in Naboth’s vineyard – and truth speaks to power.\nWhat we are talking about here is witness. This morning, at our 11:00am\nservice we are welcoming a child into the fellowship of the Church in Baptism.\nAs members of the Church we all have a vocation of witness, to show Christ to\nthe world, to be the Body of Christ in our homes, our places of work and\nPage 2 of 3\nPROPER 6 – 2013 – year C – Trinity 3\nrecreation; bearing our witness not only with our lips but with our lives. As I\nsign the child with the sign of the Cross I will say:\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nand the congregation will join in\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\nWitness, Christian witness, of course can be a word loaded with all sorts of\nassociations. It can summon up in our thoughts other words – judgemental,\ncondescending, superior. Our Gospel reading gives us the story of Jesus being\ninvited to share a meal in the house of Simon the Pharisee and the reactions of\nSimon to the arrival of a highly undesirable intruder. Simon views both the\nwoman and Jesus through the lenses of his training and discipline as a Pharisee.\nIn the woman he sees a sinner and in Jesus he sees a teacher of dubious\ncredentials. Jesus sees the same woman and sees one who, acutely aware of\nher sin in the past is moving on from her brokenness. Simon’s body language\nno doubt spoke of rejection; Jesus spoke words of inclusion and forgiveness.\nAs I read this passage I think of the Parable told by Jesus of the Pharisee and\nthe Tax Collector, both of whom had gone to the Temple to pray. The\nPharisee, so full of his own self importance, self-righteousness, sees only the\nsin of the other. It is the tax collector, who sees only too clearly his own sin,\nwho goes home at peace with God. Then of course there was that ridiculous\nbut pointed illustration of the futility of taking a speck out of our brother’s eye\nwhile we still have a plank in our own.\nPage 3 of 3\nPROPER 6 – 2013 – year C – Trinity 3\nWhich brings me back to the topic of witness. We can only witness out of a\nrealisation of our own brokenness. We can only address the faults of others if\nwe aware of our own need of inner healing and forgiveness.\nAs parents rearing our own children, particularly as they move into their\nteenage years, we learn the importance of ‘Do as I do’ if the ‘Do as I say’ is to\nhave any authority. In the context of Confirmation Classes, as we discuss the\ncommandment ‘Honour your father and your mother’, I will often point out to\nthe young people as they resist their parents to remember that their parents\nwere once too their age and made their own mistakes – and they don’t want\nthem to make the same mistakes as they did.\nTo go back to our Gospel reading; two people looking at the woman at Jesus’\nfeet. Simon sees a woman who has made a mess of her life and views her and\nJesus with contempt. Jesus sees the same woman, but he brings her out of the\ndarkness of her past to a point of profound inner healing.\nIf the Church is to have any authority to speak to the world of today, we too\nmust first find ourselves in our own weakness and failure at the feet of Christ\nso that, knowing for ourselves his love and forgiveness, we might speak and\nact in his name in the world of today."
    }
}