{
    "title": "Funeral of Rev Jack Heaslip",
    "date": "2015-02-26",
    "blurb": "This sermon is a tribute to Rev Jack Heaslip, a man who made a lasting impression on many people in various ways. It reflects on the faith that inspired him and that he shared so faithfully. The sermon also discusses the concept of faith, the journey of learning, and the hope we have in Christ of life, resurrection life, and eternal life.",
    "raw_text": "We gather here in St Mary’s in Howth for the funeral of Jack Heaslip, to honour the memory of a man who made a lasting impression on so many people in so many ways. Jack being Jack had certain views as to how his funeral was to be conducted – the sermon was to be short and it was not to focus on Jack Heaslip but on the Christian faith he lived and proclaimed in so many ways and in so many contexts.\n\nYou are here today with your own memories of Jack that will speak far more eloquently to your hearts that any words I speak. We will take the time today to come before God with our own particular memories, our own particular thank givings. We will talk of faith but it is hard to talk of faith apart from the people in whom, through whom we experience it.\n\nHow did Jack see himself? In the chat in the apartment on Monday morning after Jack had died someone recalled that someone in the past had told Jack he was a ‘holy heteroclite’. Jack grinned and said he quite liked that. A heteroclite – a person who is slightly out of the ordinary, slightly hard to define, who is not amenable to labels that people might seek to put on them.\n\n> 'Each of you says, \"I belong to Paul,\" or \"I belong to Apollos,\" or \"I belong to Cephas,\" or \"I belong to Christ.\" 13 Has Christ been divided? Was Paul crucified for you? Or were you baptized in the name of Paul?'\n1 Cor 1:12,13\n\nPaul goes on to shift the focus onto the Christ who found him on the Damascus Road and whom he was to serve for the rest of his life.\n\n> 'For when one says, \"I belong to Paul,\" and another, \"I belong to Apollos,\" are you not merely human? 5 What then is Apollos? What is Paul? Servants through whom you came to believe, as the Lord assigned to each.' 1 Cor 3:4\n\nServants though whom you came to believe. I think that would be at the heart of how Jack would have seen himself. Maybe the greatest tribute we can pay to Jack is to reflect on the faith that inspired him, that he shared so faithfully that we experienced in him and through him as husband, as father, grandfather, teacher, chaplain, priest, mentor and friend.\n\nThe family have reflected carefully on the passages to be read at this funeral service. As I read over them a number of thoughts about life, about faith, about hope come to mind. Life, faith, the life of faith is about learning – my understanding is always partial, always imperfect. So those words from Paul’s letter to Philippi strike a chord with me.\n\n> 'Not that I have already obtained this or have already reached the goal; but I press on to make it my own, because Christ Jesus has made me his own.' Phil 3:12\n\nWhenever I read these words I have a picture of Christ ahead of me, leading me on, drawing me into a deeper understanding of his love and his purpose. Jack the teacher, the priest always open to new understanding, new insights.\n\nAt its heart faith involves a letting go, an identification with the Christ of Gethsemene who says ‘Let this cup pass from me, yet not what I want but what you want.’ We become ones in whom and through whom Christ continues to work in the world of today.\n\nOf course we live this, we work through this in the real world of human frailty, of weakness, of sickness. But we discover that the Christ who calls us is the Christ who comes to meet us in our vulnerability and speaks his word of peace.\n\n> '27 Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled, and do not let them be afraid.' John 14:27\n\nPeace, peace with himself, peace with God was certainly something that will characterise my memory of Jack. It is in the context of that peace, that Jack was able to talk quite naturally of his mortality. As he said to me, he was not afraid of death, it was the process of getting there that concerned him. He died quite peacefully, in his own home, with his beloved Trish at his side.\n\nThe last few months cannot have been easy for Jack, for Trish, for the whole family, as they walked this hard path with him, loving and cherishing him along the way. It is hard watching one you love, one who had been so active, so full of life, decline. Paul talks of this mortality very naturally in his second letter to the Corinthians and then goes on to speak of the hope that we have in Christ of life, resurrection life, eternal life. He writes\n\n> 'So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 17 For this slight momentary affliction is preparing us for an eternal weight of glory beyond all measure, 4 For while we are still in this tent, we groan under our burden, because we wish not to be unclothed but to be further clothed, so that what is mortal may be swallowed up by life. 5 He who has prepared us for this very thing is God, who has given us the Spirit as a guarantee.' 2 Cor 4:16ff, 5:4ff\n\n'So that what is mortal may be swallowed up by life.’ That is our hope this day for Jack Heaslip, husband, father, grandfather, brother, teacher, priest, mentor, dear friend to so many people. All the frailty of this last while, the frustrations even Jack must have felt, along with all the limitations that just go with being human, swallowed up by life in the closer presence of the God and Father of our Lord Jesus Christ.\n\nWe may say of Jack Heaslip, as the Apostle said of himself:\n\n> '(He has) fought the good fight, (he has) finished the race, (he has) kept the faith.'\n\nTrish, Catherine, Eoghan, the whole family, who Jack loved and who loved him all along the way, have lost a dear husband, father, grandfather. However strong our faith in these times, our loss, our pain our sadness is real. May you know that you are held in the prayers of so many people whose lives have been profoundly touched by your beloved Jack.\n\n'Well done, thou good and faithful servant. Receive the Kingdom prepared for you from the beginning of the world.'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Rev Jack Heaslip.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Rev Jack Heaslip – St Mary’s Howth – 26th February 2015\nWe gather here in St Mary’s in Howth for the funeral of Jack Heaslip, to\nhonour the memory of a man who made a lasting impression on so many\npeople in so many ways. Jack being Jack had certain views as to how his\nfuneral was to be conducted – the sermon was to be short and it was not to\nfocus on Jack Heaslip but on the Christian faith he lived and proclaimed in so\nmany ways and in so many contexts.\nYou are here today with your own memories of Jack that will speak far more\neloquently to your hearts that any words I speak. We will take the time today\nto come before God with our own particular memories, our own particular\nthank givings. We will talk of faith but it is hard to talk of faith apart from the\npeople in whom, through whom we experience it\nHow did Jack see himself? In the chat in the apartment on Monday morning\nafter Jack had died someone recalled that someone in the past had told Jack he\nwas a ‘holy heteroclite’. Jack grinned and said he quite liked that. A\nheteroclite – a person who is slightly out of the ordinary, slightly hard to\ndefine, who is not amenable to labels that people might seek to put on them. I\nfound myself turning to Paul’s First Letter to the Church at Corinth. Here was\na Church who loved labels.\neach of you says, \"I belong to Paul,\" or \"I belong to Apollos,\" or \"I\nbelong to Cephas,\" or \"I belong to Christ.\" 13 Has Christ been divided?\nWas Paul crucified for you? Or were you baptized in the name of Paul?\n1 Cor 1:12,13\nPaul goes on to shift the focus onto the Christ who found him on the Damascus\nRoad and whom he was to serve for the rest of his life.\n4 For when one says, \"I belong to Paul,\" and another, \"I belong to\nApollos,\" are you not merely human?\n5 What then is Apollos? What is Paul? Servants through whom you\ncame to believe, as the Lord assigned to each. 1 Cor 3:4\nPage 2 of 4\nFuneral of Rev Jack Heaslip – St Mary’s Howth – 26th February 2015\nServants though whom you came to believe. I think that would be at the heart\nof how Jack would have seen himself. Maybe the greatest tribute we can pay\nto Jack is to reflect on the faith that inspired him, that he shared so faithfully\nthat we experienced in him and through him as husband, as father, grandfather,\nteacher, chaplain, priest, mentor and friend.\nThe family have reflected carefully on the passages to be read at this funeral\nservice. As I read over them a number of thoughts about life, about faith, about\nhope come to mind. Life, faith, the life of faith is about learning – my\nunderstanding is always partial, always imperfect. So those words from Paul’s\nletter to Philippi strike a chord with me.\nNot that I have already obtained this or have already reached the goal;\nbut I press on to make it my own, because Christ Jesus has made me\nhis own. Phil 3:12\nWhenever I read these words I have a picture of Christ ahead of me, leading\nme on, drawing me into a deeper understanding of his love and his purpose.\nJack the teacher, the priest always open to new understanding, new insights.\nAt its heart faith involves a letting go, an identification with the Christ of\nGethsemene who says ‘Let this cup pass from me, yet not what I want but\nwhat you want.’ We become ones in whom and through whom Christ\ncontinues to work in the world of today.\nOf course we live this, we work through this in the real world of human frailty,\nof weakness, of sickness. But we discover that the Christ who calls us is the\nChrist who comes to meet us in our vulnerability and speaks his word of peace\n27 Peace I leave with you; my peace I give to you. I do not give to you\nas the world gives. Do not let your hearts be troubled, and do not let\nthem be afraid. John 14:27\nPage 3 of 4\nFuneral of Rev Jack Heaslip – St Mary’s Howth – 26th February 2015\nPeace, peace with himself, peace with God was certainly something that will\ncharacterise my memory of Jack. It is in the context of that peace, that Jack\nwas able to talk quite naturally of his mortality. As he said to me, he was not\nafraid of death, it was the process of getting there that concerned him. He died\nquite peacefully, in his own home, with his beloved Trish at his side.\nThe last few months cannot have been easy for Jack, for Trish, for the whole\nfamily, as they walked this hard path with him, loving and cherishing him\nalong the way. It is hard watching one you love, one who had been so active,\nso full of life, decline. Paul talks of this mortality very naturally in his second\nletter to the Corinthians and then goes on to speak of the hope that we have in\nChrist of life, resurrection life, eternal life. He writes\nSo we do not lose heart. Even though our outer nature is wasting\naway, our inner nature is being renewed day by day. 17 For this slight\nmomentary affliction is preparing us for an eternal weight of glory\nbeyond all measure,\n4 For while we are still in this tent, we groan under our burden, because\nwe wish not to be unclothed but to be further clothed, so that what is\nmortal may be swallowed up by life. 5 He who has prepared us for this\nvery thing is God, who has given us the Spirit as a guarantee.\n2 Cor 4:16ff, 5:4ff\n‘So that what is mortal may be swallowed up by life.’ That is our hope this day\nfor Jack Heaslip, husband, father, grandfather, brother, teacher, priest, mentor,\ndear friend to so many people. All the frailty of this last while, the frustrations\neven Jack must have felt, along with all the limitations that just go with being\nhuman, swallowed up by life in the closer presence of the God and Father of\nour Lord Jesus Christ.\nWe may say of Jack Heaslip, as the Apostle said of himself:\n7 (He has) fought the good fight, (he has) finished the race, (he has) kept the faith.\nPage 4 of 4\nFuneral of Rev Jack Heaslip – St Mary’s Howth – 26th February 2015\nTrish, Catherine, Eoghan, the whole family, who Jack loved and who loved\nhim all along the way, have lost a dear husband, father, grandfather. However\nstrong our faith in these times, our loss, our pain our sadness is real. May you\nknow that you are held in the prayers of so many people whose lives have been\nprofoundly touched by your beloved Jack.\n‘Well done, thou good and faithful servant. Receive the Kingdom prepared for\nyou from the beginning of the world.’"
    }
}