{
    "title": "Sheila Morrison's Funeral",
    "date": "2020-01-31",
    "blurb": "This sermon was given at the funeral of Mrs. Sheila Morrison, a remarkable lady known for her resilience, zest for life, humor, and kindness. She was a longstanding and faithful member of the parish, who embraced modern technology and lived life to the fullest. The sermon reflects on her life, her love for her family, and her faith in God.",
    "raw_text": "On Tuesday evening news started spreading that Sheila Morrison had died in the Blackrock Clinic. As the news spread, people started to share memories of this remarkable lady. A number of words started coming to mind: Resilient, Zest for life, Humour, Kindness. Then the stories started to be told of her determination to keep up to date with modern technology – why shouldn’t she use a computer, why shouldn’t she have a smart phone – how else was she going to use Whatsapp and Facebook?\n\nAs I thought on these my mind went back to sitting in her sitting room one afternoon. She wasn’t long home from a previous hospital stay and she was telling me about problems with her one remaining kidney and the possibility of dialysis. Then a grin; ‘In the meantime I am going to enjoy life.’ She may not have the energy to keep the garden the way she had in the past – but there were ways round that. Though I do remember walking past ‘Weatherly’ one morning on the way back from posting a letter – and there she was sweeping the path.\n\nThis for me caught two aspects of Sheila. There was an honesty as she looked at how things were (Remarking to me one day, ‘I suppose none of us can last for ever’) and that resilience, that zest for life we associate her with. She was determined to keep her independence, live in her own house, drive her own car and the family, Gaye and Judy and their families, honoured that desire and she really appreciated that, even if they were anxious for her at times. Family - her love for them and their love for her was a vital aspect of her life. I’ve only known her since 2005; so many of you will come here today with your own particular memories of Sheila, as sister, as mother, grandmother, great grandmother and friend. The family will be sharing their own very particular, very personal memories. Today we bring those memories before God and thank God for the many different ways your lives were touched and enriched by Sheila.\n\nThe family have chosen as one of the lessons to be read today, that lovely passage from Ecclesiastes. It talks of all the ups and downs of life, of a rhythm of life – ‘There’s a time for everything under heaven …’ Sheila in her own life had known the ups and downs of life, times of life, times of death, times of happiness and times of great sorrow. She had married David Higginbotham, and together they reared their daughters Gaye and Judy. Just as they were reared and were setting out on their own course in life, she was widowed at a relatively early age. She subsequently married Ian Morrison, who himself died 16 years ago.\n\nShe retained that resilience, that zest for life that we have been thinking about. Sheila was a longstanding and faithful member of this Parish. She was regular in public worship and this was an important part of her life. She valued the traditions of the Church of Ireland but at the same time recognised the need for change, the need to welcome youngsters, even if they made the odd bit of noise.\n\nWe have come to remember and give thanks. But of course the love that bound Sheila and the family together lives on as they remember with tears and laughter one who meant and continues to mean so much. Those of us outside the family circle come today to offer our love and support, to assure you of our love and our prayers in the days that lie ahead.\n\nThe death of anyone is also a reminder of our own mortality. As I think of Sheila’s approach to life, I am reminded that this need not be a morbid preoccupation. She has left us a lovely example of life lived to the full, taking opportunities for new experiences, new developments – yet not denying the reality of a body wearing out and the weakness that goes with that. She did this in the context of a sincerely held faith in God expressed in worship, in service of others and in the simple enjoyment of the love of friends and family.\n\nSo today, in this Church in which she worshipped for so many years, we commend Sheila Morrison to the loving care and protection of Almighty God. I conclude with a piece that draws together our love of Sheila and the sailing traditions of this part of the world.\n\nA Parable of Immortality.\n\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\nShe is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says, ‘There she goes!’, there are other eyes watching her coming, and other voices ready to take up the glad shout :\n‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Sheila Morrison.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mrs Sheila Morrison – Howth – 31st January 2020\nOn Tuesday evening news started spreading that Sheila Morrison had died in\nthe Blackrock Clinic. As the news spread, people started to share memories of\nthis remarkable lady. A number of words started coming to mind:\nResilient\nZest for life\nHumour\nKindness\nThen the stories started to be told of her determination to keep up to date with\nmodern technology – why shouldn’t she use a computer, why shouldn’t she\nhave a smart phone – how else was she going to use Whatsapp and Facebook?\nAs I thought on these my mind went back to sitting in her sitting room one\nafternoon. She wasn’t long home from a previous hospital stay and she was\ntelling me about problems with her one remaining kidney and the possibility of\ndialysis. Then a grin; ‘In the meantime I am going to enjoy life.’ She may not\nhave the energy to keep the garden the way she had in the past – but there were\nways round that. Though I do remember walking past ‘Weatherly’ one\nmorning on the way back from posting a letter – and there she was sweeping\nthe path.\nThis for me caught two aspects of Sheila. There was an honesty as she looked\nat how things were (Remarking to me one day, ‘I suppose none of us can last\nfor ever’) and that resilience, that zest for life we associate her with. She was\ndetermined to keep her independence, live in her own house, drive her own car\nand the family, Gaye and Judy and their families, honoured that desire and she\nreally appreciated that, even if they were anxious for her at times. Family -\nher love for them and their love for her was a vital aspect of her life. I’ve only\nknown her since 2005; so many of you will come here today with your own\nparticular memories of Sheila, as sister, as mother, grandmother, great\nPage 2 of 4\nFuneral of Mrs Sheila Morrison – Howth – 31st January 2020\ngrandmother and friend. The family will be sharing their own very particular,\nvery personal memories. Today we bring those memories before God and\nthank God for the many different ways your lives were touched and enriched\nby Sheila.\nThe family have chosen as one of the lessons to be read today, that lovely\npassage from Ecclesiastes. It talks of all the ups and downs of life, of a rhythm\nof life – ‘There’s a time for everything under heaven …’ Sheila in her own life\nhad known the ups and downs of life, times of life, times of death, times of\nhappiness and times of great sorrow. She had married David Higginbotham,\nand together they reared their daughters Gaye and Judy. Just as they were\nreared and were setting out on their own course in life, she was widowed at a\nrelatively early age. She subsequently married Ian Morrison, who himself died\n16 years ago.\nShe retained that resilience, that zest for life that we have been thinking about.\nSheila was a longstanding and faithful member of this Parish. She was regular\nin public worship and this was an important part of her life. She valued the\ntraditions of the Church of Ireland but at the same time recognised the need for\nchange, the need to welcome youngsters, even if they made the odd bit of\nnoise.\nWe have come to remember and give thanks. But of course the love that bound\nSheila and the family together lives on as they remember with tears and\nlaughter one who meant and continues to mean so much. Those of us outside\nthe family circle come today to offer our love and support, to assure you of our\nlove and our prayers in the days that lie ahead.\nPage 3 of 4\nFuneral of Mrs Sheila Morrison – Howth – 31st January 2020\nThe death of anyone is also a reminder of our own mortality. As I think of\nSheila’s approach to life, I am reminded that this need not be a morbid\npreoccupation. She has left us a lovely example of life lived to the full, taking\nopportunities for new experiences, new developments – yet not denying the\nreality of a body wearing out and the weakness that goes with that. She did\nthis in the context of a sincerely held faith in God expressed in worship, in\nservice of others and in the simple enjoyment of the love of friends and family.\nSo today, in this Church in which she worshipped for so many years, we\ncommend Sheila Morrison to the loving care and protection of Almighty God. I\nconclude with a piece that draws together our love of Sheila and the sailing\ntraditions of this part of the world.\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nPage 4 of 4\nFuneral of Mrs Sheila Morrison – Howth – 31st January 2020\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}