{
    "title": "The Music of Eternity",
    "date": "2016-02-07",
    "blurb": "This sermon discusses the importance of finding a quiet place to worship and connect with God. It emphasizes the transformative power of God's presence and how it can help us to both see and reflect the Lord's glory. The sermon also encourages us to step back from the noise of the world and tune into the music of eternity.",
    "raw_text": "Sunday before lent – 2016 – year C\n\nWere you ever one of those children who was accused by a teacher of ‘day dreaming’ – those moments when you kind of lost touch with what was going on around you and you went into your own thoughts – what went on last night, who you met, who you fancied, or a host of other things that tripped through your mind.\n\nThen of course we can get lost in a piece of music, of art, a landscape, a night sky – we are lifted out of ourselves, whatever it is, it touches something deep within us.\n\nThen there can be those moments when far from drifting away, something grabs our attention, these moments of apprehension, when things fall into place. I often think back of when, in the period leading up to my physics finals, I was sitting in the Library struggling with part of the course on Quantum Mechanics (the physics of atomic and sub atomic particles).\n\nSuddenly something clicked and it made sense. I recall a sense of achievement and then of wonder at the sheer order of creation from the tiniest subatomic particle to the sheer scale of the universe. Words of Psalm 8 came to my mind:\n\nWhen I consider your heavens, the | work of your | fingers, @\nthe moon and the | stars that | you have or|dained,\n5 What is man, that you should be | mindful | of him; @\nthe son of man, that | you should | seek him | out? (Ps 8:4,5)\n\nIsaiah in the Temple had moments of apprehension as, in the midst of the Temple worship, the solemn liturgy, the smoke of incense and sacrifice, he was aware that he was in the presence of God in a way he had never experienced before as he sensed God placing a very specific call on his life.\n\nFor me the Gospel accounts of transfiguration, such as we read today, tell me of disciples apprehending Jesus, who he was, in a radically new and different way. The setting for that is going off into a quiet place, in the presence of Jesus, to pray. It is in the quiet place that Moses experienced God in the burning bush; it is in the quiet place that Elijah, at the mouth of the cave to which he had fled, experienced God in the still small voice.\n\nAll that set me thinking about the importance of that quiet place, of worship, whether here in Church or in the quietness of our own hearts. Ours is a society of activity, of deadlines, a society that is afraid of silence – so we fill it with noise, with activity. Dr Jonathan Sacks, formerly Chief Rabbi of the British Commonwealth, recalls in his book ‘The Dignity of Difference’ attending an interfaith meeting of religious leaders in New York just a few months before 9/11. He recalls reflecting that for all their differences they were united by a common desire to ‘devote themselves not to the noise of now but to the music of eternity.’\n\nHow often do we allow the noise of now to drown out the music of eternity? I mention again the importance of those times apart, those times of stillness, times of worship, of consciously seeking the presence of God.\n\nSt Paul, in his 2nd Letter to the Church at Corinth, from which we read as our Epistle, speaks of the power of God’s presence to transform. He writes:\n\n‘ 18And all of us, with unveiled faces, seeing the glory of the Lord as though reflected in a mirror,# are being transformed into the same image from one degree of glory to another; for this comes from the Lord, the Spirit.’ (2 Cor 3:18)\n\nAs I indicated in the Lesson sheets, the Greek text can also be translated: ‘And we with unveiled faces all reflect the Lord’s glory.’ We see, we reflect. Could I suggest that rather than choosing one or the other, we maintain the apparent paradox. In so doing we recognize that we both see the Lord’s glory in others and are also called to reflect something of that glory ourselves – we both show something of Christ and we recognize something of Christ in each other.\n\nThe medieval mystic, Teresa of Avila, in reflecting on Jesus’ continuing ministry through the life and witness of the ordinary Christian reflected:\n\n‘He has no hands but ours,\nHe has no feet but ours,\nHe has no lips but ours ….\nWe are called to be the hands, the feet, the lips of Christ in the words of today, called to show something of Christ in whatever situation God has placed us.\n\nBecoming more like Christ, showing something of Christ. This is a life changing process. As I was reading around this passage during the week, I came across the following:\n\n‘The worship of Christ, which exposes our soul to his glory, transforms us into his likeness.’\n\nThis is nothing less than conversion – not a once off emotional experience – rather a life long ongoing work of God in our lives, as we open up our very souls to him in quietness, in stillness, in worship – as we step back from the noise of now to tune into the music of eternity.\n\nO Jesus, Master Carpenter of Nazareth,\nwho on the cross through blood and nails didst work man’s whole salvation:\nWield well thy tools in this thy workshop;\nthat we who come to thee rough hewn may by thy hand be fashioned to a truer beauty and greater usefulness;\nfor the honour of thy name. Amen",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/sundaybeforelent2016.txt",
        "raw_ocr_content": "Page 1 of 4\nSunday before lent – 2016 – year C\nWere you ever one of those children who was accused by a teacher of ‘day\ndreaming’ – those moments when you kind of lost touch with what was going\non around you and you went into your own thoughts – what went on last night,\nwho you met, who you fancied, or a host of other things that tripped through\nyour mind.\nThen of course we can get lost in a piece of music, of art, a landscape, a night\nsky – we are lifted out of ourselves, whatever it is, it touches something deep\nwithin us.\nThen there can be those moments when far from drifting away, something\ngrabs our attention, these moments of apprehension, when things fall into\nplace. I often think back of when, in the period leading up to my physics\nfinals, I was sitting in the Library struggling with part of the course on\nQuantum Mechanics (the physics of atomic and sub atomic particles).\nSuddenly something clicked and it made sense. I recall a sense of achievement\nand then of wonder at the sheer order of creation from the tiniest subatomic\nparticle to the sheer scale of the universe. Words of Psalm 8 came to my mind:\nWhen I consider your heavens, the | work of your | fingers, @\nthe moon and the | stars that | you have or|dained,\n5 What is man, that you should be | mindful | of him; @\nthe son of man, that | you should | seek him | out? (Ps 8:4,5)\nIsaiah in the Temple had moments of apprehension as, in the midst of the\nTemple worship, the solemn liturgy, the smoke of incense and sacrifice, he was\naware that he was in the presence of God in a way he had never experienced\nbefore as he sensed God placing a very specific call on his life.\nPage 2 of 4\nSunday before lent – 2016 – year C\nFor me the Gospel accounts of transfiguration, such as we read today, tell me\nof disciples apprehending Jesus, who he was, in a radically new and different\nway. The setting for that is going off into a quiet place, in the presence of\nJesus, to pray. It is in the quiet place that Moses experienced God in the\nburning bush; it is in the quiet place that Elijah, at the mouth of the cave to\nwhich he had fled, experienced God in the still small voice.\nAll that set me thinking about the importance of that quiet place, of worship,\nwhether here in Church or in the quietness of our own hearts. Ours is a society\nof activity, of deadlines, a society that is afraid of silence – so we fill it with\nnoise, with activity. Dr Jonathan Sacks, formerly Chief Rabbi of the British\nCommonwealth, recalls in his book ‘The Dignity of Difference’ attending an\ninterfaith meeting of religious leaders in New York just a few months before\n9/11. He recalls reflecting that for all their differences they were united by a\ncommon desire to ‘devote themselves not to the noise of now but to the music\nof eternity.’\nHow often do we allow the noise of now to drown out the music of eternity? I\nmention again the importance of those times apart, those times of stillness,\ntimes of worship, of consciously seeking the presence of God.\nSt Paul, in his 2nd Letter to the Church at Corinth, from which we read as our\nEpistle, speaks of the power of God’s presence to transform. He writes:\n‘ 18And all of us, with unveiled faces, seeing the glory of the Lord as though reflected in a\nmirror,# are being transformed into the same image from one degree of glory to another;\nfor this comes from the Lord, the Spirit.’ (2 Cor 3:18)\nPage 3 of 4\nSunday before lent – 2016 – year C\nAs I indicated in the Lesson sheets, the Greek text can also be translated: ‘And\nwe with unveiled faces all reflect the Lord’s glory.’ We see, we reflect. Could\nI suggest that rather than choosing one or the other, we maintain the apparent\nparadox. In so doing we recognize that we both see the Lord’s glory in others\nand are also called to reflect something of that glory ourselves – we both show\nsomething of Christ and we recognize something of Christ in each other.\nThe medieval mystic, Teresa of Avila, in reflecting on Jesus’ continuing\nministry through the life and witness of the ordinary Christian reflected:\n‘He has no hands but ours,\nHe has no feet but ours,\nHe has no lips but ours ….\nWe are called to be the hands, the feet, the lips of Christ in the words of today,\ncalled to show something of Christ in whatever situation God has placed us.\nBecoming more like Christ, showing something of Christ. This is a life\nchanging process. As I was reading around this passage during the week, I\ncame across the following:\n‘The worship of Christ, which exposes our soul to his glory, transforms us into\nhis likeness.’\nThis is nothing less than conversion – not a once off emotional experience –\nrather a life long ongoing work of God in our lives, as we open up our very\nsouls to him in quietness, in stillness, in worship – as we step back from the\nnoise of now to tune into the music of eternity.\nPage 4 of 4\nSunday before lent – 2016 – year C\nO Jesus, Master Carpenter of Nazareth,\nwho on the cross through blood and nails didst work man’s whole salvation:\nWield well thy tools in this thy workshop;\nthat we who come to thee rough hewn\nmay by thy hand be fashioned to a truer beauty and greater usefulness;\nfor the honour of thy name. Amen"
    }
}