{
    "title": "Generosity and Inclusion",
    "date": "2017-11-26",
    "blurb": "Kevin's sermon reflects on the Archbishop's message of 'Generous Christianity' and the parable of the sheep and the goats. He emphasizes the importance of serving the poor and marginalized as a way of serving Christ, and challenges the congregation to consider the future of their worshipping community. The sermon calls for a community that embodies a 'Garland of Generosity and Inclusion' and warns against 'Self-Generosity'.",
    "raw_text": "Sunday before Advent – Year A – 2017\n\nLast Sunday was a day of celebration for two families in our Parish as they celebrated the arrival of new members of their families and for us as we welcomed them into the family of the Church. The Archbishop, in his sermon, encouraged us to draw inspiration from those who had gone before us and to look forwards and outwards, highlighting the emergence of new housing areas on the edge of our Parish.\n\nHe used three expressions that resonated with me: 'Generous Christianity,' an 'Anglican Garland of Generosity and Inclusion,' and a warning against 'Self-Generosity.' Our Gospel reading, the parable of the sheep and the goats, shows both groups encountering the King at the end of time and learning that they had met him before in the poor and marginalized. The goats used their ignorance as an excuse for inaction, while the sheep were amazed to find that in serving the needy, they had served their King.\n\nI find this Parable to be one of the most challenging, as it calls us to discern genuine need from deceit and to recognize that needs are not always simply material. There is often a deeper need of loneliness, the need to be treated as a human being. I am impressed by the Focus Ireland Centre, which reminds us that a society can be judged by how it treats its weakest and most vulnerable.\n\nCompleting the work on the roof and external fabric of our Parish Church is the easy part. We are now faced with securing the future of our worshipping community. What sort of community do we envisage here in thirty or forty years? The community of the future is being formed now.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/sundaybeforeadvent2017.txt",
        "raw_ocr_content": "Page 1 of 3\nSunday before Advent – Year A – 2017\nLast Sunday a day of celebration; a day of celebration for two families in our\nParish as they celebrated the arrival of new members of their families; a day of\ncelebration for us as we welcomed them into the family of the Church; a day of\ncelebration for the Archbishop. As he remarked afterwards rarely does a\nbishop get a chance to do one baptism, let alone two.\nIt was also a day of course that marked the culmination of the work on the\nexternal fabric of this Church of St Mary’s, that has seen the external fabric of\nthis church secured for future generations..\nIn his sermon the Archbishop encouraged us to draw inspiration from those\nwho had gone before us. St Nessan and his sons who had the faith to build a\nchurch on Ireland’s Eye; those who had fostered and passed on the faith\nthrough the tumult of history, the Reformation, Disestablishment of the Church\nof Ireland and the early years of this State. He also encouraged us to look\nforwards and outwards, highlighting in particular the emergence of new\nhousing areas on the edge of our Parish.\nHe used three expressions that have resonated with me over this past week and\nas I reflected on our Gospel reading for today. He called us to a Generous\nChristianity. Picking up on the title of the Gospel manuscript associated with\nIreland’s Eye, he spoke of and Anglican Garland of Generosity and Inclusion.\nThen picking up on an expression used within the Church of Wales as they\nprepare for the 100th anniversary of their Disestablishment, he warned against\nan attitude of Self-Generosity.\nPage 2 of 3\nSunday before Advent – Year A – 2017\nOur Gospel reading gives us one of the best known of the parables of Jesus, the\nparable of the sheep and the goats. In our Parable today, both encounter the\nKing at the end of time. Each discover that they have met him before in the\npoor, the naked, the hungry, the prisoner. Neither recognised him for who he\nwas as each protest, ‘When did we see you poor, naked, hungry, in prison?’\nFor the goats, their ignorance is an excuse for their inaction. ‘Lord if we had\nrealised who it was in those grubby clothes, of course we would have helped.’\nThe sheep discover to their amazement that in serving the poor and the\nmarginalised they had served their King.\nI just want to take two of those terms used by the Archbishop to characterise\nthe two groups in the Parable; those of Garland of Generosity and Inclusion\nand Self Generosity. I do this not just as a way of reflecting on the parable\nitself but also to further explore some of the things the Archbishop was talking\nabout last Sunday in the context of that parable.\nI have always found this Parable to be one of the most challenging of those told\nby Jesus. Maybe I have more people calling at my door than the rest of you.\nAs I meet each person I know there are some who are quite frankly chancers\nbut some who are cases in genuine need. I frequently find myself asking have I\nmade the right call. But needs are not always simply material. I would suspect\nthat there is often a much deeper need of loneliness, the need to be simply\ntreated as a human being. And this is where I find the present arrangements of\nshifting homeless families from one hotel to another, of the arrangements in\nmany of our Direct Provision Centres. I never cease to be impressed the Focus\nIreland Centre in Eustace Street where I leave off toys and dry groceries we\nPage 3 of 3\nSunday before Advent – Year A – 2017\ncollect at this time of year. There is a profound truth to those oft repeated\nwords, that a society can be judged by the manner it treats it’s weakest and\nmost vulnerable.\nAs I have said on a number of occasions, completing the work on the roof and\nexternal fabric of our Parish Church for future generations is the easy bit. We\nare still faced with the most crucial part of our task, that of securing the future\nof our worshipping community into the future. What sort of community do we\nenvisage in this place in thirty or forty years time? In one sense it is tempting\nto say, ‘Well that’s not really my concern, I won’t be around here for that.’\nBut in reality the community that is going to be around in thirty or forty years\nis being formed now."
    }
}