{
    "title": "Sunday before Lent 2013",
    "date": "2013-02-10",
    "blurb": "In this sermon, Kevin speaks about the time Jesus went off with his disciples, Peter, James, and John. He emphasizes the importance of seeing God in Jesus and how others might see Jesus in us. He also prepares the congregation for the upcoming season of Lent, a time for self-reflection and getting closer to Jesus.",
    "raw_text": "Show 'Hell's Grannies' video clip. Does anyone here have a granny like that? That's not how our grans behave is it? When we go to their houses they are kind, they give us treats.\n\nIn our Gospel reading today we read of a time when Jesus went off with 3 of his disciples, Peter, James and John. They had got to know Jesus quite well. They had heard him teach then and the crowds some wonderful things about God, about how much God loved them and the sort of lives that God wanted them to lead. They had seen him heal; they had seen some very unhappy people, some suffering from leprosy, some blind, some lame coming to Jesus and going away healed and happy.\n\nOn the mountain top they have seen more of Jesus – they see his glory – see something of the glory of God shining through Jesus. Jesus will tell his disciples – 'Anyone who has seen me has seen the Father'. That day they not only see Jesus in glory they hear God saying something very important about Jesus – 'This is my Son, listen to him.'\n\nWe are asked to listen to him, to learn form him, to become like him; so that just as the disciples saw something of God in Jesus, others might see something of Jesus in us.\n\nThere is an old prayer that I will sometimes use that reminds us that Jesus became like us so that we might become more like him. Doesn't always work like that. Sometimes I think we can be a bit like those Hell's Grannies we laughed at in the sketch. We do things, we say things, think things that people do not expect to see in a follower of Jesus.\n\nWhen we are selfish, when we are rude – what are people seeing? Certainly not a picture of the Jesus we say that we are following. We are about to start the season of Lent. Lent is a time of preparation in which we get ourselves ready to celebrate the death and resurrection of Jesus. From very early times, Christians have used this time to take a close look at our lives, ways in which we have let things slip.\n\nA time for getting closer to Jesus, a time to pay that bit extra attention to listening to him, thinking about how what he says can be put into effect in our lives – that we might come closer to him, become more like him – that others may see that we are followers of Jesus.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/sundaybeforelent2013family.txt",
        "raw_ocr_content": "Page 1 of 2\nSunday before Lent – 2013 – Year C – Family Service\nShow ‘Hell’s Grannies video clip\nDoes anyone here have a granny like that?\nThat’s not how our grans behave is it? When we go to their houses\nthey are kind, they give us treats.\nIn our Gospel reading today we read of a time when Jesus went off\nwith 3 of his disciples, Peter, James and John.\nThey had got to know Jesus quite well. They had heard him teach\nthen and the crowds some wonderful things about God, about how\nmuch God loved them and the sort of lives that God wanted them to\nlead.\nThey had seen him heal; they had seen some very unhappy people,\nsome suffering from leprosy, some blind, some lame coming to Jesus\nand going away healed and happy.\nOn the mountain top they have seen more of Jesus – they see his glory\n– see something of the glory of God shining through Jesus. Jesus will\ntell his disciples – ‘Anyone who has seen me has seen the Father’\nThat day they not only see Jesus in glory they hear God saying\nsomething very important about Jesus – ‘This is my Son, listen to\nhim.’\nPage 2 of 2\nSunday before Lent – 2013 – Year C – Family Service\nWe are asked to listen to him, to learn form him, to become like him;\nso that just as the disciples saw something of God in Jesus, others\nmight see something of Jesus in us.\nThere is an old prayer that I will sometimes use that reminds us that\nJesus became like us so that we might become more like him.\nDoesn’t always work like that. Sometimes I think we can be a bit like\nthose Hell’s Grannies we laughed at in the sketch. We do things, we\nsay things, think things that people do not expect to see in a follower\nof Jesus.\nWhen we are selfish, when we are rude – what are people seeing?\nCertainly not a picture of the Jesus we say that we are following.\nWe are about to start the season of Lent. Lent is a time of preparation\nin which we get ourselves ready to celebrate the death and\nresurrection of Jesus. From very early times, Christians have used this\ntime to take a close look at our lives, ways in which we have let things\nslip.\nA time for getting closer to Jesus, a time to pay that bit extra attention\nto listening to him, thinking about how what he says can be put into\neffect in our lives – that we might come closer to him, become more\nlike him – that others may see that we are followers of Jesus."
    }
}