{
    "title": "Stir Up Sunday Reflection",
    "date": "2018-11-25",
    "blurb": "Kevin's sermon on the Sunday before Advent in 2018 emphasizes the significance of preparing for the coming of Christ. It reflects on the end of the Church's year and the anticipation of Advent, focusing on the incarnation of God's love through Jesus. The sermon calls the faithful to recognize the gift of redemption and to live out their priestly vocation, becoming more like Christ and serving as a holy priesthood.",
    "raw_text": "'Stir up we beseech thee, O Lord, the wills of thy faithful people ...'\n\nSo begins the old collect of this Sunday before Advent. It is said that among the staffs of the big houses, hearing this in Church on Sunday morning was the signal to begin preparing the Christmas puddings. And so this Sunday got the alternative title 'Stir up Sunday'\n\nThis Sunday marks the end of the Church's year, the end of a cycle within which we have celebrated the great events of faith. We prepare to begin another next week with the first Sunday of Advent, the beginning of the Church's own distinctive preparation for Christmas, as we think about what does it mean to live in the light of the coming of Christ into the world, what it means to live in the light of our mortality.\n\nAs we read our Lessons appointed for today, which are drawn together under the general heading of 'Christ the King', we realize that God was about serious business in the person of Jesus. In reading the Gospel accounts we encounter a Jesus with a very clear idea of his purpose before God. And so we read of him declaring before Pilate, 'For this reason I was born and for this I came into the world, to testify to the truth.' The Greek of the text of John's Gospel is very strong; 'I was born ... for this I came into the world', are both in the past perfect tense, which signifies events in the past of lasting significance.\n\nThe birth, the life, the ministry, the passion of Jesus are seen in the New Testament as events of lasting import, of eternal significance. 'Stir up we beseech thee ...'; we are indeed about serious business.\n\nThe writer of that strange mysterious book, the Revelation to St John the Divine, greets his readers; 'Grace to you who is, and who was, and who is to come ..., and from Jesus Christ the faithful witness. To him who loves us and freed us from our sins by his own blood, and made us to be a kingdom, priests serving his God and Father.'\n\nAt the heart of Incarnation, Emmanuel, 'God with us' in the person of Jesus, is the concept of gift. 'God so loved the world that he gave ...; gift moreover with a purpose, that gift carries redemptive significance. I think of that ancient prayer that celebrates the fact that 'he became like us so that we might become more like him'.\n\nSo with John we acclaim him who 'loves us and freed us from our sins ...'\n\nThe hymn writer, Graham Kendrick, in lovely economy of language, draws together many of these themes of Incarnation in the words of hymn 228:\n\n'Meekness and majesty,\nmanhood and deity,\nin perfect harmony -\nthe man who is God;\n\nLord of infinity,\nstooping so tenderly,\nlifts our humanity\nto the heights of his throne.'\n\nWhat do we do with gift and what response does it evoke in hearts and lives? At our Carol Service and on Christmas Eve we will hear those familiar words from the Prologue of John's Gospel:\n\n'He came to what was his own but his own people did not accept him. But to all who received him ... He gave power to become children of God.'\n\nHe became like us so that we might become more like him ... He who loves us and freed us from our sins ... and made us to be a kingdom, priests serving his God and Father.\n\nPart of our response to Emmanuel, 'God with us' in the person of Jesus, is to enter into our priestly vocation. The writer of the 1st Letter of Peter speaks of this response:\n\n'Come to him ... And, like living stones, let yourselves be built into a spiritual house, to be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus Christ.' (1 Peter 2:4ff)\n\nThe call to priesthood, to be a kingdom of priests, a holy nation, was part of the vocation of the people of Israel; to which they were called as they assembled at the foot of Sinai prior to receiving of the commandments. As a people redeemed by God they are called to a new life before God, called to be a sign, to reveal God to the nations.\n\n'Stir up we beseech thee O Lord, the wills of thy faithful people; that they, plenteously bringing forth the fruit of good works, may of thee be plenteously rewarded: through Jesus Christ our Lord. Amen'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Sunday before Advent -2018.txt",
        "raw_ocr_content": "Page 1 of 3\nSunday before Advent - 2018 - Year B\n‘Stir up we beseech thee, O Lord, the wills of thy faithful people …..’\nSo begins the old collect of this Sunday before Advent. It is said that among the staffs\nof the big houses, hearing this in Church on Sunday morning was the signal to begin\npreparing the Christmas puddings. And so this Sunday got the alternative title ‘Stir up\nSunday’\nStir up we beseech thee……. This Sunday marks the end of the Church’s year, the\nend of a cycle within which we have celebrated the great events of faith. We prepare\nto begin another next week with the first Sunday of Advent, the beginning of the\nChurch’s own distinctive preparation for Christmas, as we think about what does it\nmean to live in the light of the coming of Christ into the world, what it means to live\nin the light of our mortality.\nStir up we beseech thee the wills of thy faithful people …….. We are about serious\nbusiness, preparing to celebrate the Incarnation, God coming into the world, in the\nfrailty of our humanity manifesting the power of divine love.\nAs we read our Lessons appointed for today, which are drawn together under the\ngeneral heading of ‘Christ the King’, we realise that God was about serious business\nin the person of Jesus. In reading the Gospel accounts we encounter a Jesus with a\nvery clear idea of his purpose before God. And so we read of him declaring before\nPilate, ‘For this reason I was born and for this I came into the world, to testify to the\ntruth.’ The Greek of the text of John’s Gospel is very strong; ‘I was born ……for this\nI came into the world’, are both in the past perfect tense, which signifies events in the\npast of lasting significance.\nThe birth, the life, the ministry, the passion of Jesus are seen in the New Testament as\nevents of lasting import, of eternal significance. ‘Stir up we beseech thee …..’; we\nare indeed about serious business.\nThe writer of that strange mysterious book, the Revelation to St John the Divine, that\nPage 2 of 3\nSunday before Advent - 2018 - Year B\ndraws the Biblical canon to a close, greets his readers; ‘Grace to you who is, and who\nwas, and who is to come ….., and from Jesus Christ the faithful witness. To him who\nloves us and freed us from our sins by his own blood, and made us to be a kingdom,\npriests serving his God and Father.’\nAt the heart of Incarnation, Emmanuel, ‘God with us’ in the person of Jesus, is the\nconcept of gift. ‘God so loved the world that he gave ….; gift moreover with a\npurpose, that gift carries redemptive significance. I think of that ancient prayer that\ncelebrates the fact that ‘he became like us so that we might become more like him’.\nSo with John we acclaim him who ‘loves us and freed us from our sins …’\nThe hymn writer, Graham Kendrick, in lovely economy of language, draws together\nmany of these themes of Incarnation in the words of hymn 228:\n‘Meekness and majesty,\nmanhood and deity,\nin perfect harmony -\nthe man who is God;\n………………………………\nLord of infinity,\nstooping so tenderly,\nlifts our humanity\nto the heights of his throne.\nWhat do I do with gift and what response does it evoke in hearts and lives. At our\nCarol Service and on Christmas Eve we will hear those familiar words from the\nPrologue of John’s Gospel:\n‘He came to what was his own but his own people did not accept him. But to all who\nreceived him …. He gave power to become children of God.’\nHe became like us so that we might become more like him …… He who loves us and\nfreed us from our sins …. and made us to be a kingdom, priests serving his God and\nFather.\nPage 3 of 3\nSunday before Advent - 2018 - Year B\nPart of our response to Emmanuel, ‘God with us’ in the person of Jesus, is to enter into\nour priestly vocation. The writer of the 1st Letter of Peter speaks of this response:\n‘Come to him …. And, like living stones, let yourselves be built into a spiritual house,\nto be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus\nChrist.’ (1 Peter 2:4ff)\nThe call to priesthood, to be a kingdom of priests, a holy nation, was part of the\nvocation of the people of Israel; to which they were called as they assembled at the\nfoot of Sinai prior to receiving of the commandments. As a people redeemed by God\nthey are called to a new life before God, called to be a sign, to reveal God to the\nnations.\n‘Stir up we beseech thee O Lord, the wills of thy faithful people; that they, plenteously\nbringing forth the fruit of good works, may of thee be plenteously rewarded: through\nJesus Christ our Lord. Amen’"
    }
}