{
    "title": "The Kingship of Christ",
    "date": "2010-11-21",
    "blurb": "The sermon explores the theme of the Kingship of Christ, highlighting the paradox of majesty and suffering. It discusses how Christ's authority is represented through both the crown and the nails, symbolizing his sacrifice and resurrection. The sermon also relates the teachings of Christ to contemporary societal challenges, urging the congregation to embody Christ in their lives.",
    "raw_text": "Each Sunday we come into Church we look at the window over the communion table. It is a window rich in symbol; symbol of both the wider Church in general and the church here in this part of north County Dublin. We have both the figures of St Lawrence, holding a grid iron, which reminds me of my local parish Church in Birmingham; then there is St Patrick, St Brigid, the gospel manuscript, the Garland of Howth, held by the figure of St Nessan as well as the figure of St Fintan. The central figure in the window is the figure of the risen Christ, head adorned with a crown, hands and feet still bearing the marks of crucifixion.\n\nI found myself looking at that window the other day as I reflected on the lessons appointed for today, the Sunday before Advent and the theme for this Sunday, the Kingship of Christ. How do we recognise kingship, sovereignty, how do we recognise authority? In our Gospel reading the penitent thief appeals to Jesus, ‘Jesus, remember me when you come into your Kingdom.’ In the world, the mark of kingship is power, the ability to order the lives of others, to impose your will upon theirs. Jesus calls his disciples to a new way.\n\n\"You know that the rulers of the Gentiles lord it over them, and their great ones are tyrants over them. 26 It will not be so among you; but whoever wishes to be great among you must be your servant, 27 and whoever wishes to be first among you must be your slave; Matt 20:25-27\n\nLooking back to the window, both the crown and the nails are marks of kingship. In fact, as we are reminded in Paul’s letter to the Philippians, the mark of the nails come before the crown.\n\nAnd being found in human form, he humbled himself and became obedient to the point of death-- even death on a cross. Therefore God also highly exalted him and gave him the name that is above every name, so that at the name of Jesus every knee should bend, in heaven and on earth and under the earth, and every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. Phil 2:7-11\n\nThe crown and the nails both testify to the kingship, the authority, the majesty of Christ. Paradox, the holding together of two apparently contradictory concepts, can often only be expressed in the poetic, in the words and music of our hymns. In a wonderful economy of language, the hymn writer Graham Kendrick expresses in the words of hymn 228:\n\nsuffering to give us life, conquering through sacrifice – and, as they crucify, prays, ‘Father, forgive.’ O what a mystery – meekness and majesty; bow down and worship, for this is your God, this is your God!\n\nThis is your God. As we are reminded in the portion we read as our Epistle: ‘15He is the image of the invisible God’. Or as we were thinking last week, in the words of Bishop David Jenkins, that often misunderstood Bishop of Durham, ‘Jesus is the face of God towards us.’ So in this figure, crowned in majesty, scarred in suffering, we encounter the God who made us, in whose image we are made.\n\nThis week we have seen very contrasting images in our news programmes. We have seen the opening of Terminal 2 at Dublin Airport, planned in the heyday of the Celtic Tiger; we have seen the officials of the IMF arrive and we have seen awful images in the multiple deaths of children and adults in two separate incidents. We have been shaken as a society. We have been left feeling hurt, angry, confused, disillusioned, powerless. Looking around our own immediate locality we have seen long established businesses closing – behind each of these lies a personal story of shattered dreams. I think our mood can be summed up by a snippet I heard from Joseph O’Connor’s ‘Drivetime Diaries’. He had been talking of the succession of bad news items we hear in ‘Morning Ireland’ and he went on; ‘sometimes I just want to say, don’t speak Ainne, just hold me.’\n\nWhat is the future for us? Of course there is a future. We will emerge from our present crisis just as this society emerged from the 1980’s, the mass emigration of the 1950’s and before that from the trauma of the War of Independence and the Civil War. A time such as this is a time to examine values, to recognise how values have been distorted, in the light of that to reassess our values and priorities for us as individuals and as a society. The coming of a new child into the world is a reminder of the future that lies before us. This morning at our 11:00 service we are baptising a child. Baptism is a sacrament of inclusion. It is also a declaration of values, the values of the Christian community, the values the parents wish to see their child adopt for his or her self. At the heart of those values lies the life of Christ, crowned in majesty, scarred by sacrifice.\n\nWe are individually and collectively members of the Body of Christ, called not just to proclaim Christ but to embody Christ in the world of today. That is what we have to offer to one another and to our society – to be Christ for one another, for those who are hurting, confused, disillusioned – to lift Christ out of our stained glass, out of our prayer books, our books of theology, and yes our Bibles and be nothing less than the lips, the hands, the feet of Christ in this troubling and confusing world.\n\nChrist has no body but yours, No hands, no feet on earth but yours, Yours are the eyes with which he looks Compassion on this world, Yours are the feet with which he walks to do good, Yours are the hands, with which he blesses all the world. Yours are the hands, yours are the feet, Yours are the eyes, you are his body. Christ has no body now but yours, No hands, no feet on earth but yours, Yours are the eyes with which he looks compassion on this world. Christ has no body now on earth but yours. Teresa of Avila (1515–1582)",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/sundaybeforeadvent2010.txt",
        "raw_ocr_content": "Page 1 of 3\nSunday before Advent – 2010 – year C\nEach Sunday we come into Church we look at the window over the communion table. It is\na window rich in symbol; symbol of both the wider Church in general and the church here\nin this part of north County Dublin. We have both the figures of St Lawrence, holding a\ngrid iron, which reminds me of my local parish Church in Birmingham; then there is St\nPatrick, St Brigid, the gospel manuscript, the Garland of Howth, held by the figure of St\nNessan as well as the figure of St Fintan. The central figure in the window is the figure of\nthe risen Christ, head adorned with a crown, hands and feet still bearing the marks of\ncrucifixion.\nI found myself looking at that window the other day as I reflected on the lessons appointed\nfor today, the Sunday before Advent and the theme for this Sunday, the Kingship of\nChrist. How do we recognise kingship, sovereignty, how do we recognise authority? In\nour Gospel reading the penitent thief appeals to Jesus, ‘Jesus, remember me when you\ncome into your Kingdom.’ In the world, the mark of kingship is power, the ability to order\nthe lives of others, to impose your will upon theirs. Jesus calls his disciples to a new way.\n\"You know that the rulers of the Gentiles lord it over them, and\ntheir great ones are tyrants over them. 26 It will not be so among\nyou; but whoever wishes to be great among you must be your\nservant, 27 and whoever wishes to be first among you must be your\nslave; Matt 20:25-27\nLooking back to the window, both the crown and the nails are marks of kingship. In fact,\nas we are reminded in Paul’s letter to the Philippians, the mark of the nails come before\nthe crown.\nAnd being found in human form,\nhe humbled himself\nand became obedient to the point of death--\neven death on a cross.\nTherefore God also highly exalted him\nand gave him the name\nthat is above every name,\nso that at the name of Jesus\nevery knee should bend,\nin heaven and on earth and under the earth,\nand every tongue should confess\nthat Jesus Christ is Lord,\nPage 2 of 3\nSunday before Advent – 2010 – year C\nto the glory of God the Father. Phil 2:7-11\nThe crown and the nails both testify to the kingship, the authority, the majesty of Christ.\nParadox, the holding together of two apparently contradictory concepts, can often only be\nexpressed in the poetic, in the words and music of our hymns. In a wonderful economy\nof language, the hymn writer Graham Kendrick expresses in the words of hymn 228:\nsuffering to give us life,\nconquering through sacrifice –\nand, as they crucify,\nprays, ‘Father, forgive.’\nO what a mystery –\nmeekness and majesty;\nbow down and worship,\nfor this is your God,\nthis is your God!\nThis is your God. As we are reminded in the portion we read as our Epistle: ‘15He is the\nimage of the invisible God’. Or as we were thinking last week, in the words of Bishop\nDavid Jenkins, that often misunderstood Bishop of Durham, ‘Jesus is the face of God\ntowards us.’ So in this figure, crowned in majesty, scarred in suffering, we encounter the\nGod who made us, in whose image we are made.\nThis week we have seen very contrasting images in our news programmes. We have seen\nthe opening of Terminal 2 at Dublin Airport, planned in the heyday of the Celtic Tiger;\nwe have seen the officials of the IMF arrive and we have seen aweful images in the\nmultiple deaths of children and adults in two separate incidents. We have been shaken as\na society. We have been left feeling hurt, angry, confused, disillusioned, powerless.\nLooking around our own immediate locality we have seen long established businesses\nclosing – behind each of these lies a personal story of shattered dreams. I think our mood\ncan be summed up by a snippet I heard from Joseph O’Connor’s ‘Drivetime Diaries’. He\nhad been talking of the succession of bad news items we hear in ‘Morning Ireland’ and he\nwent on; ‘sometimes I just want to say, don’t speak Ainne, just hold me.’\nPage 3 of 3\nSunday before Advent – 2010 – year C\nWhat is the future for us? Of course there is a future. We will emerge from our present\ncrisis just as this society emerged from the 1980’s, the mass emigration of the 1950’s and\nbefore that from the trauma of the War of Independence and the Civil War. A time such\nas this is a time to examine values, to recognise how values have been distorted, in the\nlight of that to reassess our values and priorities for us as individuals and as a society.\nThe coming of a new child into the world is a reminder of the future that lies before us.\nThis morning at our 11:00 service we are baptising a child. Baptism is a sacrament of\ninclusion. It is also a declaration of values, the values of the Christian community, the\nvalues the parents wish to see their child adopt for his or her self. At the heart of those\nvalues lies the life of Christ, crowned in majesty, scarred by sacrifice.\nWe are individually and collectively members of the Body of Christ, called not just to\nproclaim Christ but to embody Christ in the world of today. That is what we have to offer\nto one another and to our society – to be Christ for one another, for those who are hurting,\nconfused, disillusioned – to lift Christ out of our stained glass, out of our prayer books, our\nbooks of theology, and yes our Bibles and be nothing less than the lips, the hands, the feet\nof Christ in this troubling and confusing world.\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nTeresa of Avila (1515–1582)"
    }
}