{
    "title": "Upside Down Kingdom",
    "date": "2022-12-08",
    "blurb": "This sermon discusses the concept of status in the Kingdom of Heaven, using the example of John the Baptist. It emphasizes the importance of humility and servitude, and the need to be 'little' before God. It also highlights the call to care for the marginalized and oppressed, following the example of Jesus' ministry.",
    "raw_text": "People will sometimes say that someone’s world has been turned upside down. It is generally not a happy experience. It can come after bereavement, loss of job, break up of a relationship – all that gave life meaning, all that we took for granted has been taken away and we are left struggling. Our world has been turned upside down.\n\nDuring this season of Advent our Gospel readings on Sunday mornings tell of aspects of the ministry of John the Baptist and his ministry of preparing the way. We are also hearing about the nature of the coming Kingdom.\n\nIn our Gospel reading this morning Jesus is talking after he has received messengers from John the Baptist. John, alone in his prison cell, has heard news of what Jesus has been doing. He is left wondering. Is Jesus really the coming Messiah or has he made a dreadful mistake in pointing to Jesus? So, the messengers have asked Jesus, ‘Are you really the one – or are we going to have to look for someone else?’ Jesus sends word reminding John of what has been happening in his ministry, assuring John that he has not got it wrong, his work has not been in vain.\n\nAfter the messengers go, Jesus goes on to tell his disciples and anyone else who is listening:\n\n> Truly I tell you, among those born of women no one has arisen greater than John the Baptist; yet the least in the kingdom of heaven is greater than he. Matt 11:11\n\nHe speaks of relative status. Status in the eyes of the world is important. We know where we stand. I love an old Monty Python sketch. There are three characters: John Cleese (upper class), Ronnie Barker (middle class) and Ronnie Corbett (working class). Working class man turns to middle class man and says, ‘I’m working class and I look up to him.’ Middle class man says, ‘I’m middle class and I look up to him (upper class) and I look down on him.’ Upper class man says, ‘I’m upper class and I look down on them all.’ While things are not quite so rigid these days, there is an element of truth in this. People like to know where they stand.\n\n> Truly I tell you, among those born of women no one has arisen greater than John the Baptist; yet the least in the kingdom of heaven is greater than he. Matt 11:11\n\nIt can be quite threatening to let go of status. There’s an element of the world turning upside down, of things starting to slip out of control. Of course, this is not a modern phenomenon we see plenty of examples of it in the Gospels.\n\nJesus tells the story of the guest invited to dinner who on arrival assumes one of the better seats, only to be told he needs to make way for someone more important and Jesus’ advice ‘Whoever humbles themselves will be exalted and whoever exalts himself will be humbled.’ On occasions we hear of the disciples arguing among themselves as to who will be greatest in the Kingdom of Heaven. On such occasions, Jesus gives them a model of humility – he washes their feet, the task of the lowest household servant; he sets a little child in their midst, saying except you become as a little child, you will not enter the Kingdom of heaven. The model of the servant, of the child, of taking the lowest place at the feast.\n\nThis littleness flies in the face of the world and its interest in status The child, the servant, the little ones accept the lowest place, accept direction. To be little before God is to accept that we have no claim on God’s love, on God’s grace. To be little before God is to acknowledge the reality of grace – that whatever we have, whatever we are, is ultimately a gift.\n\nThis fundamental shift in attitude before God is a hallmark of the Kingdom that John came to announce and Jesus came to usher in. As citizens of the Kingdom we are called to be signs of the Kingdom in our own day, in our own situation. It is only as we become little before God, that we become sensitive to others who are little – little not by choice but by the harsh realities of life – the poor, the marginalised, the oppressed.\n\nIn his day, Jesus highlighted those who were little in the society of his day, the poor, the crippled, the blind, the leper, those who were excluded from polite society. A mark of Jesus’ ministry was a care and a concern for the very ones society despised. Not a dismissive or condescending care that tossed a few crumbs or spare change their way. This was not a demeaning care but rather a care that affirmed their dignity as human beings, as ones made in the image of God. Our care must be modelled on that of Christ. The way we offer our care must honour the humanity of the one we reach out to help.\n\nAt the heart of Jesus’ ministry lies the cross – his ultimate care for humanity, a care that reaches down and raises us up with hands that have born the mark of the nails.\n\nWhen Jesus washed his disciples’ feet, when he put a little child in their midst it would have had the effect of leaving them feeling just a little uncomfortable. In truth passages such as this need to leave me feeling just a little uncomfortable, we lose must never lose sight of the fact that we stand before God simply and solely on the basis of grace. We need, as I say, to become little before God so that we may, in his name and in his power, be enabled to reach out and draw into the Kingdom those who have nothing or, perhaps more important, those who are thought to be nothing in the eyes of the world.\n\nWe began by talking about people’s worlds being turned upside down. It can be a very unsettling experience. It can come after bereavement, loss of job, break up of a relationship – all that gave life meaning, all that we took for granted has been taken away and we are left struggling.\n\nThen when Jesus starts talking of status when he says of John the Baptist:\n\n> Truly I tell you, among those born of women no one has arisen greater than John the Baptist; yet the least in the kingdom of heaven is greater than he. Matt 11:11\n\nHe speaks of relative status. Status in the eyes of the world is important. We know where we stand. There’s an element of the world turning upside down, of things starting to slip out of control. But then I go back to grace, to the riches of my littleness. For it is my littleness I discover my riches as one made in the image of God, as one redeemed by God. Out of the riches of my littles I recognise the dignity of those who are little in the eyes of the world – and in that upside down world I discover the peace that God alone can bring.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/COGS/Advent/Thursday after Advent 2 - 2022.txt",
        "raw_ocr_content": "Page 1 of 4\nThursday after Advent 2 – COGS Midweek - 2022\nPeople will sometimes say that someone’s world has been turned upside down.\nIt is generally not a happy experience. It can come after bereavement, loss of\njob, break up of a relationship – all that gave life meaning, all that we took for\ngranted has been taken away and we are left struggling. Our world has been\nturned upside down.\nDuring this season of Advent our Gospel readings on Sunday mornings tell of\naspects of the ministry of John the Baptist and his ministry of preparing the\nway. We are also hearing about the nature of the coming Kingdom.\nIn our Gospel reading this morning Jesus is talking after he has received\nmessengers from John the Baptist. John, alone in his prison cell, has heard\nnews of what Jesus has been doing. He is left wondering. Is Jesus really the\ncoming Messiah or has he made a dreadful mistake in pointing to Jesus? So,\nthe messengers have asked Jesus, ‘Are you really the one – or are we going to\nhave to look for someone else?’ Jesus sends word reminding John of what has\nbeen happening in his ministry, assuring John that he has not got it wrong, his\nwork has not been in vain.\nAfter the messengers go, Jesus goes on to tell his disciples and anyone else\nwho is listening:\nTruly I tell you, among those born of women no one has arisen greater\nthan John the Baptist; yet the least in the kingdom of heaven is greater\nthan he. Matt 11:11\nHe speaks of relative status. Status in the eyes of the world is important. We\nknow where we stand. I love an old Monty Python sketch. There are three\ncharacters: John Cleese (upper class), Ronnie Barker (middle class) and\nRonnie Corbett (working class). Working class man turns to middle class man\nPage 2 of 4\nThursday after Advent 2 – COGS Midweek - 2022\nand says, ‘I’m working class and I look up to him.’ Middle class man says,\n‘I’m middle class and I look up to him (upper class) and I look down on him.’\nUpper class man says, ‘I’m upper class and I look down on them all.’ While\nthings are not quite so rigid these days, there is an element of truth in this.\nPeople like to know where they stand.\nTruly I tell you, among those born of women no one has arisen greater\nthan John the Baptist; yet the least in the kingdom of heaven is greater\nthan he. Matt 11:11\nIt can be quite threatening to let go of status. There’s an element of the world\nturning upside down, of things starting to slip out of control. Of course, this is\nnot a modern phenomenon we see plenty of examples of it in the Gospels.\nJesus tells the story of the guest invited to dinner who on arrival assumes one\nof the better seats, only to be told he needs to make way for someone more\nimportant and Jesus’ advice ‘Whoever humbles themselves will be exalted and\nwhoever exalts himself will be humbled.’ On occasions we hear of the\ndisciples arguing among themselves as to who will be greatest in the Kingdom\nof Heaven. On such occasions, Jesus gives them a model of humility – he\nwashes their feet, the task of the lowest household servant; he sets a little child\nin their midst, saying except you become as a little child, you will not enter the\nKingdom of heaven. The model of the servant, of the child, of taking the\nlowest place at the feast.\nThis littleness flies in the face of the world and its interest in status The child,\nthe servant, the little ones accept the lowest place, accept direction. To be little\nbefore God is to accept that we have no claim on God’s love, on God’s grace.\nTo be little before God is to acknowledge the reality of grace – that whatever\nwe have, whatever we are, is ultimately a gift.\nPage 3 of 4\nThursday after Advent 2 – COGS Midweek - 2022\nThis fundamental shift in attitude before God is a hallmark of the Kingdom that\nJohn came to announce and Jesus came to usher in. As citizens of the\nKingdom we are called to be signs of the Kingdom in our own day, in our own\nsituation. It is only as we become little before God, that we become sensitive\nto others who are little – little not by choice but by the harsh realities of life –\nthe poor, the marginalised, the oppressed.\nIn his day, Jesus highlighted those who were little in the society of his day, the\npoor, the crippled, the blind, the leper, those who were excluded from polite\nsociety. A mark of Jesus’ ministry was a care and a concern for the very ones\nsociety despised. Not a dismissive or condescending care that tossed a few\ncrumbs or spare change their way. This was not a demeaning care but rather a\ncare that affirmed their dignity as human beings, as ones made in the image of\nGod. Our care must be modelled on that of Christ. The way we offer our care\nmust honour the humanity of the one we reach out to help.\nAt the heart of Jesus’ ministry lies the cross – his ultimate care for humanity, a\ncare that reaches down and raises us up with hands that have born the mark of\nthe nails.\nWhen Jesus washed his disciples’ feet, when he put a little child in their midst\nit would have had the effect of leaving them feeling just a little uncomfortable.\nIn truth passages such as this need to leave me feeling just a little\nuncomfortable, we lose must never lose sight of the fact that we stand before\nGod simply and solely on the basis of grace. We need, as I say, to become\nlittle before God so that we may, in his name and in his power, be enabled to\nreach out and draw into the Kingdom those who have nothing or, perhaps more\nimportant, those who are thought to be nothing in the eyes of the world.\nPage 4 of 4\nThursday after Advent 2 – COGS Midweek - 2022\nWe began by talking about people’s worlds being turned upside down. It can\nbe a very unsettling experience. It can come after bereavement, loss of job,\nbreak up of a relationship – all that gave life meaning, all that we took for\ngranted has been taken away and we are left struggling.\nThen when Jesus starts talking of status when he says of John the Baptist:\nTruly I tell you, among those born of women no one has arisen greater\nthan John the Baptist; yet the least in the kingdom of heaven is greater\nthan he. Matt 11:11\nHe speaks of relative status. Status in the eyes of the world is important. We\nknow where we stand. There’s an element of the world turning upside down, of\nthings starting to slip out of control. But then I go back to grace, to the riches\nof my littleness. For it is my littleness I discover my riches as one made in the\nimage of God, as one redeemed by God. Out of the riches of my littles I\nrecognise the dignity of those who are little in the eyes of the world – and in\nthat upside down world I discover the peace that God alone can bring."
    }
}