{
    "title": "The Journey of Faith",
    "date": "2009-04-09",
    "blurb": "This sermon discusses the journey of faith, referencing the speaker's personal experiences with fellow clergy and the challenges of organizing religious tours. It also touches on the theme of competition within the clergy, using the example of John the Baptist and Jesus. The sermon ends with a story about a unique church plant in Dublin, tasked with reaching out to those disillusioned with traditional churches.",
    "raw_text": "I remember, shortly after I was ordained, being at the North Dublin Clergy Fellowship. One of those there was the then Rector of Howth (a Parish I was eventually to serve in until I retired), Canon Frank Blennerhassett. Over the years, Frank had made a name for himself leading tours to the Holy Land. In all innocence I asked him, 'Frank, how do you go about organising these tours of yours?'\n\nMaybe Frank was wary of this new young Curate – was he thinking of moving in on his territory? I got a very cagey reply – 'There’s a lot more to this than you think – I’ve had to work at building up contacts over the years.'\n\nI thought about that as I read our Gospel reading for today; the words of John the Baptist’s disciples to their master referring to Jesus:\n\n'Rabbi, the one who was with you … he is baptising and all are going to him.'\n\ni.e. this young fellow is starting to muscle in on your territory.\n\nI just want to set this alongside another conversation between two clergy in Dublin in 1990. Back then, the Archbishop of Dublin had asked a young clergyman, Willi Stewart, to plant a Church in the middle of Dublin, just south of the river and not far from Christchurch Cathedral. This was to be a very different style of Church of Ireland Parish that was charged with the task of reaching out to a growing number of people becoming disillusioned with Churches of all descriptions.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/COGS/Easter/Thursday 20th .txt",
        "raw_ocr_content": "I remember, shortly after I was ordained, being at the North Dublin Clergy\nFellowship. One of those there was the then Rector of Howth (a Parish I was\neventually to serve in until I retired), Canon Frank Blennerhassett. Over the\nyears, Frank had made a name for himself leading tours to the Holy Land. In\nall innocence I asked him, ‘Frank, how do you go about organising these tours\nof yours?’\nMaybe Frank was wary of this new young Curate – was he thinking of moving\nin on his territory? I got a very cagey reply – ‘There’s a lot more to this than\nyou think – I’ve had to work at building up contacts over the years.’\nI thought about that as I read our Gospel reading for today; the words of John\nthe Baptist’s disciples to their master referring to Jesus:\n‘Rabbi, the one who was with you … he is baptising and all are going\nto him.’\ni.e. this young fellow is starting to muscle in on your territory.\nI just want to set this alongside another conversation between two clergy in\nDublin in 1990. Back then, the Archbishop of Dublin had asked a young\nclergyman, Willi Stewart, to plant a Church in the middle of Dublin, just south\nof the riven and not far from Christchurch Cathedral. This was to be a very\ndifferent style of Church of Ireland Parish that was charged with the task of\nreaching out to a growing number of people becoming disillusioned with\nChurches of all descriptions."
    }
}