{
    "title": "The Unpredictable Gift",
    "date": "2021-05-30",
    "blurb": "Kevin reflects on the unpredictability of life and God's presence, drawing parallels between his gardening experiences and spiritual insights. He discusses the doctrine of the Trinity, the otherness of God, and the varied ways God reveals Himself, as seen through biblical testimonies. The sermon encourages openness to God's unique work in our lives and a dedication to His service.",
    "raw_text": "TRINITY SUNDAY 2021- year B\n\nAs you are aware I maintain a small, somewhat ill kempt, vegetable patch at the end of the back garden in the Rectory. I'm never going to win any prizes for my produce but I do manage to eat some of the fruits of my labours and in the process get some genuine satisfaction which counteracts the frustration of other things going horribly wrong. Over the years I have tried to grow a few different things.\n\nOne year a member of the Parish told me of cauliflower plants that were available in the garden centre in Kinsealy. I duly bought a few, prepared the ground and planted them and waited for them to grow. The first few produced small heads that then shot all over the place. I came to the conclusion that cauliflowers were not my thing and then after some time went to clear that bed to prepare the ground for something else. Then I came across one solitary plant. When I peeled back the leaves I saw a lovely head of cauliflower which I proudly presented at the kitchen door and which subsequently tasted delicious.\n\nWhy had that one worked and the others had not? The soil was the same, the plants all came from the same garden centre. Maybe it had grown more slowly than the others and the weather conditions as it came to maturity were more favourable – I don't know. One thing I do know for certain – it looked and tasted beautiful.\n\nIt is on this line of unpredictability, of gift, that I want to explore a bit this morning. Today is Trinity Sunday. The doctrine of the Trinity is on one level an attempt to explain, to comprehend the nature of God as Father, Son and Holy Spirit, three persons in one God, one in three and three in one. And on another it is recognition of the fundamental otherness, the unknowable nature of God. The lessons set by the lectionary for Trinity Sunday give varied testimony to the ways in which God has disclosed himself. There is that passage in Isaiah in which the prophet recalls an experience of the presence of God, visions of heavenly beings, the very Temple seeming to shake, all coupled with an experience of God calling him – a coming together of a vision of God as totally other and yet intensely personal. Our psalm, (Psalm 29) with its almost apocalyptic imagery of flashes of lightning, the wilderness shaking, trees writhing, speaks of the power and the glory of God that is almost beyond human description. Our Gospel reading is the account given to us by St John of Nicodemus coming to Jesus by night. In this passage, Nicodemus, clearly impressed by Jesus, is trying to draw him out on how God is to be experienced and how God transforms the believer. Jesus, in words that refuse to be tied down, gives for me one of the most insightful illustrations of God's presence in our midst.\n\n> \"The wind blows where it chooses, and you hear the sound of it, but you do not know where it comes from or where it goes. So it is with everyone who is born of the Spirit.\" John 3:8\n\nAs I read that I recalled the account of Elijah, fearful for his life, sheltering in the cave. And a voice asks him 'Why are you hiding?' and Elijah rehearses his fears and his despair.\n\n> (God) said, \"Go out and stand on the mountain before the LORD, for the LORD is about to pass by.\" Now there was a great wind, so strong that it was splitting mountains and breaking rocks in pieces before the LORD, but the LORD was not in the wind; and after the wind an earthquake, but the LORD was not in the earthquake; 12 and after the earthquake a fire, but the LORD was not in the fire; and after the fire a sound of sheer silence. 1 Kings 19:11ff\n\nThe wind blows where it chooses but you do not know where it comes from, or where it is going. A sound of sheer silence. (or 'still small voice' in our other translations)\n\nGod is undeniably present yet there is something fundamentally elusive about that presence. But then I need to remember that God is bigger than my understanding. God is not limited by the narrow confines of my understanding, by my attempts to define or to contain him or her.\n\nThere is something in us that wants to tie God down in our definitions, in doctrinal statements. And so, as we paint our word pictures, we need to remember that mere words can never do justice to that which we are trying to describe. The words we use can never go beyond picture and symbol. How can you define the God who encountered Isaiah in the shaking pillars and smoke of the Temple and Elijah in that sound of sheer silence as he hid from his enemies in the desert cave; who expressed extravagant and profligate love in the mystery of the Incarnation – the life, the passion and death of Jesus; who in the Spirit encounters us in the contradictory images of descending dove and wind and tongues of fire.\n\nWhat we must always remember is that when we try to tie God down in our definitions we end up not limiting God but limiting ourselves. I recall, in the period following the decision of the Church of Ireland to proceed with the ordination of women, discussing the issue with a Presbyterian colleague in Ahoghill. He insisted that scripture dictated that it could never happen. I asked him did that mean that God could never call a woman to ministry in the Church – that surely placed a limitation on the sovereignty of God. Our attempts to place limitations on God end up limiting our understanding of what God can do in the life of the world, in the Church, in the lives of each one of us.\n\nTo go back to my cauliflower; why had that one plant worked and the others had not? For the benefit of future years, I may try to discover, try talking to more experienced gardeners. But nothing can take from me the simple pleasure of that one unexpected gift; the sight, the touch, the smell, the taste.\n\nHow does God choose to reveal himself, to act in this world that he has made? The very variety of the Biblical testimony should in itself encourage an openness to the ways in which God will choose to act. God has created us, God has redeemed us, God comes to us to strengthen and inspire in and thorough his Holy Spirit. The way he will reveal himself in your life may be very different to the way he will do so in mine. I always say God recognises our individuality and comes to us as individuals.\n\nLet us simply rejoice in the gift of his presence and power in our lives and dedicate ourselves afresh to his service.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/trinity2021.txt",
        "raw_ocr_content": "Page 1 of 3\nTRINITY SUNDAY 2021- year B\nAs you are aware I maintain a small, somewhat ill kempt, vegetable patch at the end\nof the back garden in the Rectory. I’m never going to win any prizes for my\nproduce but I do manage to eat some of the fruits of my labours and in the process\nget some genuine satisfaction which counteracts the frustration of other things going\nhorribly wrong. Over the years I have tried to grow a few different things.\nOne year a member of the Parish told me of cauliflower plants that were available in\nthe garden centre in Kinsealy. I duly bought a few, prepared the ground and planted\nthem and waited for them to grow. The first few produced small heads that then\nshot all over the place. I came to the conclusion that cauliflowers were not my thing\nand then after some time went to clear that bed to prepare the ground for something\nelse. Then I came across one solitary plant. When I peeled back the leaves I saw a\nlovely head of cauliflower which I proudly presented at the kitchen door and which\nsubsequently tasted delicious.\nWhy had that one worked and the others had not? The soil was the same, the plants\nall came from the same garden centre. Maybe it had grown more slowly than the\nothers and the weather conditions as it came to maturity were more favourable – I\ndon’t know. One thing I do know for certain – it looked and tasted beautiful.\nIt is on this line of unpredictability, of gift, that I want to explore a bit this morning.\nToday is Trinity Sunday. The doctrine of the Trinity is on one level an attempt to\nexplain, to comprehend the nature of God as Father, Son and Holy Spirit, three\npersons in one God, one in three and three in one. And on another it is recognition of\nthe fundamental otherness, the unknowable nature of God. The lessons set by the\nlectionary for Trinity Sunday give varied testimony to the ways in which God has\ndisclosed himself. There is that passage in Isaiah in which the prophet recalls an\nexperience of the presence of God, visions of heavenly beings, the very Temple\nseeming to shake, all coupled with an experience of God calling him – a coming\ntogether of a vision of God as totally other and yet intensely personal. Our psalm,\n(Psalm 29) with its almost apocalyptic imagery of flashes of lightning, the\nwilderness shaking, trees writhing, speaks of the power and the glory of God that is\nPage 2 of 3\nTRINITY SUNDAY 2021- year B\nalmost beyond human description. Our Gospel reading is the account given to us by\nSt John of Nicodemus coming to Jesus by night. In this passage, Nicodemus, clearly\nimpressed by Jesus, is trying to draw him out on how God is to be experienced and\nhow God transforms the believer. Jesus, in words that refuse to be tied down, gives\nfor me one of the most insightful illustrations of God’s presence in our midst.\n8The wind blows where it chooses, and you hear the sound of it, but\nyou do not know where it comes from or where it goes. So it is with\neveryone who is born of the Spirit.’ John 3:8\nAs I read that I recalled the account of Elijah, fearful for his life, sheltering in the\ncave. And a voice asks him ‘Why are you hiding?’ and Elijah rehearses his fears\nand his despair.\n(God) said, \"Go out and stand on the mountain before the LORD, for\nthe LORD is about to pass by.\" Now there was a great wind, so strong\nthat it was splitting mountains and breaking rocks in pieces before the\nLORD, but the LORD was not in the wind; and after the wind an\nearthquake, but the LORD was not in the earthquake; 12 and after the\nearthquake a fire, but the LORD was not in the fire; and after the fire a\nsound of sheer silence. 1 Kings 19:11ff\nThe wind blows where it chooses but you do not know where it comes from, or\nwhere it is going. A sound of sheer silence. (or ‘still small voice’ in our other\ntranslations)\nGod is undeniably present yet there is something fundamentally elusive about that\npresence. But then I need to remember that God is bigger than my understanding.\nGod is not limited by the narrow confines of my understanding, by my attempts to\ndefine or to contain him or her.\nThere is something in us that wants to tie God down in our definitions, in doctrinal\nstatements. And so, as we paint our word pictures, we need to remember that mere\nwords can never do justice to that which we are trying to describe. The words we\nuse can never go beyond picture and symbol. How can you define the God who\nencountered Isaiah in the shaking pillars and smoke of the Temple and Elijah in that\nsound of sheer silence as he hid from his enemies in the desert cave; who expressed\nPage 3 of 3\nTRINITY SUNDAY 2021- year B\nextravagant and profligate love in the mystery of the Incarnation – the life, the\npassion and death of Jesus; who in the Spirit encounters us in the contradictory\nimages of descending dove and wind and tongues of fire.\nWhat we must always remember is that when we try to tie God down in our\ndefinitions we end up not limiting God but limiting ourselves. I recall, in the period\nfollowing the decision of the Church of Ireland to proceed with the ordination of\nwomen, discussing the issue with a Presbyterian colleague in Ahoghill. He insisted\nthat scripture dictated that it could never happen. I asked him did that mean that\nGod could never call a woman to ministry in the Church – that surely placed a\nlimitation on the sovereignty of God. Our attempts to place limitations on God end\nup limiting our understanding of what God can do in the life of the world, in the\nChurch, in the lives of each one of us.\nTo go back to my cauliflower; why had that one plant worked and the others had\nnot? For the benefit of future years, I may try to discover, try talking to more\nexperienced gardeners. But nothing can take from me the simple pleasure of that\none unexpected gift; the sight, the touch, the smell, the taste.\nHow does God choose to reveal himself, to act in this world that he has made? The\nvery variety of the Biblical testimony should in itself encourage an openness to the\nways in which God will choose to act. God has created us, God has redeemed us,\nGod comes to us to strengthen and inspire in and thorough his Holy Spirit. The way\nhe will reveal himself in your life may be very different to the way he will do so in\nmine. I always say God recognises our individuality and comes to us as individuals.\nLet us simply rejoice in the gift of his presence and power in our lives and dedicate\nourselves afresh to his service."
    }
}