{
    "title": "Fruits of the Spirit: Gentleness",
    "date": "2010-03-24",
    "blurb": "This sermon is part of a series on the Fruits of the Spirit, focusing on gentleness. It discusses how gentleness and self-control are not innate, but are fruits of the Spirit that come from allowing God's Holy Spirit to live and work within us. It emphasizes that Christian life is not always easy, and that it involves pain, sacrifice, and misunderstanding. The sermon also explores the barriers to gentleness, such as pride and wilfulness.",
    "raw_text": "# Fruits of the Spirit: Gentleness\n\nThis sermon is part of a series on the Fruits of the Spirit as listed by Paul: love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. We have looked at Love, joy, patience as we find them in Scripture, as we find them in God – attributes we should expect to see in ourselves as we seek to follow God.\n\nHow about gentleness and self control – how are we on those – how can we encourage in others those gifts we find so hard ourselves? Christian life is not always easy. God’s love was a ‘Calvary love’ – love that involved pain, sacrifice, misunderstanding – Christian life, Christian discipleship has that Calvary element to it.\n\nDietrich Boenhoffer used to talk of ‘cheap grace’. Paul talks of the old self having been crucified with Christ. Crucifixion is ugly and brutal, long and painful – once the victim is secured to the cross the final outcome is in no doubt.\n\nSo there are times when Christian pilgrimage is not easy, times when I fail, when the old self reasserts itself. Times of isolation, of misunderstanding. Christ will not leave me, the end of my pilgrimage is secure.\n\nThese are fruits of the Spirit – not of my own self discipline or effort. It does not depend on me. Gentleness and self control do not automatically well up within me, cannot be induced by my discipline – only come to the extent I am prepared to allow God’s Holy Spirit to live and work in and through me.\n\nHoly Spirit inspires all that is good in mankind – enables me to become more like Jesus. Fruits of the Spirit are characteristics of those who have grasped the reality of God’s love in Christ – an inner conversion of heart and soul not the grudging payments of a deal.\n\nLives changed by the totally gracious love of God in Christ – our lives, in all their imperfection, bear witness to Christ living in us. Gentleness of Christ is manifested in humility – emptied himself, taking the form of a servant.\n\nOne of barriers to gentleness is our pride, our dignity – hard to be proud and to be gentle – model of the father’s reaction to the returning prodigal. Gentleness, not pride, is a fruit of the spirit. Gentleness of Christ is shown in obedience, even death on a cross.\n\nAnother barrier to gentleness is our own wilfulness – what I want, what I think. We have to discover the lesson of Gethsemene ‘ Not my will but yours be done’. Next week is Holy Week – drawn into a deeper understanding of God’s love for us in Christ.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/2010 - fruits of the Spirit/Week 4 - gentleness.txt",
        "raw_ocr_content": "Page 1 of 3\nLent mid week 2010\nFruit of the Spirit (Gal 5:22-25)\n(4) Gentleness\nHave been thinking of Fruits of the Spirit as listed by Paul\nlove, joy, peace, patience, kindness, generosity, faithfulness, 23 gentleness, and\nself-control.\nLooked at Love, joy, patience as we find them in Scripture, as we find them in\nGod – attributes we should expect to see in ourselves as we seek to follow God.\nLooked at them in the context of this painting by Rembrandt\nHow about gentleness and self control – how are we on those – how can we\nencourage in others those gifts we find so hard ourselves?\nChristian life is not always easy\nGod’s love was a ‘Calvary love’ – love that involved pain, sacrifice,\nmisunderstanding – Christian life, Christian discipleship has that Calvary\nelement to it.\nDietrich Boenhoffer used to talk of ‘cheap grace’\nPaul talks of the old self having been crucified with Christ\nCrucifixion ugly and brutal, long and painful – once victim secured to the cross\nthe final outcome in no doubt.\nPage 2 of 3\nLent mid week 2010\nFruit of the Spirit (Gal 5:22-25)\n(4) Gentleness\nSo there are times when Christian pilgrimage not easy, times when I fail, when\nthe old self reasserts itself. Times of isolation, of misunderstanding.\nChrist will not leave me, the end of my pilgrimage is secure.\nThese are fruits of the Spirit – not of my own self discipline or effort\nDoes not depend on me.\nGentleness and self control do not automatically well up within me, cannot be\ninduced by my discipline – only come to the extend I am prepared to allow\nGod’s Holy Spirit to live and work in and through me\nHoly Spirit inspires all that is good in mankind – enables me to become more\nlike Jesus..\nPhilippians 2\nFruits of the Spirit characteristics of those who have grasped the reality of\nGod’s love in Christ – an inner conversion of heart and soul not the grudging\npayments of a deal.\nLives changed by the totally gracious love of God in Christ – our lives, in all\ntheir imperfection, bear witness to Christ living in us.\nPage 3 of 3\nLent mid week 2010\nFruit of the Spirit (Gal 5:22-25)\n(4) Gentleness\nGentleness of Christ manifested in humility – emptied himself, taking the form\nof a servant\nOne of barriers to gentleness is our pride, our dignity – hard top be proud and\nto be gentle – model of the father’s reaction to the returning prodigal.\nGentleness, not pride, a fruit fo the spirit\nGentleness of Christ shown in obedience, even death on a cross\nAnother barrier to gentleness is our own wilfulness – what I want, what I think\nHave to discover the lesson of Gethsemene ‘ Not my will but yours be done’\nNext week is Holy Week – drawn into a deeper understanding of God’s love\nfor us in Christ"
    }
}