{
    "title": "Patience - Fruits of the Spirit",
    "date": "2010-03-10",
    "blurb": "This sermon explores the concept of patience as a fruit of the Spirit. It delves into the biblical accounts of God's patience with humanity, Jesus' patience with his disciples, and how patience allows space for healing in relationships. The sermon encourages believers to show the same patience God has shown them, not seeking immediate revenge for wrongs done to them.",
    "raw_text": "Riches of language can lie in the different sayings people have in different parts of the country 'So and so – wouldn’t he try the patience of a saint?' Idea of someone of great sanctity struggling to keep their cool. What is the patience of a saint? - raised in the passage we have been focusing on this Lent. We read Galatians 5:22-25. Each week we have been looking at how each of these attributes are found in the Bible, in God, in Jesus. Set alongside teaching of Catechism on work of the Holy Spirit.\n\nWe have looked at love, have looked at how we find it in God – unfailing love, love at full stretch 'My God, my God ….' My love is a response to that love – if I have not grasped it how can I share it? Last week looked at joy – how do we find it in the Bible - joy an emotion of harmony, of communion, of being at one with God – more than just an emotion – founded on God’s love for us.\n\nThis week we look at patience – a word, a theme, that recurs over and over again in the Bible. Attribute of God and of the one who would follow God. We go through OT story – creation, fall, flood, call of Abraham, Exodus, desert wandering, entry into the Promised Land through to David, Solomon, Exile – right up to the coming of Jesus.\n\nGod persists in continuing love, persists in the face of failure, of disobedience. Man’s failure at no stage frustrated God’s purposes – God will not allow my sin, my failure, my sin to ultimately stand in his way – if I fail, God will find someone else. God’s patience is with a people – does not exclude judgement – both the patience and the judgement are an outworking of love.\n\nGod’s patience mirrored in the patience of Jesus in the context of his own ministry. Patience with those he called – think especially of Peter – enthusiasm, courage, weakness, failure. Clear vision (you are the Christ) coupled with blindness (this will never happen to you) Followed into the courtyard – yet crumbled – yet Jesus still trusted (Feed my sheep).\n\nPatience in the New Testament is Greek word μακροθυμία - patience in the face of injury – implies slowness to avenge injury. We read Matthew 5:38-42. Patience, μακροθυμία, a slowness to avenge injury – allows space for healing in relationships.\n\nWe see that in the Parable of the Prodigal and in the picture by Rembrandt. We read Luke 15. While the son was still a long way off, the father was waiting patiently, waiting for the son’s return, ready to respond in reconciling love. - reflected in words of Post Communion Prayer – While we were still a long way off you met us in your son and brought us home …….. Patience, μακροθυμία, a slowness to avenge injury – allows space for healing in relationships.\n\nWe offer that space because God has allowed us that space in that while we were yet sinners, Christ died for us …… a love that takes the initiative 'Father forgive, for they know not ….' – leaves time to respond. May God, by the power of the HS enable us to show something of the patience God has shown us. Patience that does not seek immediate revenge for wrongs that are done to us. The patience that recognises that we too have sinned, we too have fallen short of the glory of God. The patience that persists in the face of misunderstanding. In short the patience of a saint.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/2010 - fruits of the Spirit/Week 3 - Patience.txt",
        "raw_ocr_content": "Page 1 of 3\nLent Mid Week – 2010 – Fruit of the Spirit\n(3) Patience\nRiches of language can lie in the different sayings people have in different parts of the\ncountry\n‘So and so – wouldn’t he try the patience of a saint?’ Idea of someone of great sanctity\nstruggling to keep their cool\nWhat is the patience of a saint? - raised in the passage we have been focussing on this\nLent\nRead Galatians 5:22-25\nEach week we have been looking at how each of these attributes are found in the Bible, in\nGod, in Jesus\nSet alongside teaching of Catechism on work of the Holy Spirit\nHave looked at love, have looked at how we find it in God – unfailing love, love at full\nstretch ‘My God, my God …..’\nMy love is a response to that love – if I have not grasped it how can I share it?\nLast week looked at joy – how do we find it in the Bible - joy an emotion of harmony, of\ncommunion, of being at one with God – more than just an emotion – founded on God’s\nlove for us.\nThis week look at patience – a word, a theme, that recurs over and over again in the Bible.\nAttribute of God and of the one who would follow God.\nGo through OT story – creation, fall, flood, call of Abraham, Exodus, desert wandering,\nentry into the Promised Land through to David, Solomon, Exile – right up to the coming of\nJesus.\nPage 2 of 3\nLent Mid Week – 2010 – Fruit of the Spirit\n(3) Patience\nGod persists in continuing love, persists in the face of failure, of disobedience.\nMan’s failure at no stage frustrated God’s purposes – God will not allow my sin, my\nfailure, my sin to ultimately stand in his way – if I fail, God will find someone else.\nGod’s patience is with a people – does not exclude judgement – both the patience and the\njudgement are an outworking of love.\nGod’s patience mirrored in the patience of Jesus in the context of his own ministry.\nPatience with those he called – think especially of Peter – enthusiasm, courage, weakness,\nfailure.\nClear vision (you are the Christ) coupled with blindness (this will never happen to you)\nFollowed into the courtyard – yet crumbled – yet Jesus still trusted (Feed my sheep).\nPatience in the New Testament is Greek word  - patience in the face of\ninjury – implies slowness to avenge injury\nRead Matthew 5:38-42\nPatience, , a slowness to avenge injury – allows space for healing in\nrelationships.\nWe see that in the Parable of the Prodigal and in the picture by Rembrandt.\nRead Luke 15\nWhile the son was still a long way off, the father was waiting patiently, waiting for the\nson’s return, ready to respond in reconciling love. - reflected in words of Post\nCommunion Prayer – While we were still a long way off you met us in your son and\nPage 3 of 3\nLent Mid Week – 2010 – Fruit of the Spirit\n(3) Patience\nbrought us home …….. Patience, , a slowness to avenge injury – allows\nspace for healing in relationships.\nWe offer that space because God has allowed us that space in that while we were yet\nsinners, Christ died for us …… a love that takes the initiative ‘Father forgive, for they\nknow not ….’ – leaves time to respond\nMay God, by the power of the HS enable us to show something of the patience God has\nshown us\nPatience that does not seek immediate revenge for wrongs that are done to us.\nThe patience that recognises that we too have sinned, we too have fallen short of the glory\nof God\nThe patience that persists in the face of misunderstanding.\nIn short the patience of a saint."
    }
}