{
    "title": "Fruits of the Spirit - Joy",
    "date": "2010-02-24",
    "blurb": "In this sermon, Kevin explores the concept of joy as a fruit of the Spirit. He discusses the importance of harmony with God and our neighbours, and how joy is a deeper emotion that arises from love experienced in Christ. He also emphasizes that joy is a gift from God, not something we can manufacture ourselves.",
    "raw_text": "Fruit of the Spirit (2) - Joy\n\nStart with Reading of Galatians 5\n\nOver this particular Lent, we are centring our thoughts around what Paul describes in this letter to the Galatians as the fruits of the Spirit. Outworkings that we should expect to see in ourselves of our faith in Christ.\n\nAlbeit that Good Works, which are the fruits of Faith, and follow after Justification, cannot put away our sins, and endure the severity of God's judgment; yet are they pleasing and acceptable to God in Christ, and do spring out necessarily of a true and lively Faith insomuch that by them a lively Faith may be as evidently known as a tree discerned by the fruit. Article 12 (BCP 2004 p 781)\n\nAs with last week, set all this in the context of the teaching of the Revised Catechism of the Church of Ireland on the work of the Holy Spirit\n\nThe Holy Spirit enables me to grow in likeness to Jesus Christ.\n\nSo when last week we looked at love, we first thought about how we find it in Jesus and God\n\nAs we experience the healing reconciling love so we begin to show it.\n\nA love that took the initiative\nthat knows no boundaries - even our enemies\nthat does not calculate the cost – My God, My God …..\n\nWe become not just a people who pray but a people who do.\n\nTonight think of joy – follows on from love.\n\nJust begin with ordinary human relationships as exemplified in the picture of the return of the Prodigal.\n\nThere had been a breakdown in relationships – we all know the outcome of that – there can be tension, hurt, pain – in ordinary human situations there can be an element of revenge.\n\nChange in atmosphere when that argument, that division is resolved.\n\nIn the picture – the son had set off home – the father had been waiting ready to welcome him on his return.\n\nThere is both joy and pain – harmony and disharmony.\n\nLike ‘love’, ‘joy’ is another that occurs right through the Bible.\n\nAn emotion of harmony – harmony with God, harmony with our neighbour\n\nPsalms - Jubilate ‘O be joyful in the Lord’ – joy in the presence of God\n\nPsalm 119:11 Your decrees are my heritage forever;\nthey are the joy of my heart.\n\nIn Old Testament, experience of judgement involves a banishing of joy\n\nJeremiah 7:34 34 And I will bring to an end the sound of mirth and gladness,\nthe voice of the bride and bridegroom in the cities of Judah and in the streets of Jerusalem; for the land shall become a waste.\n\nBy the same token, the experience of redemption, the restoration of harmony, gives rise to joy – passages in Isaiah\n\n11 So the ransomed of the LORD shall return,\nand come to Zion with singing;\neverlasting joy shall be upon their heads;\nthey shall obtain joy and gladness,\nand sorrow and sighing shall flee away. Isaiah 51:11\n\nJoy – communion, fellowship, peace with God – deeper than simple emotions or feelings – transitory – rise and fall.\n\nBiblical joy runs deeper: Jesus on the eve of his Passion, speaks of a deep inner joy\n\n'A little while, and you will no longer see me, and again a little while, and you will see me'? 20 Very truly, I tell you, you will weep and mourn, but the world will rejoice; you will have pain, but your pain will turn into joy. 21 When a woman is in labor, she has pain, because her hour has come. But when her child is born, she no longer remembers the anguish because of the joy of having brought a human being into the world. 22 So you have pain now; but I will see you again, and your hearts will rejoice, and no one will take your joy from you. John 16:20-22\n\nNot something we manufacture from within – it is gift – in the picture the son’s joy is a gift of the father.\n\nJoy is gift of God, God working in and through us\n\nArising out of love experienced in Christ – work of HS enabling to grow in likeness to Christ..\n\nMay each of us be enabled to receive the love that is showered upon us; may the Holy Spirit that he promised continue to work in us, enabling us to become more like Jesus Christ. Becoming more like him, may our lives demonstrate something of the love, the joy that is in him – so that by the albeit imperfect witness of our lives, others may be drawn into his kingdom.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/2010 - fruits of the Spirit/Week 2 - Joy.txt",
        "raw_ocr_content": "Page 1 of 3\nLent Mid Week 2010\nFruit of the Spirit (2) - Joy\nStart with Reading of Galatians 5\nOver this particular Lent, we are centring our thoughts around what Paul\ndescribes in this letter to the Galatians as the fruits of the Spirit.\nOutworkings that we should expect to see in ourselves of our faith in Christ.\nExpressed in Article 12 of our Articles of Religion, which we find printed at\nthe back of our Prayer Books. Set as they are at a particular point in our\nhistory as a Church and as a society there is none the lessa timeless truth in this\none:\nAlbeit that Good Works, which are the fruits of Faith, and follow\nafter Justification, cannot put away our sins, and endure the severity\nof God's judgment; yet are they pleasing and acceptable to God in\nChrist, and do spring out necessarily of a true and lively Faith\ninsomuch that by them a lively Faith may be as evidently known as\na tree discerned by the fruit. Article 12 (BCP 2004 p 781)\nAs with last week, set all this in the context of the teaching of the Revised\nCatechism of the Church of Ireland on the work of the Holy Spirit\nThe Holy Spirit enables me to grow in likeness to Jesus Christ.\nSo when last week we looked at love, we first thought about how we find it in\nJesus and God\nAs we experience the healing reconciling love so we begin to show it.\nA love that took the initiative\nthat knows no boundaries - even our enemies\nthat does not calculate the cost – My God, My God …..\nWe become not just a people who pray but a people who do.\nTonight think of joy – follows on from love.\nJust begin with ordinary human relationships as exemplified in the picture of\nthe return of the Prodigal.\nPage 2 of 3\nLent Mid Week 2010\nFruit of the Spirit (2) - Joy\nThere had been a breakdown in relationships – we all know the outcome of that\n– there can be tension, hurt, pain – in ordinary human situations there can be an\nelement of revenge.\nChange in atmosphere when that argument, that division is resolved.\nIn the picture – the son had set off home – the father had been waiting ready to\nwelcome him on his return.\nThere is both joy and pain – harmony and disharmony.\nLike ‘love’, ‘joy’ is another that occurs right through the Bible.\nAn emotion of harmony – harmony with God, harmony with our neighbour\nPsalms - Jubilate ‘O be joyful in the Lord’ – joy in the presence of God\nPsalm 119:11 Your decrees are my heritage forever;\nthey are the joy of my heart.\nIn Old Testament, experience of judgement involves a banishing of joy\nJeremiah 7:34 34 And I will bring to an end the sound of mirth and gladness,\nthe voice of the bride and bridegroom in the cities of Judah and in the streets\nof Jerusalem; for the land shall become a waste.\nBy the same token, the experience of redemption, the restoration of harmony,\ngives rise to joy – passages in Isaiah\n11 So the ransomed of the LORD shall return,\nand come to Zion with singing;\neverlasting joy shall be upon their heads;\nthey shall obtain joy and gladness,\nand sorrow and sighing shall flee away. Isaiah 51:11\nJoy – communion, fellowship, peace with God – deeper than simple emotions\nor feelings – transitory – rise and fall.\nBiblical joy runs deeper: Jesus on the eve of his Passion, speaks of a deep\ninner joy\nPage 3 of 3\nLent Mid Week 2010\nFruit of the Spirit (2) - Joy\n'A little while, and you will no longer see me, and again a little\nwhile, and you will see me'? 20 Very truly, I tell you, you will\nweep and mourn, but the world will rejoice; you will have pain, but\nyour pain will turn into joy. 21 When a woman is in labor, she has\npain, because her hour has come. But when her child is born, she\nno longer remembers the anguish because of the joy of having\nbrought a human being into the world. 22 So you have pain now;\nbut I will see you again, and your hearts will rejoice, and no one\nwill take your joy from you. John 16:20-22\nNot something we manufacture from within – it is gift – in the picture the son’s\njoy is a gift of the father.\nJoy is gift of God, God working in and through us\nArising out of love experienced in Christ – work of HS enabling to grow in\nlikeness to Christ..\nMay each of us be enabled to receive the love that is showered upon us; may\nthe Holy Spirit that he promised continue to work in us, enabling us to become\nmore like Jesus Christ. Becoming more like him, may our lives demonstrate\nsomething of the love, the joy that is in him – so that by the albeit imperfect\nwitness of our lives, others may be drawn into his kingdom."
    }
}