{
    "title": "Tears Over Jerusalem",
    "date": "1996-07-14",
    "blurb": "Kevin reflects on the tumultuous events in Northern Ireland, drawing parallels with Christ's lament over Jerusalem. He emphasizes the need for a Christian spirit in politics and daily life, advocating for peace and a return to spiritual core values. The sermon calls for love and peace, even towards those with differing views, as fundamental Christian principles.",
    "raw_text": "July 14th 1996 – Proper 10 – Year A – Sunday after Drumcree\n\n'As he approached Jerusalem and saw the city, he wept over it and said, \"if you, even you, had only known on this day what would bring you peace - but now it is hidden from your eyes.\"' Luke 19.41\n\nThis has been a truly awful week in the history of Northern Ireland. I don't think anyone could walk through the village of Ahoghill, or parts of Ballymena or look at scenes on a television screen without a deep sense of despondency and perhaps despair. David Irvine got it about right when he said there were no winners this week - we were all losers.\n\nI was speaking to a businessman yesterday. The managing director of the parent company of his business was in Northern Ireland on Monday. As he watched him leave, he was not optimistic about future investment.\n\nAs I reflected during the week on what I was going to say this morning I tried to imagine Christ in our midst over this last week. I could not imagine him participating in the rioting. I'm afraid I could not imagine him on the barricades. The image that kept recurring in my mind was of him weeping and my mind centered on those words of lament as the saviour wept over Jerusalem. He wept over a city that was steeped in faith but blind to what God was trying to do.\n\nAs a province we boast one of the highest levels of church attachment in Western Europe. If ever there was a place that should be touched by the spirit of Christ this is it - yet this week we have seen an outpouring of strife under bigotry. Satan has stalked the streets of our province this week and Christ has wept over us. It is not good enough to say if the police had done this or not done that then this would not have happened. The intimidation, the destruction on both sides was evil, and should be named as such. It should not be condoned in any shape or form.\n\nHow do we move forward from this point? How do we regain something of the hope of the last couple of years? For if we do not try and move forward, we will surely be dragged inexorably back into the misery of the previous 25 years. In the light of last night's bomb at the hotel in Enniskillen that slide may have already begun.\n\nArchbishop Eames has spoken on a number of occasions of the need to find ways in which the different traditions of Northern Ireland can be expressed. We would all recognize this but there is a genuine fear as to what this means - there is a fear about loss of identity and fear and uncertainty are what the cancer of violence feeds on.\n\nWe have to ask ourselves what is the substance of the identity we cherish, what is the nature of the religious freedom that we seek to uphold? We need to remind ourselves that the religious freedom so cherished by our forefathers was a freedom of worship. One of the sad facts of our situation is that for an increasing number of Protestants worship is no longer a priority, and for many Protestant identity is more and more focused on bands and marches.\n\nTo be a Protestant is surely first and foremost to acknowledge the sovereignty of almighty God and to confess the Lord Jesus Christ as Lord and savior, to worship him and to follow him. In their proper place, the bands and the marches add a colour and a sense of cohesion. But a Protestant identity that has abandoned its spiritual core and expresses itself simply in bands and parades is an empty shell.\n\nWe must ensure that in affirming our Protestant identity, we must do so in a manner that honors the Christ we seek to serve. We heard as one of our lessons a portion of the 8th chapter of St. Paul's letter to the Romans. In this chapter he draws together many of the themes he has already been talking about, particularly recalling God's action in Christ. He contrasts those who live according to the flesh and those who live according to the spirit. This raises the question of who has authority in our daily living in the world.\n\nOf course, part of our daily living is our political identity. One thing that is precious to the great majority of Protestants in Northern Ireland is our citizenship of the United Kingdom. There is no need to apologize for this - it is part of who we are. Our allegiance to Christ, our desire to serve him should set the tone of our political life, how we conduct our politics. In his final address as Prime Minister of Northern Ireland, Terence O'Neill said this;\n\n'For too long we have been torn and divided. Ours is called a Christian country. We could have enriched our politics with our Christianity; but far too often we have debased our Christianity with our politics. We seem to have forgotten that love of neighbor stands beside love of God as a fundamental principle of our religion.'\n\nI will close with an item first shown to me by the principal of four towns primary school when I first came here. Many of you may have read it last night on the churches page in the Belfast Telegraph. It was an item headed 'General Lesson', issued in Dublin in 1863 by Her Majesty's Stationary Office to all schools.\n\n> Christians should endeavour, as the apostle Paul commands them, to live peaceably with all men even with those of different religious persuasion.\n\n> Our savior Christ, commanded his disciples to love one another. He taught them to love even their enemies, to bless those who curse them and to pray for those who persecuted them. He himself prayed for his murderers. Many men hold erroneous doctrines; but we ought not to hate or persecute them. We ought to hold fast to what we are convinced is the truth; but not to treat harshly those who are in error. Jesus Christ did not intend his religion to be forced on men by violent means. He would not allow his disciples to fight for him.\n\n> If any persons treat us unkindly, we must not do the same to them, for Christ and his apostles have taught us not to return evil for evil. If we would obey Christ, we must do to others not as they do to us but as we would wish them to do to us.\n\n> Quarreling with our neighbours, and abusing them is not the way to convince them that we are in the right and they in the wrong. It is more likely to convince them that we have not a Christian spirit. We ought to behave gently to everyone, to show ourselves followers of Christ, who, when he was reviled, reviled not again.\n\nMay God write that message on all our hearts that we may live it - or else fall into an abyss in which, as David Irvine said, there are no winners, only losers.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/1996-08-14-proper10-Sunday-after-Drumcree.txt",
        "raw_ocr_content": "Page 1 of 3\nJuly 14th 1996 – Proper 10 – Year A – Sunday after Drumcree\n‘As he approached Jerusalem and saw the city, he wept over it and said, ‘if you, even you,\nhad only known on this day what would bring you peace - but now it is hidden from your\neyes.’ Luke 19.41\nThis has been a truly awful week in the history of Northern Ireland. I don't think anyone\ncould walk through the village of Ahoghill, or parts of Ballymena or look at scenes on a\ntelevision screen without a deep sense of despondency and perhaps despair. I think David\nIrvine got it about right when he said there were no winners this week - we were all losers.\nI was speaking to a businessman yesterday. The managing director of the parent company\nof his business was in Northern Ireland on Monday. As he watched him leave, he was not\noptimistic about future investment.\nAs I reflected during the week on what I was going to say this morning I tried to imagine\nChrist in our midst over this last week. I could not imagine him participating in the rioting.\nI'm afraid I could not imagine him on the barricades. The image that kept recurring in my\nmind was of him weeping and my mind centered on those words of lament as the saviour\nwept over Jerusalem. He wept over a city that was steeped in faith but blind to what God\nwas trying to do.\nAs a province we boast one of the highest levels of church attachment in Western Europe.\nIf ever there was a place that should be touched by the spirit of Christ this is it - yet this\nweek we have seen an outpouring of strife under bigotry. Satan has stalked the streets of our\nprovince this week and Christ as wept over us. It is not good enough to say if the police had\ndone this or not done that then this would not have happened. The intimidation, the\ndestruction on both sides was evil, and should be named as such. It should not be condoned\nin any shape or form.\nHow do we move forward from this point? How do we regain something of the hope of the\nlast couple of years? For if we do not try and move forward, we will surely be dragged\nPage 2 of 3\nJuly 14th 1996 – Proper 10 – Year A – Sunday after Drumcree\ninexorably back into the misery of the previous 25 years. In the light of last night's bomb at\nthe hotel in Enniskillen that slide may have already begun.\nArchbishop Eames has spoken on a number of occasions of the need to find ways in which\nthe different traditions of Northern Ireland can be expressed. We would all recognize this\nbut there is a genuine fear as to what this means - there is a fear about loss of identity and\nfear and uncertainty are what the cancer of violence feeds on.\nWe have to ask ourselves what is the substance of the identity we cherish, what is the nature\nof the religious freedom that we seek to uphold? We need to remind ourselves that the\nreligious freedom so cherished by our forefathers was a freedom of worship. One of the sad\nfacts of our situation is that for an increasing number of Protestants worship is no longer a\npriority, and for many Protestant identity is more and more focused on bands and marches.\nTo be a Protestant is surely first and foremost to acknowledge the sovereignty of almighty\nGod and to confess the Lord Jesus Christ as Lord and savior, to worship him and to follow\nhim. In their proper place, the bands and the marches add a colour and a sense of cohesion.\nBut a Protestant identity that has abandoned its spiritual core and expresses itself simply in\nbands and parades is an empty shell.\nWe must ensure that in affirming our Protestant identity, we must do so in a manner that\nhonors the Christ we seek to serve. We heard as one of our lessons a portion of the 8th\nchapter of St. Paul's letter to the Romans. In this chapter he draws together many of the\nitems he has already been talking about, particularly recalling God's action in Christ. He\ncontrasts those who live according to the flesh and those who live according to the spirit.\nThis raises the question of who has authority in our daily living in the world.\nOf course, part of our daily living is our political identity. One thing that is precious to the\ngreat majority of Protestants in Northern Ireland is our citizenship of the United Kingdom.\nPage 3 of 3\nJuly 14th 1996 – Proper 10 – Year A – Sunday after Drumcree\nThere is no need to apologise for this - it is part of who we are. Our allegiance to Christ, our\ndesire to serve him should set the tone of our political life, how we conduct our politics. In\nhis final address as Prime Minister of Northern Ireland, Terence O'Neill said this;\n‘For too long we have been torn and divided. Ours is called a Christian\ncountry. We could have enriched our politics with our Christianity; but\nfar too often we have debased our Christianity with our politics. We\nseem to have forgotten that love of neighbor stands beside love of God\nas a fundamental principle of our religion.’\nI will close with an item first shown to me by the principal of four towns primary school\nwhen I first came here. Many of you may have read it last night on the churches page in the\nBelfast Telegraph. It was an item headed ‘General Lesson’, issued in Dublin in 1863 by Her\nMajesty's Stationary Office to all schools.\nChristians should endeavour, as the apostle Paul commands them, to\nlive peaceably with all men even with those of different religious\npersuasion.\nOur savior Christ, commanded his disciples to love one another. He\ntaught them to love even their enemies, to bless those who curse them\nand to pray for those who persecuted them. He himself prayed for his\nmurderers. Many men hold erroneous doctrines; but we ought not to\nhate or persecute them. We ought to hold fast to what we are convinced\nis the truth; but not to treat harshly those who are in error. Jesus Christ\ndid not intend his religion to be forced on men by violent means. He\nwould not allow his disciples to fight for him.\nIf any persons create us unkindly, we must not do the same to them, for\nChrist and his apostles have taught us not to return evil for evil. If we\nwould obey Christ, we must do to others not as they do to us but as we\nwould wish them to do to us.\nQuarreling with our neighbours, and abusing them is not the way to\nconvince them that we are in the right and they in the wrong. It is more\nlikely to convince them that we have not a Christian spirit. We ought to\nbehave gently to everyone, to show ourselves followers of Christ, who,\nwhen he was reviled, reviled not again.’\nMay God write that message on all our hearts that we may live it - or else for into an abyss\nin which, as David Irvine said, there are no winners, only losers."
    }
}