{
    "title": "Insight and Blindness",
    "date": "2012-02-19",
    "blurb": "In this sermon, Kevin explores the concept of 'Transfiguration', drawing parallels between the biblical account and our own experiences of insight and blindness. He encourages the congregation to be beacons of hope and light in times of darkness and uncertainty, and calls on the Church to play a major role in society, particularly in challenging times.",
    "raw_text": "Could I begin by asking you a question? What went through your mind as you read our Gospel passage, Mark’s account of the Transfiguration of Jesus, either before the service or as it was read in the context of this service? For myself, whenever I read passages such as this, or the miracles of feeding or healing, I ask myself, ‘What experience did the disciples have, what experience of Jesus lay behind, this account?’ This is a question we have to ask ourselves whether we take these passages literally or see them as expressing in symbolic form their experience of Jesus as healer, as feeder, as Son of God.\n\nThe narrative itself is set on the top of a mountain, frequently in the scriptures a place of encounter, of revelation – we think of Moses on Sinai, of Elijah on Mount Horeb hearing the still small voice, of the Sermon on the Mount. The words out of the cloud, ‘This is my son … listen to him.’ recall words spoken from the heavens in the accounts of Jesus’ Baptism. In the vision of Jesus talking with Moses and Elijah, this episode not only looks to the past but also looks forward to his coming passion and death. As I read over this passage a theme that seemed to run through it for me is that of insight, of understanding, of who this Jesus is.\n\nAnd so transfiguration isn’t just something that happens to Jesus, to which the disciples are simply passive observers; this is also something that happens to them. It is on this level of insight, of understanding, that this passage begins to speak to me. At this point let me set this episode against the portion we read from the 2nd Letter to the Corinthians:\n\n'the god of this world has blinded the minds of the unbelievers, to keep them from seeing the light of the gospel of the glory of Christ'\n\nThe blindness spoken of here is a mental and spiritual blindness. So between these two passages we have twin experiences of insight and blindness that are so much part of life. I just want to reflect on these experiences of insight and blindness in our own human experience..\n\n‘the god of this world has blinded’ ….. Of course we all know of people, ourselves at times, where the wrong things have been prioritised in life to the detriment of other commitments and our own spiritual journey. It could be pressures of work, hobbies which are not bad in themselves as long as they are kept in their proper place in our overall lives and commitments – when that slips there is a skewing of our priorities to the detriment of ourselves and others. But I would go further than that. Particularly in these straightened times sheer worry, worry over ourselves, our work, our finances, problems faced by other members of our family can simply weigh us down. We lose sight of the goodness of God, lose faith in God, faith in other people, and sometimes even faith in ourselves. What we all need at times like that are beacons, beacons of hope, of life, of love.\n\nThat is the darker side of things. Then there are those moments of insight. These can come on all sorts of levels. You can be looking at a landscape, maybe one you have looked at many times. Maybe it is the light, the colours of that particular season of the year, maybe even our own mood – but on this occasion there is a particular sense of wonder that borders on worship and we feel a oneness with it all. Times perhaps in our lives when we feel a real sense of the moment, when things fall into place – this is the person I love, this is the job that is really meant for me. This is the move I should make in my life. Moments also when God seems to break through. It might be in the course of an act of worship when the readings, the music, the prayers just seem to come together in a way that God seems real and close and personal.\n\nWhat I have been talking about are the highs and lows of life, of faith, these moments of blindness, of insight. Are these highs and lows, these moments of insight and blindness simply to be the experience, the plight of the individual? This is where the image of the Church as the Body of Christ has a particular importance in our thinking. We are not just a group of individuals who gather here around this place, we are the Body of Christ with a commitment, a care for one another. Here to encourage one another along the path of faith, to shine light into one another’s darkness, to steady stumbling feet when the path is rough or uncertain – to be beacons of hope and light in the darkness and uncertainty of another’s life.\n\nAs we move further into the 21st century, a century that began in such hope and confidence for us as a nation and as a society, much has happened to undermine that self confidence as a nation and as a society. A series of damaging reports regarding both our political structures and the abuse of children, have posed profound questions to us as a society, how we have been prepared to turn a blind eye in the past and how we ensure this is not repeated in the future. Our loss of economic sovereignty has profoundly effected all levels of our society; the economic cost to essential services of health and education; the political landscape has been profoundly shaken. The Christian Church has a major role to play in speaking into our national situation at this time in our history. Just as we as individuals are called to be beacons of light and hope in the life of another. The Church in our generation is called to be a beacon of light and hope in the life of our society, to be a voice of truth and integrity in the public place, to be a voice for those who have no voice in our society, those on the margins. To be the voice that says to our society, to those who have the power, who have the wealth, ‘This is my son, my beloved. Listen to him.’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/1bflent2012.txt",
        "raw_ocr_content": "Page 1 of 4\nSunday before Lent – 2012 – year B (Transfiguration)\nCould I begin by asking you a question?\nWhat went through your mind as you read our Gospel passage, Mark’s account\nof the Transfiguration of Jesus, either before the service or as it was read in the\ncontext of this service? For myself, whenever I read passages such as this, or\nthe miracles of feeding or healing, I ask myself, ‘What experience did the\ndisciples have, what experience of Jesus lay behind, this account?’ This is a\nquestion we have to ask ourselves whether we take these passages literally or\nsee them as expressing in symbolic form their experience of Jesus as healer, as\nfeeder, as Son of God.\nThe narrative itself is set on the top of a mountain, frequently in the scriptures a\nplace of encounter, of revelation – we think of Moses on Sinai, of Elijah on\nMount Horeb hearing the still small voice, of the Sermon on the Mount. The\nwords out of the cloud, ‘This is my son …. listen to him.’ recall words spoken\nfrom the heavens in the accounts of Jesus’ Baptism. In the vision of Jesus\ntalking with Moses and Elijah, this episode not only looks to the past but also\nlooks forward to his coming passion and death. As I read over this passage a\ntheme that seemed to run through it for me is that of insight, of understanding,\nof who this Jesus is.\nAnd so transfiguration isn’t just something that happens to Jesus, to which the\ndisciples are simply passive observers; this is also something that happens to\nthem. It is on this level of insight, of understanding, that this passage begins to\nspeak to me. At this point let me set this episode against the portion we read\nfrom the 2nd Letter to the Corinthians:\nPage 2 of 4\nSunday before Lent – 2012 – year B (Transfiguration)\nthe god of this world has blinded the minds of the unbelievers, to keep\nthem from seeing the light of the gospel of the glory of Christ\nThe blindness spoken of here is a mental and spiritual blindness. So between\nthese two passages we have twin experiences of insight and blindness that are\nso much part of life. I just want to reflect on these experiences of insight and\nblindness in our own human experience..\n‘the god of this world has blinded’ ….. Of course we all know of people,\nourselves at times, where the wrong things have been prioritised in life to the\ndetriment of other commitments and our own spiritual journey. It could be\npressures of work, hobbies which are not bad in themselves as long as they are\nkept in their proper place in our overall lives and commitments – when that\nslips there is a skewing of our priorities to the detriment of ourselves and\nothers. But I would go further than that. Particularly in these straightened\ntimes sheer worry, worry over ourselves, our work, our finances, problems\nfaced by other members of our family can simply weigh us down. We lose\nsight of the goodness of God, lose faith in God, faith in other people, and\nsometimes even faith in ourselves. What we all need at times like that are\nbeacons, beacons of hope, of life, of love.\nThat is the darker side of things. Then there are those moments of insight.\nThese can come on all sorts of levels. You can be looking at a landscape,\nmaybe one you have looked at many times. Maybe it is the light, the colours of\nthat particular season of the year, maybe even our own mood – but on this\noccasion there is a particular sense of wonder that borders on worship and we\nPage 3 of 4\nSunday before Lent – 2012 – year B (Transfiguration)\nfeel a oneness with it all. Times perhaps in our lives when we feel a real sense\nof the moment, when things fall into place – this is the person I love, this is the\njob that is really meant for me. This is the move I should make in my life.\nMoments also when God seems to break through. It might be in the course of\nan act of worship when the readings, the music, the prayers just seem to come\ntogether in a way that God seems real and close and personal.\nWhat I have been talking about are the highs and lows of life, of faith, these\nmoments of blindness, of insight. Are these highs and lows, these moments of\ninsight and blindness simply to be the experience, the plight of the individual?\nThis is where the image of the Church as the Body of Christ has a particular\nimportance in our thinking. We are not just a group of individuals who gather\nhere around this place, we are the Body of Christ with a commitment, a care\nfor one another. Here to encourage one another along the path of faith, to shine\nlight into one another’s darkness, to steady stumbling feet when the path is\nrough or uncertain – to be beacons of hope and light in the darkness and\nuncertainty of another’s life.\nAs we move further into the 21st century, a century that began in such hope and\nconfidence for us as a nation and as a society, much has happened to\nundermine that self confidence as a nation and as a society. A series of\ndamaging reports regarding both our political structures and the abuse of\nchildren, have posed profound questions to us as a society, how we have been\nprepared to turn a blind eye in the past and how we ensure this is not repeated\nin the future. Our loss of economic sovereignty has profoundly effected all\nlevels of our society; the economic cost to essential services of health and\nPage 4 of 4\nSunday before Lent – 2012 – year B (Transfiguration)\neducation; the political landscape has been profoundly shaken. The Christian\nChurch has a major role to play in speaking into our national situation at this\ntime in our history. Just as we as individuals are called to be beacons of light\nand hope in the life of another. The Church in our generation is called to be a\nbeacon of light and hope in the life of our society, to be a voice of truth and\nintegrity in the public place, to be a voice for those who have no voice in our\nsociety, those on the margins. To be the voice that says to our society, to those\nwho have the power, who have the wealth, ‘This is my son, my beloved.\nListen to him.’"
    }
}