{
    "title": "How Big Is Your God?",
    "date": "2014-02-16",
    "blurb": "In this sermon, Kevin explores the theme of 'How big is our God?' He reflects on the biblical stories of creation, covenant, and redemption, and how they reveal God's greatness and relevance in our lives. He encourages us to recognize God's presence in our daily lives and challenges, and to allow our faith to impact our decisions, attitudes, and relationships.",
    "raw_text": "We read as our Lesson this morning that first opening chapter of Genesis, the story of creation, a story that captures the amazing diversity of creation, the majesty of the creation, from the sun, the moon and the stars and the rich diversity of life on the face of the earth. 'God saw all that he had made, and it was very good.'\n\nThere is the story of an old cleric who, whenever this passage was read in Church, used to preach a sermon on the wonders of the solar system, the galaxies, the massive sizes of the stars, the immense distances that lay between them. On one particular Sunday a young curate, who was serving in the Parish at the time, asked the old man, somewhat disparagingly, whether he thought anyone in the congregation had understood a word of what he was talking about. The old man smiled at his earnest young colleague and said, 'Maybe they did or maybe they didn't – but it certainly enhances my own understanding of the greatness of God.'\n\nAs I reflected on that story, on the lesson we read form Genesis, on our Gospel reading with Jesus' injunction 'Do not worry', I recalled the title of a book I saw in a bookshop many years ago, 'Is your God too small?'\n\nSo this morning I want to continue my thoughts under the heading, 'How big is our God?' By this I am not talking so much about the power of God as manifested in creation; I'm kind of taking that for granted. What I am more interested in is the extent to which we see God as active and relevant in our own lives.\n\nAs you go through the Bible, as you follow the story of Abraham, of Isaac and Jacob; as we continue on through the story of Moses and the Exodus, one of the underlying themes running through that whole story is that of Covenant. Covenant is about a relationship between God and his people.\n\nOn the one hand there is the God who called Abram to leave his homeland and travel to a foreign land and with that comes the promise of descendants and land. But there is also the element of responsibility – the covenant is given, the descendants are promised so that they might be a blessing on a wider world.\n\nThen when we move on to the story of Moses and the Exodus – the people are brought out of slavery, preserved at the Red Sea and then they are given the Law on Mount Sinai. The people are redeemed – the Law is about how the people are to live before God as ones who have been redeemed by God.\n\nThe whole of the biblical story is one of working out that relationship – we hear of the times when it goes right and the times when it goes horribly wrong as a society fell apart.\n\nSo when I ask, 'How big is our God?' How do we see God as having authority in our lives, in the decisions, in the choices we make in daily living? Two weeks ago, as I pondered on the question of 'Who am I?' we reflected on what it meant to say that I am made in the image of God; that my neighbour, the one I engage with, the one I disagree with, is also one made in the image of God. We recognised that that had implications in areas of justice, of reconciliation.\n\nSo when I ask, 'How big is my God?', I must recognise that my faith must impact on daily life, in the decisions I take, in the attitudes I adopt, in the person I am, at home, at school, in my places of work and leisure.\n\nI said earlier that one of the themes running through the Biblical story is one of Covenant. As we follow that story, another related truth comes through. Our God is a God who journeys with his people; a God who heard their pain in captivity; who accompanied them in the desert; a God who stays with his people even if at times they seem to abandon him. The Psalmist writes:\n\n'Be still and know that I am God' Ps 46:10\n\n'Be still, let go, sense God's presence with you.'\n\nIt is out of that sense of God's presence with us, that I turn to our Gospel reading for today, with its injunction not to worry, about life, about food, about clothing. Of course we do worry, youngsters at this time of year are worrying about their mocks – or if they are not, their parents are. Those of us who have any responsibility for others, our children, our parents, our loved ones are going to have concerns for their welfare. We shoulder those responsibilities; we experience our concern not in isolation, but in the presence of God who accompanies us. This does not mean our problems go away, it does not mean we do not have to face sadness, disappointment, hurt. We do not do it alone but in the presence of him who knew what it was to be lonely, what it was to be hungry, to know what it was like to be let down by friends, to know the darkness of death itself.\n\nHow big is your God? What authority does he have in your life? Do you know his presence in time of trial and disappointment?\n\n'Be still and know that I am God'\n\n'The Lord of Hosts is with us, the God of Jacob is our refuge.' Ps 46:10-11",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/2beforelent2014.txt",
        "raw_ocr_content": "Page 1 of 3\n2nd Sunday before Lent – 2014 – year A\nWe read as our Lesson this morning that first opening chapter of Genesis, the\nstory of creation, a story that captures the amazing diversity of creation, the\nmajesty of the creation, from the sun, the moon and the stars and the rich\ndiversity of life on the face of the earth. ‘God saw all that he had made, and it\nwas very good.’\nThere is the story of an old cleric who, whenever this passage was read in\nChurch, used to preach a sermon on the wonders of the solar system, the\ngalaxies, the massive sizes of the stars, the immense distances that lay between\nthem. On one particular Sunday a young curate, who was serving in the Parish\nat the time, asked the old man, somewhat disparagingly, whether he thought\nanyone in the congregation had understood a word of what he was talking\nabout. The old man smiled at his earnest young colleague and said, ‘Maybe\nthey did or maybe they didn’t – but it certainly enhances my own\nunderstanding of the greatness of God.’\nAs I reflected on that story, on the lesson we read form Genesis, on our Gospel\nreading with Jesus’ injunction ‘Do not worry’, I recalled the title of a book I\nsaw in a bookshop many years ago, ‘Is your God too small?’\nSo this morning I want to continue my thoughts under the heading, ‘How big is\nour God?’ By this I am not talking so much about the power of God as\nmanifested in creation; I’m kind of taking that for granted. What I am more\ninterested in is the extent to which we see God as active and relevant in our\nown lives.\nAs you go through the Bible, as you follow the story of Abraham, of Isaac and\nJacob; as we continue on through the story of Moses and the Exodus, one of\nthe underlying themes running through that whole story is that of Covenant.\nCovenant is about a relationship between God and his people.\nPage 2 of 3\n2nd Sunday before Lent – 2014 – year A\nOn the one hand there is the God who called Abram to leave his homeland and\ntravel to a foreign land and with that comes the promise of descendants and\nland. But there is also the element of responsibility – the covenant is given, the\ndescendants are promised so that they might be a blessing on a wider world.\nThen when we move on to the story of Moses and the Exodus – the people are\nbrought out of slavery, preserved at the Red Sea and then they are given the\nLaw on Mount Sinai. The people are redeemed – the Law is about how the\npeople are to live before God as ones who have been redeemed by God.\nThe whole of the biblical story is one of working out that relationship – we\nhear of the times when it goes right and the times when it goes horribly wrong\nas a society fell apart.\nSo when I ask, ‘How big is our God?’ How do we see God as having authority\nin our lives, in the decisions, in the choices we make in daily living? Two\nweeks ago, as I pondered on the question of ‘Who am I?’ we reflected on what\nit meant to say that I am made in the image of God; that my neighbour, the one\nI engage with, the one I disagree with, is also one made in the image of God.\nWe recognised that that had implications in areas of justice, of reconciliation.\nSo when I ask, ‘How big is my God?’, I must recognise that my faith must\nimpact on daily life, in the decisions I take, in the attitudes I adopt, in the\nperson I am, at home, at school, in my places of work and leisure.\nI said earlier that one of the themes running through the Biblical story is one of\nCovenant. As we follow that story, another related truth comes through. Our\nGod is a God who journeys with his people; a God who heard their pain in\ncaptivity; who accompanied them in the desert; a God who stays with his\npeople even if at times they seem to abandon him. The Psalmist writes:\nPage 3 of 3\n2nd Sunday before Lent – 2014 – year A\nBe still and know that I am God Ps 46:10\nBe still, let go, sense God’s presence with you.\nIt is out of that sense of God’s presence with us, that I turn to our Gospel\nreading for today, with its injunction not to worry, about life, about food, about\nclothing. Of course we do worry, youngsters at this time of year are worrying\nabout their mocks – or if they are not, their parents are. Those of us who have\nany responsibility for others, our children, our parents, our loved ones are\ngoing to have concerns for their welfare. We shoulder those responsibilities;\nwe experience our concern not in isolation, but in the presence of God who\naccompanies us. This does not mean our problems go away, it does not mean\nwe do not have to face sadness, disappointment, hurt. We do not do it alone\nbut in the presence of him who knew what it was to be lonely, what it was to be\nhungry, to know what it was like to be let down by friends, to know the\ndarkness of death itself.\nHow big is your God? What authority does he have in your life? Do you\nknow his presence in time of trial and disappointment?\nBe still and know that I am God\n………………………………………..\nThe Lord of Hosts is with us, the God of Jacob is our refuge. Ps 46:10-11"
    }
}