{
    "title": "God, the Creator",
    "date": "2017-02-12",
    "blurb": "This sermon explores the theme of God as the creator, who is not indifferent to us but knows, loves, and cares. It emphasizes the importance of seeking to understand God's thoughts and intentions, rather than focusing on individual phenomena or details. The sermon encourages listening and watching to know God better, highlighting the importance of prayer as a means of communication with God.",
    "raw_text": "2nd Sunday before Epiphany – 2017 – Family Service (Need powerpoint)\n\nJust started Confirmation Group\nExplore whole idea of faith – who or what is God, what does God mean for me\nThis Sunday, 2nd before Lent, theme of creation.\nGod as creator – lesson from Genesis – pictures on screen.\nAfter – Burrow song ‘Our God is a great big God’\n‘He’s wider than the Universe and beyond ……’\nDoesn’t stop there:\n‘He’s known me and he’s loved me ……’\nGod who creates not indifferent to us – knows, loves and cares\nThis is where our Gospel reading came in:\nDon’t worry about what you eat……… Your heavenly father knows\nA God who creates – who knows, who listens, who understands\n\nThis is brought together in this quote by Albert Einstein …… one of the all time giants of the scientific world.\n\n>I want to know how God created this world. I'm not interested in this or that phenomenon, in the spectrum of this or that element. I want to know His thoughts, the rest are details.\n\nIf you want to know something, if you want to know somebody – you have to watch, you have to listen.\nThat’s why I like that drama we just had of the Lord’s Prayer\nThe God who creates – a God who listens, who understands us, who speaks and inspires us.\nThat is a God who is real – that is the God we are trying to get to know better in our journey towards Confirmation.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/2beforelent2017-famserv.txt",
        "raw_ocr_content": "Page 1 of 2\n2nd Sunday before Epiphany – 2017 – Family Service (Need powerpoint)\nJust started Confirmation Group\nExplore whole idea of faith – who or what is God, what does God\nmean for me\nThis Sunday, 2nd before Lent, theme of creation.\nGod as creator – lesson from Genesis – pictures on screen.\nAfter – Burrow song ‘Our God is a great big God’\n‘He’s wider than the Universe and beyond ……’\nDoes n’t stop there:\n‘He’s known me and he’s loved me ……..’\nGod who creates not indifferent to us – knows, loves and cares\nThis is where our Gospel reading came in:\nDon’t worry about what you eat………. Your heavenly father knows\nA God who creates – who knows, who listens, who understands\nPage 2 of 2\n2nd Sunday before Epiphany – 2017 – Family Service (Need powerpoint)\nThis is brought together in this quote by Albert Einstein …… one of\nthe all time giants of the scientific world.\nI want to know how God created this world. I'm not\ninterested in this or that phenomenon, in the spectrum\nof this or that element. I want to know His thoughts,\nthe rest are details.\nIf you want to know something, if you want to know somebody – you\nhave to watch, you have to listen.\nThat’s why I like that drama we just had of the Lord’s Prayer\nThe God who creates – a God who listens, who understands us, who\nspeaks and inspires us.\nThat is a God who is real – that is the God we are trying to get to\nknow better in our journey towards Confirmation."
    }
}