{
    "title": "Purpose and Providence",
    "date": "2015-02-08",
    "blurb": "In this sermon, Kevin explores the concept of God's purpose in creation and the idea of providence. He addresses the problem of evil and suffering in the world, and how these challenges can be faced with faith. The sermon emphasizes on the power of resurrection and the peace that comes from God's solidarity in suffering.",
    "raw_text": "When we think about creation in religious terms our minds turn inevitably to the two creation narratives that make up the first two chapters of Genesis. Around these passages have sprung up all the debates about creationism, Darwinism, the apparent conflict between religious faith and scientific enquiry. The Bible has a lot more to say on this subject – there is the whole Wisdom tradition that we find in books such as the Psalms, the Book Proverbs.\n\nI often find myself reflecting on Psalm 8, the psalmist standing in awe at the majesty of creation, amazed that God would have anything to do with mere man. In our Old Testament Lesson, there is a reflection on Wisdom present at creation, participating in creation that ties in with the opening verses of our Gospel reading, ‘In the beginning was the Word, and the Word was with God, and the Word was God. He was with God in the beginning.’ (John 1:1)\n\nOur thoughts here are being drawn beyond the mere fact of creation, beyond speculation about the mechanics of creation – evolution, big bang, Darwin or Genesis - to the issue that lies at the heart of all the Biblical material, that of purpose; ‘What is man that God is mindful of him?’\n\nWith purpose comes the idea of providence, that God has a continuing interest in this world that he has made. The Bible explores this through the story, the history of a particular people. The Hebrews understood their history as the working out of a destiny to which God had called Abraham and his descendants; that history is understood as a covenant history, through which God guided his people towards their destiny.\n\nIt is a picture of God working through history. Joseph abandoned into slavery by jealous conniving brothers becomes the instrument of their preservation. Then of course there are the events of a people’s Exodus from Egypt; scarcely mentioned in Egyptian annals yet crucial in the Jewish people’s understanding of who they are before God. The opening chapter of St John’s Gospel, that we read from this morning, expresses the Christian conviction that what was begun in the call of Abraham finds its culmination in the coming of Christ.\n\nBut this picture of God’s purposes in creation, God’s providence brings us face to face with the problem of evil, of suffering. What do we say in the face of the suffering we see on our television screens – be they the results of natural disaster or human conflict? Or just the crises we face in our own lives; illness in ourselves or a loved one – where is God in all of this?\n\nI often recall one of our lecturers in college remarking that we often feel that we have to be so polite to God in the face of evil. He contrasted this to the writer of the Psalms and books such as the Book of Job in which the problem of evil was addressed with nothing less than a passion. As I thought about this I went back to a book by Bishop David Jenkins, ‘Free to Believe’.\n\n‘Belief in God is always challenged. There is always a question-mark about which wins – faith or nonsense. Sometimes the question-mark goes down in the same sort of desperation, despair and nonsense that Jesus faced on the cross. Then I am reminded that the writer of the Book of Job had the same question-mark and practically swore at God. Jesus in his desperate cry on the Cross experienced the same question-mark. I find again and again that, in a very glorious and strange way, the question-mark suddenly changes into an exclamation-mark about the glory of God and triumph of love. The hell business in life of much-loved children dying, of the sufferings of famine, bereavement, loneliness – the shouting at God – it all echoes the desolation of the Cross. In Jesus we are reminded that bang out of the middle of this despair is where Resurrection explodes, the Holy Spirit is given and there is power to go on living.’ (Free to Believe p 67)\n\nWe began by thinking of God’s purposes in creation and the whole concept of providence, the whole idea of God working in and through the developing history of his creation. In the context of the Biblical story, working through from the call of Abraham, the ups and downs of the covenant history through to the coming of Christ.\n\nBut any thoughts of God’s purpose inevitably bring us up against the problem of evil, of suffering in the world; those question marks mentioned by Bishop David Jenkins, questions that have to be faced. I begin to find the answer in the very question itself and in the mystery of the incarnation, the passion, the death and resurrection of Jesus. In place of God’s apparent absence, I experience something of God’s solidarity as one who experienced in himself the darkness, the pain and desolation of Calvary, and in that solidarity come to find something of his peace.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/2bflent2015.txt",
        "raw_ocr_content": "2nd Sunday before Lent – 2015 – year B\nWhen we think about creation in religious terms our minds turn inevitably to\nthe two creation narratives that make up the first two chapters of Genesis.\nAround these passages have sprung up all the debates about creationism,\nDarwinism, the apparent conflict between religious faith and scientific enquiry.\nThe Bible has a lot more to say on this subject – there is the whole Wisdom\ntradition that we find in books such as the Psalms, the Book Proverbs.\nI often find myself reflecting on Psalm 8, the psalmist standing in awe at the\nmajesty of creation, amazed that God would have anything to do with mere\nman. In our Old Testament Lesson, there is a reflection on Wisdom present at\ncreation, participating in creation that ties in with the opening verses of our\nGospel reading, ‘In the beginning was the Word, and the Word was with God,\nand the Word was God. He was with God in the beginning.’ (John 1:1)\nOur thoughts here are being drawn beyond the mere fact of creation, beyond\nspeculation about the mechanics of creation – evolution, big bang, Darwin or\nGenesis - to the issue that lies at the heart of all the Biblical material, that of\npurpose; ‘What is man that God is mindful of him?’\nWith purpose comes the idea of providence, that God has a continuing interest\nin this world that he has made. The Bible explores this through the story, the\nhistory of a particular people. The Hebrews understood their history as the\nworking out of a destiny to which God had called Abraham and his\ndescendants; that history is understood as a covenant history, through which\nGod guided his people towards their destiny.\nPage 1 of 3\n2nd Sunday before Lent – 2015 – year B\nIt is a picture of God working through history. Joseph abandoned into slavery\nby jealous conniving brothers becomes the instrument of their preservation.\nThen of course there are the events of a people’s Exodus from Egypt; scarcely\nmentioned in Egyptian annals yet crucial in the Jewish people’s understanding\nof who they are before God. The opening chapter of St John’s Gospel, that we\nread from this morning, expresses the Christian conviction that what was begun\nin the call of Abraham finds its culmination in the coming of Christ.\nBut this picture of God’s purposes in creation, God’s providence brings us face\nto face with the problem of evil, of suffering. What do we say in the face of\nthe suffering we see on our television screens – be they the results of natural\ndisaster or human conflict? Or just the crises we face in our own lives; illness\nin ourselves or a loved one – where is God in all of this?\nI often recall one of our lecturers in college remarking that we often feel that\nwe have to be so polite to God in the face of evil. He contrasted this to the\nwriter of the Psalms and books such as the Book of Job in which the problem\nof evil was addressed with nothing less than a passion. As I thought about this\nI went back to a book by Bishop David Jenkins, ‘Free to Believe’.\n‘Belief in God is always challenged. There is always a question-mark about\nwhich wins – faith or nonsense. Sometimes the question-mark goes down in\nthe same sort of desperation, despair and nonsense that Jesus faced on the\ncross. Then I am reminded that the writer of the Book of Job had the same\nquestion-mark and practically swore at God. Jesus in his desperate cry on the\nPage 2 of 3\n2nd Sunday before Lent – 2015 – year B\nCross experienced the same question-mark. I find again and again that, in a\nvery glorious and strange way, the question-mark suddenly changes into an\nexclamation-mark about the glory of God and triumph of love. The hell\nbusiness in life of much-loved children dying, of the sufferings of famine,\nbereavement, loneliness – the shouting at God – it all echoes the desolation of\nthe Cross. In Jesus we are reminded that bang out of the middle of this despair\nis where Resurrection explodes, the Holy Spirit is given and there is power to\ngo on living.’ (Free to Believe p 67)\nWe began by thinking of God’s purposes in creation and the whole concept of\nprovidence, the whole idea of God working in and through the developing\nhistory of his creation. In the context of the Biblical story, working through\nfrom the call of Abraham, the ups and downs of the covenant history through\nto the coming of Christ.\nBut any thoughts of God’s purpose inevitably bring us up against the problem\nof evil, of suffering in the world; those question marks mentioned by Bishop\nDavid Jenkins, questions that have to be faced. I begin to find the answer in\nthe very question itself and in the mystery of the incarnation, the passion, the\ndeath and resurrection of Jesus. In place of God’s apparent absence, I\nexperience something of God’s solidarity as one who experienced in himself\nthe darkness, the pain and desolation of Calvary, and in that solidarity come to\nfind something of his peace.\nPage 3 of 3"
    }
}