{
    "title": "The Universe and Us",
    "date": "2012-02-12",
    "blurb": "This sermon focuses on our place in the universe and God's care for us. It explores the vastness of the universe, the beauty of life on Earth, and the intricate details of our own bodies. It emphasizes that not only does God create, but He also cares deeply for His creation, including us in all our goodness and badness.",
    "raw_text": "2nd Sunday before Lent – 2012 – year B - Family Service\n\nNot so very long ago we celebrated Christmas, the birth of Jesus. This Sunday we are getting close to the beginning of Lent when we will be starting our preparations for Good Friday and Easter, when we think of the death and resurrection of Jesus. On this particular Sunday, in our readings we are asked to think about this wonderful world in which we live. Not just how it is made but what is it all for. At the centre of all that is the person of Jesus.\n\nWith the help of a few pictures I just want to think not just about this world in which we live but the whole Universe of which we are just a little bit. It is hard at times to get our heads around how big the universe is.\n\nThis is a picture taken by the Hubble Space Telescope of the Seagull Nebula, a group of stars 3,800 light years away – that means it took 3,800 years for the light to travel from these stars to the Earth – it takes only 15 minutes for the light to travel from the Sun to the Earth. Working on the basis of that – if the distance between the Earth and the Sun were scaled down to just 1cm, that beauty would be 2,500 km away. This Universe that God has made is massive.\n\nThen around the stars are planets. Around our own Sun we have a number of planets including Saturn and our own Earth. Saturn has these beautiful rings. Because it is so far out from the Sun it is very cold so no life can live on it. But our Earth is very different. It is just the right temperature for water to exist, has just the right atmosphere – it is home for a wonderful variety of life.\n\nWe have tiny life forms, microbes that can exist in a wide variety of places, from the wall of a volcanic lava tube to deep down in the Antarctic Ocean, in total darkness and very cold temperatures.\n\nThen of course there is the miracle of you and me. This is a picture of a baby in the womb, a full 6 months before he was born.\n\nThen each life form, from the tiniest microbe, the biggest whale, you and me, each has its own DNA, in every cell of its body that contains a code which will determine the colour of my eyes, how tall I am going to grow, colour of my hair, my eyes, my skin.\n\nGoing down even smaller we get to the atoms and molecules that make up everything. This picture, taken by one of the most powerful microscopes in the world, shows the structure of a molecule, how the atoms are joined together to make it.\n\nSo from the very smallest atom to the most distant star we celebrate the God who made it all, the God who is so big and so strong and so mighty.\n\nThe Bible takes us a stage further than amazement at this wonderful world. It goes on to ask why? Why does God bother with us? Why are we so special? We not only worship a God who makes, we worship a God who cares, cares for this world he makes, cares for us in all our goodness and in our badness.\n\nThat is where Christ fits in – present at the very start of creation, he comes and lives among us to show us God’s love and how God wants us to live.\n\nLet us go out from this place with something of the innocent wonder of a child at the glory of this earth, this universe in which we are set, reminding ourselves that the God who made all of this has an abiding care for you and for me. Let us show something of that wonder in simple care and service of one another in the week to come.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/2bflent2012famserv.txt",
        "raw_ocr_content": "Page 1 of 4\n2nd Sunday before Lent – 2012 – year B - Family Service\nNot so very long ago we celebrated Christmas, the birth of Jesus. This Sunday\nwe are getting close to the beginning of Lent when we will be starting our\npreparations for Good Friday and Easter, when we think of the death and\nresurrection of Jesus. On this particular Sunday, in our readings we are asked\nto think about this wonderful world in which we live. Not just how it is made\nbut what is it all for. At the centre of all that is the person of Jesus.\nWith the help of a few pictures I just want to think not just about this world in\nwhich we live but the whole Universe of which we are just a little bit.\nIt is hard at times to get our heads around how big the universe is.\nSlide 1\nThis is a picture taken by the Hubble Space Telescope of the Seagull Nebula, a\ngroup of stars 3,800 light years away – that means it took 3,800 years for the\nlight to travel from these stars to the Earth – it takes only 15 minutes for the\nlight to travel from the Sun to the Earth. Working on the basis of that – if the\ndistance between the Earth and the Sun were scaled down to just 1cm, that\nbeauty would be 2,500 km away. This Universe that God has made is massive.\nSlide 2\nPage 2 of 4\n2nd Sunday before Lent – 2012 – year B - Family Service\nThen around the stars are planets. Around our own Sun we have a number of\nplanets including Saturn and our own Earth. Saturn has these beautiful rings.\nBecause it is so far out from the Sun it is very cold so no life can live on it. But\nour Earth is very different. It is just the right temperature for water to exist, has\njust the right atmosphere – it is home for a wonderful variety of life.\nSlide 3 & 4\nWe have tiny life forms, microbes that can exist in a wide variety of places,\nfrom the wall of a volcanic lava tube to deep down in the Antarctic Ocean, in\ntotal darkness and very cold temperatures.\nSlide 5\nThen of course there is the miracle of you and me. This is a picture of a baby\nin the womb, a full 6 months before he was born.\nSlide 6\nPage 3 of 4\n2nd Sunday before Lent – 2012 – year B - Family Service\nThen each life form, from the tiniest microbe, the biggest whale, you and me,\neach has its own DNA, in every cell of its body that contains a code which will\ndetermine the colour of my eyes, how tall I am going to grow, colour of my\nhair, my eyes, my skin.\nSlide 7\nGoing down even smaller we get to the atoms and molecules that make up\neverything. This picture, taken by one of the most powerful microscopes in the\nworld, shows the structure of a molecule, how the atoms are joined together to\nmake it.\nSo from the very smallest atom to the most distant star\nSlide 8\nwe celebrate the God who made it all, the God who is so big and so strong and\nso mighty.\nThe Bible takes us a stage further than amazement at this wonderful world. It\ngoes on to ask why? Why does God bother with us? Why are we so special?\nWe not only worship a God who makes, we worship a God who cares, cares\nfor this world he makes, cares for us in all our goodness and in our badness.\nPage 4 of 4\n2nd Sunday before Lent – 2012 – year B - Family Service\nThat is where Christ fits in – present at the very start of creation, he comes and\nlives among us to show us God’s love and how God wants us to live.\nLet us go out from this place with something of the innocent wonder of a child\nat the glory of this earth, this universe in which we are set, reminding ourselves\nthat the God who made all of this has an abiding care for you and for me. Let\nus show something of that wonder in simple care and service of one another in\nthe week to come."
    }
}