{
    "title": "Recognizing Jesus",
    "date": "2011-05-08",
    "blurb": "The sermon emphasizes the importance of recognizing Jesus not by his physical appearance but by his actions. It highlights the need for followers of Jesus to emulate his actions and compassion. The sermon concludes with a powerful reminder that as followers, we are the body of Christ on earth.",
    "raw_text": "3rd Sunday of Easter - 2011 - Family Service\n\nHow would you describe a painter, a postman, a bus driver? We recognise them not by how big or small they are, the sound of their voice but by what they do.\n\nThe disciples on the road to Emmaus did not recognise the stranger as he walked alongside them - they did not recognise his voice, even how he looked but they saw who he was when he did something - when he broke the bread.\n\nJesus did not always do things that other people wanted him to do sometimes his disciples thought they knew best what Jesus should do - stay here, the people like you - you are doing well. Don't go near Jerusalem - they are not nice.\n\nIf we are going to be followers of Jesus we have to learn to do and say the things he would want us to do.\n\n> Christ has no body but yours,\n> No hands, no feet on earth but yours,\n> Yours are the eyes with which he looks\n> Compassion on this world,\n> Yours are the feet with which he walks to do good,\n> Yours are the hands, with which he blesses all the world.\n> Yours are the hands, yours are the feet,\n> Yours are the eyes, you are his body.\n\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks compassion on this world.\nChrist has no body now on earth but yours.\n\nMay each one of us be recognized this week as a follower of Jesus.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/3ofeaster2011 - Family Service.txt",
        "raw_ocr_content": "Page 1 of 2\n3rd Sunday of Easter – 2011 – Family Service\nHow would you describe a painter\na postman\na bus driver\nWe recognise them not by how big or small they are, the sound of their voice\nbut by what they do.\nThe disciples on the road to Emmaus did not recognise the stranger as he\nwalked alongside them – they did not recognise his voice, even how he looked\nbut they saw who he was when he did something – when he broke the bread.\nJesus did not always do things that other people wanted him to do\nsometimes his disciples thought they knew best what Jesus should do – stay\nhere, the people like you – you are doing well.\nDon’t go near Jerusalem – they are not nice.\nIf we are going to be followers of Jesus we have to learn to do and say the\nthings he would want us to do.\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nPage 2 of 2\n3rd Sunday of Easter – 2011 – Family Service\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nMay each one of us be recognized this week as a follower of Jesus"
    }
}