{
    "title": "The Road to Emmaus",
    "date": "2017-04-16",
    "blurb": "This sermon explores the story of the two disciples on the road to Emmaus on the first Easter Day. It discusses their initial confusion and despair, and how their encounter with the risen Jesus, initially unrecognized, brings them comfort and understanding. The sermon emphasizes the importance of honesty with God in times of pain and confusion.",
    "raw_text": "While they were talking and discussing, Jesus himself came near and went with them, but their eyes were kept from recognizing him. Luke 24:15\n\nThe opening greeting in our services on Easter Morning is 'The Lord is risen; He is risen indeed. Alleluia'. This reminds me of the custom in Russia in the time of the Czars. On Easter morning the Czar would come out of his chamber and greet the guard at the door with the words 'The Lord is risen!' To which the guard would reply, 'He is risen indeed!'. The two men would embrace each other. It was the only occasion of the year when the Czar would have physical contact with any of the lower orders.\n\nAs we say those words, 'The Lord is risen! He is risen indeed, Alleluia!' there is a confidence, an exuberance – for we know the story. The Gospel, the Good News of resurrection was spread, eventually coming to Ireland and the Easter message has been proclaimed one generation to another.\n\nBut we forget that that was not the experience of those first disciples on that first Easter Day. The news of the Empty Tomb was a confusing and disturbing experience. Mary was distraught; the disciples did not believe her. Thomas certainly would have none of it. This morning we read of two disciples, dispirited and confused, heading out of Jerusalem on that first Easter Day, heading for Emmaus, talking about all that had happened. We are told:\n\n'While they were talking and discussing, Jesus himself came near and went with them, but their eyes were kept from recognizing him.'\n\nWhat is the picture, what is the understanding of the Risen Jesus that Luke is trying to impart to us in this lovely story we read this morning. To tease this out I just want to set it alongside a prayer of blessing that I would often use:\n\n'Go, and know that the Lord goes with you: let him lead you each day into the quiet place of your heart, where he will speak with you; know that he watches over you – that he listens to you in gentle understanding, that he is with you always, wherever you are and however you may feel: and the blessing of God Almighty, the Father, the Son and the Holy Spirit be upon you and remain with you always. Amen.'\n\nIt is this picture of the Lord going with them as they trudged that weary road to Emmaus. There was no sudden revelation, nothing forced upon them. Initially all they knew was the presence of a sympathetic stranger who listened to them, who heard their pain and their disappointment.\n\nThe risen Christ walks the road of pain and disappointment. He, who knew the pain and darkness of the Cross, knows and understands. He walks with us in our own times of self doubt, of disappointment and hurt – those times when we only seem to know God in his absence.\n\nHe does not cut across their expressions of pain and confusion. He listens as they articulate their disillusionment and pain. I often say to people that God can handle our expressions of hurt. Sometimes we feel we have to be so polite to God. The Psalmist displays a wonderful honesty with God. If things were going well he would praise, if things were going badly he would ask why.\n\nThere is no point declaring, 'Lord, life is wonderful!' if we are in despair – God knows how we feel anyway. Once the Psalmist has got the pain off his chest, he begins to see God acting in his life. Once the disciples have expressed their hurt and their pain, they are able to listen as Jesus 'unfolds the scriptures'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/3ofeaster2017 - not used.txt",
        "raw_ocr_content": "15While they were talking and discussing, Jesus himself came near and went with them,\n16but their eyes were kept from recognizing him. Luke 24:15\nThe opening greeting in our services on Easter Morning is ‘The Lord is risen; He is risen\nindeed. Alleluia’ This for me reminds me of the custom in Russia in the time of the\nCzars. On Easter morning the Czar would come out of his chamber and greet the guard at\nthe door with the words ‘The Lord is risen!’ To which the guard would reply, ‘He is risen\nindeed!’. The two men would embrace each other. It was the only occasion of the year\nwhen the Czar would have physical contact with any of the lower orders.\nAs we say those words, ‘The Lord is risen! He is risen indeed, Alleluia!’ there is a\nconfidence, an exuberance – for we know the story. The Gospel, the Good News of\nresurrection was spread, eventually coming to Ireland and the Easter message has been\nproclaimed one generation to another.\nBut we forget that that was not the experience of those first disciples on that first Easter\nDay. The news of the Empty Tomb was a confusing and disturbing experience. Mary was\ndistraught; the disciples did not believe her. Thomas certainly would have none of it. This\nmorning we read of two disciples, dispirited and confused, heading out of Jerusalem on\nthat first Easter Day, heading for Emmaus, talking about all that had happened. We are\ntold:\n15While they were talking and discussing, Jesus himself came near and\nwent with them, 16but their eyes were kept from recognizing him.\nWhat is the picture, what is the understanding of the Risen Jesus that Luke is\ntrying to impart to us in this lovely story we read this morning.. To tease this\nout I just want to set it alongside a prayer of blessing that I would often use:\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place of your heart,\nwhere he will speak with you;\nknow that he watches over you – that he listens to you in gentle\nunderstanding,\nthat he is with you always, wherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always. Amen.\nIt is this picture of the Lord going with them as they trudged that weary road to\nEmmaus. There was no sudden revelation, nothing forced upon them. Initially\nall they knew was the presence of a sympathetic stranger who listened to them,\nwho heard their pain and their disappointment.\nThe risen Christ walks the road of pain and disappointment. He, who knew the\npain and darkness of the Cross, knows and understands. He walks with us in\nour own times of self doubt, of disappointment and hurt – those times when we\nonly seem to know God in his absence.\nHe does not cut across their expressions of pain and confusion. He listens as\nthey articulate their disillusionment and pain. I often say to people that God\ncan handle our expressions of hurt. Sometimes we feel we have to be so polite\nto God. The Psalmist displays a wonderful honesty with God. If things were\ngoing well he would praise, if things were going badly he would ask why.\nThere is no point declaring, ‘Lord, life is wonderful!’ if we are in despair –\nGod knows how we feel anyway. Once the Psalmist has got the pain off his\nchest, he begins to see God acting in his life. Once the disciples have\nexpressed their hurt and their pain, they are able to listen as Jesus ‘unfolds the\nscriptures’"
    }
}