{
    "title": "Prayers for the Faithful",
    "date": "2023-02-05",
    "blurb": "This sermon is a series of prayers for the Church, the nations, the community, the sick, and the departed. It emphasizes the need for peace, righteousness, respect, and awareness of each other's needs within our homes and communities. It also highlights the importance of leadership in fostering peace and reconciliation.",
    "raw_text": "Let us pray to the Lord who has called us to be faithful in his service. Give to the Church power to proclaim your great works and to shine as a light that will draw all people to your love and honour your name. We pray for the Church in Ireland at this time, for this Diocese and for Michael our Archbishop, for this Parish and for Gillian our Rector.\n\nLord in your mercy: hear our prayer. We pray for all those called to leadership and power among the nations, that power may be used for good, working for peace and righteousness in the world. We continue in our prayers for the people of Ukraine, for peace in Israel and Palestine. We pray for this country, for our President and for all in authority. We pray for all those called to leadership North and South that they may foster peace, not conflict; reconciliation, not division.\n\nLord in your mercy: hear our prayer. We pray that within our homes and communities there may be a new awareness of one another’s gifts and needs, more sensitivity and respect in our relationships. May we reverence one another as human beings, born of your creative love.\n\nLord in your mercy: hear our prayer. We pray for all who are sick, those who watch over them, those who minister to their needs. In a few moments of silence let us remember our GP’s, those who work as home helps in our community.\n\nLord in your mercy: hear our prayer. We remember with thanksgiving those who have gone before us in the faith, those in whom we have seen something of the light of Christ in our lives. May we share with them the joys of your eternal Kingdom.\n\nLord in your mercy: hear our prayer. Merciful Father accept these prayers for the sake of your Son, our Saviour Jesus Christ.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/3rdbeforelent2023 - prayers.txt",
        "raw_ocr_content": "Booterstown & Mountmerrion – Sunday 5th February 2023\nPrayers – 3rd Sunday before Lent\nLet us pray to the Lord who has called us to be faithful in his service.\nGive to the Church power to proclaim your great works and to shine as a light that will draw all\npeople to your love and honour your name.\nWe pray for the Church in Ireland at this time, for this Diocese and for Michael our Archbishop,\nfor this Parish and for Gillian our Rector.\nLord in your mercy:\nhear our prayer.\nWe pray for all those called to leadership and power among the nations, that power may be used\nfor good, working for peace and righteousness in the world. We continue in our prayers for the\npeople of Ukraine, for peace in Israel and Palestine.\nWe pray for this country, for our President and for all in authority.\nWe pray for all those called to leadership North and South that they may foster peace, not\nconflict; reconciliation, not division.\nLord in your mercy:\nhear our prayer.\nWe pray that within our homes and communities there may be a new awareness of one another’s\ngifts and needs,\nmore sensitivity and respect in our relationships.\nMay we reverence one another as human beings, born of your creative love.\nLord in your mercy:\nhear our prayer.\nWe pray for all who are sick, ……………..\nthose who watch over them, those who minister to their needs.\nIn a few moments of silence let us remember our GP’s, those who work as home helps in our\ncommunity.\nLord in your mercy:\nhear our prayer.\nWe remember with thanksgiving those who have gone before us in the faith, those in whom we\nhave seen something of the light of Christ in our lives.\nMay we share with them the joys of your eternal Kingdom.\nLord in your mercy:\nhear our prayer.\nMerciful Father\naccept these prayers\nfor the sake of your Son,\nour Saviour Jesus Christ."
    }
}