{
    "title": "The Good Shepherd",
    "date": "2020-04-26",
    "blurb": "In this sermon, Kevin discusses the concept of Jesus as the Good Shepherd, drawing parallels between the relationship of a shepherd and his flock to God's relationship with humanity. He emphasizes the unconditional love and care that a shepherd provides, mirroring God's unwavering love for us. The sermon also touches on the story of the Prodigal Son, further illustrating God's boundless love and forgiveness.",
    "raw_text": "As we move through the Easter season our Gospel readings shift from those which tell of Jesus’ resurrection appearances to passages from John’s account of his teaching at the Last Supper. We read them not as the disciples first heard them, as the words of a man about to die; we read them in the light of the Resurrection, Jesus victorious over sin and death.\n\nIn our Gospel reading today, Jesus talks of himself as the Good Shepherd. When we think of shepherds in our own context, we think of sheep in well organised farms, with the shepherd and his dog driving the sheep from one pasture to another, returning to his home at night. The shepherd in Jesus’ time had a different relationship to his flock. He lived with them 24/7. He slept out in the fields with them; he protected them from wild animals. Whereas the modern sheep farmer rears his animals primarily for their meat and so will keep them for a relatively short period; the shepherd in Jesus’ time kept his flock for their milk and their wool so he would have kept them for a much longer period of time. The shepherd would know their sheep and the sheep would know the shepherd.\n\nSo when Jesus describes himself as a shepherd, he is identifying with the lower orders of society. He is a shepherd who knows his sheep, one in whose presence the sheep feel secure. All this was brought home to me nearly thirty years ago when Rachel and I lead a small group to the Holy Land. It was towards the end of our stay. We had spent the afternoon on the hills overlooking Lake Galilee where we had shared a lovely communion service out in the open air overlooking the Lake.\n\nThe shepherd knew his own and his own knew the voice of the shepherd. If you think about it there was no point at which the straggler ceased to be part of the flock. There was no point at which the shepherd ceased to listen out for the straggler.\n\nWhen I am talking with a Confirmation Group about forgiveness, I will often ask could they imagine any circumstance in which their parents would stop loving them. They might get cross, very cross, they might impose punishments; but would they ever stop loving them? And they all reply that they could not imagine such a situation – which is a wonderful affirmation of their parents.\n\nIt is at this point that I want to set what we have been thinking about against a picture and a story I frequently find myself thinking about. It is Rembrandt’s picture of the return of the Prodigal Son.\n\nLike the lamb wandering off, the story of the Prodigal Son is a story of separation and return. Maybe the son had turned his back on the father, maybe he had even stopped thinking or caring about the father. But it is clear from the story that the father never stopped thinking and caring about him, never stopped looking out for the return of his wayward son.\n\nIn time, the son, returns to his senses and heads home, rehearsing the abject apology he was going to make to his father as he offered himself as a household servant.\n\nBut he was still the father’s son. The father, clearly watching out for the son, rushes out to meet him. The son’s carefully rehearsed apology is smothered by a father’s love as the son is welcomed, thoroughly undeserved in his own right, back into his place as son in the family.\n\nThe shepherd always on the look out for the flock, the father constantly looking out for his returning wayward son – both these are powerful illustrations of that fundamental truth of God that we read in the letters of John. 'God is love'. That is more than just God loves us. God is love, love is part of the very nature of the one who created us, who redeemed us.\n\nLoved by God, we are sent out into the world to love as he would have us love; to love those who need our love, those in need but also to love the unloveable, the undeserving, those who would hurt and abuse our love.\n\nIn the words of a blessing I would sometimes use:\n\nGo forth into the world in peace;\nbe of good courage;\nhold fast that which is good;\nrender to no one evil for evil;\nstrengthen the fainthearted; support the weak;\nhelp the afflicted; honour everyone;\nlove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand the blessing of God almighty,\nthe Father, the Son, and the Holy Spirit,\nbe among you and remain with you always.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/4ofeaster2020.txt",
        "raw_ocr_content": "Page 1 of 3\n4th Sunday of Easter – 2015 – Year B\nYouTube clip of a simple act of worship - https://youtu.be/GgvUGMipgwU\nAs we move through the Easter season our Gospel readings shift from those which\ntell of Jesus’ resurrection appearances to passages from John’s account of his\nteaching at the Last Supper. We read them not as the disciples first heard them, as\nthe words of a man about to die; we read them in the light of the Resurrection, Jesus\nvictorious over sin and death.\nIn our Gospel reading today, Jesus talks of himself as the Good Shepherd. When we\nthink of shepherds in our own context, we think of sheep in well organised farms,\nwith the shepherd and his dog driving the sheep from one pasture to another,\nreturning to his home at night. The shepherd in Jesus’ time had a different\nrelationship to his flock. He lived with them 24/7. He slept out in the fields with\nthem; he protected them from wild animals. Whereas the modern sheep farmer rears\nhis animals primarily for their meat and so will keep them for a relatively short\nperiod; the shepherd in Jesus’ time kept his flock for their milk and their wool so he\nwould have kept them for a much longer period of time. The shepherd would know\ntheir sheep and the sheep would know the shepherd.\nQuite apart from that, the shepherd would have been among the lower echelons of\nsociety. The very nature of his work would have presented severe difficulties in the\narea of ritual purity and participation in public worship.\nSo when Jesus describes himself as a shepherd, he is identifying with the lower\norders of society. He is a shepherd who knows his sheep, one in whose presence the\nsheep feel secure. All this was brought home to me nearly thirty years ago when\nRachel and I lead a small group to the Holy Land. It was towards the end of our\nstay. We had spent the afternoon on the hills overlooking Lake Galilee where we\nhad shared a lovely communion service out in the open air overlooking the Lake.\nWe were resting on the grass, waiting for our coach to come and pick us up. As we\nwaited a shepherd strolled by walking ahead of his flock. One of the flock stayed\nbehind to taste some tasty morsel. When he looked up, the flock was nowhere to be\nPage 2 of 3\n4th Sunday of Easter – 2015 – Year B\nseen, just us looking at him. Starting to panic, he bleated furiously. From the\ndistance came the sound of the familiar voice of the shepherd and the straggler\nrushed off to join.\nThe shepherd knew his own and his own knew the voice of the shepherd. If you\nthink about it there was no point at which the straggler ceased to be part of the flock.\nThere was no point at which the shepherd ceased to listen out for the straggler.\nWhen I am talking with a Confirmation Group about forgiveness, I will often ask\ncould they imagine any circumstance in which their parents would stop loving them.\nThey might get cross, very cross, they might impose punishments; but would they\never stop loving them? And they all reply that they could not imagine such a\nsituation – which is a wonderful affirmation of their parents.\nIt is at this point that I want to set what\nwe have been thinking about against a\npicture and a story I frequently find\nmyself thinking about. It is\nRembrandt’s picture of the return of\nthe Prodigal Son.\nLike the lamb wandering off, the story\nof the Prodigal Son is a story of\nseparation and return. Maybe the son\nhad turned his back on the father,\nmaybe he had even stopped thinking or\ncaring about the father. But it is clear\nfrom the story that the father never\nstopped thinking and caring about him,\nnever stopped looking out for the\nreturn of his wayward son.\nIn time, the son, returns to his senses and heads home, rehearsing the abject apology\nhe was going to make to his father as he offered himself as a household servant.\nPage 3 of 3\n4th Sunday of Easter – 2015 – Year B\nBut he was still the father’s son. The father, clearly watching out for the son, rushes\nout to meet him. The son’s carefully rehearsed apology is smothered by a father’s\nlove as the son is welcomed, thoroughly undeserved in his own right, back into his\nplace as son in the family.\nThe shepherd always on the look out for the flock, the father constantly looking out\nfor his returning wayward son – both these are powerful illustrations of that\nfundamental truth of God that we read in the letters of John. ‘God is love’. That is\nmore than just God loves us. God is love, love is part of the very nature of the one\nwho created us, who redeemed us.\nLoved by God, we are sent out into the world to love as he would have us love; to\nlove those who need our love, those in need but also to love the unloveable, the\nundeserving, those who would hurt and abuse our love.\nIn the words of a blessing I would sometimes use:\nGo forth into the world in peace;\nbe of good courage;\nhold fast that which is good;\nrender to no one evil for evil;\nstrengthen the fainthearted; support the weak;\nhelp the afflicted; honour everyone;\nlove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand the blessing of God almighty,\nthe Father, the Son, and the Holy Spirit,\nbe among you and remain with you always."
    }
}