{
    "title": "Who Am I?",
    "date": "2014-02-16",
    "blurb": "In this sermon, Kevin Brew explores the fundamental questions of identity, purpose, and our relationship with God. He emphasizes the importance of understanding ourselves in relation to God and others, and the need for our spirituality to inspire and transform our daily lives. The sermon calls for justice, love, and mercy, and the need to live out our dignity and vocation as ones made in the image of God.",
    "raw_text": "4th Sunday before Lent – 2014 – Year A\n\nWhat brings us here each Sunday, to sit in this Church? What is on our hearts this day?\n\nCould I take this a step further back? Who are we who come to sit here in this Church? Who are we? Who am I?\n\nI am Kevin Brew, a white male, mid sixties, priest of the Church of Ireland, Rector of this Parish of Howth. That is more a matter of what am I? No, who am I?\n\nI am husband of Rachel, father of Anthony and Benjamin. I am beginning to understand myself in terms of relationships of love and commitment.\n\nI am brother of Randal and Ted. We are sons of Gilbert Brew and Kathleen Lofts. I am adding to this an understanding of relationships of kindred, that extend back to a time before I was born. My brothers and I have characteristics of appearance and temperament that we have inherited from our parents and through them our grandparents.\n\nBut I am more than the flesh and blood of this body, more than the collection of genetic material I have inherited my parents and ancestors.\n\nI have a mind to think, to reflect, to question; to ask of myself the fundamental questions, ‘Who am I?’, ‘Why am I here?’ ‘What is my purpose?’\n\nAs we ask these questions of ourselves, we realise we are not alone. We are in the presence of one who is the answer. In the Christian tradition we are drawn into an understanding of ourselves in relation to the other, to the God who I encounter in the person of Jesus.\n\nAs I began my own spiritual journey, not sure of who or what I was reaching out to in prayer, one image that was of particular power in my thinking was that of man made in the image of God. That speaks to me not only of dignity, but also of vocation, of purpose; a dignity not only of ourselves as individuals but of everyone. That underpins our commitment to justice for all, irrespective of race, of class, of gender.\n\nAnd so I begin to see a relationship between what I believe; believe about God, about myself and life, how I relate to, interact with, other people.\n\nEvery time we celebrate communion we hear our Lord’s summary of the Law. On one occasion, Jesus was asked what, in his opinion, were the greatest of the commandments. He replied that we should love God with all our heart, our mind and our soul and our neighbour as ourselves. Our belief should inspire our life and our life should bear witness to our belief. This is where our reading from Isaiah speaks to me with a particular force.\n\nThe prophet was speaking to a community that clearly saw itself as faithful in terms of its worship, its spirituality. This spirituality did not seem to infiltrate into daily life. The man who fasts before God seems to see nothing wrong with exploitation of the poor.\n\nI found myself thinking of Terence O’Neill’s last address to the people of Northern Ireland as he prepared to stand down as Prime Minister of Northern Ireland in the face of his proposals of modest reform in the 1960’s before Northern Ireland descended into the ‘Troubles’. As he reflected on the high levels of Church attendance in the Province, he lamented, ‘Our religion could have enriched our politics, instead we have allowed our politics to demean our religion.’. Of course this is not a situation unique to Northern Ireland. In the revelations of recent years, we have seen a dichotomy in our own society between spirituality and the treatment of the weakest and most vulnerable in our midst.\n\nThe prophet points his hearers towards a spirituality that will inspire and transform his society:\n\n> “Is not this the kind of fasting I have chosen:\n> to loose the chains of injustice\n> and untie the cords of the yoke,\n> to set the oppressed free\n> and break every yoke?\n> Is it not to share your food with the hungry\n> and to provide the poor wanderer with shelter\n> ……..\n> Then you will call, and the LORD will answer;\n> you will cry for help, and he will say: Here am I.\n\nHear what our Lord Jesus Christ says:\n\n> You shall love the Lord your God with all your heart and with all your soul and with all your mind.\n> This is the first and great commandment.\n> And the second is like it.\n> You shall love your neighbour as yourself.\n> On these two commandments depend all the law and the prophets. Matthew 22: 37-39\n\nLord, have mercy on us, and write these your laws in our hearts.\n\nMay they indeed be written and inscribed in our hearts as we seek to live out our dignity and vocation this week to live as ones made in the image of God, called to shed something of the light of God in the world in which we live and move and have our being.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/4thbeforelent2014.txt",
        "raw_ocr_content": "Page 1 of 3\n4th Sunday before Lent – 2014 – Year A\nWhat brings us here each Sunday, to sit in this Church? What is on our hearts\nthis day?\nCould I take this a step further back? Who are we who come to sit here in this\nChurch? Who are we? Who am I?\nI am Kevin Brew, a white male, mid sixties, priest of the Church of Ireland,\nRector of this Parish of Howth. That is more a matter of what am I?\nNo, who am I?\nI am husband of Rachel, father of Anthony and Benjamin. I am beginning to\nunderstand myself in terms of relationships of love and commitment.\nI am brother of Randal and Ted. We are sons of Gilbert Brew and Kathleen\nLofts. I am adding to this an understanding of relationships of kindred, that\nextend back to a time before I was born. My brothers and I have characteristics\nof appearance and temperament that we have inherited from our parents and\nthrough them our grandparents.\nBut I am more than the flesh and blood of this body, more than the collection\nof genetic material I have inherited my parents and ancestors.\nI have a mind to think, to reflect, to question; to ask of myself the fundamental\nquestions, ‘Who am I?’, ‘Why am I here?’ ‘What is my purpose?’\nAs we ask these questions of ourselves, we realise we are not alone. We are in\nthe presence of one who is the answer. In the Christian tradition we are drawn\ninto an understanding of ourselves in relation to the other, to the God who I\nencounter in the person of Jesus.\nPage 2 of 3\n4th Sunday before Lent – 2014 – Year A\nAs I began my own spiritual journey, not sure of who or what I was reaching\nout to in prayer, one image that was of particular power in my thinking was\nthat of man made in the image of God. That speaks to me not only of dignity,\nbut also of vocation, of purpose; a dignity not only of ourselves as individuals\nbut of everyone. That underpins our commitment to justice for all, irrespective\nof race, of class, of gender.\nAnd so I begin to see a relationship between what I believe; believe about God,\nabout myself and life, how I relate to, interact with, other people.\nEvery time we celebrate communion we hear our Lord’s summary of the Law.\nOn one occasion, Jesus was asked what, in his opinion, were the greatest of the\ncommandments. He replied that we should love God with all our heart, our\nmind and our soul and our neighbour as ourselves. Our belief should inspire\nour life and our life should bear witness to our belief. This is where our\nreading from Isaiah speaks to me with a particular force.\nThe prophet was speaking to a community that clearly saw itself as faithful in\nterms of its worship, its spirituality. This spirituality did not seem to infiltrate\ninto daily life. The man who fasts before God seems to see nothing wrong with\nexploitation of the poor.\nI found myself thinking of Terence O’Neill’s last address to the people of\nNorthern Ireland as he prepared to stand down as Prime Minister of Northern\nIreland in the face of his proposals of modest reform in the 1960’s before\nNorthern Ireland descended into the ‘Troubles’. As he reflected on the high\nlevels of Church attendance in the Province, he lamented, ‘Our religion could\nhave enriched our politics, instead we have allowed our politics to demean our\nreligion.’. Of course this is not a situation unique to Northern Ireland. In the\nPage 3 of 3\n4th Sunday before Lent – 2014 – Year A\nrevelations of recent years, we have seen a dichotomy in our own society\nbetween spirituality and the treatment of the weakest and most vulnerable in\nour midst.\nThe prophet points his hearers towards a spirituality that will inspire and\ntransform his society:\n“Is not this the kind of fasting I have chosen:\nto loose the chains of injustice\nand untie the cords of the yoke,\nto set the oppressed free\nand break every yoke?\nIs it not to share your food with the hungry\nand to provide the poor wanderer with shelter\n………………………………………..\nThen you will call, and the LORD will answer;\nyou will cry for help, and he will say: Here am I.\nHear what our Lord Jesus Christ says:\nYou shall love the Lord your God with all your heart and with all your\nsoul and with all your mind.\nThis is the first and great commandment.\nAnd the second is like it.\nYou shall love your neighbour as yourself.\nOn these two commandments depend all the law\nand the prophets. Matthew 22: 37-39\nLord, have mercy on us,\nand write these your laws in our hearts.\nMay they indeed be written and inscribed in our hearts as we seek to live out\nour dignity and vocation this week to live as ones made in the image of God,\ncalled to shed something of the light of God in the world in which we live and\nmove and have our being."
    }
}