{
    "title": "Family and Faith",
    "date": "2017-05-14",
    "blurb": "This sermon, delivered on the 5th Sunday of Easter in 2017, discusses the importance of family and community in the Church. It emphasizes the role of the Church as a family, providing spiritual nutrition and guidance, and the responsibility of the congregation in nurturing new members. The sermon also highlights the significance of the physical space of the Church, as it moves into a new location.",
    "raw_text": "5th Sunday of Easter – Year A – 2017\nFamily Service & Baptism – 1st Sunday in the Hall\n\nWell we’ve moved! Thanks to a lot of people turning up on Monday night to move lots of stuff out of the Church into the container. I was asked, ‘Rector – do we need this?’ ‘Rector – can we manage without that?’\n\nWe’ve all been saying – ‘Church will be different.’ – yet Church won’t be different. Because Church is first of all you and me – it is just that the Church (you and me) are going to be meeting in a different place – here in this Hall, the same Hall we have coffee in after our services, where the Montessori operates, where many of you come for scouts, for cubs, for Tae Kwando, for bridge, for Youth Club, for the Tuesday club, for Art classes, for Alzheimer’s support – next Saturday it will be humming with activity for the Fete.\n\nAnd so it is lovely that today, our first Sunday for worshipping in the Hall in which so much ‘ordinary stuff’ happens that we are welcoming a new member of the Church.\n\nNew babies have never ceased to amaze me – the perfect miniature detail of those hands – the fingers, the finger nails – magic. Talking to Mums and Dads for a minute, when babies arrive as parents we realise, in a way we never did before they were born, they depend on us – in the early days of little sleep and lots of exhaustion it is food and drink and warmth and love – then of course there are lifts, football kits to be bought and washed, shoulders to cry on, someone to shout and scream at, to borrow money off, who is going to love and be proud of them through it all.\n\nA lot of what we offer can be summed up under two headings: Nutrition – the food we give, the love and understanding; Guidance – the advice, the education, the listening ear. Beatrice is already an irreplaceable part of her human family. This morning we welcome her into the wider family of the Church. Our lessons this morning have talked a bit about nutrition and guidance.\n\nIn our first lesson, Peter was talking to the early Christians about the importance of looking for ‘pure spiritual milk that you may grow.’ and elsewhere Jesus will talk of himself as ‘the bread of life’. In our second lesson Jesus talks of himself as being the ‘way, the truth and the life’.\n\nThis little girl is already physically very well looked after and loved as part of her own family – how do we look after her as part of the family of the Church?\n\nThis morning Beatrice’s parents and godparents were asked a number of questions – I asked them ‘will you walk with her in the way of Christ?’ and then ‘will you help her take her place within the life and worship of Christ’s Church?’\n\nA lot of it is going to fall on her Mum and Dad – but not all of it – we all have a part to play. When she comes here is she just going to hear about following Jesus – or is she going to see people around her to live that out in practice?\n\nLater on in the service we will all say to Beatrice:\n\nWe welcome you into the fellowship of faith;\nwe are children of the same heavenly Father;\nwe welcome you.\n\nIs she going to feel that welcome in the years to come as she takes her place in the life of the Church?\n\nSo today, in our temporary home, we welcome a new member into our family, the Church. May God bless her and her Mum and Dad and all who will have the care of her in the days and weeks and years to come.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/5ofeaster2017 - Family.txt",
        "raw_ocr_content": "Page 1 of 4\n5th Sunday of Easter – Year A – 2017\nFamily Service & Baptism – 1st Sunday in the Hall\nWell we’ve moved! Thanks to a lot of people turning up on Monday\nnight to move lots of stuff out of the Church into the container?\nI was asked, ‘Rector – do we need this?’ ‘Rector – can we manage\nwithout that?’\nWe’ve all been saying – ‘Church will be different.’ – yet Church\nwon’t be different\nBecause Church is first of all you and me – it is just that the Church\n(you and me) are going to be meeting in a different place – here in this\nHall, the same Hall we have coffee in after our services, where the\nMontessori operates, where many of you come for scouts, for cubs, for\nTae Kwando, for bridge, for Youth Club, for the Tuesday club, for Art\nclasses, for Alzheimer’s support – next Saturday it will be humming\nwith activity for the Fete.\nAnd so it is lovely that today, our first Sunday for worshipping in the\nHall in which so much ‘ordinary stuff’ happens that we are welcoming\na new member of the Church.\nPage 2 of 4\n5th Sunday of Easter – Year A – 2017\nFamily Service & Baptism – 1st Sunday in the Hall\nNew babies have never ceased to amaze me – the perfect miniature\ndetail of those hands – the fingers, the finger nails – magic.\nTalking to Mums and Dads for a minute, when babies arrive as\nparents we realise, in a way we never did before they were born, they\ndepend on us – in the early days of little sleep and lots of exhaustion it\nis food and drink and warmth and love – then of course there are lifts,\nfootball kits to be bought and washed, shoulders to cry on, someone to\nshout and scream at, to borrow money off, who is going to love and be\nproud of them through it all.\nA lot of what we offer can be summed up under two headings\nNutrition – the food we give, the love and understanding\nGuidance – the advice, the education, the listening ear\nBeatrice is already an irreplaceable part of her human family. This\nmorning we welcome her into the wider family of the Church. Our\nlessons this morning have talked a bit about nutrition and guidance.\nIn our first lesson, Peter was talking to the early Christians about the\nimportance of looking for ‘pure spiritual milk that you may grow.’ and\nelsewhere Jesus will talk of himself as ‘the bread of life’. In our\nPage 3 of 4\n5th Sunday of Easter – Year A – 2017\nFamily Service & Baptism – 1st Sunday in the Hall\nsecond lesson Jesus talks of himself as being the ‘way, the truth and\nthe life’.\nThis little girl is already physically very well looked after and loved as\npart of her own family – how do we look after her as part of the family\nof the Church?\nThis morning Beatrice’s parents and godparents were asked a number\nof questions – I asked them ‘will you walk with her in the way of\nChrist?’ and then ‘will you help her take her place within the life and\nworship of Christ’s Church?’\nA lot of it is going to fall on her Mum and Dad – but not all of it – we\nall have a part to play.\nWhen she comes here is she just going to hear about following Jesus –\nor is she going to see people around her to live that out in practice?\nLater on in the service we will all say to Beatrice:\nWe welcome you into the fellowship of faith;\nwe are children of the same heavenly Father;\nwe welcome you.\nIs she going to feel that welcome in the years to come as she takes her\nplace in the life of the Church?\nPage 4 of 4\n5th Sunday of Easter – Year A – 2017\nFamily Service & Baptism – 1st Sunday in the Hall\nSo today, in our temporary home, we welcome a new member into our\nfamily, the Church. May God bless her and her Mum and Dad and all\nwho will have the care of her in the days and weeks and years to\ncome."
    }
}