{
    "title": "Journey of Faith",
    "date": "2010-11-14",
    "blurb": "In this sermon, Kevin discusses the importance of self-awareness and honesty in both our personal and societal lives, drawing parallels between the state of the nation's finances and the parable of the Pharisee and the Tax Collector. He emphasizes the need for healing, not just addressing immediate symptoms but also root causes. The sermon also marks the baptism of a child, Tadhg Ryan, symbolizing the beginning of a spiritual journey.",
    "raw_text": "During this last week the leading figures of our political parties have visited the Department of Finance and Government Buildings to be briefed on the grim realities of our nation’s finances. As Budget Day approaches the cost of restructuring our economy seems to rise by the week. 3 billion euro – 4 billion euro – 5 billion euro. We are hearing the pro’s and con’s of frontloading by taking most of the costs up-front, or of deferring the pain, allowing a longer period for sorting things out. There is a fine balance to be struck between on the one hand the danger of driving the economy into an even deeper recession and on the other maintaining the confidence of the international bond markets.\n\nLast week, in the course of the briefings given at the Department of Finance, the opposition parties were allowed to see things as they really are. In any area of life, be it community or individual, being brought face to face with how things really are can be painful and yet it can be the starting point of healing. Healing in this context involves not just dealing with the immediate symptoms but also addressing root causes, putting into place strategies to avoid a reoccurrence of the problem. In the case of our nation’s finances this will involve avoiding a future reliance on one single sector of the economy, recognising the need for a broader base for our taxation.\n\nOur Gospel reading, the Parable of the Pharisee and the Tax Collector is a story of seeing/not seeing ourselves as we really are. This parable is often seen as one of a pair with the Parable of the Prodigal Son; the younger son being seen as one with the tax collector; the older son seen as one with the Pharisee, both confident in their own virtue, both expecting that virtue to be recognised. God I think you I am not like that tax collector; Dad you are lucky to have only one renegade son.\n\nThe key moment in this latter parable is when the younger son, having come a cropper after leaving home to find the good life, came to himself, came to his senses, saw himself as he really was and began the journey home. The welcome of the father is symbolic of a God who never abandons his children, who is always open to our return, as we celebrate in the words of the prayer of consecration in the Communion Service:\n\n> even when we turned away from you,\n> you never ceased to care for us,\n> but in your love and mercy you freed us from the slavery of sin,\n> giving your only begotten Son to become man\n> and suffer death on the cross to redeem us:\n\nThe tax collector in our parable has begun that journey home, on his knees in the Temple pouring out his regrets to God. He is the one who goes home justified, healing has begun. This last two years has been a painful process for us as a society but an honest appraisal of the past, of the way we conduct our business life, our public life can be the beginning of a journey towards the formation the foundation of a more equitable society, of a healed society.\n\nThis morning at the 11:00 service we are welcoming a young child Tadhg Ryan into the fellowship of the Church in Baptism. That in itself represents the beginning of a journey. As Tadhg is signed with the sign of the cross I will say to him:\n\n> Christ claims you for his own.\n> Receive the sign of the cross.\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n\nIn our Lesson from the 2nd letter to Timothy the writer, looking back over his own life recalls:\n\n> 6As for me, I am already being poured out as a libation, and the time\n> of my departure has come. 7I have fought the good fight, I have\n> finished the race, I have kept the faith. 2 Timothy 4:6-7\n\nWhat we are talking about here is the beginning and end of the Christian journey. As Tadhg’s parents bring their child for Baptism they do so with all the hopes and anticipation of any parent. In the years to come they will be making provision for his education, his health, helping him find his place in the world in which he will be growing up. Today we are placing him within the context of the Christian family, the Body of Christ in this place and as he embarks upon his Christian journey we point the way:\n\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n\nWe who point the way are ourselves on that same journey of faith, that journey home to God. A Baptism is not only a wonderful event for a family but also as an opportunity to reflect on our own journey of faith. Where am I, where are we on our Christian journey? How do I see myself? The late Archbishop Michael Ramsay once spoke of seeing the whole of his life as lived out in response to his Baptism, and the promises made on his behalf that he spent a lifetime making his own.\n\nSo as we hear Tadhg’s parents and godparents making the promises on his behalf, as fellow pilgrims on the same journey we reflect on our own ongoing response to God In baptism, God calls us from darkness into his marvellous light. To follow Christ means dying to sin and rising to new life with him. Therefore I ask:\n\n> Do you reject the devil and all proud rebellion against God?\n> I reject them.\n> Do you renounce the deceit and corruption of evil?\n> I renounce them.\n> Do you repent of the sins that separate us from God and neighbour?\n> I repent of them.\n> Do you turn to Christ as Saviour?\n> I turn to Christ.\n> Do you submit to Christ as Lord?\n> I submit to Christ.\n> Do you come to Christ, the Way, the Truth and the Life?\n> I come to Christ.\n\nSo as I frequently remark, these are not questions of people who have arrived, who have got it all sorted; they are rather questions of people on a journey. And so I can say with integrity that I reject the devil but at the same time realise that in my darker times evil still has its hold on me. Likewise I submit to Christ - but that is still a work in progress. The journey of faith is a journey of a lifetime and hopefully, at each stage, we are growing and maturing in that faith.\n\nWe gather this morning as fellow pilgrims on the journey of faith, to welcome this child and to encourage one another in the faith. May God enable each of us to grow into the fullness of the promises of our Baptism as we encourage one another:\n\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/5thbeforeadvent2010.txt",
        "raw_ocr_content": "Page 1 of 4\nDuring this last week the leading figures of our political parties have visited the\nDepartment of Finance and Government Buildings to be briefed on the grim realities of\nour nation’s finances. As Budget Day approaches the cost of restructuring our economy\nseems to rise by the week. 3 billion euro – 4 billion euro – 5 billion euro. We are hearing\nthe pro’s and con’s of frontloading by taking most of the costs up-front, or of deferring the\npain, allowing a longer period for sorting things out. There is a fine balance to be struck\nbetween on the one hand the danger of driving the economy into an even deeper recession\nand on the other maintaining the confidence of the international bond markets.\nLast week, in the course of the briefings given at the Department of Finance, the\nopposition parties were allowed to see things as they really are. In any area of life, be it\ncommunity or individual, being brought face to face with how things really are can be\npainful and yet it can be the starting point of healing. Healing in this context involves not\njust dealing with the immediate symptoms but also addressing root causes, putting into\nplace strategies to avoid a reoccurrence of the problem. In the case of our nation’s\nfinances this will involve avoiding a future reliance on one single sector of the economy,\nrecognising the need for a broader base for our taxation.\nOur Gospel reading, the Parable of the Pharisee and the Tax Collector is a story of\nseeing/not seeing ourselves as we really are. This parable is often seen as one of a pair\nwith the Parable of the Prodigal Son; the younger son being seen as one with the tax\ncollector; the older son seen as one with the Pharisee, both confident in their own virtue,\nboth expecting that virtue to be recognised. God I think you I am not like that tax\ncollector; Dad you are lucky to have only one renegade son.\nThe key moment in this latter parable is when the younger son, having come a cropper\nafter leaving home to find the good life, came to himself, came to his senses, saw himself\nas he really was and began the journey home. The welcome of the father is symbolic of a\nGod who never abandons his children, who is always open to our return, as we celebrate in\nthe words of the prayer of consecration in the Communion Service:\nPage 2 of 4\neven when we turned away from you,\nyou never ceased to care for us,\nbut in your love and mercy you freed us from the slavery of sin,\ngiving your only begotten Son to become man\nand suffer death on the cross to redeem us:\nThe tax collector in our parable has begun that journey home, on his knees in the Temple\npouring out his regrets to God. He is the one who goes home justified, healing has begun.\nThis last two years has been a painful process for us as a society but an honest appraisal of\nthe past, of the way we conduct our business life, our public life can be the beginning of a\njourney towards the formation the foundation of a more equitable society, of a healed\nsociety.\nThis morning at the 11:00 service we are welcoming a young child Tadhg Ryan into the\nfellowship of the Church in Baptism. That in itself represents the beginning of a journey.\nAs Tadhg is signed with the sign of the cross I will say to him:\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nIn our Lesson from the 2nd letter to Timothy the writer, looking back over his own life\nrecalls:\n6As for me, I am already being poured out as a libation, and the time\nof my departure has come. 7I have fought the good fight, I have\nfinished the race, I have kept the faith. 2 Timothy 4:6-7\nWhat we are talking about here is the beginning and end of the Christian journey. As\nTadhg’s parents bring their child for Baptism they do so with all the hopes and\nanticipation of any parent. In the years to come they will be making provision for his\neducation, his health, helping him find his place in the world in which he will be growing\nPage 3 of 4\nup. Today we are placing him within the context of the Christian family, the Body of\nChrist in this place and as he embarks upon his Christian journey we point the way:\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nWe who point the way are ourselves on that same journey of faith, that journey home to\nGod. A Baptism is not only a wonderful event for a family but also as an opportunity to\nreflect on our own journey of faith. Where am I, where are we on our Christian journey?\nHow do I see myself? The late Archbishop Michael Ramsay once spoke of seeing the\nwhole of his life as lived out in response to his Baptism, and the promises made on his\nbehalf that he spent a lifetime making his own.\nSo as we hear Tadhg’s parents and godparents making the promises on his behalf, as\nfellow pilgrims on the same journey we reflect on our own ongoing response to God\nIn baptism, God calls us from darkness into his marvellous light.\nTo follow Christ means dying to sin and rising to new life with him.\nTherefore I ask:\nDo you reject the devil and all proud rebellion against God?\nI reject them.\nDo you renounce the deceit and corruption of evil?\nI renounce them.\nDo you repent of the sins that separate us from God and neighbour?\nI repent of them.\nDo you turn to Christ as Saviour?\nI turn to Christ.\nDo you submit to Christ as Lord?\nI submit to Christ.\nDo you come to Christ, the Way, the Truth and the Life?\nI come to Christ.\nPage 4 of 4\n. So as I frequently remark, these are not questions of people who have arrived, who have\ngot it all sorted; they are rather questions of people on a journey. And so I can say with\nintegrity that I reject the devil but at the same time realise that in my darker times evil still\nhas its hold on me. Likewise I submit to Christ - but that is still a work in progress. The\njourney of faith is a journey of a lifetime and hopefully, at each stage, we are growing and\nmaturing in that faith.\nWe gather this morning as fellow pilgrims on the journey of faith, to welcome this child\nand to encourage one another in the faith. May God enable each of us to grow into the\nfullness of the promises of our Baptism as we encourage one another:\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith."
    }
}