{
    "title": "6th Sunday of Easter - Year A",
    "date": "2020-05-17",
    "blurb": "In this sermon, the speaker talks about the intertwining of love and obedience. He emphasizes the role of the Holy Spirit in inspiring all that is good in mankind and enabling us to become more like Christ. He also reflects on the importance of selfless acts of love and service, and how our love for one another should mirror Jesus' love for us.",
    "raw_text": "6th Sunday of Easter – Year A – 2020\n\nIt has often been said that pets become more and more like their owners – or is it the other way round? Whichever way you take it, what is meant is that the long-term association, the long-term companionship has its effect in affecting one party or the other.\n\nI will leave you to ponder that deep philosophical point and ask a quite different question: ‘Why do we do what it right? I am not saying that we always do the right thing – because we don’t. But the things is we know when we have done wrong, and we generally feel bad about it (even if for reasons of pride we don’t show it).\n\nThere is planted deep within us an awareness of right and wrong which we call conscience. It is not just an individual thing. Different religious and national traditions have ethical codes that will certainly differ, but will show remarkable similarities to one another.\n\nThe Revised Catechism of the Church of Ireland (which regrettably was not included in our current Prayer Book), in talking of the Holy Spirit, makes two important points.\n\nFirst – the Holy Spirit inspires all that is good in mankind. The writer of Genesis, in the second of the two Creation narratives, tells of God forming man from the dust, breathing into his nostrils the breath of life and man becoming a living being. On the evening of the day of Resurrection we read of Jesus in the upper room, breathing on the disciples, saying, ‘Receive the Holy Spirit’. Each of us, made in the image of God, having something of the breath, the Spirit of God moving us, inspiring us.\n\nSecond – The Holy Spirit enables me to become more like Christ. This brings me to the passage we were reading, ‘As the Father has loved me, so I have loved you; abide in my love. If you keep my commandments you will abide in my love.’\n\nWhy, I asked earlier, do we do the right thing? Yes, there is a basic feeling for right and wrong that we share with all humanity, the impulse of conscience. But there is more to us than just gut reaction, however divinely inspired. What about those selfless acts of love and service that have touched our lives? As I speak, you may recall occasions on which you have benefitted from the love and generosity of others; maybe when sickness or tragedy struck your life. Or life was just difficult, and someone saw your pain and reached out in love.\n\nReturning to our Gospel reading, John tells us of Jesus saying to his disciples on the night before he died: ‘This is my commandment, that you love one another as I have loved you.’\n\nOur love, our concern, our service of one another should mirror something of his love for us; should have something of that same self-giving, self-forgetting, cross centred love that we find in Jesus.\n\nTo go back for a moment to those occasions when you have experienced the love and generosity of spirit of another in a time of need – a time when Christ touched your life, when Christ ministered to your need. The Holy Spirit enables us, enables others to become more like Christ.\n\nThis takes me back to that deep philosophical point I raised earlier, concerning owners becoming more like their pets – or whichever way round it is. It is all about the time we spend with each other.\n\nThe more time we spend with Christ, the more we consciously seek his presence, the more we seek his will and purpose in our lives. As we do so the more we come to recognise something of the height, the depth, the length, the breadth of the love of God for us in Christ, the more we seek to make our own response of love.\n\nWhy, I asked at the outset, do we do what is right? Later on in this same teaching in the upper room we read, ‘You are my friends if you do what I command you. I do not call you servants any longer …… but I have called you friends. ….. You did not choose me but I chose you …..to go and bear fruit, fruit that will last.’ John 15:14-16\n\nWhat we are talking of here is an intertwining of love and obedience. An obedience, an adherence to what is right, that has its roots in love. A love that has its outpouring in obedience to a God who has loved us in Christ. What we are talking of is not a compliance, a conforming to an external set of rules, rather a conforming to a person. May we in our daily walk with God be enabled to grow in our likeness to Christ as we respond to his self-giving love.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/6ofeaster2020.txt",
        "raw_ocr_content": "Page 1 of 4\n6th Sunday of Easter – Year A – 2020\nLink to YouTube clip of short act of worship - https://youtu.be/qua0zIAKcd8\nIt has often been said that pets become more and more like their owners – or is\nit the other way round? Whichever way you take it, what is meant is that the\nlong-term association, the long-term companionship has its effect in affecting\none party or the other.\nI will leave you to ponder that deep philosophical point and ask a quite\ndifferent question: ‘Why do we do what it right?\nI am not saying that we always do the right thing – because we don’t. But the\nthings is we know when we have done wrong, and we generally feel bad about\nit (even if for reasons of pride we don’t show it).\nThere is planted deep within us an awareness of right and wrong which we call\nconscience. It is not just an individual thing. Different religious and national\ntraditions have ethical codes that will certainly differ, but will show remarkable\nsimilarities to one another.\nThe Revised Catechism of the Church of Ireland (which regrettably was not\nincluded in our current Prayer Book), in talking of the Holy Spirit, makes two\nimportant points.\nFirst – the Holy Spirit inspires all that is good in mankind. The writer of\nGenesis, in the second of the two Creation narratives, tells of God forming man\nfrom the dust, breathing into his nostrils the breath of life and man becoming a\nPage 2 of 4\n6th Sunday of Easter – Year A – 2020\nliving being. On the evening of the day of Resurrection we read of Jesus in the\nupper room, breathing on the disciples, saying, ‘Receive the Holy Spirit’. Each\nof us, made in the image of God, having something of the breath, the Spirit of\nGod moving us, inspiring us.\nSecond – The Holy Spirit enables me to become more like Christ. This brings\nme to the passage we were reading, ‘As the Father has loved me, so I have\nloved you; abide in my love. If you keep my commandments you will abide in\nmy love.’\nWhy, I asked earlier, do we do the right thing? Yes, there is a basic feeling for\nright and wrong that we share with all humanity, the impulse of conscience.\nBut there is more to us than just gut reaction, however divinely inspired. What\nabout those selfless acts of love and service that have touched our lives? As I\nspeak, you may recall occasions on which you have benefitted from the love\nand generosity of others; maybe when sickness or tragedy struck your life. Or\nlife was just difficult, and someone saw your pain and reached out in love.\nReturning to our Gospel reading, John tells us of Jesus saying to his disciples\non the night before he died: ‘This is my commandment, that you love one\nanother as I have loved you.’\nOur love, our concern, our service of one another should mirror something of\nhis love for us; should have something of that same self-giving, self-forgetting,\ncross centred love that we find in Jesus.\nPage 3 of 4\n6th Sunday of Easter – Year A – 2020\nTo go back for a moment to those occasions when you have experienced the\nlove and generosity of spirit of another in a time of need – a time when Christ\ntouched your life, when Christ ministered to your need. The Holy Spirit\nenables us, enables others to become more like Christ.\nThis takes me back to that deep philosophical point I raised earlier, concerning\nowners becoming more like their pets – or whichever way round it is. It is all\nabout the time we spend with each other.\nThe more time we spend with Christ, the more we consciously seek his\npresence, the more we seek his will and purpose in our lives. As we do so the\nmore we come to recognise something of the height, the depth, the length, the\nbreadth of the love of God for us in Christ, the more we seek to make our own\nresponse of love.\nWhy, I asked at the outset, do we do what is right? Later on in this same\nteaching in the upper room we read, ‘You are my friends if you do what I\ncommand you. I do not call you servants any longer …… but I have called\nyou friends. ….. You did not choose me but I chose you …..to go and bear\nfruit, fruit that will last.’ John 15:14-16\nWhat we are talking of here is an intertwining of love and obedience. An\nobedience, an adherence to what is right, that has its roots in love. A love that\nhas its outpouring in obedience to a God who has loved us in Christ. What we\nare talking of is not a compliance, a conforming to an external set of rules,\nPage 4 of 4\n6th Sunday of Easter – Year A – 2020\nrather a conforming to a person. May we in our daily walk with God be\nenabled to grow in our likeness to Christ as we respond to his self-giving love."
    }
}