{
    "title": "Prayers of Life",
    "date": "2023-05-21",
    "blurb": "This sermon is a series of prayers focusing on the theme of life, drawing from the Christian belief in the resurrection. It includes prayers for the church, for political and community leaders, for places of work and for those who are suffering. It ends with a prayer of thanksgiving and a call for deeper love for God.",
    "raw_text": "As we gather in the company of the living God, let us pray.\n\nLord of life, we pray that the Church may be alive with your risen life, refreshed and revived by the breath of your spirit, purified and refined like gold and silver, so that we truly offer the possibility of saving love to the searching world. We pray for the church in all the world. At this time we pray for the General Synod of the Church of Ireland meeting in Wexford. We pray for the church in this diocese, for George our Bishop, for this parish and for Nigel our rector, and for Brendan. Lord in your mercy: hear our prayer.\n\nLord of life, we pray that in all meetings and conferences where important decisions are taken, hearts may be turned to honor what is just and true, compassionate and constructive. We pray for the work of peacemakers in areas of conflict. We continue to pray for the people of Ukraine and Sudan. We pray for our country, for Charles our king and all in authority, we pray for our province, for those called to leadership. We bring before God the coming elections, for all those who are standing and for ourselves as voters, that God may work in and through this whole process to further the cause of peace and well-being in our community. Lord in your mercy: hear our prayer.\n\nLord of life, we pray for the streets and places of work we represent. May they be places where the truth of your being is proclaimed daily by the way we live and handle the everyday situations, through your leading. May our words and actions speak of your faithful love, your graciousness and your purity. Lord in your mercy: hear our prayer.\n\nLord of life, we pray for all who feel out of their depth, all who are drowning in their pain, sorrow or guilt. We pray for all who are sick, especially those known to us. Support them in the arms of your love and fix their feet on the solid rock of your love. Lord in your mercy: hear our prayer.\n\nLord of life, we remember with thanksgiving those who have gone before us in the faith and now see you as you really are. Grant that we may share with them the glories of your Kingdom. Lord in your mercy: hear our prayer.\n\nLord of life, your love for us is so great and our love for you so small. Thank you for accepting what we are able to offer; and deepen in us our love for you. Merciful father, accept these prayers for the sake of your son, our saviour Jesus Christ. Amen",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/6ofeaster2023 - prayers.txt",
        "raw_ocr_content": "As we gather in the company of the living God,\nlet us pray.\nLord of life, we pray that the Church\nmay be alive with your risen life,\nrefreshed and revived by the breath of your spirit,\npurified and refined like gold and silver,\nso that we truly offer the possibility\nof saving love to the searching world.\nWe pray for the church in all the world.\nAt this time we pray for the General Synod of the Church of Ireland\nmeeting in Wexford.\nWe pray for the church in this diocese, for George our Bishop,\nfor this parish and for Nigel our rector, and for Brendan.\nLord in your mercy: hear our prayer.\nLord of life, we pray that in all meetings and conferences\nwhere important decisions are taken,\nhearts may be turned to honor what is just and true,\ncompassionate and constructive.\nWe pray for the work of peacemakers in areas of conflict.\nWe continue to pray for the people of Ukraine and Sudan.\nWe pray for our country, for Charles our king and all in authority,\nwe pray for our province, for those called to leadership.\nWe bring before God the coming elections, for all those who are standing\nand for ourselves as voters, that God may work in and through this whole\nprocess\nto further the cause of peace and well-being in our community.\nLord in your mercy: hear our prayer.\nLord of life, we pray for the streets\nand places of work we represent.\nMay they be places where the truth of your being\nis proclaimed daily by the way we live\nand handle the everyday situations, through your leading.\nMay our words and actions speak of your faithful love,\nyour graciousness and your purity.\nLord in your mercy: hear our prayer.\nLord of life,\nwe pray for all who feel out of their depth,\nall who are drowning in their pain, sorrow or guilt.\nWe pray for all who are sick, especially those known to us.\nSupport them in the arms of your love\nand fix their feet on the solid rock of your love.\nLord in your mercy: hear our prayer.\nLord of life,\nwe remember with thanksgiving those who have gone before us in the faith\nand now see you as you really are.\nGrant that we may share with them the glories of your Kingdom.\nLord in your mercy: hear our prayer.\nLord of life, your love for us is so great\nand our love for you so small.\nThank you for accepting what we are able to offer;\nand deepen in us our love for you.\nMerciful father,\naccept these prayers\nfor the sake of your son,\nour saviour Jesus Christ. Amen"
    }
}