{
    "title": "Becoming Like Jesus",
    "date": "2020-05-17",
    "blurb": "In this family service sermon, Kevin draws parallels between pet owners starting to resemble their pets and Christians becoming more like Jesus. He emphasizes the importance of spending time with Jesus, seeking His presence, and understanding His will. Kevin reminds us that Jesus' commandments are not just rules but a part of our response to His love and sacrifice.",
    "raw_text": "Over these last few weeks we have had to spend a lot of time with each other. Sometimes funny things can happen in situations like this. You may have heard it said that owners of pets can start looking like their pets. Crazy idea? Well just have a look at these (3 slides). I suppose owners choose pets that suit their personalities, how they want other people to see them – or could part of it be the amount of time they spend with each other?\n\nI'll just leave that with you and go on to something completely different. In our reading we heard of Jesus promising his disciples the gift of the Holy Spirit – an advocate, a guide, one who will live in them and with them. The revised catechism of the Church of Ireland has a lovely way of expressing part of the work of the Holy Spirit. The Holy Spirit enables me to become more like Jesus.\n\nAs I was saying at the outset, we have been spending a lot more time with each other. Things can happen in situations like that. We saw those pictures of owners with their pets – or was it pets with their owners. The more time I spend with Jesus, the more I consciously seek his presence, seek to understand what he wants of me in my life – and just grasp the simple truth that he loves me.\n\nIn that night in the Upper Room before he died, Jesus says something very important about how life will be for the disciples. The love he has for them, the love they have for him will continue and grow. He is not going to leave them alone. He will be with them in a different way.\n\n> 21They who have my commandments and keep them are those who love me; and those who love me will be loved by my Father, and I will love them and reveal myself to them.\n\nBeing in Jesus' company changes me. When that begins to happen, his commandments, the things he wants me to do become not one more set of rules I have to follow, they become part of me, part of my ongoing response to all that he has done, for you, for me, for all of us in his life, death and resurrection.\n\nIn the power of the Holy Spirit, may Christ be our companion in wherever we go, in whatever we do this coming week.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/6ofeaster2020 - family service.txt",
        "raw_ocr_content": "Page 1 of 2\n6th Sunday of Easter – Year A – 2020 – Family Service\nOver these last few weeks we have had to spend a lot of time with each other.\nSometimes funny things can happen in situations like this.\nYou may have heard it said that owners of pets can start looking like their pets.\nCrazy idea? Well just have a look at these\n(3 slides)\nI suppose owners choose pets that suit their personalities, how they want other\npeople to see them – of could part of it be the amount of time they spend with\neach other?\nI’ll just leave that with you and go on to something completely different.\n(New slide)\nIn our reading we heard of Jesus promising his disciples the gift of the Holy\nSpirit – an advocate, a guide, one who will live in them and with them. The\nrevised catechism of the Church of Ireland has a lovely way of expressing part\nof the work of the Holy Spirit.\n(New slide)\nThe Holy Spirit enables me to become more like Jesus.\nPage 2 of 2\n6th Sunday of Easter – Year A – 2020 – Family Service\nAs I was saying at the outset, we have been spending a lot more time with each\nother. Things can happen in situations like that. We saw those pictures of\nowners with their pets – or was it pets with their owners. The more time I\nspend with Jesus, the more I consciously seek his presence, seek to understand\nwhat he wants of me in my life – and just grasp the simple truth that he loves\nme.\nIn that night in the Upper Room before he died, Jesus says something very\nimportant about how life will be for the disciples. The love he has for them,\nthe love they have for him will continue and grow. He is not going to leave\nthem alone. He will be with them in a different way.\n21They who have my commandments and keep them are those who\nlove me; and those who love me will be loved by my Father, and I will\nlove them and reveal myself to them.’\nBeing in Jesus’ company changes me.\n(New slide)\nWhen that begins to happen, his commandments, the things he wants me to do\nbecome not one more set of rules I have to follow, they become part of me, part\nof my ongoing response to all that he has done, for you, for me, for all of us in\nhis life, death and resurrection.\nIn the power of the Holy Spirit, may Christ be our companion in wherever we\ngo, in whatever we do this coming week."
    }
}