{
    "title": "Looking Back and Forward",
    "date": "2014-05-25",
    "blurb": "This sermon discusses the shift in focus from the resurrection of Jesus to the coming of the Holy Spirit during the Easter season. It explores the concept of looking back and forward, using a poem by Minnie Louise Haskins as a metaphor for stepping into the unknown with faith in God. The sermon also addresses the anxieties and uncertainties of the future, assuring that the Holy Spirit is always with us.",
    "raw_text": "6th Sunday of Easter – 2014 – year A\n\nIf you look near the front of your Prayer Book, from page 27 on, you can find the Lectionary – that is the scheme of readings for use in Church every Sunday of the year. Then, if you turn to page 43, you find the readings set out for today, the 6th Sunday of Easter. This particular year, 2014, we are using the Year A readings.\n\nDuring these Sundays of the Easter season we see a gradual shift in the emphasis in the Gospel readings appointed for use. In the Sundays immediately after Easter, we read of the resurrection appearances of Jesus, those experiences of the disciples in those days after the resurrection. Then as this season of Easter progresses we have read of the teaching of Jesus in the Upper Room on that night before he died in which he talks of his significance, he speaks of himself as the Good Shepherd, of the meaning of his coming death and then today we get a reference to the coming of the Holy Spirit.\n\nWe begin this season with a looking back to Easter and move towards a looking forward to the coming of the Spirit. I want to think a bit about looking back and looking forward. To begin, I want to look back to a broadcast by the late George 6th on the first Christmas of the Second World War. He began with a poem by Minnie Louise Haskins, a lecturer in the London School of Economics, for whom poetry was something of a side line.\n\n> And I said to the man who stood at the gate of the year: “Give me a light that I may tread safely into the unknown.”\n> And he replied:\n> “Go out into the darkness and put your hand into the Hand of God. That shall be to you better than light and safer than a known way.”\n> So I went forth, and finding the Hand of God, trod gladly into the night. And He led me towards the hills and the breaking of day in the lone East.\n\nIt is a poem that speaks to us of a presence that goes with us into the unknown. Of course the past is known but the future, and what lies ahead for us, is unknown.\n\nFor Linda, this has been a year of preparation, of waiting. Now, since Wednesday, she knows – she will be serving in the Parish of Mohill. Linda, we rejoice with you on your news. Now you and Steve can plan with a lot more certainty your ministry and your life together.\n\nOf course for many of our young people, exams lie ahead. For some this will be just School exams (i.e. say ‘just’ as one for whom exams are (thank goodness) a thing of the past.) For others there are the Junior and Leaving Cert and College exams. Of course they have prepared, they know what is coming – yet until that paper is in front of them, there is anxiety, there is uncertainty.\n\nFor others, the future is uncertain for different reasons. There may be anxiety about themselves or ones dear to them. And there is a loneliness to our uncertainty – Linda waited for news in the company of other colleagues, knowing the love and support of family, of friends, of the Church in this place. But it was Linda who was waiting on Wednesday – not friends, not family, not you and I. Our young people are not taking their exams by themselves – there will be plenty of others in the exam hall, family and friends will have wished them well – but it is they who will turn over that exam paper, not their Mum and Dad. It is they who will have to write – not their teacher, their friend but them. It is the same with anxieties we may have – friends may offer support and understanding but it is we who have the uncertainty, the fears.\n\nThis is where our Gospel reading speaks to me this morning – whether we are worried about exams, whether we are worried about ourselves or our loved ones.\n\n> 16And I will ask the Father, and he will give you another Advocate, to be with you for ever. 17 …You know him, because he abides with you, and he will be in you. John 14:16ff\n\nThe Advocate, the one who walks the road with us, stands alongside us. The Holy Spirit who is with us, within us in whatever situation we find ourselves, whatever anxiety we may have, whatever challenge we may have to face.\n\nSo whatever lies ahead, may you know that you do not face it alone. God is with you, even in his apparent absence. God is with you even when he seems far away. He knows our deepest thoughts, our hopes, our fears, our hurts, our pain, our dreams.\n\nAnd so we pray:\n\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place of your heart, where he will speak with you;\nknow that he watches over you – that he listens to you in gentle understanding,\nthat he is with you always, wherever you are and however you may feel:\nand the blessing of God Almighty, the Father, the Son and the Holy Spirit be upon you and remain with you always.\n\nAmen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/6ofeaster2014.txt",
        "raw_ocr_content": "Page 1 of 3\n6th Sunday of Easter – 2014 – year A\nIf you look near the front of your Prayer Book, from page 27 on, you can find\nthe Lectionary – that is the scheme of readings for use in Church every Sunday\nof the year. Then, if you turn to page 43, you find the readings set out for\ntoday, the 6th Sunday of Easter. This particular year, 2014, we are using the\nYear A readings.\nDuring these Sundays of the Easter season we see a gradual shift in the\nemphasis in the Gospel readings appointed for use. In the Sundays\nimmediately after Easter, we read of the resurrection appearances of Jesus,\nthose experiences of the disciples in those days after the resurrection. Then as\nthis season of Easter progresses we have read of the teaching of Jesus in the\nUpper Room on that night before he died in which he talks of his significance,\nhe speaks of himself as the Good Shepherd, of the meaning of his coming\ndeath and then today we get a reference to the coming of the Holy Spirit.\nWe begin this season with a looking back to Easter and move towards a\nlooking forward to the coming of the Spirit. I want to think a bit about looking\nback and looking forward. To begin, I want to look back to a broadcast by the\nlate George 6th on the first Christmas of the Second World War. He began with\na poem by Minnie Louise Haskins, a lecturer in the London School of\nEconomics, for whom poetry was something of a side line.\nAnd I said to the man who stood at the gate of the year: “Give me a\nlight that I may tread safely into the unknown.”\nAnd he replied:\n“Go out into the darkness and put your hand into the Hand of God.\nThat shall be to you better than light and safer than a known way.”\nSo I went forth, and finding the Hand of God, trod gladly into the\nnight. And He led me towards the hills and the breaking of day in the\nlone East.\nIt is a poem that speaks to us of a presence that goes with us into the unknown.\nPage 2 of 3\n6th Sunday of Easter – 2014 – year A\nOf course the past is known but the future, and what lies ahead for us, is\nunknown.\nFor Linda, this has been a year of preparation, of waiting. Now, since\nWednesday, she knows – she will be serving in the Parish of Mohill. Linda,\nwe rejoice with you on your news. Now you and Steve can plan with a lot\nmore certainty your ministry and your life together.\nOf course for many of our young people, exams lie ahead. For some this will\nbe just School exams (i.e. say ‘just’ as one for whom exams are (thank\ngoodness) a thing of the past.) For others there are the Junior and Leaving Cert\nand College exams. Of course they have prepared, they know what is coming\n– yet until that paper is in front of them, there is anxiety, there is uncertainty.\nFor others, the future is uncertain for different reasons. There may be anxiety\nabout themselves or ones dear to them. And there is a loneliness to our\nuncertainty – Linda waited for news in the company of other colleagues,\nknowing the love and support of family, of friends, of the Church in this place.\nBut it was Linda who was waiting on Wednesday – not friends, not family, not\nyou and I. Our young people are not taking their exams by themselves – there\nwill be plenty of others in the exam hall, family and friends will have wished\nthem well – but it is they who will turn over that exam paper, not their Mum\nand Dad. It is they who will have to write – not their teacher, their friend but\nthem. It is the same with anxieties we may have – friends may offer support\nand understanding but it is we who have the uncertainty, the fears.\nPage 3 of 3\n6th Sunday of Easter – 2014 – year A\nThis is where our Gospel reading speaks to me this morning – whether we are\nworried about exams, whether we are worried about ourselves or our loved\nones.\n16And I will ask the Father, and he will give you another Advocate, to\nbe with you for ever. 17 ….You know him, because he abides with you,\nand he will be in you. John 14:16ff\nThe Advocate, the one who walks the road with us, stands alongside us. The\nHoly Spirit who is with us, within us in whatever situation we find ourselves,\nwhatever anxiety we may have, whatever challenge we may have to face.\nSo whatever lies ahead, may you know that you do not face it alone. God is\nwith you, even in his apparent absence. God is with you even when he seems\nfar away. He knows our deepest thoughts, our hopes, our fears, our hurts, our\npain, our dreams.\nAnd so we pray:\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen."
    }
}