{
    "title": "The Lord is Near",
    "date": "2015-12-13",
    "blurb": "In this sermon, Kevin explores the concept of God's nearness, drawing on references from literature and a prayer of blessing. He challenges the audience to consider their understanding of God and His presence in their lives. The sermon emphasizes the comforting and understanding nature of God, encouraging the audience to bring their anxieties and concerns to Him.",
    "raw_text": "Advent 3 – 2015 – year C\n\n“The Lord is near” Phil 4:5\n\nOne of the more depressing books I was encouraged to read during my teenage years was the book ‘1984’. Written in 1948, as the Cold War, that period of grim hostility between East and West, took hold it purported to describe the world as it would be in 1984. The world would be divided into three power blocks, at any one time two would be pitched against the third, the combination varying from time to time. Throughout the story there is the all pervading presence of Big Brother. There was no where the citizen could go where he would not be seen or heard. Big Brother, portrayed as caring, was experienced as a chilling threatening presence.\n\nWhen you hear the words of our Epistle, ‘The Lord is near’, what sort of presence comes to our mind, is it the overbearing tyrannical figure akin to the Big Brother of the book ‘1984’.\n\nAs I reflected on this question of what is my fundamental understanding of the God who draws near to me, I thought back on a film Rachel and I saw not long after we were married. The principal character was young aristocrat who as the film opened was a patient in a psychiatric hospital. He looked and acted like a young hippy of the Flower Power generation that were a feature of the 1970’s, with their slogan ‘Make love not war’. He was also under the impression that he was God. When asked to explain what drew him to this conclusion he remarked, ‘Whenever I pray, I find myself talking to my self’.\n\nAs the film progressed, he did not lose the impression of his divinity. What did change was how he expressed that. The rather superficial God of Universal Love, before whom everything was OK, gradually gave way to a rather austere, rather sinister God of judgement, ready to pounce on any transgression of the divine Law. Both extremes represent a parody of the God we worship, of the God we encounter in the person of Jesus. So who is this God whose Advent we await, the God who is near, the God who comes close to us in the person of Jesus whose birth we to celebrate this Christmas time.\n\nAs I thought of this nearness of God, I thought of a prayer of blessing I would often use at the end of a service. It is one I have often been asked to use at weddings. I recall one young man in Ahoghill, who was heading off in connection with his work for a number of months, asked me to give him a copy of it before he went.\n\n> Go, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen.\n\nIt is a prayer that I would find of particular meaning in the face of anxiety or uncertainty. When we are anxious and alone, the presence of God, the closeness of God is not always a reality in our hearts.\n\n> Know that he watches over you –\nThat he listens to you in gentle understanding\nThat he is with you always\nWherever you are and however you may feel.\n\nThat prayer came to me as I read over the short passage from the Letter of Paul to the Philippians that we read as our Epistle this morning.\n\nThe Lord is near. Do not worry about anything.\n\nThe God who listens to us in gentle understanding, wherever we are and however we may feel. The God to whom I can bring my concerns and my anxieties about myself, my past, my present and my future. This is the God to whom I can bring my cares and concerns about those I love. This is the God to whom we come with our hurt and our anger at the sometimes cruel injustice of this world in which we live – how 130 people can be killed in random attacks on the streets of Paris.\n\n> The Lord is near. He listens to us in gentle understanding,\nwherever we are and however we may feel.\n\nUntil perhaps, like the two distressed disillusioned followers who set out along the Emmaus Road, we find that God is indeed near, listening and understanding our confusion, our hurts and our pain all along.\n\nAnd with that we can perhaps begin to grasp something of the meaning of the second promise in that short passage we read as our Epistle\n\n> 7And the peace of God, which surpasses all understanding, will\nguard your hearts and your minds in Christ Jesus.\n\nEmmanuel, God with us, God drawing near to us. May God grant us something of his peace in the midst of all the anxieties of this present time.\n\n> Go, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/advent32015.txt",
        "raw_ocr_content": "Page 1 of 3\nAdvent 3 – 2015 – year C\n“The Lord is near” Phil 4:5\nOne of the more depressing books I was encouraged to read during my teenage\nyears was the book ‘1984’. Written in 1948, as the Cold War, that period of\ngrim hostility between East and West, took hold it purported to describe the\nworld as it would be in 1984. The world would be divided into three power\nblocks, at any one time two would be pitched against the third, the combination\nvarying from time to time. Throughout the story there is the all pervading\npresence of Big Brother. There was no where the citizen could go where he\nwould not be seen or heard. Big Brother, portrayed as caring, was experienced\nas a chilling threatening presence.\nWhen you hear the words of our Epistle, ‘The Lord is near’, what sort of\npresence comes to our mind, is it the overbearing tyrannical figure akin to the\nBig Brother of the book ‘1984’.\nAs I reflected on this question of what is my fundamental understanding of the\nGod who draws near to me, I thought back on a film Rachel and I saw not long\nafter we were married. The principal character was young aristocrat who as the\nfilm opened was a patient in a psychiatric hospital. He looked and acted like a\nyoung hippy of the Flower Power generation that were a feature of the 1970’s,\nwith their slogan ‘Make love not war’. He was also under the impression that\nhe was God. When asked to explain what drew him to this conclusion he\nremarked, ‘Whenever I pray, I find myself talking to my self’.\nAs the film progressed, he did not lose the impression of his divinity. What did\nchange was how he expressed that. The rather superficial God of Universal\nLove, before whom everything was OK, gradually gave way to a rather austere,\nrather sinister God of judgement, ready to pounce on any transgression of the\ndivine Law. Both extremes represent a parody of the God we worship, of the\nPage 2 of 3\nAdvent 3 – 2015 – year C\nGod we encounter in the person of Jesus. So who is this God whose Advent\nwe await, the God who is near, the God who comes close to us in the person of\nJesus whose birth we to celebrate this Christmas time.\nAs I thought of this nearness of God, I thought of a prayer of blessing I would\noften use at the end of a service. It is one I have often been asked to use at\nweddings. I recall one young man in Ahoghill, who was heading off in\nconnection with his work for a number of months, asked me to give him a copy\nof it before he went.\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen.\nIt is a prayer that I would find of particular meaning in the face of anxiety or\nuncertainty. When we are anxious and alone, the presence of God, the\ncloseness of God is not always a reality in our hearts.\nKnow that he watches over you –\nThat he listens to you in gentle understanding\nThat he is with you always\nWherever you are and however you may feel.\nThat prayer came to me as I read over the short passage from the Letter of Paul\nto the Philippians that we read as our Epistle this morning.\nThe Lord is near. Do not worry about anything.\nPage 3 of 3\nAdvent 3 – 2015 – year C\nThe God who listens to us in gentle understanding, wherever we are and\nhowever we may feel. The God to whom I can bring my concerns and my\nanxieties about myself, my past, my present and my future. This is the God to\nwhom I can bring my cares and concerns about those I love. This is the God to\nwhom we come with our hurt and our anger at the sometimes cruel injustice of\nthis world in which we live – how 130 people can be killed in random attacks\non the streets of Paris.\nThe Lord is near. He listens to us in gentle understanding,\nwherever we are and however we may feel.\nUntil perhaps, like the two distressed disillusioned followers who set out along\nthe Emmaus Road, we find that God is indeed near, listening and\nunderstanding our confusion, our hurts and our pain all along.\nAnd with that we can perhaps begin to grasp something of the meaning of the\nsecond promise in that short passage we read as our Epistle\n7And the peace of God, which surpasses all understanding, will\nguard your hearts and your minds in Christ Jesus.\nEmmanuel, God with us, God drawing near to us. May God grant us something\nof his peace in the midst of all the anxieties of this present time.\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen."
    }
}