{
    "title": "God is Good",
    "date": "2011-12-11",
    "blurb": "In this sermon, Kevin reflects on a visit to an old lady named Sophie O'Neill, who despite her struggles, maintained a strong faith in God's goodness. He uses this story to illustrate the radical faith that can sustain us through life's challenges. He also emphasizes the call for Christians to offer hope, integrity, truth, and reconciliation in a troubled world.",
    "raw_text": "In the past I have referred to a visit I made when I was in the Parish of Finglas to an old lady called Sophie O’Neill. Life had not been easy for her. She had married in her 30’s and had one child John, who was born with Downes Syndrome. She was widowed when John was only 9 and, despite well meaning advice of friends and family to have John placed in care, she had brought her son up on her own in the Dublin of the 1950’s and 60’s – so life was not easy but people both inside and outside the Parish recalled seeing Sophie and John always together in the shops, in Church, out and about in the general community.\n\nBy the time I arrived John was in his 40’s and his Mum well into her 80’s. I recall visiting her in her house just before Christmas, not long before she went into hospital for the last time. The house was cold. John had gone out to make a cup of tea for the three of us. Sophie looked me straight in the eye and said, ‘You know Mr Brew, God is good.’ Everything in that house seemed to say otherwise, the cold, the struggles that Sophie and John had to face yet she said it with a conviction that I have never forgotten.\n\nThere was something deeply radical in that simple statement of faith that had clearly sustained Sophie through the years. Over the years, I have often thought back on that night in the house in Finglas; that lady has stood as something of a herald for me, an example of a counter-intuitive thinking that the Gospel brings to daily life.\n\nI thought of Sophie as I read over the second lesson set for use today, this 3rd Sunday of Advent and the words:\n\n> 16Rejoice always, 17pray without ceasing, 18give thanks in all circumstances; for this is the will of God in Christ Jesus for you. 19Do not quench the Spirit. 1st Thess 5:16\n\nGive thanks in all circumstances. As we look at the news night by night, as we hear of awful cruelties inflicted by men upon men whether it be in the name of religion or national security; as we hear of deficiencies in our institutions of care, as we are reminded of the flawed political and business cultures that have left deep wounds in our society that are now coming to the surface in the conflict over water charges, that call to give thanks seems at the very least naïve.\n\nThere is a chant used by the Taize community that picks up one of the themes of Psalm 27:\n\n> ‘I am sure I shall see the goodness of the Lord in the land of the living. Yes, I shall see the goodness of the Lord, hold firm, trust in the Lord.’\n\nIs this more than just a pious whistling in the dark in the face of the grim realities of everyday life? Advent and Christmas remind us that ours is an incarnational faith, centred on a fundamental belief that, in the person of Jesus Christ, God was and continues to be living and active in the world. In the person of Jesus, God knows what it is like to be human, what it is to be tempted, to fear, to suffer, to die. In that life God offers a different vision, a different perspective on this wounded and troubled world. So ours is not a faith divorced from reality but one deeply rooted in reality.\n\nAs followers of Christ, as heralds of the Kingdom, we are called to offer a different vision. In the face of despair we are called to offer hope; in the world where sleight of hand, where half truth and innuendo have seemed to prevail, we are called to be signs of integrity, of truth. In a world that is fractured along so many lines of culture, of race, economically, socially, we are called to be instruments of reconciliation. In short to be ones through whom, in whom, others may ‘see the goodness of the Lord in the land of the living.’\n\nThat night in Finglas, Sophie O’Neill declared to me, ‘You know Mr Brew, God is good.’ May we be the ones through whom, and in whom, the goodness of God is experienced in the world of today.\n\n> ‘I am sure I shall see the goodness of the Lord in the land of the living. Yes, I shall see the goodness of the Lord, hold firm, trust in the Lord.’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/year B/advent32011.txt",
        "raw_ocr_content": "Page 1 of 3\nAdvent 3 – year B - 2014\nIn the past I have referred to a visit I made when I was in the Parish of Finglas\nto an old lady called Sophie O’Neill. Life had not been easy for her. She had\nmarried in her 30’s and had one child John, who was born with Downes\nSyndrome. She was widowed when John was only 9 and, despite well\nmeaning advice of friends and family to have John placed in care, she had\nbrought her son up on her own in the Dublin of the 1950’s and 60’s – so life\nwas not easy but people both inside and outside the Parish recalled seeing\nSophie and John always together in the shops, in Church, out and about in the\ngeneral community.\nBy the time I arrived John was in his 40’s and his Mum well into her 80’s. I\nrecall visiting her in her house just before Christmas, not long before she went\ninto hospital for the last time. The house was cold. John had gone out to make\na cup of tea for the three of us. Sophie looked me straight in the eye and said,\n‘You know Mr Brew, God is good.’ Everything in that house seemed to say\notherwise, the cold, the struggles that Sophie and John had to face yet she said\nit with a conviction that I have never forgotten.\nThere was something deeply radical in that simple statement of faith that had\nclearly sustained Sophie through the years. Over the years, I have often\nthought back on that night in the house in Finglas; that lady has stood as\nsomething of a herald for me, an example of a counter-intuitive thinking that\nthe Gospel brings to daily life.\nI thought of Sophie as I read over the second lesson set for use today, this 3rd\nSunday of Advent and the words:\nPage 2 of 3\nAdvent 3 – year B - 2014\n16Rejoice always, 17pray without ceasing, 18give thanks in all\ncircumstances; for this is the will of God in Christ Jesus for you.\n19Do not quench the Spirit. 1st Thess 5:16\nGive thanks in all circumstances. As we look at the news night by night, as we\nhear of awful cruelties inflicted by men upon men whether it be in the name of\nreligion or national security; as we hear of deficiencies in our institutions of\ncare, as we are reminded of the flawed political and business cultures that have\nleft deep wounds in our society that are now coming to the surface in the\nconflict over water charges, that call to give thanks seems at the very least\nnaïve.\nThere is a chant used by the Taize community that picks up one of the themes\nof Psalm 27:\n‘I am sure I shall see the goodness of the Lord in the land of the living.\nYes, I shall see the goodness of the Lord, hold firm, trust in the Lord.’\nIs this more than just a pious whistling in the dark in the face of the grim\nrealities of everyday life? Advent and Christmas remind us that ours is an\nincarnational faith, centred on a fundamental belief that, in the person of Jesus\nChrist, God was and continues to be living and active in the world. In the\nperson of Jesus, God knows what it is like to be human, what it is to be\ntempted, to fear, to suffer, to die. In that life God offers a different vision, a\ndifferent perspective on this wounded and troubled world. So ours is not a\nfaith divorced from reality but one deeply rooted in reality.\nAs followers of Christ, as heralds of the Kingdom, we are called to offer a\ndifferent vision. In the face of despair we are called to offer hope; in the world\nPage 3 of 3\nAdvent 3 – year B - 2014\nwhere sleight of hand, where half truth and innuendo have seemed to prevail,\nwe are called to be signs of integrity, of truth. In a world that is fractured along\nso many lines of culture, of race, economically, socially, we are called to be\ninstruments of reconciliation. In short to be ones through whom, in whom,\nothers may ‘see the goodness of the Lord in the land of the living.’\nThat night in Finglas, Sophie O’Neill declared to me, ‘You know Mr Brew,\nGod is good.’ May we be the ones through whom, and in whom, the goodness\nof God is experienced in the world of today.\n‘I am sure I shall see the goodness of the Lord in the land of the living.\nYes, I shall see the goodness of the Lord, hold firm, trust in the Lord.’"
    }
}