{
    "title": "The Unknown Christ",
    "date": "2020-12-13",
    "blurb": "In this sermon, the speaker reflects on the unknown Christ, who is present yet elusive, infinite yet intimate. Drawing from the words of John the Baptist, the speaker encourages us to seek Christ in the unexpected, in service, and in each other. As we approach Christmas, we are reminded to recognize Christ in the marginalized and in our shared worship.",
    "raw_text": "One of the legendary figures to come out of the Church’s ministry during the First World War and its aftermath was a priest of the Church of Ireland, Geoffrey Studdart Kennedy, known to the troops on the front line as Woodbine Willie, because of a packet of Woodbines he always seemed to produce when he approached a group of men in the trenches. He wrote a huge amount of verse including one that has often appealed to me, ‘Indifference’, evoked by the fate of many ex-servicemen, disabled in war, left to beg on the streets:\n\n> When Jesus came to Golgatha,\n> They hanged Him on a tree,\n> They drove great nails through hands and feet,\n> And made a Calvary.\n> They crowned Him with a crown of thorns,\n> Red were His wounds and deep,\n> For those were crude and cruel days,\n> And human flesh was cheap.\n> When Jesus came to Birmingham\n> They simply passed Him by,\n> They never hurt a hair of Him,\n> They only let Him die;\n> For men have grown more tender,\n> And they would not give Him pain,\n> They only just passed down the street,\n> And left Him in the rain.\n> Still Jesus cried, 'Forgive them,\n> For they know not what they do!\n> And still it rained the winter rain\n> That drenched Him through and through;\n> The crowd went home and left the streets\n> Without a soul to see,\n> And Jesus crouched against a wall\n> And cried for Calvary.\n\nA picture of Christ in the world yet not known, not recognised by the world. In our Gospel reading, John the Baptist speaks of one who ‘stands among you, whom you do not know.’ John 1.26. John’s words and the poem of Studdart Kennedy set me thinking about the unknown Christ.\n\nWe have tried to define him. The creeds we recite Sunday by Sunday bear witness to the turmoil in the early years of the Church as successive Councils wrestled with the problem of the precise relationship between the earthly Jesus and God. But of course words can never fully express the heavenly, the infinite, the divine, the unknown Christ.\n\nThe late Lord Hailsham, formerly Lord Chancellor in Britain, writing towards the end of his life in the closing pages of his biography ‘A Sparrow’s Flight’ writes:\n\n> ‘As I approach the throne of the ineffable, the more mere words fail to express my innermost feelings and I take refuge in metaphor, in poetry, in admiration for the beauty in a landscape, in a sunset, in the plumage of a bird, in a butterfly ….. But my doubts finally dissolve in wonder, in longing, in adoration. And, lo, a paradox appears. I seek God, and behold a bedraggled human figure impaled for ridicule upon a cross. I despair of man, and behold the same figure, enthroned in majesty above the clouds. If I go up to heaven he is there. If I descend into the depths of misery and grief, he is there also. He is Alpha and Omega, the source of my being and the end of my pilgrimage. He is love, at once the beloved and the eternal lover. He is Father, Son and Holy Spirit, at once the creator, the redeemer, the inspirer of suffering humanity, the companion on my way and the strengthener of my steps. But he is himself the Way, the Truth and the Life. he is unknown and unknowable, yet constantly revealed, revealed in nature, in beauty, in goodness, in knowledge, but always absent in the negative, the hated and the hateful. he is always present yet constantly eludes my grasp. Being infinite, he cannot be comprised in my understanding. Nevertheless as constantly he reappears in my need. Remaining Christian, I am constantly reassured in my wandering, in my doubting and as constantly lead back by my trusting. I do not know. I do not pretend to know. But I trust, and therefore I believe. Now I see through a glass, darkly. The time is not far distant when, infinitely contrite, I must seek the mercy of an infinitely compassionate judge, and then, face to face, I shall know, even as I am known.’\n\nA Sparrow’s Flight – Lord Hailsham p 452\n\nI meet Christ in the unexpected, in the unknown, in the daily opportunities of service ….. ‘As much as you did it for the least of these you did it to me.’ We encounter Christ in the hungry, in the lonely, the desolate. Reaching out in the name of Christ, I encounter Christ.\n\nI meet Christ as I meet with others in all the limitations and inadequacy of the worship we meet to offer up to God. ‘Where two or three are gathered together in my name, there am I in the midst of them.’ As Paul reminds his readers in the Church in Corinth, ‘You are the Body of Christ’. Our vocation, our calling is to be ones through whom Christ continues to speak, to act, to be present in the world of today. We encounter Christ in one another. We are to be the ones through whom others encounter Christ.\n\nWhenever we meet in the sharing of the bread and the wine, as members of the Body of Christ we recall, we remember. ‘This is my body; this is my blood. Do this in remembrance of me.’ As often as we eat the bread and drink the cup, we proclaim the Lord’s death until he comes, rejoicing in his presence among us; ‘Thou art here, we ask not how.’\n\nAs we proceed through Advent towards the Festival of Christmas, God’s presence among us in Christ; may God enable us to recognise the presence of Christ in the poor and the marginalised, the lonely and the desolate; recognise him in each other as we meet together in word and sacrament. May he enable us to be ones through whom others have their own encounter with Christ.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year B/advent32020.txt",
        "raw_ocr_content": "Page 1 of 4\nADVENT 3 – Year B – 2020\nLink to a short act of worship - https://youtu.be/Bo5Hg3358SE\nOne of the legendary figures to come out of the Church’s ministry during the\nFirst World War and its aftermath was a priest of the Church of Ireland,\nGeoffrey Studdart Kennedy, known to the troops on the front line as Woodbine\nWillie, because of a packet of Woodbines he always seemed to produce when\nhe approached a group of men in the trenches. He wrote a huge amount of\nverse including one that has often appealed to me, ‘Indifference’, evoked by\nthe fate of many ex-servicemen, disabled in war, left to beg on the streets:\nWhen Jesus came to Golgatha,\nThey hanged Him on a tree,\nThey drove great nails through hands and feet,\nAnd made a Calvary.\nThey crowned Him with a crown of thorns,\nRed were His wounds and deep,\nFor those were crude and cruel days,\nAnd human flesh was cheap.\nWhen Jesus came to Birmingham\nThey simply passed Him by,\nThey never hurt a hair of Him,\nThey only let Him die;\nFor men have grown more tender,\nAnd they would not give Him pain,\nThey only just passed down the street,\nAnd left Him in the rain.\nStill Jesus cried, 'Forgive them,\nFor they know not what they do!\nAnd still it rained the winter rain\nThat drenched Him through and through;\nThe crowd went home and left the streets\nWithout a soul to see,\nAnd Jesus crouched against a wall\nPage 2 of 4\nADVENT 3 – Year B – 2020\nAnd cried for Calvary.\nA picture of Christ in the world yet not known, not recognised by the world. In\nour Gospel reading, John the Baptist speaks of one who ‘stands among you,\nwhom you do not know.’ John 1.26. John’s words and the poem of Studdart\nKennedy set me thinking about the unknown Christ.\nWe have tried to define him. The creeds we recite Sunday by Sunday bear\nwitness to the turmoil in the early years of the Church as successive Councils\nwrestled with the problem of the precise relationship between the earthly Jesus\nand God. But of course words can never fully express the heavenly, the\ninfinite, the divine, the unknown Christ.\nThe late Lord Hailsham, formerly Lord Chancellor in Britain, writing towards\nthe end of his life in the closing pages of his biography ‘A Sparrow’s Flight’\nwrites:\n‘As I approach the throne of the ineffable, the more mere words fail to express\nmy innermost feelings and I take refuge in metaphor, in poetry, in admiration\nfor the beauty in a landscape, in a sunset, in the plumage of a bird, in a\nbutterfly ….. But my doubts finally dissolve in wonder, in longing, in\nadoration. And, lo, a paradox appears. I seek God, and behold a bedraggled\nhuman figure impaled for ridicule upon a cross. I despair of man, and behold\nthe same figure, enthroned in majesty above the clouds. If I go up to heaven he\nis there. If I descend into the depths of misery and grief, he is there also. He is\nAlpha and Omega, the source of my being and the end of my pilgrimage. He is\nlove, at once the beloved and the eternal lover. He is Father, Son and Holy\nPage 3 of 4\nADVENT 3 – Year B – 2020\nSpirit, at once the creator, the redeemer, the inspirer of suffering humanity, the\ncompanion on my way and the strengthener of my steps. But he is himself the\nWay, the Truth and the Life. he is unknown and unknowable, yet constantly\nrevealed, revealed in nature, in beauty, in goodness, in knowledge, but always\nabsent in the negative, the hated and the hateful. he is always present yet\nconstantly eludes my grasp. Being infinite, he cannot be comprised in my\nunderstanding. Nevertheless as constantly he reappears in my need.\nRemaining Christian, I am constantly reassured in my wandering, in my\ndoubting and as constantly lead back by my trusting. I do not know. I do not\npretend to know. But I trust, and therefore I believe. Now I see through a\nglass, darkly. The time is not far distant when, infinitely contrite, I must seek\nthe mercy of an infinitely compassionate judge, and then, face to face, I shall\nknow, even as I am known.’\nA Sparrow’s Flight – Lord Hailsham p 452\nI meet Christ in the unexpected, in the unknown, in the daily opportunities of\nservice …. ‘As much as you did it for the least of these you did it to me.’ We\nencounter Christ in the hungry, in the lonely, the desolate. Reaching out in the\nname of Christ, I encounter Christ.\nI meet Christ as I meet with others in all the limitations and inadequacy of the\nworship we meet to offer up to God. ‘Where two or three are gathered together\nin my name, there am I in the midst of them.’ As Paul reminds his readers in\nthe Church in Corinth, ‘You are the Body of Christ’. Our vocation, our calling\nis to be ones through whom Christ continues to speak, to act, to be present in\nPage 4 of 4\nADVENT 3 – Year B – 2020\nthe world of today. We encounter Christ in one another. We are to be the ones\nthrough whom others encounter Christ.\nWhenever we meet in the sharing of the bread and the wine, as members of the\nBody of Christ we recall, we remember. ‘This is my body; this is my blood.\nDo this in remembrance of me.’ As often as we eat the bread and drink the\ncup, we proclaim the Lord’s death until he comes, rejoicing in his presence\namong us; ‘Thou art here, we ask not how.’\nAs we proceed through Advent towards the Festival of Christmas, God’s\npresence among us in Christ; may God enable us to recognise the presence of\nChrist in the poor and the marginalised, the lonely and the desolate; recognise\nhim in each other as we meet together in word and sacrament. May he enable\nus to be ones through whom others have their own encounter with Christ."
    }
}