{
    "title": "Advent People",
    "date": "2022-12-04",
    "blurb": "The sermon emphasizes the importance of being an 'Advent People', a group that waits in hope for the coming of Christ. It stresses the need for faithfulness and active participation in the world, not just passive observation. The sermon also highlights the importance of helping others and showing kindness, as these actions are seen as serving Christ himself.",
    "raw_text": "I recall many years ago when I was Rector in County Laois visiting a retired Roman Catholic Priest in Hospital in Portlaoise one Easter. We had struck up a friendship. He had grown up in the village of Clonaslee in my Parish and ended up as Parish Priest in Birmingham in a Parish near where I had grown up. And I had come from Birmingham and ended up ministering in Clonaslee to where he had come to retire. It was his first Easter since he had been ordained that he had not been leading worship. He said something that Easter Day that has stayed with me ever since. 'We are an Easter people'.\n\nI thought of that encounter as I read over the lessons being read at our Advent Service this evening and I found myself thinking that we are an Advent People. The two are not contradictory: for it as an Easter People that we, as an Advent People wait in hope.\n\nAs an Advent People we are a people in waiting but we do not wait as passive observers. We read in Matthew’s Gospel of John the Baptist warning the Pharisees and Sadducees:\n\n“You brood of vipers! Who warned you to flee from the wrath to come? Bear fruit worthy of repentance. Do not presume to say to yourselves, ‘We have Abraham as our ancestor’; for I tell you, God is able from these stones to raise up children to Abraham.” Matt 3:7-9\n\nNow it is worth noting that Luke, as he describes this same episode, tells us of John saying these same words to everyone who came out to hear him. Sometimes we can think that uncomfortable passages of scripture apply only to other people and not to me.\n\n'Bear fruit worthy of repentance.’ There’s a modern catchphrase that says, ‘If you are going to talk the talk then you need to walk the walk’. It reminds us that fine words are not enough. Fine words need to be followed up in life.\n\nAs I thought on that my mind turned to words of the Prophet Micah:\n\n“With what shall I come before the Lord,\nand bow myself before God on high?\nShall I come before him with burnt offerings,\nwith calves a year old?\nWill the Lord be pleased with thousands of rams,\nwith ten thousands of rivers of oil?\nShall I give my firstborn for my transgression,\nthe fruit of my body for the sin of my soul?”\nHe has told you, O mortal, what is good;\nand what does the Lord require of youbut to do justice, and to love kindness,\nand to walk humbly with your God? Micah 6:6-8\n\nGod requires faithfulness – not extravagance.\nBear fruit worthy of repentance.\n\nIn the course of his ministry Jesus told a number of Parables that point to the coming of the Kingdom. One that has spoken to me over these last few days, as I have been thinking over the service this evening, is the Parable of the Sheep and the Goats. You recall the King turns to those on his right and says:\n\n‘Come, you that are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world; for I was hungry and you gave me food, I was thirsty and you gave me something to drink, I was a stranger and you welcomed me, I was naked and you gave me clothing, I was sick and you took care of me, I was in prison and you visited me.’ Then the righteous will answer him, ‘Lord, when was it that we saw you hungry and gave you food, or thirsty and gave you something to drink? And when was it that we saw you a stranger and welcomed you, or naked and gave you clothing? And when was it that we saw you sick or in prison and visited you?’ And the king will answer them, ‘Truly I tell you, just as you did it to one of the least of these who are members of my family, you did it to me.’ Matt 25:34-40\n\nYou recall he turns to those on his left and turns them away because of their failure to respond. Their complaint could be summed up as ‘Lord, if we had realised it was you, of course we would have helped you.’\n\nAs an Advent People we are waiting in hope. As we await the coming of Christ in glory, let us not lose sight of the Christ we encounter in our midst. This picks up on what we were thinking about earlier. As an Advent People, as a people in waiting, we do not wait as passive observers. In our last Lesson from St Luke, we hear of Jesus as he teaches in his home town of Nazareth, identifies his ministry, the Kingdom he has come to bring in with words of the Prophet Isaiah, a Kingdom of Good News for the poor, the prisoner, the blind, the oppressed. Later on in his Gospel, Luke tells of John the Baptist languishing in prison. In the isolation of his prison cell, John clearly wonders has he got it wrong, had he made a dreadful mistake in pointing to Jesus. We read:\n\nWhen the men came to Jesus, they said, “John the Baptist sent us to you to ask, ‘Are you the one who is to come, or should we expect someone else?’”\n\nAt that very time Jesus cured many who had diseases, sicknesses and evil spirits, and gave sight to many who were blind. So he replied to the messengers, “Go back and report to John what you have seen and heard: The blind receive sight, the lame walk, those who have leprosy are cleansed, the deaf hear, the dead are raised, and the good news is proclaimed to the poor. Blessed is anyone who does not stumble on account of me.” Luke 7:20-23\n\nJohn has been faithful. His work as a herald of the Kingdom has been done. As an Advent People, as a people who wait in hope, a people who are not merely passive observers, we are called to be faithful as heralds of the Kingdom of God not merely by what we say, but by who we are. To be living and active signs in the places and time in which God has placed us; to be people and communities of reconciliation, in our stand for justice, for healing of body, mind and soul in our broken and hurting world; that we too may hear our Lord greeting us:\n\n‘Come, you that are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world; ………….\nTruly I tell you, just as you did it to one of the least of these who are members of my family, you did it to me.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/Advent Carol Service - St Patrick_s - 2022.txt",
        "raw_ocr_content": "Page 1 of 4\nAdvent Carol Service – St Patrick’s Jordanstown - 2022\nI recall many years ago when I was Rector in County Laois visiting a retired\nRoman Catholic Priest in Hospital in Portlaoise one Easter. We had struck up\na friendship. He had grown up in the village of Clonaslee in my Parish and\nended up as Parish Priest in Birmingham in a Parish near where I had grown\nup. And I had come from Birmingham and ended up ministering in Clonaslee\nto where he had come to retire. It was his first Easter since he had been\nordained that he had not been leading worship. He said something that Easter\nDay that has stayed with me ever since. ‘We are an Easter people’.\nI thought of that encounter as I read over the lessons being read at our Advent\nService this evening and I found myself thinking that we are an Advent People.\nThe two are not contradictory: for it as an Easter People that we, as an Advent\nPeople wait in hope.\nAs an Advent People we are a people in waiting but we do not wait as passive\nobservers. We read in Matthew’s Gospel of John the Baptist warning the\nPharisees and Sadducees:\n“You brood of vipers! Who warned you to flee from the wrath to\ncome? Bear fruit worthy of repentance. Do not presume to say to\nyourselves, ‘We have Abraham as our ancestor’; for I tell you, God is\nable from these stones to raise up children to Abraham.” Matt 3:7-9\nNow it is worth noting that Luke, as he describes this same episode, tells us of\nJohn saying these same words to everyone who came out to hear him.\nSometimes we can think that uncomfortable passages of scripture apply only to\nother people and not to me.\n‘Bear fruit worthy of repentance.’ There’s a modern catchphrase that says, ‘If\nyou are going to talk the talk then you need to walk the walk’. It reminds us\nthat fine words are not enough. Fine words need to be followed up in life.\nAs I thought on that my mind turned to words of the Prophet Micah:\nPage 2 of 4\nAdvent Carol Service – St Patrick’s Jordanstown - 2022\n“With what shall I come before the Lord,\nand bow myself before God on high?\nShall I come before him with burnt offerings,\nwith calves a year old?\nWill the Lord be pleased with thousands of rams,\nwith ten thousands of rivers of oil?\nShall I give my firstborn for my transgression,\nthe fruit of my body for the sin of my soul?”\nHe has told you, O mortal, what is good;\nand what does the Lord require of youbut to do justice, and to love\nkindness,\nand to walk humbly with your God? Micah 6:6-8\nGod requires faithfulness – not extravagance.\nBear fruit worthy of repentance.\nIn the course of his ministry Jesus told a number of Parables that point to the\ncoming of the Kingdom. One that has spoken to me over these last few days,\nas I have been thinking over the service this evening, is the Parable of the\nSheep and the Goats. You recall the King turns to those on his right and says:\n‘Come, you that are blessed by my Father, inherit the kingdom\nprepared for you from the foundation of the world; for I was hungry\nand you gave me food, I was thirsty and you gave me something to\ndrink, I was a stranger and you welcomed me, I was naked and you\ngave me clothing, I was sick and you took care of me, I was in prison\nand you visited me.’ Then the righteous will answer him, ‘Lord, when\nwas it that we saw you hungry and gave you food, or thirsty and gave\nyou something to drink? And when was it that we saw you a stranger\nand welcomed you, or naked and gave you clothing? And when was it\nthat we saw you sick or in prison and visited you?’ And the king will\nanswer them, ‘Truly I tell you, just as you did it to one of the least of\nthese who are members of my family, you did it to me.’ Matt 25:34-\n40\nYou recall he turns to those on his left and turns them away because of their\nfailure to respond. Their complaint could be summed up as ‘Lord, if we had\nrealised it was you, of course we would have helped you.’\nPage 3 of 4\nAdvent Carol Service – St Patrick’s Jordanstown - 2022\nAs an Advent People we are waiting in hope. As we await the coming of\nChrist in glory, let us not lose sight of the Christ we encounter in our midst.\nThis picks up on what we were thinking about earlier. As an Advent People, as\na people in waiting, we do not wait as passive observers. In our last Lesson\nfrom St Luke, we hear of Jesus as he teaches in his home town of Nazareth,\nidentifies his ministry, the Kingdom he has come to bring in with words of the\nProphet Isaiah, a Kingdom of Good News for the poor, the prisoner, the blind,\nthe oppressed. Later on in his Gospel, Luke tells of John the Baptist\nlanguishing in prison. In the isolation of his prison cell, John clearly wonders\nhas he got it wrong, had he made a dreadful mistake in pointing to Jesus. We\nread:\nWhen the men came to Jesus, they said, “John the Baptist sent us to\nyou to ask, ‘Are you the one who is to come, or should we expect\nsomeone else?’”\nAt that very time Jesus cured many who had diseases, sicknesses and\nevil spirits, and gave sight to many who were blind. So he replied to\nthe messengers, “Go back and report to John what you have seen and\nheard: The blind receive sight, the lame walk, those who have leprosy\nare cleansed, the deaf hear, the dead are raised, and the good news is\nproclaimed to the poor. Blessed is anyone who does not stumble on\naccount of me.” Luke 7:20-23\nJohn has been faithful. His work as a herald of the Kingdom has been done.\nAs an Advent People, as a people who wait in hope, a people who are not\nmerely passive observers, we are called to be faithful as heralds of the\nKingdom of God not merely by what we say, but by who we are. To be living\nand active signs in the places and time in which God has placed us; to be\npeople and communities of reconciliation, in our stand for justice, for healing\nof body, mind and soul in our broken and hurting world; that we too may hear\nour Lord greeting us:\nPage 4 of 4\nAdvent Carol Service – St Patrick’s Jordanstown - 2022\n‘Come, you that are blessed by my Father, inherit the kingdom\nprepared for you from the foundation of the world; …………………..\nTruly I tell you, just as you did it to one of the least of these who are\nmembers of my family, you did it to me."
    }
}