{
    "title": "Advent 4 - 2010",
    "date": "2010-12-19",
    "blurb": "In this sermon, Kevin reflects on the meaning of Advent and the importance of compassion and care in society. He shares a story about a young man who fell into destitution but found hope and support through Focus Ireland. The sermon emphasizes the presence of God in our lives, embodied in the acts of love and care we show to each other.",
    "raw_text": "This week, as I do every year at this time, I travelled into the Focus Ireland café on Eustace Street, on the edge of Temple Bar to hand over the gifts you gave to Focus Ireland. I always find this a very humbling experience. There is the gratitude of the staff for our modest offering. Then there are the stories of those they meet in the café and out on the streets. As the chef told me, those on the streets are coming from a wider and wider group in society. He told me of a young man, 12 months ago with a job, a company car, his own flat – suddenly destitute. Pride prevented him from seeking help until after several weeks on the street he came to Focus Ireland. Now he has received job training and is back in a flat.\n\nThat place a symbol of hope and care ever more necessary in our straightened times. for me it is also a very hopeful sign that fundamental values of care and compassion that marked Irish society were not swamped by the Celtic Tiger. That place is also a sign of God’s presence in our society. Those who work there may or may not have a specifically Christian commitment but they are definitely channels of God’s love and care.\n\nOne of the names given to the infant to be born in Bethlehem, that we read in our lesson from Isaiah is ‘Emmanuel’, God with us. Matthew’s Gospel begins with the designation of Jesus as Emmanuel. The closing words of the Gospel are a promise of continuing presence, ‘I am with you always, to the end of the age.’\n\nJesus had promised his disciples, ‘Where two or three are gathered together in my name, there I am in the midst of them.’ Jesus here in the midst of us as we gather to worship him; among us as we share bread and wine, proclaiming his death until he comes again as together we confess:\n\nChrist has died,\nChrist has risen,\nChrist will come again.\n\nGod with us. Paul meditated upon the enormity of that in those lovely words to the Philippians:\n\n6 who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7 but emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8 he humbled himself\nand became obedient to the point of death--\neven death on a cross. Phil 2:6-8\n\nThe writer of the Letter to the Hebrews explores this further as he reflects on Jesus as our great High Priest:\n\nSince, then, we have a great high priest who has passed through the heavens,\nJesus, the Son of God, let us hold fast to our confession. 15 For we do not have\na high priest who is unable to sympathize with our weaknesses, but we have one\nwho in every respect has been tested as we are, yet without sin. 16 Let us\ntherefore approach the throne of grace with boldness, so that we may receive\nmercy and find grace to help in time of need. Hebrews 4:14-16\n\nGod with us, God in Jesus, entering into our human condition and in the loneliness of his temptations, of his agony in Gethsemene, of his suffering on the Cross he experiences our humanity. What it is to be lonely and destitute, what it is to be abandoned beyond the city wall.\n\nThe writer to the Hebrews goes further:\n\n7 In the days of his flesh, Jesus offered up prayers and supplications, with loud\ncries and tears, to the one who was able to save him from death, and he was\nheard because of his reverent submission. 8 Although he was a Son, he learned\nobedience through what he suffered; 9 and having been made perfect, he\nbecame the source of eternal salvation for all who obey him, Heb 5:7-9\n\nThis is the wonder of Christmas. God with us, not in the tinsel and glitter of a world obsessed by celebrity but in the birth of a child, a child who was to touch the leper, welcome tax collector and sinner and those whom the world despised. Over this season of Christmas we will hear again those lovely words of St John:\n\n10 He was in the world, and the world came into being through him; yet the\nworld did not know him. 11 He came to what was his own, and his own people\ndid not accept him. 12 But to all who received him, who believed in his name,\nhe gave power to become children of God, 13 who were born, not of blood or\nof the will of the flesh or of the will of man, but of God.\n\nJn 1:14 And the Word became flesh and lived among us, and we have seen his\nglory, the glory as of a father's only son, full of grace and truth. John 1:10-14\n\nMay we be enabled to see his glory, to receive him into our hearts and to enter into our inheritance as sons and daughters of the living God.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year A/advent42010.txt",
        "raw_ocr_content": "Page 1 of 3\nAdvent 4 – 2010 – year A\nThis week, as I do every year at this time, I travelled into the Focus Ireland café on\nEustace Street, on the edge of Temple Bar to hand over the gifts you gave to Focus\nIreland. I always find this a very humbling experience. There is the gratitude of the staff\nfor our modest offering. Then there are the stories of those they meet in the café and out\non the streets. As the chef told me, those on the streets are coming from a wider and wider\ngroup in society. He told me of a young man, 12 months ago with a job, a company car,\nhis own flat – suddenly destitute. Pride prevented him from seeking help until after\nseveral weeks on the street he came to Focus Ireland. Now he has received job training\nand is back in a flat.\nThat place a symbol of hope and care ever more necessary in our straightened times. for\nme it is also a very hopeful sign that fundamental values of care and compassion that\nmarked Irish society were not swamped by the Celtic Tiger. That place is also a sign of\nGod’s presence in our society. Those who work there may or may not have a specifically\nChristian commitment but they are definitely channels of God’s love and care.\nOne of the names given to the infant to be born in Bethlehem, that we read in our lesson\nfrom Isaiah is ‘Emmanuel’, God with us. Matthew’s Gospel begins with the designation\nof Jesus as Emmanuel. The closing words of the Gospel are a promise of continuing\npresence, ‘I am with you always, to the end of the age.’\nJesus had promised his disciples, ‘Where two or three are gathered together in my name,\nthere I am in the midst of them.’ Jesus here in the midst of us as we gather to worship\nhim; among us as we share bread and wine, proclaiming his death until he comes again as\ntogether we confess:\nChrist has died,\nChrist has risen,\nChrist will come again.\nPage 2 of 3\nAdvent 4 – 2010 – year A\nGod with us. Paul meditated upon the enormity of that in those lovely words to the\nPhilippians:\n6 who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7 but emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8 he humbled himself\nand became obedient to the point of death--\neven death on a cross. Phil 2:6-8\nThe writer of the Letter to the Hebrews explores this further as he reflects on Jesus as our\ngreat High Priest:\nSince, then, we have a great high priest who has passed through the heavens,\nJesus, the Son of God, let us hold fast to our confession. 15 For we do not have\na high priest who is unable to sympathize with our weaknesses, but we have one\nwho in every respect has been tested as we are, yet without sin. 16 Let us\ntherefore approach the throne of grace with boldness, so that we may receive\nmercy and find grace to help in time of need. Hebrews 4:14-16\nGod with us, God in Jesus, entering into our human condition and in the loneliness of his\ntemptations, of his agony in Gethsemene, of his suffering on the Cross he experiences our\nhumanity. What it is to be lonely and destitute, what it is to be abandoned beyond the city\nwall.\nThe writer to the Hebrews goes further:\n7 In the days of his flesh, Jesus offered up prayers and supplications, with loud\ncries and tears, to the one who was able to save him from death, and he was\nheard because of his reverent submission. 8 Although he was a Son, he learned\nobedience through what he suffered; 9 and having been made perfect, he\nbecame the source of eternal salvation for all who obey him, Heb 5:7-9\nThis is the wonder of Christmas. God with us, not in the tinsel and glitter of a world\nobsessed by celebrity but in the birth of a child, a child who was to touch the leper,\nPage 3 of 3\nAdvent 4 – 2010 – year A\nwelcome tax collector and sinner and those whom the world despised. Over this season of\nChristmas we will hear again those lovely words of St John:\n10 He was in the world, and the world came into being through him; yet the\nworld did not know him. 11 He came to what was his own, and his own people\ndid not accept him. 12 But to all who received him, who believed in his name,\nhe gave power to become children of God, 13 who were born, not of blood or\nof the will of the flesh or of the will of man, but of God.\nJn 1:14 And the Word became flesh and lived among us, and we have seen his\nglory, the glory as of a father's only son, full of grace and truth. John 1:10-14\nMay we be enabled to see his glory, to receive him into our hearts and to enter into our\ninheritance as sons and daughters of the living God."
    }
}