{
    "title": "Hope Amidst Uncertainty",
    "date": "2017-12-10",
    "blurb": "In this sermon, Kevin reflects on the challenges of 2020 and the enduring hope found in faith. Drawing parallels between the hardships endured during the pandemic and the biblical exile of the Israelites, he emphasizes the importance of hope and faith during times of uncertainty. He encourages the congregation to remain vigilant and hopeful, looking forward to a time when normalcy will return.",
    "raw_text": "2020 has not been a good year. 12 months ago all that we have endured would have been the stuff of nightmares. Home and family life, business and community life, school and college life, Church life – all have been traumatised by a virus we had not even heard of this time last year. A virus that even on this island has killed thousands, left people with debilitating disease, left people afraid to leave their own homes, meet their own families. Ordinary rites of passage that we would celebrate as a community, births, marriages, deaths – all reduced to small numbers – people left without the supports from extended family, neighbours and friends in time of grievous loss.\n\nThis is our first Sunday back in Church – and part of us is asking for how long. Many are wary of taking the step back in among crowds and so we will continue to meet not only in person but also on line.\n\nBut there are signs of hope. In the Republic our infection numbers, though still much higher than last summer are falling significantly. There has been encouraging news not only about the development of effective vaccines but now in the past couple of weeks about their approval and vaccination programmes over the next few months.\n\nWe are emerging from a period of darkness, were not out of it yet but there are signs of hope.\n\nThe theme of emerging from a time of suffering and uncertainty is a thread that runs through our readings and the service of Holy Communion that we celebrate and one that resonates with the season of Advent as we approach the celebration of Christmas.\n\nOur Old Testament Lesson begins with those lovely words from Isaiah:\n\n1Comfort, O comfort my people, says your God.\n2Speak tenderly to Jerusalem, and cry to her that she has served her term, that her penalty is paid, that she has received from the LORD’s hand double for all her sins. Is 40:1,2\n\nThis passage comes at a pivotal point in the Book of the Prophet Isaiah. The preceding chapter, set in the context of the final days of the reign of Hezekiah, spoke of judgement, of Judah carried off into exile – and then silence. Then comes this chapter, spoken to a people who had endured the trauma of the fall of Jerusalem, the pain, the despair, the humiliation of exile. Out of that silence come words of comfort and hope. We have that lovely expectation of God accompanying his people back to Jerusalem.\n\nIn many ways the Old Testament is a story of unrequited love of God for his people. The people did return from Exile to Jerusalem but we have no account of the return journey; there is no pillar of cloud going before them as through Sinai; no account of the Spirit of God filling the Temple to counter Ezekiel’s vision of God’s Spirit leaving the Temple.\n\nThe people have returned – but there is still a sense in which they are still in Exile. The land is still under foreign domination, the people still fall short of their calling to be God’s people. Israel is released but has not yet entered into her freedom. She is living between the times, between the now and the not yet of her redemption, still on the journey.\n\nIn our Gospel reading, John the Baptist is speaking to a people in the land but still in Exile. John summons the people to prepare, to get ready for the one who is to come. Part of that process of preparation is that of preparing themselves, John’s call to the people of his day to repent. There is a sense of anticipation, of waiting, of hope. People are called to live in the light of that hope.\n\nAs we celebrate the sacrament of Holy Communion, we proclaim the death and resurrection of Christ, we look forward to the culmination of our hope. In the Eucharist Prayer we declare:\n\n‘dying your destroyed our death rising your restored our life, Lord Jesus, come in glory.’\n\nThese are words of people in waiting, on a journey, a journey of anticipation, of commitment, of hope, of ‘pressing on to take hold of that for which Christ took hold of me.’ of ‘forgetting what is behind and straining towards what is ahead, pressing on towards the goal to win the prize for which God has called me in Christ.’\n\nWe live in the light of the Good News in Christ. In Christ, God has spoken tenderly to his people; in Christ God has pain double for all their sins; in Christ the glory of the Lord has been revealed.\n\nAs we come to the end of this traumatic year that has been 2020, there is light ahead of us, there are signs of our suffering drawing to a close. As the people drew to the end of their desert journey, they still had to live the desert life. So as we wait for the vaccine to come we will need to continue our vigilance, to protect ourselves, to protect the vulnerable and those we love. But the time is coming, and coming soon, when we will be able to hug our loved ones again, when we will see the smiles that are now hidden behind the masks. Hopefully we will learn to appreciate those simple things that all too often we had come to take for granted\n\nAs we continue through this journey of Advent towards our celebration of Christmas, we do so as people on a journey of faith, learning what it means in daily living, in our places of work and recreation, our homes and communities to live out our baptismal calling to die to sin, to rise to new life in Christ, proclaiming in word and deed:\n\n‘dying your destroyed our death rising your restored our life, Lord Jesus, come in glory.’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/year B/advent22017.txt",
        "raw_ocr_content": "Page 1 of 4\nADVENT 2 – 2017 – year B\n2020 has not been a good year. 12 months ago all that we have endured would\nhave been the stuff of nightmares. Home and family life, business and\ncommunity life, school and college life, Church life – all have been traumatised\nby a virus we had not even heard of this time last year. A virus that even on\nthis island has killed thousands, left people with debilitating disease, left\npeople afraid to leave their own homes, meet their own families. Ordinary rites\nof passage that we would celebrate as a community, births, marriages, deaths –\nall reduced to small numbers – people left without the supports from extended\nfamily, neighbours and friends in time of grievous loss.\nThis is our first Sunday back in Church – and part of us is asking for how long.\nMany are wary of taking the step back in among crowds and so we will\ncontinue to meet not only in person but also on line.\nBut there are signs of hope. In the Republic our infection numbers, though still\nmuch higher than last summer are falling significantly. There has been\nencouraging news not only about the development of effective vaccines but\nnow in the past couple of weeks about their approval and vaccination\nprogrammes over the next few months.\nWe are emerging from a period of darkness, were not out of it yet but there are\nsigns of hope.\nThe theme of emerging from a time of suffering and uncertainty is a thread that\nruns through our readings and the service of Holy Communion that we\ncelebrate and one that resonates with the season of Advent as we approach the\ncelebration of Christmas.\nOur Old Testament Lesson begins with those lovely words from Isaiah:\nPage 2 of 4\nADVENT 2 – 2017 – year B\n1Comfort, O comfort my people,\nsays your God.\n2Speak tenderly to Jerusalem,\nand cry to her\nthat she has served her term,\nthat her penalty is paid,\nthat she has received from the LORD’s hand\ndouble for all her sins. Is 40:1,2\nThis passage comes at a pivotal point in the Book of the Prophet Isaiah. The\npreceding chapter, set in the context of the final days of the reign of Hezekiah,\nspoke of judgement, of Judah carried off into exile – and then silence. Then\ncomes this chapter, spoken to a people who had endured the trauma of the fall\nof Jerusalem, the pain, the despair, the humiliation of exile. Out of that silence\ncome words of comfort and hope. We have that lovely expectation of God\naccompanying his people back to Jerusalem.\nIn many ways the Old Testament is a story of unrequited love of God for his\npeople. The people did return from Exile to Jerusalem but we have no account\nof the return journey; there is no pillar of cloud going before them as through\nSinai; no account of the Spirit of God filling the Temple to counter Ezekiel’s\nvision of God’s Spirit leaving the Temple.\nThe people have returned – but there is still a sense in which they are still in\nExile. The land is still under foreign domination, the people still fall short of\ntheir calling to be God’s people. Israel is released but has not yet entered into\nher freedom. She is living between the times, between the now and the not yet\nof her redemption, still on the journey.\nIn our Gospel reading, John the Baptist is speaking to a people in the land but\nstill in Exile. John summons the people to prepare, to get ready for the one\nwho is to come. Part of that process of preparation is that of preparing\nthemselves, John’s call to the people of his day to repent. There is a sense of\nPage 3 of 4\nADVENT 2 – 2017 – year B\nanticipation, of waiting, of hope. People are called to live in the light of that\nhope.\nAs we celebrate the sacrament of Holy Communion, we proclaim the death and\nresurrection of Christ, we look forward to the culmination of our hope. In the\nEucharist Prayer we declare:\n‘dying your destroyed our death\nrising your restored our life,\nLord Jesus, come in glory.’\nThese are words of people in waiting, on a journey, a journey of anticipation,\nof commitment, of hope, of ‘pressing on to take hold of that for which Christ\ntook hold of me.’ of ‘forgetting what is behind and straining towards what is\nahead, pressing on towards the goal to win the prize for which God has called\nme in Christ.’\nWe live in the light of the Good News in Christ. In Christ, God has spoken\ntenderly to his people; in Christ God has pain double for all their sins; in\nChrist the glory of the Lord has been revealed.\nAs we come to the end of this traumatic year that has been 2020, there is light\nahead of us, there are signs of our suffering drawing to a close. As the people\ndrew to the end of their desert journey, they still had to live the desert life. So\nas we wait for the vaccine to come we will need to continue our vigilance, to\nprotect ourselves, to protect the vulnerable and those we love. But the time is\ncoming, and coming soon, when we will be able to hug our loved ones again,\nwhen we will see the smiles that are now hidden behind the masks. Hopefully\nwe will learn to appreciate those simple things that all too often we had come\nto take for granted\nAs we continue through this journey of Advent towards our celebration of\nChristmas, we do so as people on a journey of faith, learning what it means in\nPage 4 of 4\nADVENT 2 – 2017 – year B\ndaily living, in our places of work and recreation, our homes and communities\nto live out our baptismal calling to die to sin, to rise to new life in Christ,\nproclaiming in word and deed:\n‘dying your destroyed our death\nrising your restored our life,\nLord Jesus, come in glory.’"
    }
}