{
    "title": "Dreams into Reality",
    "date": "2016-12-04",
    "blurb": "In this sermon, Kevin explores the concept of 'Wouldn't it be nice if...?' and how it can be transformed into reality. He uses examples from everyday life, city planning, and the peace process in Northern Ireland to illustrate his point. He also discusses the biblical teachings of Isaiah and the ministry of John the Baptist, emphasizing the importance of repentance and change in direction to bring about new possibilities.",
    "raw_text": "Do you ever find yourself asking, 'Wouldn't it be nice if...?' Maybe around the house the question is asked 'Wouldn't it be nice if there was a flower bed in the middle of the lawn?' I often remark that these questions may take only a minute to ask but a lot longer to put into effect. This can all just remain at the level of the day dream. We can sit looking at the lawn and imagine the flower bed, the rockery, the roses. We can imagine the scent of the flowers, the buzzing of the bees. They remain at the level of the day dream because we are not willing to take the practical steps, to put in the effort required, to transform our day dreams into reality.\n\nOf course there are more far reaching questions of this nature. Years ago, as traffic planners looked at the mounting problems as a larger and larger number of bigger and bigger trucks clogged up the traffic in the city of Dublin, at some point someone will have said something along the lines of 'Wouldn't it be nice if we had a tunnel that took all those trucks out of the port out onto the M50?' A whole project was born. Plans were drawn up, calculations made and eventually the tunnel built as a 'Wouldn't it be nice if...?' has been transformed into a reality.\n\nThe road to peace in Northern Ireland has been a long and arduous one with many hiccups along the way. I remember, in the wake of the first Loyalist and Republican cease-fires, the Northern Ireland Office sponsored a series of TV advertisements designed to promote a culture of peace in a society that had come to see conflict as the norm. One of them showed a group of children from different backgrounds playing together and finished with the question, 'Wouldn't it be great if it could be like this all of the time?' At one level there was a naivety to that campaign – society is not made up of three year olds playing around a bouncy castle – but it did put out a challenge. It challenged the assumption that conflict was the norm, that there was no alternative. There are still those on both sides who are more comfortable with conflict, who still feel threatened by that dream – reminders that there are still attitudes that have to be changed if the dream 'Wouldn't it be nice if...?' is finally to take root.\n\nThe lessons today present us with another of these 'Wouldn't it be nice if...?' situations. Our Old Testament Lesson is one of those lovely passages from Isaiah, in which the prophet points to a future when the creation will be in harmony with its creator: when\n\nThe wolf will live with the lamb,\n\nThe infant will play near the hole of the cobra,\n\nThey will neither harm nor destroy on all my holy mountain, Is 11:6ff\n\nThis, we are told, will be brought to pas with the coming of God's Messiah, one who will bring God's wisdom and justice to bear on human society. Under his rule the disorder and conflict of the created world will be a thing of the past. What are the basic requirements for this to come to pass? It will be when:\n\nthe earth will be full of the knowledge of the LORD as the waters cover the sea. Is 11:9\n\nThis for me provides the basic link between the dream, 'Wouldn't it be nice if the word was in harmony with its creator?' and it coming into reality.\n\nOur Gospel reading enlarges on this link between dream and reality. It tells of the ministry of John the Baptist. St Matthew identifies the ministry of John with the one spoke of in the Book of Isaiah crying out, 'Prepare the way of the Lord' as he called the people of his day to repentance.\n\nWhat are we talking about when we use that word 'repentance'? Let us just take another look at that word 'repentance'. Alongside 'penance' it can be seen in very negative, discouraging ways; it can have something of the aura of the hair shirt about it. We use that word to translate the Greek word metanoia. That is a word that is rich in meaning. It means literally a change in direction, a change in attitude that in turn opens up possibilities of new beginnings, new life.\n\nIf we go to our doctor with a problem she may offer a particular course of treatment. But at the same time we will often be told that if the treatment is to be effective then we are also going to have to make changes in life-style. There is no point, for example in my doctor treating me for diabetes if I am not prepared to alter my diet. She is looking for a sort of repentance – a change in direction, a change in life style that if followed opens up new possibilities.\n\nSo let us start to apply that 'change in direction, change in attitude', to that TV ad that I remember well from very troubled times in Northern Ireland. As I look back on that I see an invitation to society to take a change in direction. But it didn't just stop there, it encouraged us to think of new possibilities; that conflict, that division need not be the norm for our society; that if we moved out beyond the familiarity and, in a strange way, the safety of our conflict and division then whole new opportunities could open up. Northern Ireland still has a long way to go but whenever I go back I see signs of hope as people continue to ask 'Wouldn't it be nice if...?' In hardline Ballymena, there is now a strong ecumenical movement between many of the Churches. Following a particularly nasty sectarian killing, many of the Churches, realising a common witness had to be made, came together to start joint alpha groups. Towards the end of my time there, the Church of Ireland Bishop of Derry was welcomed in the Roman Catholic Church in the town. Repentance, changes in direction opening up new possibilities.\n\nThis takes me back to our reading from Isaiah, and those words we read,\n\nThe wolf will live with the lamb,\n\nThe infant will play near the hole of the cobra,\n\nThey will neither harm nor destroy on all my holy mountain, Is 11:6ff\n\nIn this the prophet is offering a vision of how things can be, the possibilities that a repentance, a root and branch change in direction, change in attitude could bring to a broken and hurting society.\n\nThis Sunday, as we bring our gifts to Church in support of the appeal for Focus Ireland, we are very conscious of the numbers of families living in temporary accommodation, those living on our streets. It is indeed shocking that we have to make these appeals in a modern European capital. One of the functions of groups such as Focus Ireland is to articulate that shock; to ask that awkward question 'Wouldn't it be nice if...?' If people were not forced into homelessness, if people did not have to sleep on our streets.\n\nQuestions like that challenge us to re-evaluate wider issues and priorities in our society, as we are beginning to emerge from the nightmare of the last ten years as the economy continues to improve, as unemployment continues to decrease. These are values that can not be measured on a balance sheet, that never appear on a profit and loss account that none the less define us as a society. I am thinking of the values we put on community, on integrity in business, in politics; the priority we give to justice, the place of the weak and the marginalised in our society.\n\n'Wouldn't it be nice if...?' As a society let us repent, let us dare to dream, let us embrace the possibilities that improving economy present us with to make the day dream a reality.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year A/advent22016.txt",
        "raw_ocr_content": "Page 1 of 4\nAdvent 2 – 2010 – Year A\nDo you ever find yourself asking, ‘Would n’t it be nice if …?’ Maybe around\nthe house the question is asked ‘Would n’t it be nice if there was a flower bed\nin the middle of the lawn?’ I often remark that these questions may take only a\nminute to ask but a lot longer to put into effect. This can all just remain at the\nlevel of the day dream. We can sit looking at the lawn and imagine the flower\nbed, the rockery, the roses. We can imagine the scent of the flowers, the\nbuzzing of the bees. They remain at the level of the day dream because we are\nnot willing to take the practical steps, to put in the effort required, to transform\nour day dreams into reality.\nOf course there are more far reaching questions of this nature. Years ago, as\ntraffic planners looked at the mounting problems as a larger and larger number\nof bigger and bigger trucks clogged up the traffic in the city of Dublin, at some\npoint someone will have said something along the lines of ‘Would n’t it be nice\nif we had a tunnel that took all those trucks out of the port out onto the M50?’\nA whole project was born. Plans were drawn up, calculations made and\neventually the tunnel built as a ‘Would n’t it be nice if …’ has been\ntransformed into a reality.\nThe road to peace in Northern Ireland has been a long and arduous one with\nmany hiccups along the way. I remember, in the wake of the first Loyalist and\nRepublican cease-fires, the Northern Ireland Office sponsored a series of TV\nadvertisements designed to promote a culture of peace in a society that had\ncome to see conflict as the norm. One of them showed a group of children\nfrom different backgrounds playing together and finished with the question,\n‘Would n’t it be great if it could be like this all of the time?’ At one level there\nwas a naivety to that campaign – society is not made up of three year olds\nplaying around a bouncy castle – but it did put out a challenge. It challenged\nthe assumption that conflict was the norm, that there was no alternative. There\nare still those on both sides who are more comfortable with conflict, who still\nPage 2 of 4\nAdvent 2 – 2010 – Year A\nfeel threatened by that dream – reminders that there are still attitudes that have\nto be changed if the dream ‘Would n’t it be nice if … ?’ is finally to take root.\nThe lessons today present us with another of these ‘Would n’t it be nice if … ?’\nsituations. Our Old Testament Lesson is one of those lovely passages from\nIsaiah, in which the prophet points to a future when the creation will be in\nharmony with its creator: when\nThe wolf will live with the lamb,\n………………………\nThe infant will play near the hole of the cobra,\n……………………………..\nThey will neither harm nor destroy\non all my holy mountain, Is 11:6ff\nThis, we are told, will be brought to pas with the coming of God’s Messiah,\none who will bring God’s wisdom and justice to bear on human society. Under\nhis rule the disorder and conflict of the created world will be a thing of the\npast. What are the basic requirements for this to come to pass? It will be\nwhen:\nthe earth will be full of the knowledge of the LORD\nas the waters cover the sea. Is 11:9\nThis for me provides the basic link between the dream, ‘Would n’t it be nice if\nthe word was in harmony with its creator?’ and it coming into reality.\nOur Gospel reading enlarges on this link between dream and reality. It tells of\nthe ministry of John the Baptist. St Matthew identifies the ministry of John\nwith the one spoke of in the Book of Isaiah crying out, ‘Prepare the way of the\nLord’ as he called the people of his day to repentance.\nWhat are we talking about when we use that word ‘repentance’? Let us just\ntake another look at that word ‘repentance’. Alongside ‘penance’ it can be\nseen in very negative, discouraging ways; it can have something of the aura of\nPage 3 of 4\nAdvent 2 – 2010 – Year A\nthe hair shirt about it. We use that word to translate the Greek word metanoia.\nThat is a word that is rich in meaning. It means literally a change in direction,\na change in attitude that in turn opens up possibilities of new beginnings, new\nlife.\nIf we go to our doctor with a problem she may offer a particular course of\ntreatment. But at the same time we will often be told that if the treatment is to\nbe effective then we are also going to have to make changes in life-style.\nThere is no point, for example in my doctor treating me for diabetes if I am not\nprepared to alter my diet. She is looking for a sort of repentance – a change in\ndirection, a change in life style that if followed opens up new possibilities.\nSo let us start to apply that ‘change in direction, change in attitude’, to that TV\nad that I remember well from very troubled times in Northern Ireland. As I\nlook back on that I see an invitation to society to take a change in direction.\nBut it didn’t just stop there, it encouraged us to think of new possibilities; that\nconflict, that division need not be the norm for our society; that if we moved\nout beyond the familiarity and, in a strange way, the safety of our conflict and\ndivision then whole new opportunities could open up. Northern Ireland still\nhas a long way to go but whenever I go back I see signs of hope as people\ncontinue to ask ‘Wouldn’t it be nice if…?’ In hardline Ballymena, there is now\na strong ecumenical movement between many of the Churches. Following a\nparticularly nasty sectarian killing, many of the Churches, realising a common\nwitness had to be made, came together to start joint alpha groups. Towards the\nend of my time there, the Church of Ireland Bishop of Derry was welcomed in\nthe Roman Catholic Church in the town. Repentance, changes in direction\nopening up new possibilities.\nThis takes me back to our reading from Isaiah, and those words we read,\nThe wolf will live with the lamb,\n………………………\nPage 4 of 4\nAdvent 2 – 2010 – Year A\nThe infant will play near the hole of the cobra,\n……………………………..\nThey will neither harm nor destroy\non all my holy mountain, Is 11:6ff\nIn this the prophet is offering a vision of how things can be, the possibilities\nthat a repentance, a root and branch change in direction, change in attitude\ncould bring to a broken and hurting society.\nThis Sunday, as we bring our gifts to Church in support of the appeal for Focus\nIreland, we are very conscious of the numbers of families living in temporary\naccommodation, those living on our streets. It is indeed shocking that we have\nto make these appeals in a modern European capital. One of the functions of\ngroups such as Focus Ireland is to articulate that shock; to ask that awkward\nquestion ‘Wouldn’t it be nice if …?’ If people were not forced into\nhomelessness, if people did not have to sleep on our streets.\nQuestions like that challenge us to re-evaluate wider issues and priorities in our\nsociety, as we are beginning to emerge from the nightmare of the last ten years\nas the economy continues to improve, as unemployment continues to decrease.\nThese are values that can not be measured on a balance sheet, that never appear\non a profit and loss account that none the less define us as a society. I am\nthinking of the values we put on community, on integrity in business, in\npolitics; the priority we give to justice, the place of the weak and the\nmarginalised in our society.\n‘Would n’t it be nice if ….?’ As a society let us repent, let us dare to dream, let\nus embrace the possibilities that improving economy present us with to make\nthe day dream a reality."
    }
}