{
    "title": "Signposts in Life",
    "date": "2020-12-13",
    "blurb": "In this sermon, Kevin discusses the importance of signposts in life, both literal and metaphorical. He talks about the people who have acted as signposts in his life, guiding him in his faith and personal development. He also emphasizes the role of parents and godparents as signposts in a child's life, guiding them in their faith and personal development. Finally, he uses the story of John the Baptist to remind us of our role as signposts, pointing others to Jesus.",
    "raw_text": "As I was walking along the Fisherman’s Pier in Howth the other day, I came across a large Christmas decoration outside one of the fish shops. It is in the form of a large sleigh pulled by white reindeer. At the back of the sleigh there is a sign post pointing vaguely north out beyond Ireland’s Eye, indicating the North Pole is 4000 odd miles away.\n\nSignposts are important to us. If you get to a crossroads it is good to see a clear sign pointing to the place you are looking for.\n\nPeople are very important to us, people who show us the way in life, who act as signposts for us. I think of parents and teachers. I look back, grateful to the start my parents gave me in life. I think of my ‘A’ Level physics teacher; the Rector who first welcomed me when I started going to Church as a teenager; Professor Ernest Walton in the Physics Department in Trinity who taught me that there was no conflict between my love of physics and my new found faith. All these were signposts in my life, people who showed me the way in various aspects of my life.\n\nThis morning in St Mary’s, while this service is going on, we are baptising baby Olivia Ennis. In the course of that service her parents and godparents are going to make promises about the way they are going to bring her up.\n\n> By your own prayers and example, by your teaching and love, will you encourage her in the life and faith of the Christian community?\n\nBy your example, by your teaching and love will you encourage her? This is a wonderful expression of Christian parenthood as parents guide their children in all aspects of their development. They are, we are called to be signposts.\n\nThis is what lies at the heart of our Gospel reading. John was attracting a lot of attention; people were coming from all over the place to hear him. It must have been very tempting to enjoy all that, to bask in the glory of it all. But John deflects all the attention away from himself and points to one who is to come, one of whom he will say, ‘Behold the Lamb of God’, to Jesus.\n\nHe is saying, ‘Look all this is not about me.’ There is a lesson here for us. Sometimes in Churches we can get so wrapped up in ourselves, our own organisation, our own prestige, our own survival. When that happens, we lose sight of what we are really here for, as individuals, as a Church. We are here to be living signposts, pointing others to Jesus.\n\nThe signpost on that sleigh that I came across on the Fisherman’s pier the other day set me thinking about signposts in my own life, people who have showed me the way in life. Today we think particularly of Ross and Gillian as they embark upon the adventure of bringing up Olivia, to be signposts to this young child on her journey through life. As we think about John the Baptist, as one pointing to Jesus, so we are reminded of our job of being signposts, pointing to Jesus in all that we say and think and do.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year B/advent32020family.txt",
        "raw_ocr_content": "Page 1 of 2\nADVENT 3 – Year B – 2020 – Baptism and Family Service\nAs I was walking along the Fisherman’s Pier in Howth the other day, I came\nacross a large Christmas decoration outside one of the fish shops. It is in the\nform of a large sleigh pulled by white reindeer. At the back of the sleigh there\nis a sign post pointing vaguely north out beyond Ireland’s Eye, indicating the\nNorth Pole is 4000 odd miles away.\nSignposts are important to us. If you get to a crossroads it is good to see a\nclear sign pointing to the place you are looking for.\nPeople are very important to us, people who show us the way in life, who act as\nsignposts for us. I think of parents and teachers. I look back, grateful to the\nstart my parents gave me in life. I think of my ‘A’ Level physics teacher; the\nRector who first welcomed me when I started going to Church as a teenager;\nProfessor Ernest Walton in the Physics Department in Trinity who taught me\nthat there was no conflict between my love of physics and my new found faith.\nAll these were signposts in my life, people who showed me the way in various\naspects of my life.\nThis morning in St Mary’s, while this service is going on, we are baptising\nbaby Olivia Ennis. In the course of that service her parents and godparents are\ngoing to make promises about the way they are going to bring her up.\nBy your own prayers and example, by your teaching and love, will\nyou encourage her in the life and faith of the Christian community?\nPage 2 of 2\nADVENT 3 – Year B – 2020 – Baptism and Family Service\nBy your example, by your teaching and love will you encourage her? This is a\nwonderful expression of Christian parenthood as parents guide their children in\nall aspects of their development. They are, we are called to be signposts.\nThis is what lies at the heart of our Gospel reading. John was attracting a lot of\nattention; people were coming from all over the place to hear him. It must\nhave been very tempting to enjoy all that, to bask in the glory of it all. But\nJohn deflects all the attention away from himself and points to one who is to\ncome, one of whom he will say, ‘Behold the Lamb of God’, to Jesus.\nHe is saying, ‘Look all this is not about me.’ There is a lesson here for us.\nSometimes in Churches we can get so wrapped up in ourselves, our own\norganisation, our own prestige, our own survival. When that happens, we lose\nsight of what we are really here for, as individuals, as a Church. We are here to\nbe living signposts, pointing others to Jesus.\nThe signpost on that sleigh that I came across on the Fisherman’s pier the other\nday set me thinking about signposts in my own life, people who have showed\nme the way in life. Today we think particularly of Ross and Gillian as they\nembark upon the adventure of bringing up Olivia, to be signposts to this young\nchild on her journey through life. As we think about John the Baptist, as one\npointing to Jesus, so we are reminded of our job of being signposts, pointing to\nJesus in all that we say and think and do."
    }
}