{
    "title": "The Magnificat: A Radical Message",
    "date": "2012-12-23",
    "blurb": "In this sermon, Kevin explores the radical message of the Magnificat, a song of praise and gratitude to God, traditionally associated with the Service of Evening Prayer in the Anglican Communion. He reflects on how the Magnificat's message of the powerful being brought low and the humble being lifted up aligns with the teachings of John the Baptist and the core message of Christmas.",
    "raw_text": "Our Gospel passage this morning, the 4th Sunday of Advent, provides us with the setting of the Magnificat, the Song of Mary, a song of praise and gratitude to God when she goes to meet with her cousin Elizabeth. We will be using the Magnificat as our psalm this morning.\n\nThe Magnificat, of course, is usually associated with the Service of Evening Prayer, part of the tradition of the Anglican Communion. With the passing of the evening service in many churches this canticle is passing out of use.\n\nI remember a member of Ahoghill Parish, who rarely came to the Evening Service, once remarking as he came out of an evening service that was slightly different to the norm that he missed the Magnificat. There was, he said, something comfortable, something familiar about it - it took him back to evening services in his childhood when his father had been Sexton of his local Parish Church.\n\nAs we both went on to reflect on his comments, it occurred to us that at times the very traditions that we value have at times, by their very familiarity, had the effect of taming the scriptures, taking away some of their cutting edge.\n\nThe Magnificat may be familiar, may be traditional, but its message is anything but comfortable. It is, if you read it closely, quite radical in its content as it speaks of the powerful being brought low and the humble lifted up, the hungry being filled and the rich being sent empty handed away.\n\nIt all fits in with the future proclamation of the child who leapt in Elizabeth’s womb as her cousin Mary came into her home. Elizabeth’s child, John the Baptist, was to call his generation to repentance. As we read last week, he was to have harsh words for the rich and powerful in both the political and religious establishment of his day.\n\nAlso, as we read last week, he was to call his hearers to a new way of living in the world. The one with two tunics was to give to those who had none; the tax collector was to forgo his customary payment on the side; the soldier was to refrain from his customary practices of oppression and extortion of the local population.\n\nThe images of Christmas, Joseph, Mary, shepherds, wise men gathered around the crib in the warm glow of lamp and candlelight, quite understandably appeal to us but they are far from being the whole story of Christmas. For behind the story of Christmas is the God of the Magnificat, the one who brings down rulers form their thrones and lifts up the humble; the one who fills the hungry with good things and sends the rich empty handed away.\n\nIn the Incarnation, this God of the Magnificat, comes among us in the child of Bethlehem, comes among us to call us to a new way of living before God. And so we prepare to celebrate the coming of him who declared that ‘the first shall be last and the last’; the one who, as his disciples bickered among themselves as to who was going to be the greatest among them, placed a child in their midst, declaring that ‘except you become as a little child, you shall not enter the kingdom of heaven.’\n\nHe was the one, who on the night of the Last Supper, laid aside his coat, taking on the task of the least of the least of the household servants, washing the feet of his disciples:\n\n> When he had finished washing their feet, he put on his clothes and returned to his place. “Do you understand what I have done for you?” he asked them. “You call me ‘Teacher’ and ‘Lord’, and rightly so, for that is what I am. Now that I, your Lord and Teacher, have washed your feet, you also should wash one another’s feet. I have set you an example that you should do as I have done for you. I tell you the truth, no servant is greater than his master, nor is a messenger greater than the one who sent him. Now that you know these things, you will be blessed if you do them.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year C/advent42012.txt",
        "raw_ocr_content": "Page 1 of 3\n4th Sunday of Advent - year C - 2012\nOur Gospel passage this morning, the 4th Sunday of Advent, provides us with\nthe setting of the Magnificat, the Song of Mary, a song of praise and gratitude\nto God when she goes to meet with her cousin Elizabeth. We will be using the\nMagnificat as our psalm this morning.\nThe Magnificat, of course, is usually associated with the Service of Evening\nPrayer, part of the tradition of the Anglican Communion. With the passing of\nthe evening service in many churches this canticle is passing out of use.\nI remember a member of Ahoghill Parish, who rarely came to the Evening\nService, once remarking as he came out of an evening service that was slightly\ndifferent to the norm that he missed the Magnificat. There was, he said,\nsomething comfortable, something familiar about it - it took him back to\nevening services in his childhood when his father had been Sexton of his local\nParish Church.\nAs we both went on to reflect on his comments, it occurred to us that at times\nthe very traditions that we value have at times, by their very familiarity, had the\neffect of taming the scriptures, taking away some of their cutting edge.\nThe Magnificat may be familiar, may be traditional, but its message is anything\nbut comfortable. It is, if you read it closely, quite radical in its content as it\nspeaks of the powerful being brought low and the humble lifted up, the hungry\nbeing filled and the rich being sent empty handed away.\nPage 2 of 3\n4th Sunday of Advent - year C - 2012\nIt all fits in with the future proclamation of the child who leapt in Elizabeth’s\nwomb as her cousin Mary came into her home. Elizabeth’s child, John the\nBaptist, was to call his generation to repentance. As we read last week, he was\nto have harsh words for the rich and powerful in both the political and religious\nestablishment of his day.\nAlso, as we read last week, he was to call his hearers to a new way of living in\nthe world. The one with two tunics was to give to those who had none; the tax\ncollector was to forgo his customary payment on the side; the soldier was to\nrefrain from his customary practices of oppression and extortion of the local\npopulation.\nThe images of Christmas, Joseph, Mary, shepherds, wise men gathered around\nthe crib in the warm glow of lamp and candlelight, quite understandably appeal\nto us but they are far from being the whole story of Christmas. For behind the\nstory of Christmas is the God of the Magnificat, the one who brings down\nrulers form their thrones and lifts up the humble; the one who fills the hungry\nwith good things and sends the rich empty handed away.\nIn the Incarnation, this God of the Magnificat, comes among us in the child of\nBethlehem, comes among us to call us to a new way of living before God. And\nso we prepare to celebrate the coming of him who declared that ‘the first shall\nbe last and the last’; the one who, as his disciples bickered among themselves\nPage 3 of 3\n4th Sunday of Advent - year C - 2012\nas to who was going to be the greatest among them, placed a child in their\nmidst, declaring that ‘except you become as a little child, you shall not enter\nthe kingdom of heaven.’\nHe was the one, who on the night of the Last Supper, laid aside his coat, taking\non the task of the least of the least of the household servants, washing the feet\nof his disciples:\nWhen he had finished washing their feet, he put on his clothes and returned to his\nplace. “Do you understand what I have done for you?” he asked them. “You call me\n‘Teacher’ and ‘Lord’, and rightly so, for that is what I am. Now that I, your Lord and\nTeacher, have washed your feet, you also should wash one another’s feet. I have set\nyou an example that you should do as I have done for you. I tell you the truth, no\nservant is greater than his master, nor is a messenger greater than the one who sent\nhim. Now that you know these things, you will be blessed if you do them."
    }
}