{
    "title": "Advent Waiting",
    "date": "2013-12-22",
    "blurb": "This sermon explores the concept of waiting during the Advent season. It draws parallels between waiting for loved ones at the airport and waiting for God. The sermon emphasizes the presence of God with us, through the incarnation of Jesus, and encourages us to hold onto this truth in our lives.",
    "raw_text": "This time of year will find many of us at Dublin Airport waiting. Waiting for relatives and friends who are making a trip home for the Christmas Season. As we wait, we may recognise others there for the same reason. 'Who are you waiting for?' 'Is it long since they have been home?' 'Where are they living now?'\n\nThere is that sense of anticipation as we watch the arrivals board. What flight are they on? What airport are they flying out of? Can you see if the flight is on time, or has it been delayed? Has the plane landed yet? Then once the flight has landed there is that interminable wait at the arrivals gate as passengers stream through. One by one people are recognised, hugs are exchanged, children are gathered up in the arms of uncles, aunts, grandparents.\n\nThe one we have been waiting for has arrived and we head back home to the room that has been made ready, the treats that have been brought in. Then the photographs are brought out, news exchanged, stories told of life away from home, of the journey home.\n\nThis Advent we have paid a little more attention to this idea of waiting, waiting upon God. At the airport we wait for someone in particular, we wait with a purpose, we wait in anticipation of the joy of reunion with old friends and family.\n\nWho are we waiting for in our Advent waiting? In our Gospel reading this morning the writer recalls words of Isaiah:\n\n> 'The virgin will be with child and will give birth to a son, and they will call him Immanuel'—which means, 'God with us.'\n\nImmanuel, God with us. Joseph is told to name the child Jesus, 'because he will save his people from their sins.' God present, God incarnate, present with his people, experiencing what it is to be human, to love and to be loved, to laugh, to weep, to be misunderstood, to be betrayed, to be lonely, to have friends, to know hostility, to live, to suffer pain, to die.\n\nThen at the very end of Matthew's Gospel, the closing words, the risen Jesus takes leave of his disciples and says\n\n> 'And remember, I am with you always, to the end of the age.'\n\nJesus had promised his disciples, 'Where two or three are gathered together in my name, there I am in the midst of them.' Jesus here in the midst of us as we gather to worship him; among us as we share bread and wine, proclaiming his death until he comes again as together we confess:\n\nChrist has died,\nChrist has risen,\nChrist will come again.\n\nGod with us. Paul meditated upon the enormity of that in those lovely words to the Philippians:\n\n> 'who, though he was in the form of God, did not regard equality with God as something to be exploited, but emptied himself, taking the form of a slave, being born in human likeness. And being found in human form, he humbled himself and became obedient to the point of death-- even death on a cross.' Phil 2:6-8\n\nThe writer of the Letter to the Hebrews explores this further as he reflects on Jesus as our great High Priest:\n\n> 'Since, then, we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast to our confession. For we do not have a high priest who is unable to sympathize with our weaknesses, but we have one who in every respect has been tested as we are, yet without sin. Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need.' Hebrews 4:14-16\n\nGod with us, God in Jesus, entering into our human condition and in the loneliness of his temptations, of his agony in Gethsemene, of his suffering on the Cross he experiences our humanity. What it is to be lonely and destitute, what it is to be abandoned beyond the city wall.\n\nThis is the wonder of Christmas. God with us, not in the tinsel and glitter of a world obsessed by celebrity but in the birth of a child, a child who was to touch the leper, welcome tax collector and sinner and those whom the world despised. Over this season of Christmas we will hear again those lovely words of St John:\n\n> 'He was in the world, and the world came into being through him; yet the world did not know him. He came to what was his own, and his own people did not accept him. But to all who received him, who believed in his name, he gave power to become children of God, who were born, not of blood or of the will of the flesh or of the will of man, but of God. And the Word became flesh and lived among us, and we have seen his glory, the glory as of a father's only son, full of grace and truth.' John 1:10-14\n\nMay we be enabled to see his glory, to receive him into our hearts and to enter into our inheritance as sons and daughters of the living God.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Advent/year A/advent42013.txt",
        "raw_ocr_content": "Page 1 of 3\nAdvent 4 2013 – Year A\nThis time of year will find many of us at Dublin Airport waiting. Waiting for\nrelatives and friends who are making a trip home for the Christmas Season. As\nwe wait, we may recognise others there for the same reason. ‘Who are you\nwaiting for?’ ‘Is it long since they have been home?’ ‘Where are they living\nnow?’\nThere is that sense of anticipation as we watch the arrivals board. What flight\nare they on? What airport are thy flying out of? Can you see if the flight is on\ntime, or has it been delayed? Has the plane landed yet? Then once the flight\nhas landed there is that interminable wait at the arrivals gate as passengers\nstream through. One by one people are recognised, hugs are exchanged,\nchildren are gathered up in the arms of uncles, aunts, grandparents.\nThe one we have been waiting for has arrived and we head back home to the\nroom that has been made ready, the treats that have been brought in. Then the\nphotographs are brought out, news exchanged, stories told of life away from\nhome, of the journey home.\nThis Advent we have paid a little more attention to this idea of waiting, waiting\nupon God. At the airport we wait for someone in particular, we wait with a\npurpose, we wait in anticipation of the joy of reunion with old friends and\nfamily.\nWho are we waiting for in our Advent waiting? In our Gospel reading this\nmorning the writer recalls words of Isaiah:\n“The virgin will be with child and will give birth to a son, and they\nwill call him Immanuel”—which means, “God with us.”\nImmanuel, God with us. Joseph is told to name the child Jesus, ‘because he\nwill save his people from their sins.’ God present, God incarnate, present with\nPage 2 of 3\nAdvent 4 2013 – Year A\nhis people, experiencing what it is to be human, to love and to be loved, to\nlaugh, to weep, to be misunderstood, to be betrayed, to be lonely, to have\nfriends, to know hostility, to live, to suffer pain, to die.\nThen at the very end of Matthew’s Gospel, the closing words, the risen Jesus\ntakes leave of his disciples and says\n“And remember, I am with you always, to the end of the age.”\nJesus had promised his disciples, ‘Where two or three are gathered together in\nmy name, there I am in the midst of them.’ Jesus here in the midst of us as we\ngather to worship him; among us as we share bread and wine, proclaiming his\ndeath until he comes again as together we confess:\nChrist has died,\nChrist has risen,\nChrist will come again.\nGod with us. Paul meditated upon the enormity of that in those lovely words to\nthe Philippians:\n6 who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7 but emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8 he humbled himself\nand became obedient to the point of death--\neven death on a cross. Phil 2:6-8\nThe writer of the Letter to the Hebrews explores this further as he reflects on\nJesus as our great High Priest:\nPage 3 of 3\nAdvent 4 2013 – Year A\nSince, then, we have a great high priest who has passed through the heavens,\nJesus, the Son of God, let us hold fast to our confession. 15 For we do not have\na high priest who is unable to sympathize with our weaknesses, but we have one\nwho in every respect has been tested as we are, yet without sin. 16 Let us\ntherefore approach the throne of grace with boldness, so that we may receive\nmercy and find grace to help in time of need. Hebrews 4:14-16\nGod with us, God in Jesus, entering into our human condition and in the\nloneliness of his temptations, of his agony in Gethsemene, of his suffering on\nthe Cross he experiences our humanity. What it is to be lonely and destitute,\nwhat it is to be abandoned beyond the city wall.\nThis is the wonder of Christmas. God with us, not in the tinsel and glitter of a\nworld obsessed by celebrity but in the birth of a child, a child who was to touch\nthe leper, welcome tax collector and sinner and those whom the world\ndespised. Over this season of Christmas we will hear again those lovely words\nof St John:\n10 He was in the world, and the world came into being through him; yet the\nworld did not know him. 11 He came to what was his own, and his own people\ndid not accept him. 12 But to all who received him, who believed in his name,\nhe gave power to become children of God, 13 who were born, not of blood or\nof the will of the flesh or of the will of man, but of God.\nJn 1:14 And the Word became flesh and lived among us, and we have seen his\nglory, the glory as of a father's only son, full of grace and truth. John 1:10-14\nMay we be enabled to see his glory, to receive him into our hearts and to enter\ninto our inheritance as sons and daughters of the living God."
    }
}