{
    "title": "Instruments of Faith",
    "date": "2009-11-01",
    "blurb": "Kevin reflects on the Christian pilgrimage on All Saints Day, using the metaphor of 'the only instruments we have to work with' to describe our souls and bodies offered in service to God. He emphasizes our journey into Christ, growing into the person God wants us to be, and the communal aspect of worship in communion with saints past and present.",
    "raw_text": "All Saints – 2009 – year B\n\nIn their attempt to wipe out the Jewish people for all time, the leaders of the German 3rd Reich operated the now infamous system of concentration camps in which slaughter was carried out on an industrial scale. There perished in those camps men and women who could have made a major contribution to German and European civilisation had not the bizarre concept of a pure Arian race blinded its adherents to the intellectual and cultural riches of the men, women and children they consigned to the flames. In one camp however there was a group of musicians who, prior to the war, had been at the top of their field. These were allowed to survive, often forced to perform for the senior officers, providing an element of culture in the midst of barbarity.\n\nAfter the war, this group was asked to perform at a concert. The final item was a piece composed by the conductor while they were in the camp. It had a strange haunting melody, using combinations of instruments you would not normally come across. After the concert the piece was much admired. Someone asked the conductor; 'What inspired you to choose that particular combination of instruments for this piece?' To which the conductor replied, 'Those were the only instruments we had to work with.' I want to take this idea 'These are the only instruments we have to work with' into our thoughts on Christian pilgrimage on this All Saints Day.\n\nIn the context of our 11:00 Service we are celebrating the Sacraments of Baptism and Holy Communion. At the close the Service we say together the Post Communion Prayer:\n\n> Almighty God,\n> we thank you for feeding us\n> with the spiritual food\n> of the body and blood of your Son Jesus Christ.\n> Through him we offer you our souls and bodies\n> to be a living sacrifice.\n> Send us out in the power of your Spirit\n> to live and work to your praise and glory. Amen.\n\n'We offer you our souls and bodies' - These are the only instruments we have to work with. What is it we offer? What is it this child we baptise this morning has to offer? We bring our DNA, our genetic make up. This will determine the colour of my eyes, my hair, my skin colour, my height, my build. It will probably influence my temperament, possibly my predisposition to certain diseases. But we are of course more than just the sum our genes, more than just pre-programmed machines. Part of our understanding of who we are is that of being ones 'made in the image of God'. There is something in each one of us that reflects the divine. It may be obscured, it may be shadowed by sin, by our human imperfection but there is something in each one of us that reflects, that shows something of the God who made us.\n\nOur Christian pilgrimage, our journey into Christ, our response to the call laid upon us in baptism to be saints; this is a process of growing into the person God wants me to be, of the Kevin I am becoming the Kevin God wants me to be; one who more faithfully shows something of the image of his glory.\n\nIn this I bring to God the person I am, in all the strengths and limitations God has given me, all the frailty and failure of my service and ask him to take me and use me in his service. In the words of hymn 310:\n\n> Spirit of the living God,\n> fall afresh on me.\n> Spirit of the living God,\n> fall afresh on me.\n> Break me, melt me,\n> mould me, fill me.\n> Spirit of the living God,\n> fall afresh on me.\n\nAll Saints is a reminder that I do all this not in isolation but as part of a community, in communion with those in different circumstances, backgrounds and traditions, in communion furthermore with those who have gone before, who have offered their souls and bodies in worship and service down through the ages. And so as part of that fellowship transcending space and time, we offer him our sacrifice of thanks and praise and lift our voice to join the song of heaven, for ever praising him and saying:\n\n> Holy, holy, holy Lord,\n> God of power and might,\n> heaven and earth are full of your glory.\n> Hosanna in the highest.\n> Blessed is he who comes in the name of the Lord.\n> Hosanna in the highest.\n\nAnd in our Post Communion Prayer this All Saints Day we pray:\n\n> May we who have shared at this table\n> as strangers and pilgrims here on earth\n> be welcomed with all your saints\n> to the heavenly feast on the day of your kingdom;\n\nAs we welcome young Zachary into the fellowship of the Church at the beginning of his own earthly pilgrimage, we remember with thanksgiving those who have gone before us, who in their own time offered themselves in all the strengths and weaknesses God gave them and the ways in which God worked in and through them. In fellowship with them we offer ourselves, the only instruments we have, asking only that God may take us and use us in his service for the advancement of his Kingdom.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/All Saints - 2009.txt",
        "raw_ocr_content": "Page 1 of 3\nAll Saints – 2009 – year B\nIn their attempt to wipe out the Jewish people for all time, the leaders of the German 3rd\nReich operated the now infamous system of concentration camps in which slaughter was\ncarried out on an industrial scale. There perished in those camps men and women who\ncould have made a major contribution to German and European civilisation had not the\nbizarre concept of a pure Arian race blinded its adherents to the intellectual and cultural\nriches of the men, women and children they consigned to the flames. In one camp\nhowever there was a group of musicians who, prior to the war, had been at the top of their\nfield. These were allowed to survive, often forced to perform for the senior officers,\nproviding an element of culture in the midst of barbarity.\nAfter the war, this group was asked to perform at a concert. The final item was a piece\ncomposed by the conductor while they were in the camp. It had a strange haunting\nmelody, using combinations of instruments you would not normally come across. After\nthe concert the piece was much admired. Someone asked the conductor; ‘What inspired\nyou to choose that particular combination of instruments for this piece?’ To which the\nconductor replied, ‘Those were the only instruments we had to work with.’ I want to take\nthis idea ‘These are the only instruments we have to work with’ into our thoughts on\nChristian pilgrimage on this All Saints Day.\nIn the context of our 11:00 Service we are celebrating the Sacraments of Baptism and\nHoly Communion. At the close the Service we say together the Post Communion Prayer:\nAlmighty God,\nwe thank you for feeding us\nwith the spiritual food\nof the body and blood of your Son Jesus Christ.\nThrough him we offer you our souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen.\n‘We offer you our souls and bodies’ - These are the only instruments we have to work\nwith. What is it we offer? What is it this child we baptise this morning has to offer? We\nbring our DNA, our genetic make up. This will determine the colour of my eyes, my hair,\nPage 2 of 3\nAll Saints – 2009 – year B\nmy skin colour, my height, my build. It will probably influence my temperament,\npossibly my predisposition to certain diseases. But we are of course more than just the\nsum our genes, more than just pre-programmed machines. Part of our understanding of\nwho we are is that of being ones ‘made in the image of God’. There is something in each\none of us that reflects the divine. It may be obscured, it may be shadowed by sin, by our\nhuman imperfection but there is something in each one of us that reflects, that shows\nsomething of the God who made us.\nAfter the Signing of the Cross in the service of Baptism, there is the prayer for the child:\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ.\n‘Restore in you the image of his glory, lead you in the\nlight and obedience of Christ.’\nOur Christian pilgrimage, our journey into Christ, our response to the call laid upon us in\nbaptism to be saints; this is a process of growing into the person God wants me to be, of\nthe Kevin I am becoming the Kevin God wants me to be; one who more faithfully shows\nsomething of the image of his glory.\nIn this I bring to God the person I am, in all the strengths and limitations God has given\nme, all the frailty and failure of my service and ask him to take me and use me in his\nservice. In the words of hymn 310\nSpirit of the living God,\nfall afresh on me.\nSpirit of the living God,\nfall afresh on me.\nBreak me, melt me,\nmould me, fill me.\nSpirit of the living God,\nfall afresh on me.\nPage 3 of 3\nAll Saints – 2009 – year B\nWe offer him our souls and bodies, the only instruments I have to offer. The DNA of my\nmakeup and all the challenges and opportunities that presents me with; the spark of the\ndivine image that God has planted within me and the offering of my life and with that the\nstrength God has offered to those who seek to follow.\nAll Saints is a reminder that I do all this not in isolation but as part of a community, in\ncommunion with those in different circumstances, backgrounds and traditions, in\ncommunion furthermore with those who have gone before, who have offered their souls\nand bodies in worship and service down through the ages. And so as part of that\nfellowship transcending space and time,\nwe offer him our sacrifice of thanks and praise\nand lift our voice to join the song of heaven,\nfor ever praising him and saying:\nHoly, holy, holy Lord,\nGod of power and might,\nheaven and earth are full of your glory.\nHosanna in the highest.\nBlessed is he who comes in the name of the Lord.\nHosanna in the highest.\nand in our Post Communion Prayer this All Saints Day we pray:\nMay we who have shared at this table\nas strangers and pilgrims here on earth\nbe welcomed with all your saints\nto the heavenly feast on the day of your kingdom;\nAs so as we welcome young Zachary into the fellowship of the Church at the beginning of\nhis own earthly pilgrimage, we remember with thanksgiving those who have gone before\nus, who in their own time offered themselves in all the strengths and weaknesses God gave\nthem and the ways in which God worked in and through them. In fellowship with them\nwe offer ourselves, the only instruments we have, asking only that God may take us and\nuse us in his service for the advancement of his Kingdom."
    }
}