{
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/allsaints2013.txt",
        "raw_ocr_content": "Page 1 of 5\nAll Saints – 2019 – Year C (Alternative OT Lesson)\nLast Thursday night I answered the door to four bright young faces demanding\n‘Trick or treat!’ As I watched them heading back to the gate to rejoin their\nparents I heard the sound of the first of the night’s firework displays. It was of\ncourse Haloween, All Hallows Eve, the eve of All Saints.\nI suppose the title Saint tends to have a bit of a celebrity tag to it. The festival\nof All Saints for me draws us back to the original New Testament\nunderstanding of what it is to be a saint.\nIn the passage from Ephesians that is set as our second reading this morning,\nthe writer tells his reader:\nFor this reason, ever since I heard about your faith in the Lord Jesus and\nyour love for all the saints\nWe are talking here of a community of faith that has at its heart a shared faith\nand a commitment to each other, a communion, a fellowship of saints.\nIn the Apostles Creed we confess\nI believe in the Holy Spirit,\nthe holy catholic Church,\nthe communion of saints,\nA community transcending barriers of time and culture.\nSo one of the marks of the Communion of Saints, and by definition any\nChristian community such as this Parish of which we are members, is one of\nINCLUSION. This is very much one of the underlying themes of the passage\nwe read from Isaiah as our Old Testament Lesson, in which the prophet speaks\nof the faithful foreigner and eunuch, those who would have been seen on the\nPage 2 of 5\nAll Saints – 2019 – Year C (Alternative OT Lesson)\nmargins, on the edge; these will take their place on the holy mountain, the\nTemple, the altar of a restored Jerusalem.\nWe will now take this theme of inclusion, those on the margins into our\nreflection on the Gospel passage appointed for today, Luke’s account of the\nSermon on the Mount. Luke’s account differs from Matthew in that he\nincludes not just a series of blessings but also a series of woes on those who\nwould have been seen as very much part of the Establishment. As we read it\nwe pick up themes of the Magnificat, which I have printed alongside our\nGospel reading, with its talk of filling the hungry with good things and sending\nthe rich empty away.\nThe teaching is delivered to the disciples in the hearing of the crowd. So in a\nsense we are invited to listen in. Like the Magnificat, Jesus’ teaching\nrepresents a reversal of values\n‘Blessed are you who are poor,\nfor yours is the kingdom of God.\n21‘Blessed are you who are hungry now,\nfor you will be filled.\n‘Blessed are you who weep now,\nfor you will laugh.\nThe saints are called to the margins, to identify with the poor, the hungry; to\ngo with Jesus as he touches the leper, shares table with the tax collector and the\nsinner, allows the sinful woman to wash his feet with her tears and dry them\nwith her hair.\nPage 3 of 5\nAll Saints – 2019 – Year C (Alternative OT Lesson)\nIn so doing he causes offence. That has always been the lot of the prophet, the\none who stood in the places of power and spoke unwelcome truth, be it\nWilliam Wilberforce campaigning against slavery in Victorian England; Martin\nLuther King in the Southern States of America in the 1960’s or Desmond Tutu\nin South Africa. They all went to the margins, they all caused offence in the\npursuit of justice and truth as they worked out their vocation to be saints of\nGod in the world in which they lived.\nSo another mark of the Church, as part of the communion of saints, must be\nSOLIDARITY. The Church, as individuals and as a community, must be\nprepared to go to the margins, into the prisons, the drug therapy units, the\nshelters for the homeless; to be with people who are lonely, who are ignored by\nthe world as it rushes past so busy in its busyness.\nInclusion, Solidarity. Jesus invites us further down a path of radical,\ntransforming love.\n27‘But I say to you that listen, Love your enemies, do good to those\nwho hate you, 28bless those who curse you, pray for those who abuse\nyou. 29If anyone strikes you on the cheek, offer the other also; and from\nanyone who takes away your coat do not withhold even your shirt.\n30Give to everyone who begs from you; and if anyone takes away your\ngoods, do not ask for them again. 31Do to others as you would have\nthem do to you.\nInclusion can have an element of the clique; solidarity with the suffering can\nall too easily be tinged with condescension. The radical, transforming love\nJesus is calling his followers to follow will have none of this. ‘But I say to you\nthat listen ..’, you that are open; open to Christ, open to others, open even to\nthose who would take advantage of us. ‘Love your enemies, do good to those\nPage 4 of 5\nAll Saints – 2019 – Year C (Alternative OT Lesson)\nwho hate you.’ That is to go beyond an interior feeling. That love must\nencounter the one who is being loved. ‘Bless those who curse you, pray for\nthose who abuse you.’ That encounter must go beyond mere words into\npositive action; ‘If anyone strikes you on the cheek, offer the other also’;\naction that opens up possibilities of new beginnings. What we are talking of\nhere is a third mark of the Church as part of the communion of saints, that of\nRECONCILIATION. Reconciliation must always be at the heart of the life\nof the Church. Reconciliation between man and God, as we bear witness to the\ndying and rising Christ at the heart of our faith, who speaks into our\nbrokenness words of forgiveness and peace. As a reconciled people, we are\ncalled to be instruments of reconciliation in a broken and hurting world.\nWe are called to be saints, part of the communion of saints, transcending\nbarriers of culture and time; in our fellowship with one another welcoming and\nhonouring one another. As saints of God, we are called to reach out in\nsolidarity with those who are hurting, those on the margins; we are called to be\ninstruments of peace in a broken and divided world.\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nPage 5 of 5\nAll Saints – 2019 – Year C (Alternative OT Lesson)\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\nPrayer of Saint Francis of Assisi"
    },
    "base": "{\n    \"title\": \"All Saints 2013\",\n    \"date\": \"2013-11-03\",\n    \"blurb\": \"In this sermon, Kevin discusses the concept of sainthood, emphasizing the importance of inclusion, solidarity, and reconciliation. He challenges the congregation to go beyond their comfort zones, reaching out to those on the margins of society and standing up for justice and truth. He invites them to follow the path of radical, transforming love, even towards their enemies.\",\n    \"raw_text\": \"Last Thursday night I answered the door to four bright young faces demanding 'Trick or treat!' As I watched them heading back to the gate to rejoin their parents I heard the sound of the first of the night's firework displays. It was of course Halloween, All Hallows Eve, the eve of All Saints.\\n\\nI suppose the title Saint tends to have a bit of a celebrity tag to it. The festival of All Saints for me draws us back to the original New Testament understanding of what it is to be a saint.\\n\\nIn the passage from Ephesians that is set as our second reading this morning, the writer tells his reader:\\n\\n> For this reason, ever since I heard about your faith in the Lord Jesus and your love for all the saints\\n\\nWe are talking here of a community of faith that has at its heart a shared faith and a commitment to each other, a communion, a fellowship of saints.\\n\\nIn the Apostles Creed we confess\\n\\n> I believe in the Holy Spirit,\\n> the holy catholic Church,\\n> the communion of saints,\\n\\nA community transcending barriers of time and culture.\\n\\nSo one of the marks of the Communion of Saints, and by definition any Christian community such as this Parish of which we are members, is one of INCLUSION. This is very much one of the underlying themes of the passage we read from Isaiah as our Old Testament Lesson, in which the prophet speaks of the faithful foreigner and eunuch, those who would have been seen on the margins, on the edge; these will take their place on the holy mountain, the Temple, the altar of a restored Jerusalem.\\n\\nWe will now take this theme of inclusion, those on the margins into our reflection on the Gospel passage appointed for today, Luke's account of the Sermon on the Mount. Luke's account differs from Matthew in that he includes not just a series of blessings but also a series of woes on those who would have been seen as very much part of the Establishment. As we read it we pick up themes of the Magnificat, which I have printed alongside our Gospel reading, with its talk of filling the hungry with good things and sending the rich empty away.\\n\\nThe teaching is delivered to the disciples in the hearing of the crowd. So in a sense we are invited to listen in. Like the Magnificat, Jesus' teaching represents a reversal of values\\n\\n> 'Blessed are you who are poor,\\n> for yours is the kingdom of God.\\n> 'Blessed are you who are hungry now,\\n> for you will be filled.\\n> 'Blessed are you who weep now,\\n> for you will laugh.\\n\\nThe saints are called to the margins, to identify with the poor, the hungry; to go with Jesus as he touches the leper, shares table with the tax collector and the sinner, allows the sinful woman to wash his feet with her tears and dry them with her hair.\\n\\nIn so doing he causes offence. That has always been the lot of the prophet, the one who stood in the places of power and spoke unwelcome truth, be it William Wilberforce campaigning against slavery in Victorian England; Martin Luther King in the Southern States of America in the 1960's or Desmond Tutu in South Africa. They all went to the margins, they all caused offence in the pursuit of justice and truth as they worked out their vocation to be saints of God in the world in which they lived.\\n\\nSo another mark of the Church, as part of the communion of saints, must be SOLIDARITY. The Church, as individuals and as a community, must be prepared to go to the margins, into the prisons, the drug therapy units, the shelters for the homeless; to be with people who are lonely, who are ignored by the world as it rushes past so busy in its busyness.\\n\\nInclusion, Solidarity. Jesus invites us further down a path of radical, transforming love.\\n\\n> 'But I say to you that listen, Love your enemies, do good to those who hate you, bless those who curse you, pray for those who abuse you. If anyone strikes you on the cheek, offer the other also; and from anyone who takes away your coat do not withhold even your shirt. Give to everyone who begs from you; and if anyone takes away your goods, do not ask for them again. Do to others as you would have them do to you.\\n\\nInclusion can have an element of the clique; solidarity with the suffering can all too easily be tinged with condescension. The radical, transforming love Jesus is calling his followers to follow will have none of this. 'But I say to you that listen ..', you that are open; open to Christ, open to others, open even to those who would take advantage of us. 'Love your enemies, do good to those who hate you.' That is to go beyond an interior feeling. That love must encounter the one who is being loved. 'Bless those who curse you, pray for those who abuse you.' That encounter must go beyond mere words into positive action; 'If anyone strikes you on the cheek, offer the other also'; action that opens up possibilities of new beginnings. What we are talking of here is a third mark of the Church as part of the communion of saints, that of RECONCILIATION. Reconciliation must always be at the heart of the life of the Church. Reconciliation between man and God, as we bear witness to the dying and rising Christ at the heart of our faith, who speaks into our brokenness words of forgiveness and peace. As a reconciled people, we are called to be instruments of reconciliation in a broken and hurting world.\\n\\nWe are called to be saints, part of the communion of saints, transcending barriers of culture and time; in our fellowship with one another welcoming and honouring one another. As saints of God, we are called to reach out in solidarity with those who are hurting, those on the margins; we are called to be instruments of peace in a broken and divided world.\\n\\n> Lord, make me an instrument of your peace.\\n> Where there is hatred, let me sow love;\\n> where there is injury, pardon;\\n> where there is doubt, faith;\\n> where"
}