{
    "title": "All Saints Reflection",
    "date": "2017-10-31",
    "blurb": "Kevin's sermon on All Saints' night at Raheny Church emphasizes the universal call to sainthood within the Christian faith. He contrasts the New Testament's inclusive definition of sainthood with the often narrow modern interpretation, reminding the congregation that all Christians are called to sainthood through baptism. The sermon also reflects on the history of the local church and the unknown faithful who have served God throughout the ages.",
    "raw_text": "All Saints – Raheny 2017-10-31\n\nFirst of all I would like to thank Norman your Rector for his kind invitation to preach here in Raheny on All Saints’ night. I retain a very warm affection for this Church and this Parish in which I began my ordained ministry. I recall the All Saints’ night services as very much a feature of the life of this place.\n\nEach Parish Church has its own particular features. I can still recall Cecil Wilson showing me the font here in All Saints with that delightful counterweight to the lid. He also pointed out the window in which the archangel had six toes. We have a number of features in St Mary’s. There is the absence of a central aisle – apparently the idea was to prevent processions. Well you never know what clergy might get up to given half a chance.\n\nAnother of the features of our Parish Church of St Mary’s would be the East Window over the communion table, donated to the Church in memory of the last Earl of Howth. At the centre of the window is the figure of the risen and ascended Christ. Then gathered around him are other figures, saints of the Church, exceptional figures who contributed to the early growth of the Church and the Church in Ireland. So we see the figure of St Peter. We see the figures of St Christopher and St Lawrence, both associated with the St Lawrence family in Howth Castle. Then we have figures of Patrick, Brendan and Brigid, as well as those associated with the Church in this locality, Fintan and Assam, one presenting the church in Sutton, the other the Garland of Howth, a manuscript associated with the Church on Ireland’s Eye.\n\nAll of these were exceptional characters who left their mark on the history of the Church, who have inspired succeeding generations. The trouble is that in ascribing the title saint to any individual, however worthy, it can lead us to a distorted understanding of the whole concept of what it means to be a saint in the Church of God.\n\nOf course in the New Testament, sainthood was a much more all embracing term. When Paul was writing to the different churches, he began his letter in these terms:\n\n> Paul and Timothy, servants of Christ Jesus,\n> To all the saints in Christ Jesus who are in Philippi, (or whichever Church he was writing to)\n\nHe wasn’t writing to an elite, to a spiritual inner circle; he was writing to the whole Church. What marked them out was not a perfection in their Christian life. That would be quite clear when you read some of the letters that followed these greetings to the saints. No, their sainthood rested on the fact that God had laid a claim upon them and they sought to respond to that call in their following of Jesus as Lord and Saviour. They are saints not by the acclamation of men - they are saints by the call of God.\n\nIn the sacrament of Baptism, as each candidate is signed with the sign of the cross, we make the following affirmation:\n\n> Christ claims you for his own.\n> Receive the sign of the cross.\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n> Confess Christ crucified,\n> proclaim his resurrection,\n> look for his coming in glory.\n\nEvery Christian in Baptism is called to sainthood. As we were reminded in our opening, at All Saints we give thanks to God for those men and women down through the ages, known only to God and those close to them, who have responded to the call of their Baptism, who have faithfully followed him in their earthly pilgrimage, facing whatever challenges were placed in their path, serving him and furthering the work of his kingdom in the situation in which he placed them.\n\nAs you did a few years back, we in Howth have been undertaking extensive renovation of the exterior fabric of St Mary’s Church. The last of the slates went on just in time for Storm Ophelia – and not one of them shifted!\n\nIn the course of our work on the Church this summer it was necessary to install additional drainage. The National Monuments Office required us to commission (and pay for) a full archaeological excavation. In the course of this work we discovered that our Church was built on the site of an ancient burial ground dating back to the 11th century. We came across 30 individuals, men and women, old and young along with evidence of an early settlement. We were reminded of a Christian community existing in Howth long before our Church was built.\n\nUp to now, we were completely unaware of these people we found buried in the grounds of our Church, who lived and died, worked and worshipped in these parts nearly a thousand years ago. These are not remembered in any windows, or brass plaques in our Church – we know of no names, we only know of their presence.\n\nIn our lessons Jeremiah spoke of a time when God’s law would be written on the very hearts of men. In our Gospel reading from St Matthew we hear of Jesus giving us the Beatitudes. Both speak of a vision of lives lived in harmony, in communion with God. Lives in whom God’s law is to be part of their very nature, written on their heart, bearing fruit. These passages speak of our Baptismal vocation, our calling to be saints in the Church of God.\n\nAll too often we lose sight of that vocation. Overawed by the exploits of the giants of the Church we lose sight of our own value, our own worth in the sight of God as ones made in God’s image, ransomed, healed, restored, forgiven.\n\nAll too often we lose sight of the value of others – they are of a different class, a different culture, a different tradition – but they too are ones made in God’s image, they too are ransomed, healed, restored, forgiven.\n\nAll Saints is a reminder of the diversity, the faithfulness of those who have gone before; a community spanning time and culture and with that a reminder of the faithfulness of God towards those who are faithful to him. We worship a God who is not a God of the dead but of the living, receiving the worship not only of the Church on earth but also the Church in heaven.\n\nThis season of All Saints is an opportunity to reflect on our own calling, our own vocation, our hope as saints in the Church of God. It is a wonderful reminder of the all encompassing love of God – even for us.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/allsaints2017 -Raheny.txt",
        "raw_ocr_content": "Page 1 of 4\nAll Saints – Raheny 2017-10-31\nFirst of all I would like to thank Norman your Rector for his kind invitation to\npreach here in Raheny on All Saints’ night. I retain a very warm affection for\nthis Church and this Parish in which I began my ordained ministry. I recall the\nAll Saints’ night services as very much a feature of the life of this place.\nEach Parish Church has its own particular features. I can still recall Cecil\nWilson showing me the font here in All Saints with that delightful\ncounterweight to the lid. He also pointed out the window in which the\narchangel had six toes. We have a number of features in St Mary’s. There is\nthe absence of a central aisle – apparently the idea was to prevent processions.\nWell you never know what clergy might get up to given half a chance.\nAnother of the features of our Parish Church of St Mary’s would be the East\nWindow over the communion table, donated to the Church in memory of the\nlast Earl of Howth. At the centre of the window is the figure of the risen and\nascended Christ. Then gathered around him are other figures, saints of the\nChurch, exceptional figures who contributed to the early growth of the Church\nand the Church in Ireland. So we see the figure of St Peter. We see the figures\nof St Christopher and St Lawrence, both associated witht eh St Lawrence\nfamily in Howth Castle. Then we have figures of Patrick, Brendan and Brigid,\nas well as those associated with the Church in this locality, Fintan and Assam,\none presenting the church in Sutton, the other the Garland of Howth, a\nmanuscript associated with the Church on Ireland’s Eye.\nAll of these were exceptional characters who left their mark on the history of\nthe Church, who have inspired succeeding generations. The trouble is that in\nascribing the title saint to any individual, however worthy, it can lead us to a\ndistorted understanding of the whole concept of what it means to be a saint in\nthe Church of God.\nPage 2 of 4\nAll Saints – Raheny 2017-10-31\nOf course in the New Testament, sainthood was a much more all embracing\nterm. When Paul was writing to the different churches, he began his letter in\nthese terms:\nPaul and Timothy, servants of Christ Jesus,\nTo all the saints in Christ Jesus who are in Philippi, (or whichever Church he\nwas writing to)\nHe wasn’t writing to an elite, to a spiritual inner circle; he was writing to the\nwhole Church. What marked them out was not a perfection in their Christian\nlife. That would be quite clear when you read some of the letters that followed\nthese greetings to the saints. No, their sainthood rested on the fact that God\nhad laid a claim upon them and they sought to respond to that call in their\nfollowing of Jesus as Lord and Saviour. They are saints not by the acclamation\nof men - they are saints by the call of God.\nIn the sacrament of Baptism, as each candidate is signed with the sign of the\ncross, we make the following affirmation:\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\nEvery Christian in Baptism is called to sainthood. As we were reminded in our\nopening, at All Saints we give thanks to God for those men and women down\nthrough the ages, known only to God and those close to them, who have\nresponded to the call of their Baptism, who have faithfully followed him in\ntheir earthly pilgrimage, facing whatever challenges were placed in their path,\nserving him and furthering the work of his kingdom in the situation in which he\nplaced them.\nPage 3 of 4\nAll Saints – Raheny 2017-10-31\nAs you did a few years back, we in Howth have been undertaking extensive\nrenovation of the exterior fabric of St Mary’s Church. The last of the slates\nwent on just in time for Storm Ophelia – and not one of them shifted!\nIn the course of our work on the Church this summer it was necessary to install\nadditional drainage. The National Monuments Office required us to\ncommission (and pay for) a full archaeological excavation. In the course of this\nwork we discovered that our Church was built on the site of an ancient burial\nground dating back to the 11th century. We came across 30 individuals, men\nand women, old and young along with evidence of an early settlement. We\nwere reminded of a Christian community existing in Howth long before our\nChurch was built.\nUp to now, we were completely unaware of these people we found buried in\nthe grounds of our Church, who lived and died, worked and worshipped in\nthese parts nearly a thousand years ago. These are not remembered in any\nwindows, or brass plaques in our Church – we know of no names, we only\nknow of their presence.\nIn our lessons Jeremiah spoke of a time when God’s law would be written on\nthe very hearts of men. In our Gospel reading from St Matthew we hear of\nJesus giving us the Beatitudes. Both speak of a vision of lives lived in\nharmony, in communion with God. Lives in whom God’s law is to be part of\ntheir very nature, written on their heart, bearing fruit. These passages speak of\nour Baptismal vocation, our calling to be saints in the Church of God.\nAll too often we lose sight of that vocation. Overawed by the exploits of the\ngiants of the Church we lose sight of our own value, our own worth in the sight\nof God as ones made in God’s image, ransomed, healed, restored, forgiven.\nAll too often we lose sight of the value of others – they are of a different class,\nPage 4 of 4\nAll Saints – Raheny 2017-10-31\na different culture, a different tradition – but they too are ones made in God’s\nimage, they too are ransomed, healed, restored, forgiven.\nAll Saints is a reminder of the diversity, the faithfulness of those who have\ngone before; a community spanning time and culture and with that a reminder\nof the faithfulness of God towards those who are faithful to him. We worship a\nGod who is not a God of the dead but of the living, receiving the worship not\nonly of the Church on earth but also the Church in heaven.\nThis season of All Saints is an opportunity to reflect on our own calling, our\nown vocation, our hope as saints in the Church of God. It is a wonderful\nreminder of the all encompassing love of God – even for us."
    }
}