{
    "title": "Wholeness and Healing",
    "date": "2010-11-07",
    "blurb": "In this sermon, Kevin reflects on the concept of health and healing from a Christian perspective. He draws a distinction between symptoms and root causes, using a personal anecdote about jogging and knee discomfort. Kevin also discusses the World Health Organization's definition of health and critiques the societal view of health as an ideal state, arguing instead for an understanding of health as 'the strength to be human'.",
    "raw_text": "All Saints 2010 – year C – Service of Wholeness and Healing\n\nWhen I was in the North my GP used to call me in every couple of years for a general health check. I remember on one occasion he looked over the records of my previous visits and then announced, ‘You are not overweight yet, but unless you start to do something about it you soon will be. You need to think of ways in which you can get regular exercise.’ All this from a man who couldn’t give up his cigarettes – but that is another story.\n\nI was never a great sportsman – football, cricket and tennis were beyond me. The only thing I had enjoyed was cross country running. So I started to jog again and I must admit I came to enjoy it – it got me out into the fresh air, kept my weight down and I found if I was worrying about something it helped me to relax. Over the last few months I found I was getting a bit of discomfort in one of my knees and thought is this going to spell the end of my jogging. So I went to see a physio a fellow runner recommended to me. After looking at my legs and my feet, she announced, ‘Your problem is not with your knee it is with the arch of your left foot – an instep in your shoe will sort that out.’\n\nI tell that story because it draws the distinction between the symptoms, the things that I notice (in my case my knee) and the root cause of the problem. Today, in the context of the Service of Wholeness and Healing at the 11:00 service I just want to reflect on what do we mean by health, what do we understand by healing? Coming as this does on the Sunday before All Saints Day I want to set all this in the context of the fundamental theme of our Christian hope.\n\nFreud, one of the fathers of modern psychology spoke of health as the capacity for work and enjoyment. Thinking along these lines, if my capacity for work or pleasure is impaired then I am reckoned to be ill. But this is very much coloured by the concepts of production and consumption that are the mark of an industrialised society. If I can work, if I can consume then I am healthy.\n\nThe World Health Organisation adopted a broader definition of health as a ‘state of complete physical, mental and social well-being, not merely the absence of sickness or handicap.’ That though is defining health in terms of an ideal, almost a utopia, as life without suffering, happiness without pain, community without conflict. Human fulfilment, human health comes to be seen in terms of this ideal – and every impairment undermines us as individuals. In these days when every wrinkle can be smoothed out, every sagging chin, tummy or bottom lifted, we end up with a view of health that is quite artificial – in fact quite threatening or undermining. Healing comes to be seen in terms of dealing with the symptoms, not the root causes. As my physio told me, my problem was not with my knee but with my foot. There is no point running around with my knee strapped up if I don’t deal with the problem in the foot. We are also dealing with a very functional approach to health and healing. If the symptoms cannot be dealt with, if we are dealing with a serious illness that undermines our ability to work, to contribute, we are left feeling that we are a burden, that we are of no value.\n\nI often think back on an insight on health I came across some time ago – ‘health as the strength to be human’. Now part and parcel of being human is the wear and tear of our mortal frame, of which the less serious consequences are the sagging chin, bottom or tummy. One issue of the Health Supplement in the Irish Times recently focussed on aging and there was a lovely article that spoke of the need to relish the autumn of our lives, to use the experiences we have gained, the freedom from the busy-ness of rearing families, of developing our careers. And health is not a denial of sickness, a denial of frailty – rather health in its broadest sense, as the strength to be human, involves a capacity to adapt, to become older, to recover one’s health, to accept our mortality.\n\nOur understanding of healing from the Christian perspective involves a thankful acceptance of the benefits of the wonderful advances in medical science; it also involves coming before God in prayer with our concerns for ourselves and all who are sick in the assurance that God hears our prayer, God does understand and does respond.\n\nAs we think of health and the strength to be human, All Saints tide reminds me that I find my true humanity, my deepest healing in the context of my faith in God, Father, Son and Holy Spirit. In the Old Testament Lesson set for today, Daniel’s dream is set in the context of a people’s suffering and the hope of deliverance. Our Gospel reading, Luke’s rendition of Jesus’ teaching in the Beatitudes, speaks of the transformed values of a society redeemed, healed through Christ.\n\nSo I would always want to see health, healing in the context of my faith in Christ, as part of my faith in Christ. But I hold that faith not as an isolated individual but as a member of a community that is bound together by the love of Christ, that is called to have a love and concern for one another.\n\nAnd so this morning some will be coming to seek the ministry of prayer and laying on of hands. They will do so in the context of their faith in Christ, to whom, in his earthly ministry, the sick were brought for healing but also in the context of the love and faith of this Christian community, as we hold up before God those who seek that deep inner healing that only Christ can bring.\n\nSo today we are all involved in this service. Those who come to seek the particular ministry of prayer, those who administer it but all in the context of the love and prayer of the whole congregation as together we seek God’s healing touch, as we all seek that deep inner healing of body, mind and spirit, seeking that peace that God alone can bring.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/allsaints2010.txt",
        "raw_ocr_content": "Page 1 of 3\nAll Saints 2010 – year C – Service of Wholeness and Healing\nWhen I was in the North my GP used to call me in every couple of years for a general\nhealth check. I remember on one occasion he looked over the records of my previous\nvisits and then announced, ‘You are not overweight yet, but unless you start to do\nsomething about it you soon will be. You need to think of ways in which you can get\nregular exercise.’ All this from a man who couldn’t give up his cigarettes – but that is\nanother story.\nI was never a great sportsman – football, cricket and tennis were beyond me. The only\nthing I had enjoyed was cross country running. So I started to jog again and I must admit I\ncame to enjoy it – it got me out into the fresh air, kept my weight down and I found if I\nwas worrying about something it helped me to relax. Over the last few months I found I\nwas getting a bit of discomfort in one of my knees and thought is this going to spell the\nend of my jogging. So I went to see a physio a fellow runner recommended to me. After\nlooking at my legs and my feet, she announced, ‘Your problem is not with your knee it is\nwith the arch of your left foot – an instep in your shoe will sort that out.’\nI tell that story because it draws the distinction between the symptoms, the things that I\nnotice (in my case my knee) and the root cause of the problem. Today, in the context of\nthe Service of Wholeness and Healing at the 11:00 service I just want to reflect on what do\nwe mean by health, what do we understand by healing? Coming as this does on the\nSunday before All Saints Day I want to set all this in the context of the fundamental theme\nof our Christian hope.\nFreud, one of the fathers of modern psychology spoke of health as the capacity for work\nand enjoyment. Thinking along these lines, if my capacity for work or pleasure is\nimpaired then I am reckoned to be ill. But this is very much coloured by the concepts of\nproduction and consumption that are the mark of an industrialised society. If I can work,\nif I can consume then I am healthy\nPage 2 of 3\nAll Saints 2010 – year C – Service of Wholeness and Healing\nThe World Health Organisation adopted a broader definition of health as a ‘state of\ncomplete physical, mental and social well-being, not merely the absence of sickness or\nhandicap.’ That though is defining health in terms of an ideal, almost a utopia, as life\nwithout suffering, happiness without pain, community without conflict. Human\nfulfilment, human health comes to be seen in terms of this ideal – and every impairment\nundermines us as individuals. In these days when every wrinkle can be smoothed out,\nevery sagging chin, tummy or bottom lifted, we end up with a view of health that is quite\nartificial – in fact quite threatening or undermining. Healing comes to be seen in terms of\ndealing with the symptoms, not the root causes. As my physio told me, my problem was\nnot with my knee but with my foot. There is no point running around with my knee\nstrapped up if I don’t deal with the problem in the foot. We are also dealing with a very\nfunctional approach to health and healing. If the symptoms cannot be dealt with, if we are\ndealing with a serious illness that undermines our ability to work, to contribute, we are left\nfeeling that we are a burden, that we are of no value.\nI often think back on an insight on health I came across some time ago – ‘health as the\nstrength to be human’. Now part and parcel of being human is the wear and tear of our\nmortal frame, of which the less serious consequences are the sagging chin, bottom or\ntummy. One issue of the Health Supplement in the Irish Times recently focussed on aging\nand there was a lovely article that spoke of the need to relish the autumn of our lives, to\nuse the experiences we have gained, the freedom from the busy-ness of rearing families, of\ndeveloping our careers. And health is not a denial of sickness, a denial of frailty – rather\nhealth in its broadest sense, as the strength to be human, involves a capacity to adapt, to\nbecome older, to recover one’s health, to accept our mortality.\nOur understanding of healing from the Christian perspective involves a thankful\nacceptance of the benefits of the wonderful advances in medical science; it also involves\ncoming before God in prayer with our concerns for ourselves and all who are sick in the\nassurance that God hears our prayer, God does understand and does respond.\nPage 3 of 3\nAll Saints 2010 – year C – Service of Wholeness and Healing\nAs we think of health and the strength to be human, All Saints tide reminds me that I find\nmy true humanity, my deepest healing in the context of my faith in God, Father, Son and\nHoly Spirit. In the Old Testament Lesson set for today, Daniel’s dream is set in the\ncontext of a people’s suffering and the hope of deliverance. Our Gospel reading, Luke’s\nrendition of Jesus’ teaching in the Beatitudes, speaks of the transformed values of a\nsociety redeemed, healed through Christ.\nSo I would always want to see health, healing in the context of my faith in Christ, as part\nof my faith in Christ. But I hold that faith not as an isolated individual but as a member of\na community that is bound together by the love of Christ, that is called to have a love and\nconcern for one another.\nAnd so this morning some will be coming to seek the ministry of prayer and laying on of\nhands. They will do so in the context of their faith in Christ, to whom, in his earthly\nministry, the sick were brought for healing but also in the context of the love and faith of\nthis Christian community, as we hold up before God those who seek that deep inner\nhealing that only Christ can bring.\nSo today we are all involved in this service. Those who come to seek the particular\nministry of prayer, those who administer it but all in the context of the love and prayer of\nthe whole congregation as together we seek God’s healing touch, as we all seek that deep\ninner healing of body, mind and spirit, seeking that peace that God alone can bring."
    }
}