{
    "title": "Funeral of Anne Stanley",
    "date": "2021-02-26",
    "blurb": "This sermon was delivered during the funeral of Mrs. Anne Stanley. It highlights Anne's life, her devotion to her family, and her faith. The sermon draws on passages from Ecclesiastes and John's Gospel to reflect on the themes of peace and the rhythm of life. It concludes with a hopeful message about the Christian belief in life after death.",
    "raw_text": "At the start of this service, David, on behalf of the family, spoke of some thoughts, some memories the family shared as they put together this service. Anne Stanley, being Anne Stanley, made clear a long time ago that there was to be no fuss, no elaborate eulogies at her funeral. The family have been determined to honour Anne's wishes yet cannot hold back from expressing love and gratitude for the love of a mother, a grandmother given unstintingly over the course of their lives.\n\nTowards the end of the First Letter to Timothy the Apostle gives his advice to the younger man:\n\n> But as for you, man of God, pursue righteousness, godliness, faith, love, endurance, gentleness. 12 Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Tim 6:11 ff\n\n'pursue righteousness, godliness, faith, love, endurance, gentleness.' This seems to me to draw together so many of the memories of Anne Stanley that I came to know, that I know so many of you remember today with love and affection. She has fought the good fight and now is at peace.\n\nThe family chose as the lessons to be read today those lovely passages from Ecclesiastes and John's Gospel. The writer of Ecclesiastes speaks of a time for everything, a rhythm of life:\n\n> For everything there is a season, and a time for every matter under heaven: a time to be born, and a time to die;\n\nIn John's Gospel we read:\n\n> Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid\n\nAs I mulled those two sentences over in my mind, with their themes of peace and rhythm of life – maybe there is a link between with that God given rhythm of life and that peace. Peace with one another, peace with God, peace with ourselves – that can be very elusive – a coming to terms with who we are, where we are at. I think we saw something of that in the life of Anne Stanley.\n\nAt the heart of Anne's life was her family, her beloved Tommy, their children Roger, Robert, Christopher and David. A devoted wife and mother they were all her pride and joy and she delighted in the arrival of grandchildren. She watched with pride as they have grown up, some already developing their own careers and shared the anxieties and sorrow in time of loss with the death of Lily May.\n\nThere is now a huge gap in your lives as you as a family begin to build a life together without the closer presence of Anne. But of course, the love that bound Anne and you her family together lives on as you remember with tears and laughter one who meant and continues to mean so much. Those of us outside the family circle who today can only be present online offer our love and support, assure you of our love and our prayers in the days that lie ahead.\n\nAs a parish we remember Anne with great affection, her companionship with Tommy, her support for him in those latter stages. She was regular in worship here both on Sunday and Wednesday morning. She only stopped coming to the Wednesday service so she could pick up her friend Elsie to enable her to come and share in the coffee after the service. That is just one example of a quiet thoughtfulness that we will always associate with Anne Stanley.\n\nWe come to set the mystery of death in the context of our Christian faith. We are into Lent and approaching Good Friday and Easter in which we remember the death and resurrection of our Lord Jesus Christ, the victory of life over the forces of death. We celebrate it not just as an event in the life of Jesus, but as a victory he has won for us all. On these occasions I often find myself turning over in my mind words from Paul's second letter to the Church at Corinth. In many ways he picks up on the themes of that reading we heard from Ecclesiastes. Paul speaks very honestly of our mortality, of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home. The words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Anne, that all the limitations of these recent times that came with failing health, along with all the limitations that go with just being human are \"swallowed up by life\", that is our inheritance in Christ in the closer presence of our heavenly Father.\n\nWell done, thou good and faithful servant. Receive the kingdom prepared for you from the beginning of the world.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Anne Stanley.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mrs Anne Stanley – St Mary’s Howth – 26th February 2021\nAt the start of this service, David, David, on behalf of the family, spoke of\nsome thoughts, some memories the family shared as they put together this\nservice.\nAnne Stanley, being Anne Stanley, made clear a long time ago that there was\nto be no fuss, no elaborate eulogies at her funeral. The family have been\ndetermined to honour Anne’s wishes yet cannot hold back from expressing\nlove and gratitude for the love of a mother, a grandmother given unstintingly\nover the course of their lives.\nTowards the end of the First Letter to Timothy the Apostle gives his advice to\nthe younger man:\nBut as for you, man of God, pursue righteousness, godliness,\nfaith, love, endurance, gentleness. 12 Fight the good fight of the\nfaith; take hold of the eternal life, to which you were called and\nfor which you made the good confession in the presence of\nmany witnesses. 1 Tim 6:11 ff\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This\nseems to me to draw together so many of the memories of Anne Stanley that I\ncame to know, that I know so many of you remember today with love and\naffection. She has fought the good fight and now is at peace.\nThe family chose as the lessons to be read today those lovely passages from\nEcclesiastes and John’s Gospel. The writer of Ecclesiastes speaks of a time for\neverything, a rhythm of life:\nFor everything there is a season, and a time for every matter\nunder heaven: a time to be born, and a time to die;\nIn John’s Gospel we read:\nPage 2 of 4\nFuneral of Mrs Anne Stanley – St Mary’s Howth – 26th February 2021\nPeace I leave with you; my peace I give you. I do not give to\nyou as the world gives. Do not let your hearts be troubled and\ndo not be afraid\nAs I mulled those two sentences over in my mind, with their themes of peace\nand rhythm of life – maybe there is a link between with that God given rhythm\nof life and that peace. Peace with one another, peace with God, peace with\nourselves – that can be very elusive – a coming to terms with who we are,\nwhere we are at. I think we saw something of that in the life of Anne Stanley.\nAt the heart of Anne’s life was her family, her beloved Tommy, their children\nRoger, Robert, Christopher and David. A devoted wife and mother they were\nall her pride and joy and she delighted in the arrival of grandchildren. She\nwatched with pride as they have grown up, some already developing their own\ncareers and shared the anxieties and sorrow in time of loss with the death of\nLily May.\nThere is now a huge gap in your lives as you as a family begin to build a life\ntogether without the closer presence of Anne. But of course, the love that\nbound Anne and you her family together lives on as you remember with tears\nand laughter one who meant and continues to mean so much. Those of us\noutside the family circle who today can only be present online offer our love\nand support, assure you of our love and our prayers in the days that lie ahead.\nAs a parish we remember Anne with great affection, her companionship with\nTommy, her support for him in those latter stages. She was regular in worship\nhere both on Sunday and Wednesday morning. She only stopped coming to the\nWednesday service so she could pick up her friend Elsie to enable her to come\nPage 3 of 4\nFuneral of Mrs Anne Stanley – St Mary’s Howth – 26th February 2021\nand share in the coffee after the service. That is just one example of a quiet\nthoughtfulness that we will always associate with Anne Stanley.\nWe come to set the mystery of death in the context of our Christian faith. We\nare into Lent and approaching Good Friday and Easter in which we remember\nthe death and resurrection of our Lord Jesus Christ, the victory of life over the\nforces of death. We celebrate it not just as an event in the life of Jesus, but as a\nvictory he has won for us all. On these occasions I often find myself turning\nover in my mind words from Paul’s second letter to the Church at Corinth. In\nmany ways he picks up on the themes of that reading we heard from\nEcclesiastes. Paul speaks very honestly of our mortality, of the body wearing\nout. But just as he talks of the reality of physical decline and death, Paul talks\nof our new heavenly home. The words that really stand out for me are ; \"So\nthat what is mortal may be swallowed up by life.\" This is our hope for Anne,\nthat all the limitations of these recent times that came with failing health, along\nwith all the limitations that go with just being human are \"swallowed up by\nlife\", that is our inheritance in Christ in the closer presence of our heavenly\nFather.\nWell done, thou good and faithful servant. Receive the kingdom prepared for\nyou from the beginning of the world.\nWe give them back to thee, dear Lord, who gavest them to us.\nYet as thou didst not lose them in giving, so we have not lost\nthem by their return. What thou gavest thou takest not away, O\nLover of souls; for what is thine is ours also if we are thine.\nAnd life is eternal and love is immortal, and death is only an\nhorizon, and an horizon is nothing save the limit of our sight.\nLift us up, strong Son of God, that we may see further; cleanse\nour eyes that we may see more clearly; and draw us closer to\nthyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us,\nPage 4 of 4\nFuneral of Mrs Anne Stanley – St Mary’s Howth – 26th February 2021\nprepare us also for that happy place, that where they are and\nthou art, we too may be for evermore."
    }
}