{
    "title": "Salt and Light",
    "date": "2011-04-14",
    "blurb": "Kevin's sermon on 14th April 2011, during the Lent season, focuses on the role of the Church and its members in society. Drawing from the Acts of the Apostles and the Sermon on the Mount, he emphasizes the need for Christians to be like 'salt and light', spreading the love of Christ and serving those outside the Church. He challenges the Church to avoid becoming insular and to live out their faith in the world.",
    "raw_text": "Lent 2011 – 14th April 2011\n\nActs 2:42-46\n\n42 They devoted themselves to the apostles' teaching and fellowship, to the breaking of bread and the prayers. Life among the Believers. Awe came upon everyone, because many wonders and signs were being done by the apostles. 44 All who believed were together and had all things in common; 45 they would sell their possessions and goods and distribute the proceeds to all, as any had need. 46 Day by day, as they spent much time together in the temple, they broke bread at home and ate their food with glad and generous hearts, 47 praising God and having the goodwill of all the people. And day by day the Lord added to their number those who were being saved.\n\nMt 5:13=16\n\nMt 5:13 Salt and Light\n\n\"You are the salt of the earth; but if salt has lost its taste, how can its saltiness be restored? It is no longer good for anything, but is thrown out and trampled under foot.\n\nMt 5:14 \"You are the light of the world. A city built on a hill cannot be hid. 15 No one after lighting a lamp puts it under the bushel basket, but on the lampstand, and it gives light to all in the house. 16 In the same way, let your light shine before others, so that they may see your good works and give glory to your Father in heaven.\n\nOver the last few weeks of this season of Lent we have taken as a recurring theme the injunction that we find in the Book of the Prophet Micah:\n\nMic 6:8 He has told you, O mortal, what is good; and what does the LORD require of you but to do justice, and to love kindness, and to walk humbly with your God?\n\nWe have recognized at each stage in our thoughts the requirement to look out from ourselves. A willingness to recognize the poor and marginalized among us, a willingness to stand alongside them, that willingness to stand alongside them extending into a compassion a compassion, to identify not just with them but with their situation. That will have implications in how we run our society, so last week we recognized that this will have implications in our politics, the issues we regard as priorities in our national life.\n\nTonight we look at what this means for the Church. To ask of ourselves, how do we think we are looked upon by those outside the Church, how do we view ourselves.\n\nIn the ancient world the Church was viewed as a very different organization to the society in which it was set, in that Christians refused to see their devotion to Christ as one religious commitment that could be expressed along with a devotion to the local gods. This meant that it was viewed with a mixture of admiration but also suspicion. The Emperor Julian said of the early Christians 'These godless Galileans feed our poor in addition to their own.’\n\nThe writer Aristedes wrote with some bemusement:\n\n'They do not keep for themselves the goods entrusted to them. They do not covet what belongs to others. They show love to their neighbours … Everyone of them who has anything gives ungrudgingly to the one who has nothing.’\n\nSo even by their detractors, the early Christians were seen as a group who looked beyond themselves. As our lesson from the Acts of the Apostles tells us, they were a community that also had a deep love for one another, sharing resources.\n\nIn more recent times, a former Archbishop of Canterbury, Archbishop William Temple described the Church as:\n\n'the only organisation in the world that exists for the benefit of those outside its membership.’\n\nThe Church is of course a very different organisation to the early years when it was often an underground organisation within the Roman Empire. The institutional Church of our own day does not face the same external pressures of the early Church and that can impact on how we see ourselves, how others see us. Do we see ourselves, do others see us as a sort of holy huddle? We have these wonderful buildings bequeathed to us by previous generations, we have our traditions – does the preservation of our buildings, the preservation of our traditions (which are not bad things in themselves) maybe sometimes divert our attention from our core purpose, to bear witness in word and deed to the Christ we seek to serve.\n\nIn our second reading, from the Sermon on the Mount, Jesus present his hearers with two models of life and witness, those of light and salt. Light essentially flows out from its source. That in itself is a warning against any sort of insular, inward looking approach on our part. We are here to shed the light of Christ on the world. Our buildings, our traditions are servants of that core purpose, not its masters.\n\nSalt is there to be mixed. I recall when we began talking of a policy for Youth Work in the Parish, as we recognised the many other organisations that competed for the attention and commitment of our young people, we came to the conclusion we did not want to seek to withdraw our young people from the Yacht Club, the Rugby Club but rather they would take part in the activities of those organisations confident and comfortable in their Christian commitment, that would see their faith as something to be lived out in the world, the world of school, of employment, of recreation rather than in isolation from the world.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/2011 - just people/April 14 2011.txt",
        "raw_ocr_content": "Page 1 of 4\nLent 2011 – 14th April 2011\nActs 2:42-46\n42 They devoted themselves to the apostles' teaching and fellowship,\nto the breaking of bread and the prayers.\nAc 2:43 Life among the Believers\nAwe came upon everyone, because many wonders and signs were\nbeing done by the apostles. 44 All who believed were together and\nhad all things in common; 45 they would sell their possessions and\ngoods and distribute the proceeds to all, as any had need. 46 Day by\nday, as they spent much time together in the temple, they broke bread\nat home and ate their food with glad and generous hearts, 47 praising\nGod and having the goodwill of all the people. And day by day the\nLord added to their number those who were being saved.\nMt 5:13=16\nMt 5:13 Salt and Light\n\"You are the salt of the earth; but if salt has lost its taste, how can\nits saltiness be restored? It is no longer good for anything, but is\nthrown out and trampled under foot.\nMt 5:14 \"You are the light of the world. A city built on a hill cannot be\nhid. 15 No one after lighting a lamp puts it under the bushel basket,\nbut on the lampstand, and it gives light to all in the house. 16 In the\nsame way, let your light shine before others, so that they may see\nyour good works and give glory to your Father in heaven.\nOver the last few weeks of this season of Lent we have taken as a recurring\ntheme the injunction that we find in the Book of the Prophet Micah:\nMic 6:8 He has told you, O mortal, what is good;\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God?\nPage 2 of 4\nLent 2011 – 14th April 2011\nWe have recognized at each stage in our thoughts the requirement to look out\nfrom ourselves. A willingness to recognize the poor and marginalized among\nus, a willingness to stand alongside them, that willingness to stand alongside\nthem extending into a compassion a compassion, to identify not just with them\nbut with their situation. That will have implications in how we run our society,\nso last week we recognized that this will have implications in our politics, the\nissues we regard as priorities in our national life.\nTonight we look at what this means for the Church. To ask of ourselves, how\ndo we think we are looked upon by those outside the Church, how do we view\nourselves.\nIn the ancient world the Church was viewed as a very different organization\nto the society in which it was set, in that Christians refused to see their\ndevotion to Christ as one religious commitment that could be expressed along\nwith a devotion to the local gods. This meant that it was viewed with a mixture\nof admiration but also suspicion. The Emperor Julian said of the early\nChristians\n‘These godless Galileans feed our poor in addition to their own.’\nThe writer Aristedes wrote with some bemusement:\n‘They do not keep for themselves the goods entrusted to them. They do\nnot covet what belongs to others. They show love to their neighbours ….\nThey speak gently to those who oppress them, and in this way they make\nthem their friends … Everyone of them who has anything gives\nungrudgingly to the one who has nothing.’\nPage 3 of 4\nLent 2011 – 14th April 2011\nSo even by their detractors, the early Christians were seen as a group who\nlooked beyond themselves. As our lesson from the Acts of the Apostles\ntells us, they were a community that also had a deep love for one another,\nsharing resources.\nIn more recent times, a former Archbishop of Canterbury, Archbishop\nWilliam Temple described the Church as:\n‘the only organisation in the world that exists for the benefit of those\noutside its membership.’\nThe Church is of course a very different organisation to the early years\nwhen it was often an underground organisation within the Roman Empire.\nThe institutional Church of our own day does not face the same external\npressures of the early Church and that can impact on how we see\nourselves, how others see us. Do we see ourselves, do others see us as a\nsort of holy huddle? We have these wonderful buildings bequeathed to us\nby previous generations, we have our traditions – does the preservation of\nour buildings, the preservation of our traditions (which are not bad things\nin themselves) maybe sometimes divert our attention from our core\npurpose, to bear witness in word and deed to the Christ we seek to serve.\nIn our second reading, from the Sermon on the Mount, Jesus present his\nhearers with two models of life and witness, those of light and salt. Light\nessentially flows out from its source. That in itself is a warning against\nPage 4 of 4\nLent 2011 – 14th April 2011\nany sort of insular, inward looking approach on our part. We are here to\nshed the light of Christ on the world. Our buildings, our traditions are\nservants of that core purpose, not its masters.\nSalt is there to be mixed. I recall when we began talking of a policy for\nYouth Work in the Parish, as we recognised the many other organisations\nthat competed for the attention and commitment of our young people, we\ncame to the conclusion we did not want to seek to withdraw our young\npeople from the Yacht Club, the Rugby Club but rather they would take\npart in the activities of those organisations confident and comfortable in\ntheir Christian commitment, that would see their faith as something to be\nlived out in the world, the world of school, of employment, of recreation\nrather than in isolation from the world."
    }
}