{
    "title": "Ash Wednesday 2014",
    "date": "2014-03-05",
    "blurb": "This sermon discusses the human emotion of guilt and its potential to be a positive influence in challenging behaviors and attitudes. It also talks about the debilitating effects of unresolved guilt. The sermon uses Psalm 51, associated with David's guilt over his affair with Bathsheba, to illustrate the idea of new beginnings built on honesty before God.",
    "raw_text": "ASH WEDNESDAY 2014\n\nHave you ever felt guilty? Have you ever looked back at something said, something done – and even long after the event, we have cringed at the very thought of it. That is a very common human emotion. Guilt, feelings of guilt, can have a very positive influence in challenging behaviors, attitudes towards other people – it can be an agent of change. But that is not really what I am talking about. – guilt left unresolved, not addressed or attended to can be debilitating, even destructive, leaving us with feelings of unworthiness, even self loathing that can spill over into our dealings with others, our attitudes to others.\n\nOur psalm for this evening, Psalm 51 is traditionally associated with David and his feelings of guilt over his adulterous affair with Bathsheba, his consigning of her husband Uriah to certain death on the battlefield. As we read through the psalm we sense something of his pain, his regrets, his recognition of the enormity of what he has done.\n\nI also sense a recognition that God’s will for him is better that this but only God can give him the release, the healing, the new beginning that will enable this.\n\nIn the course of confirmation classes I will often undertake an exercise with the class designed to draw out this idea of new beginnings built on our honesty before God. I give each person a piece of paper and a pen and I ask them to note down in a few words something they regret – they don’t show it to any one and certainly not to me – this is between them and God. And then one by one we burn them and as we mix up the ashes, I remark that those things have gone, they cannot read them, no-one else can read them – it is an illustration of the completeness of God’s forgiveness. All that is now in the past, we now move into the future.\n\nGod still had a role for David – but it was a humbler, more contrite David that went forward in God’s service.\n\nThe Collect for Ash Wednesday, which we will use each Sunday in Lent, draws together the key elements of God’s healing reconciling love.\n\n> Almighty and everlasting God,\n> you hate nothing that you have made\n> and forgive the sins of all those who are penitent:\n\n'God saw all that he had made – and behold it was very good.' God is love and God’s purposes towards us are those of love. But love must be received, love must be returned.\n\nOne of the ancient mystics observed\n\n> God made us without our help – but he cannot redeem us with out our consent.\n\nAnd so we pray for change – not in God but in ourselves.\n\n> Create and make in us new and contrite hearts\n> that we, worthily lamenting our sins\n> and acknowledging our wretchedness,\n\nAt various stages in the story, the prophets talk of God putting a new heart in his people, of God’s law written on the hearts of his people. So we pray not just for a new start but for a new creation – in and through us, that God may take us and use us as we are, in all our frailty.\n\nSo that we\n\n> may receive from you, the God of all mercy,\n> perfect remission and forgiveness;\n> through Jesus Christ our Lord.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/ashwednesday2014.txt",
        "raw_ocr_content": "Page 1 of 3\nASH WEDNESDAY 2014\nHave you ever felt guilty? Have you ever looked back at something said,\nsomething done – and even long after the event, we have cringed at the very\nthought of it.\nThat is a very common human emotion. Guilt, feelings of guilt, can have a\nvery positive influence in challenging behaviours, attitudes towards other\npeople – it can be an agent of change.\nBut that is not really what I am talking about. – guilt left unresolved, not\naddressed or attended to can be debilitating, even destructive, leaving us with\nfeelings of unworthiness, even self loathing that can spill over into our dealings\nwith others, our attitudes to others.\nOur psalm for this evening, Psalm 51 is traditionally associated with David and\nhis feelings of guilt over his adulterous affair with Bathsheba, his consigning of\nher husband Uriah to certain death on the battlefield. As we read through the\npsalm we sense something of his pain, his regrets, his recognition of the\nenormity of what he has done.\nI also sense a recognition that God’s will for him is better that this but only\nGod can give him the release, the healing, the new beginning that will enable\nthis.\nIn the course of confirmation classes I will often undertake an exercise with the\nclass designed to draw out this idea of new beginnings built on our honesty\nbefore God. I give each person a piece of paper and a pen and I ask them to\nPage 2 of 3\nASH WEDNESDAY 2014\nnote down in a few words something they regret – they don’t show it to any\none and certainly not to me – this is between them and God. And then one by\none we burn them and as we mix up the ashes, I remark that those things have\ngone, they cannot read them, no-one else can read them – it is an illustration of\nthe completeness of God’s forgiveness. All that is now in the past, we now\nmove into the future.\nGod still had a role for David – but it was a humbler, more contrite David that\nwent forward in God’s service.\nThe Collect for Ash Wednesday, which we will use each Sunday in Lent,\ndraws together the key elements of God’s healing reconciling love.\nAlmighty and everlasting God,\nyou hate nothing that you have made\nand forgive the sins of all those who are penitent:\n‘God saw all that he had made – and behold it was very good.’ God is love and\nGod’s purposes towards us are those of love. But love must be received, love\nmust be returned.\nOne of the ancient mystics observed\nGod made us without our help – but he cannot redeem us with out our consent.\nAnd so we pray for change – not in God but in ourselves.\nCreate and make in us new and contrite hearts\nthat we, worthily lamenting our sins\nand acknowledging our wretchedness,\nPage 3 of 3\nASH WEDNESDAY 2014\nAt various stages in the story, the prophets talk of God putting a new heart in\nhis people, of God’s law written on the hearts of his people. So we pray not\njust for a new start but for a new creation – in and through us, that God may\ntake us and use us as we are, in all our frailty.\nSo that we\nmay receive from you, the God of all mercy,\nperfect remission and forgiveness;\nthrough Jesus Christ our Lord."
    }
}