{
    "title": "Encouragement in Faith: St. Barnabas",
    "date": "2012-06-10",
    "blurb": "Kevin's sermon on St. Barnabas Day emphasizes the importance of encouragement within the Christian community. He reflects on the life of Barnabas, an early church figure known as the 'son of encouragement', and how his actions exemplify the supportive spirit that should permeate Christian fellowship. The sermon calls for emulation of Barnabas's example by offering comfort and challenging each other to live up to our Christian values.",
    "raw_text": "One of the features of the worship of the Church of Ireland is our use of the liturgical year. There are the seasons of Advent, Christmas, Epiphany, Lent, Easter, and Trinity. These seasons encourage us to focus on particular aspects of our faith story. At Christmas, we focus on the Incarnation, the mystery of God made man in the person of Jesus; on Good Friday and Easter, we focus on redemption; at Pentecost, our attention turns to the activity of the Holy Spirit. And then, dotted among these, there are a number of days designated as Saints' Days when we remember with thanksgiving the work of particular individuals.\n\nTomorrow is one such day in the Christian calendar when we honor the name of Barnabas. Barnabas, like Paul, was not one of the original apostles but, nonetheless, played an important part in the growth of the early Church. We first come across him in the Acts of the Apostles, as one of those who sold their possessions and brought the proceeds to the Apostles to distribute to those who had need.\n\nJoseph, a Levite from Cyprus, was named Barnabas by the Apostles, a name meaning a son of encouragement. Encouragement was certainly one of the hallmarks of his own discipleship. It was he who introduced Paul to the disciples in Jerusalem after his conversion on the Damascus Road. When word came that the Gospel was being preached to the Gentiles at Antioch, it was Barnabas who the disciples sent from Jerusalem to check on what was going on. We often refer to the missionary journeys of Paul, but at the outset, it was Barnabas, accompanied by Paul, who first embarked on these journeys though Paul quickly became the more prominent of the two. It was Paul and Barnabas who went to the Council in Jerusalem to defend the mission to the Gentiles in the face of those in the Church at Jerusalem who sought to undermine it. The split with Paul came when he insisted that his nephew Mark accompany them on their journeys. Paul refused and they went their separate ways. He is traditionally credited with the foundation of the Church in his native Cyprus and met his death at Salamis.\n\nIt is as Barnabas as encourager that I want to continue my thoughts this morning. The New Testament refers to the Church as the Body of Christ and so community lies at the heart of our understanding of ourselves. We are not just a group of individuals who happen to meet at a mutually convenient time. We are, in words of a colleague I have often quoted before, a 'community of friends drawn together by the friendship of Jesus'. So within that understanding, encouragement is a vital element in our relationships with one another. So how does that work out in practice.\n\nSo let us go back to James the Levite from Cyprus and the name that the Apostles gave him, Barnabas, son of encouragement. Now if we follow the use of that word through the New Testament, and the different ways in which it is translated in our Bibles, we begin to get a feel of what is meant to be an encourager of one another in the fellowship of the Church.\n\nWe come across it in that lovely passage in Paul's letter to the Philippians, \"If then there is any encouragement in Christ, any consolation from love, any sharing in the Spirit, any compassion and sympathy.\" Our primary inspiration comes from our fellowship in faith with Christ himself. He is our model, our pattern for life in the world and with one another. He is the one who touched the leper when those around banished them from their villages, who healed the sick. So a large part of our encouragement of one another will be through our compassion for one another, bringing comfort and consolation to one another. It is in these terms that Paul writes to the Church at Corinth, \"the God of all consolation, who consoles us in all our affliction, so that we may be able to console those who are in any affliction with the consolation with which we ourselves are consoled by God.\"\n\nEncouragement does not just take the form of sympathy. There is also the element of challenge to live up to our Christian profession. In the course of his journeys, Paul and his companions became aware of a situation of great need in the Church in Jerusalem. Later on in this same second letter to the Church at Corinth, he refers to the great generosity shown by other Churches in the matter of this collection. He challenges them, who pride themselves on the vitality of their faith, to show the fruits of that faith in their generosity.\n\nSo the Church honors the memory of James, the Levite from Cyprus, Barnabas, the 'son of encouragement'. The one who opened doors for Gentiles to join the Church, who encouraged the disciples to trust Saul of Tarsus, who stood by his nephew Mark in the face of what he saw as unjust treatment. As we honor his memory, let us as sons and daughters of encouragement, not only admire him but seek to emulate him in our own Christian pilgrimage, bringing comfort to those in need and by our own example calling others to more faithful service of our Lord and Saviour Jesus Christ.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/barnabas2012.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 6 – as for St Barnabas – 2012\nOne of the features of the worship of the Church of Ireland is our use of the\nliturgical year. There are the seasons of Advent, Christmas, Epiphany, Lent,\nEaster and Trinity. These seasons encourage us to focus on particular aspects\nof our faith story. At Christmas we focus on the Incarnation, the mystery of\nGod made man in the person of Jesus; on Good Friday and Easter we focus on\nredemption; at Pentecost our attention turns to the activity of the Holy Spirit.\nAnd then, dotted among these, there are a number of days designated as Saints’\nDays when we remember with thanksgiving the work of particular individuals.\nI think of St Peter, St Paul, St Patrick. We have no tradition of intercession to\nthe saints but they are honoured as sources of inspiration to us on our Christian\npilgrimage.\nTomorrow is one such day in the Christian calendar when we honour the name\nof Barnabas. Barnabas, like Paul, was not one of the original apostles but,\nnone the less, played an important part in the growth of the early Church. We\nfirst come across him in the Acts of the Apostles, as one of those who sold\ntheir possessions and brought the proceeds to the Apostles to distribute to those\nwho had need.\nJoseph, a Levite from Cyprus, was named Barnabas by the Apostles, a name\nmeaning a son of encouragement. Encouragement was certainly one of the hall\nmarks of his own discipleship. It was he who introduced Paul to the disciples\nin Jerusalem after his conversion on the Damascus Road. When word came\nthat the Gospel was being preached to the Gentiles at Antioch, it was Barnabas\nwho the disciples sent from Jerusalem to check on what was going on. We\noften refer to the missionary journeys of Paul, but at the outset it was Barnabas,\nPage 2 of 4\nProper 6 – as for St Barnabas – 2012\naccompanied by Paul, who first embarked on these journeys though Paul\nquickly became the more prominent of the two. It was Paul and Barnabas who\nwent to the Council in Jerusalem to defend the mission to the Gentiles in the\nface of those in the Church at Jerusalem who sought to undermine it. The split\nwith Paul came when he insisted that his nephew Mark accompany them on\ntheir journeys. Paul refused and they went their separate ways. He is\ntraditionally credited with the foundation of the Church in his native Cyprus\nand met his death at Salamis.\nIt is as Barnabas as encourager that I want to continue my thoughts this\nmorning. The New Testament refers to the Church as the Body of Christ and\nso community lies at the heart of our understanding of ourselves. We are not\njust a group of individuals who happen to meet at a mutually convenient time.\nWe are, in words of a colleague I have often quoted before, a ‘community of\nfriends drawn together by the friendship of Jesus’. So within that\nunderstanding, encouragement is a vital element in our relationships with one\nanother. So how does that work out in practice.\nSo let us go back to James the Levite from Cyprus and the name that the\nApostles gave him, Barnabas, son of encouragement. ‘uiJo;\" paraklhvsew\"’.\nNow if we follow use of that word paraklesi\" through the New Testament, and\nthe different ways in which it is translated in our Bibles we begin to get a feel\nof what is meant to be an encourager of one another in the fellowship of the\nChurch.\nPage 3 of 4\nProper 6 – as for St Barnabas – 2012\nWe come across it in that lovely passage in Paul’s letter to the Philippians,\nIf then there is any encouragement in Christ, any consolation from\nlove, any sharing in the Spirit, any compassion and sympathy, Phil 2:1\nOur primary inspiration comes from our fellowship in faith with Christ himself.\nHe is our model, our pattern for life in the world and with one another. He is\nthe one who touched the leper when those around banished them from their\nvillages, who healed the sick. So a large part of our encouragement of one\nanother will be through our compassion for one another, bringing comfort and\nconsolation to one another. It is in these terms that Paul writes to the Church at\nCorinth.\nthe God of all consolation, 4 who consoles us in all our affliction, so\nthat we may be able to console those who are in any affliction with the\nconsolation with which we ourselves are consoled by God. 2 Cor 1:3,4\nWe who have known God’s love and consolation in our own times of difficulty\nare called to show that same love and consolation to those around us.\nEncouragement does not just take the form of sympathy. There is also the\nelement of challenge to live up to our Christian profession. In the course of his\njourneys Paul and his companions became aware of a situation of great need in\nthe Church in Jerusalem. Later on in this same second letter to the Church at\nCorinth he refers to the great generosity shown by other Churches in the matter\nof this collection. He challenges them, who pride themselves on the vitality of\ntheir faith, to show the fruits of that faith in their generosity.\n3 For, as I can testify, they voluntarily gave according to their means,\nand even beyond their means, 4 begging us earnestly (lit with great\nencouragement) for the privilege of sharing in this ministry to the\nsaints ……\nPage 4 of 4\nProper 6 – as for St Barnabas – 2012\n7 Now as you excel in everything--in faith, in speech, in knowledge, in\nutmost eagerness, and in our love for you--so we want you to excel\nalso in this generous undertaking. 2 Cor 8:3,4,7\nSo the Church honours the memory of James, the Levite from Cyprus,\nBarnabas, the ‘son of encouragement’. The one who opened doors, for\nGentiles to join the Church, who encouraged the disciples to trust Saul of\nTarsus, who stood by his nephew Mark in the face of what he saw as unjust\ntreatment. As we honour his memory, let us as sons and daughters of\nencouragement, not only admire him but seek to emulate him in our own\nChristian pilgrimage, bringing comfort to those in need and by our own\nexample calling others to more faithful service of our Lord and Saviour Jesus\nChrist."
    }
}