{
    "title": "Funeral of Dorrie MacCann",
    "date": "2021-04-15",
    "blurb": "This sermon is a tribute to Dorrie MacCann, a devoted wife, mother, and grandmother, and a central figure in her parish. Despite the challenges she faced in her later years, her faith remained strong. Her life is celebrated and her contributions to her family and community are remembered fondly.",
    "raw_text": "Funeral of Dorrie MacCann – Howth – 15th April 2021\n\nDorrie MacCann – where do we begin? Norman, Lyndon, Adrian and Melanie and their families remember a devoted wife, mother, grandmother – a rock in all their lives. We as a Parish remember one who was at the very heart of this place. First and foremost, regular in public worship. Her worship of Almighty God here each Sunday was an essential element of her weekly routine. In the full of their health, Norman and Dorrie would have been here every Sunday – apart of course from the holidays they enjoyed together. A faith that worked itself out in so many ways in individual acts of care to wider family and community.\n\nMy memories of Dorrie would have been of her energy, her striding around the place as she delivered her bundle of Newsletters, the wonderful hospitality she offered as she organised the coffee after the midweek service. For my one appearance on stage for the Burrow players, she prompted those of us who maybe were not as quick on our lines as we might have been. Then of course, Dorrie and Norman made a great team; Dorrie at Norman’s side in the Burrow Players, in the St Mary’s Golf. Both providing a warm welcome to any who might call on their home. I for one will always be grateful for the ways in which Dorrie and Norman made Rachel and I feel at home in this place. And of course that gorgeous laugh that conveyed the generous humour with which she did all these things.\n\nI’m sure those of you watching this service online will have your own fond memories of Dorrie. I invite you all, both family here in Church and those of you watching online to bring your own particular memories of Dorrie before God and thank God for all that she has meant, and will continue to mean to you.\n\nFor Dorrie, for one so full of energy these last few years have been difficult as her loss of mobility meant she could no longer stride around the place, engage in all those activities she enjoyed. The simple act of coming to Church, the worship, the chat afterwards in the Hall all became too much. Then the point came when she and Norman could no longer remain in the house and home they had built together. Through this period of transition she and Norman had the support of Melanie and her brothers – that in itself must have been hard for you her family.\n\nOn an occasion such as this, I often find myself searching for a verse of scripture that draws my thoughts together. I found myself turning to the First Letter to Timothy. The Apostle gives his advice to the younger man:\n\n> But as for you, man of God, pursue righteousness, godliness, faith, love, endurance, gentleness. 12 Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Tim 6:11 ff\n\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This seems to me to draw together so many of the memories of Dorrie MacCann that I came to know, that I know so many of you remember today with love and affection. Dorrie has fought the good fight and now is at peace\n\nWe come to set the mystery of death in the context of our Christian faith. We have just celebrated the Festival of Easter, the triumph of life over death. We have heard once against the Gospel accounts of disciples devastated by the death of Jesus, huddled together in the upper room. We have heard of those same disciples transformed by an encounter with he risen Jesus, that they can only understand in terms of resurrection; an encounter that broke through the darkness of loss and regrets in the words of that simple greeting; ‘Peace be with you.’\n\nSo, today, on the day of her funeral we declare that darkness, death has not had the last word in the life of Dorrie MacCann. Sickness, weakness has not had the final say. In fellowship with Dorrie, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nA passage I often find myself turning to at a time of a funeral is from St Paul's second letter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home.\n\nThe words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Dorrie MacCann this day, that all the limitations of these latter years, the frailty, along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ in the closer presence of our heavenly Father.\n\nSo today we gather to thank God for Dorrie MacCann, for the many different ways she touched our lives, for her love, her gentle humour, her quiet courage in the face of developing illness, her faithfulness in the tasks to which God called her. We come to pray for her family, for Norman, for Melanie, Lyndon and Adrian, her grandchildren and for all who loved him.\n\nWe gather to set her life and our lives in the context of our faith in a loving and living God as we commend Dorrie, loving wife, mother, grandmother, friend, wonderful human being into the hands of a loving heavenly Father.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Dorrie MacCann.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Dorrie MacCann – Howth – 15th April 2021\nDorrie MacCann – where do we begin?\nNorman, Lyndon, Adrian and Melanie and their families remember a devoted\nwife, mother, grandmother – a rock in all their lives. We as a Parish remember\none who was at the very heart of this place. First and foremost, regular in\npublic worship. Her worship of Almighty God here each Sunday was an\nessential element of her weekly routine. In the full of their health, Norman and\nDorrie would have been here every Sunday – apart of course from the holidays\nthey enjoyed together. A faith that worked itself out in so many ways in\nindividual acts of care to wider family and community.\nMy memories of Dorrie would have been of her energy, her striding around the\nplace as she delivered her bundle of Newsletters, the wonderful hospitality she\noffered as she organised the coffee after the midweek service. For my one\nappearance on stage for the Burrow players, she prompted those of us who\nmaybe were not as quick on our lines as we might have been. Then of course,\nDorrie and Norman made a great team; Dorrie at Norman’s side in the Burrow\nPlayers, in the St Mary’s Golf. Both providing a warm welcome to any who\nmight call on their home. I for one will always be grateful for the ways in\nwhich Dorrie and Norman made Rachel and I feel at home in this place. And of\ncourse that gorgeous laugh that conveyed the generous humour with which she\ndid all these things.\nI’m sure those of you watching this service online will have your own fond\nmemories of Dorrie. I invite you all, both family here in Church and those of\nyou watching online to bring your own particular memories of Dorrie before\nPage 2 of 4\nFuneral of Dorrie MacCann – Howth – 15th April 2021\nGod and thank God for all that she has meant, and will continue to mean to\nyou.\nFor Dorrie, for one so full of energy these last few years have been difficult as\nher loss of mobility meant she could no longer stride around the place, engage\nin all those activities she enjoyed. The simple act of coming to Church, the\nworship, the chat afterwards in the Hall all became too much. Then the point\ncame when she and Norman could no longer remain in the house and home\nthey had built together. Through this period of transition she and Norman had\nthe support of Melanie and her brothers – that in itself must have been hard for\nyou her family.\nOn an occasion such as this, I often find myself searching for a verse of\nscripture that draws my thoughts together. I found myself turning to the First\nLetter to Timothy. The Apostle gives his advice to the younger man:\nBut as for you, man of God, pursue righteousness, godliness,\nfaith, love, endurance, gentleness. 12 Fight the good fight of the\nfaith; take hold of the eternal life, to which you were called and\nfor which you made the good confession in the presence of\nmany witnesses. 1 Tim 6:11 ff\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This\nseems to me to draw together so many of the memories of Dorrie MacCann\nthat I came to know, that I know so many of you remember today with love\nand affection. Dorrie has fought the good fight and now is at peace\nWe come to set the mystery of death in the context of our Christian faith. We\nhave just celebrated the Festival of Easter, the triumph of life over death. We\nPage 3 of 4\nFuneral of Dorrie MacCann – Howth – 15th April 2021\nhave heard once against the Gospel accounts of disciples devastated by the\ndeath of Jesus, huddled together in the upper room. We have heard of those\nsame disciples transformed by an encounter with he risen Jesus, that they can\nonly understand in terms of resurrection; an encounter that broke through the\ndarkness of loss and regrets in the words of that simple greeting; ‘Peace be\nwith you.’\nSo, today, on the day of her funeral we declare that darkness, death has not had\nthe last word in the life of Dorrie MacCann. Sickness, weakness has not had\nthe final say. In fellowship with Dorrie, we follow a Lord who knows what\ndeath, what suffering, what loss is all about; one who knew what it was like to\nweep at the grave of his friend Lazarus. Not only that, he is the one who was\nraised triumphant over death, breaking the power of death itself. Knowing in\nhis own person what it was all about, I find in him one to whom I cam come in\nmy own time of suffering and find real comfort, real strength and real hope.\nA passage I often find myself turning to at a time of a funeral is from St Paul's\nsecond letter to the Church at Corinth. the end of chapter 4 and the beginning\nof chapter 5. In this Paul presents us with the reality of our own mortality and\ndeath, he talks very plainly of the body wearing out. But just as he talks of the\nreality of physical decline and death, Paul talks of our new heavenly home.\nThe words that really stand out for me are ; \"So that what is mortal may be\nswallowed up by life.\" This is our hope for Dorrie MacCann this day, that all\nthe limitations of these latter years, the frailty, along with all the limitations\nthat go with being human are \"swallowed up by life\", that is our inheritance in\nChrist in the closer presence of our heavenly Father.\nPage 4 of 4\nFuneral of Dorrie MacCann – Howth – 15th April 2021\nSo today we gather to thank God for Dorrie MacCann, for the many different\nways she touched our lives, for her love, her gentle humour, her quiet courage\nin the face of developing illness, her faithfulness in the tasks to which God\ncalled her. We come to pray for her family, for Norman, for Melanie, Lyndon\nand Adrian, her grandchildren and for all who loved him.\nWe gather to set her life and our lives in the context of our faith in a loving and\nliving God as we commend Dorrie, loving wife, mother, grandmother, friend,\nwonderful human being into the hands of a loving heavenly Father."
    }
}