{
    "title": "Belonging and Service",
    "date": "2013-04-07",
    "blurb": "In this sermon, the Rector reflects on his time in Howth and the importance of a sense of belonging in Parish life. He discusses the development of youth work and the contributions of various youth workers. He concludes by announcing new appointments within the Parish.",
    "raw_text": "In his address, the Rector remarked that, apart from the 16 years he spent in Ahoghill & Portglenone, his period in Howth was the longest he had spent in any one Parish in the course of his ministry in the Church of Ireland. Reflecting on initiatives in the Diocese, he spoke of the importance of a sense of belonging in Parish life, a belonging to God and a belonging to one another, a concept that is embedded in the services of Baptism and Holy Communion.\n\nHe went on to speak of the development of our Youth work, and the distinctive contribution that each of our Youth Workers have brought to this position. He then thanked the various people who have worked so hard in a voluntary capacity in the service of the Parish.\n\nHe concluded his address in announcing that Mr Eddie Kerr had agreed to act as Rector’s Church Warden for the coming year and that Stephen Shaw had agreed to act as Glebe Warden.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/eastervestry2013 = summary.txt",
        "raw_ocr_content": "In his address the Rector remarked that, apart from the 16 years he spent in Ahoghill & Portglenone, his\nperiod in Howth was the longest he had spent in any one Parish in the course of his ministry in the\nChurch of Ireland. Reflecting on initiatives in the Diocese, he spoke of the importance of a sense of\nbelonging in Parish life, a belonging to God and a belonging to one another , a concept that is imbedded\nin the services of Baptism and Holy Communion.\nHe went on to speak of the development of our Youth work, and the distinctive contribution that each of\nour Youth Workers have brought to this position. He then thanked the various people who have worked\nso hard in a voluntary capacity in the service of the Parish.\nHe concluded his address in announcing that Mr Eddie Kerr had agreed to act as Rector’s Church Warden\nfor the coming year and that Stephen Shaw had agreed to act as Glebe Warden."
    }
}