{
    "title": "Easter Vestry 2021",
    "date": "2021-04-04",
    "blurb": "In this sermon, Kevin reflects on the challenges and resilience of the Parish during the pandemic. He acknowledges the hardships faced by all sectors of society and the impact on the Church's activities. Despite the difficulties, he highlights the care and engagement shown by the Parish members. As he prepares to move on, he expresses optimism for the future under new leadership.",
    "raw_text": "Funny how things come to our minds; as I was sitting down to a few words for our meeting tonight, the words of that song by Louis Armstrong drifted into my mind; 'What a wonderful world'\n\nBut of course this has been an awful year. Every sector of our society, every generation of our population has been affected. We owe a huge debt of gratitude to our health services, hospital and nursing home staff, GP’s, our front line workers, our Gardai and emergency workers, transport workers, the staff that have kept our supermarkets going, our undertakers, those who collected our bins – let us never take any of these for granted, ever again. Every generation has had to bear its share of the burden. I think of our young people who have lost so much of their education, our older people who have been confined to their homes. I for one, as I think of the freedom I had as a teenager and young student, am only now beginning to recognize the huge impact all this has had on that cohort, the loss of social interaction, the travel opportunities that we took for granted at that stage in our lives. Then of course the impact on employment, on those in the retail and hospitality sectors.\n\nThere has been a huge impact on the life of the Church. We have been shut down for longer than we have been open. We have lost Easter twice along with the many things that brought us together – the carol service, coffee after Church, the midweeks service and coffee; our Youth Club, Tuesday Club, Men’s Breakfast. Among the many deaths this year we lost stalwarts such as Anne Stanley, Dorrie MacCann and Fred Spendlove. We lost the Fete, the Christmas Concert, lovely community events that brought people together and of course the impact this has had on Parish finances.\n\nBut it has also been a wonderful year in that it has brought out a resilience in this Parish. I have been very aware of the care that people have shown to each other, the engagement I have seen with our online worship be it YouTube, Zoom or live streaming. The wonderful response to our financial appeals.\n\nAs we approach the end of lock down and our Church prepares to reopen for public worship, I am fundamentally optimistic about the future. But, and this is a big but, just as society will not be the same, commerce will be different, the work place will be different, so the Church will need to respond to these changed circumstances.\n\nAs I prepare to move on, I am more and more convinced that this is probably a very good time for a change in leadership. We’ve come through the crisis as well and probably better than most parishes having learned a lot over the last 12 months. Now is the time to build on that. Whoever comes after me will bring fresh vision, different perspectives, a different style. I wish you well, as under a new Rector, whoever she or he may be, you embark on the next chapter of the history of this Parish.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/Easter Vestry 2021.txt",
        "raw_ocr_content": "Page 1 of 2\nEASTER GENERAL VESTRY – online reports - 2020\nFunny how things come to our minds; as I was sitting down to a few words for our meeting tonight, the words of that song by\nLouis Armstrong drifted into my mind; ‘What a wonderful world’\nBut of course this has been an awful year. Every sector of our society, every generation of our population has been affected.\nWe owe a huge debt of gratitude to our health services, hospital and nursing home staff, GP’s, our front line workers, our\nGardai and emergency workers, transport workers, the staff that have kept our supermarkets going, our undertakers, those who\ncollected our bins – let us never take any of these for granted, ever again. Every generation has had to bear its share of the\nburden. I think of our young people who have lost so much of their education, our older people who have been confined to\ntheir homes. I for one, as I think of the freedom I had as a teenager and young student, am only now beginning to recognise\nthe huge impact all this has had on that cohort, the loss of social interaction, the travel opportunities that we took for granted at\nthat stage in our lives. Then of course the impact on employment, on those in the retail and hospitality sectors.\nThere has been a huge impact on the life of the Church. We have been shut down for longer than we have been open. We\nhave lost Easter twice along with the many thangs that brought us together – the carol service, coffee after Church, the\nmidweeks service and coffee; our Youth Club, Tuesday Club, Men’s Breakfast. Among the many deaths this year we lost\nstalwarts such as Anne Stanley, Dorrie MacCann and Fred Spendlove. We lost the Fete, the Christmas Concert, lovely\ncommunity events that brought people together and of course the impact this has had on Parish finances.\nBut it has also been a wonderful year in that it has brought out a resilience in this Parish. I have been very aware of the care\nthat people have shown to each other, the engagement I have seen with our online worship be it YouTube, Zoom or live\nstreaming. The wonderful response to our financial appeals.\nAs we approach the end of lock down and our Church prepares to reopen for public worship, I am fundamentally optimistic\nabout the future. But, and this is a big but, just as society will not be the same, commerce will be different, the work place will\nbe different, so the Church will need to respond to these changed circumstances.\nAs I prepare to move on, I am more and more convinced that this is probably a very good time for a change in leadership.\nWe’ve come through the crisis as well and probably better than most parishes having learned a lot over the last 12 months.\nNow is the time to build on that. Whoever comes after me will bring fresh vision, different perspectives, a different style. I\nwish you well, as under a new Rector, whoever she or he may be, you embark on the next chapter of the history of this Parish.\nAs is customary, I want to thank a number of people who have served the Parish over the last year. I thank the outgoing\nChurch Wardens, Mr Denis Headon, who has served as People’s Church Warden, and Mr Eddie Kerr, who served as Rector’s\nChurch Warden. Eddie has indicated that, after many years of service to the Parish of Howth that he now wishes to stand\ndown. On behalf of the Parish I want to say a sincere thank you to Eddie for all that he has done – but Eddie assures us that he\nhasn’t gone away and will be available to give a helping hand.\nI would like to thank the outgoing Select Vestry for their continued commitment. This has been a very challenging year. The\noutgoing Select Vestry have provided real leadership as we have navigated our way through lockdown, in the provision of\nlivestreaming services and the handling of our financial resources and all the other issues that accompanied successive\nlockdowns and reopenings of our Church for Public Worship. It has been my experience of all Select Vestries during my time\nthat issues have been debated thoroughly, all options considered and decisions arrived at after mature reflection – and we still\nmanage to smile! I speak of Garrett Wren who has continued to act as Secretary of our Select Vestry. For a second year\nGarrett took on the task of arranging our voting procedures when we frankly did not have a notion as to how many, if any,\nwould be allowed to assemble. He adopted the same procedures that he had developed for last year. As he did last year he\nbrought a thoroughness and sensitivity with which they were operated with that same cheerful efficiency he brings to both his\nprofessional life and his service of the Church. I want to pay a special tribute to Tadhg in his continuing stewardship of our\nfinances as Treasurer. This last year has been a Treasurer’s nightmare. A Treasurer is more than just a book keeper, he has the\ntask of planning for the future. In the midst of very heavy professional commitments Tadhg has given very clear leadership in\nguiding us through the very difficult and challenging decisions that both the outgoing and incoming Select Vestries have and\nwill have to make to ensure both the long term mission and the long term financial stability of the Parish. Peter Harding has\nassumed the role of Rector’s Glebe Warden and he had brought a characteristic thoroughness honed in years of outside\nbroadcasts with RTE and is tackling a number of outstanding issues.\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will Offering Envelopes. I would also like to take\nthis opportunity of thanking those who contribute through this scheme or through standing order. Details of how you can\nparticipate in this are to be found at the foot of any email you receive from the Parish.\nI would like to thank Randal Henly for his continued service as organist. I know he has missed leading the choir in our singing\nbut he has provided reflective music to accompany our streamed services.\nPage 2 of 2\nEASTER GENERAL VESTRY – online reports - 2020\nI would like to thank our Youth Worker Elke for all her work as Youth Worker in our Parish. She has been an invaluable help\nin preparing our young people for Confirmation. She has brought her wonderful gifts to bear on using modern technology to\nhelp our young people stay connected and to participate in our online and YouTube worship. She has certainly been a huge\nhelp to me in developing my skills. Sadly the time has come for her to leave us as her husband Marcus prepares to return to\nGermany to take up a new position with Tearfund. Like me, she will be leaving at the end of June. We have been very\nfortunate in our Youth Workers over the years but Elke has been exceptional and I will count my years working with her as\none of the highlights of my years in ministry.\nThe Garden Gang continues to thrive under the leadership, or should I say command, of Lorna Hopkins – new faces very\nwelcome. Thank you also for Derek Fennell and the team for mowing the grass. Again, new faces welcome.\nCathy Fennell continues to look after our Parish Centre. Most of the activities, the Bridge Club, the different activities for\nyoung people are simply not able to happen in the immediate future. Cathy has a wonderful can-do approach and I know that\nshe is trying to think of ways in which, in full compliance with regulations, at least some groups may resume activities.\nBaptisms 3\nMarriages 0\nDeaths Patrick Reilly, Paul Smeed, Susan Magann, Fred Spendlove, Anne Stanley, Lilian and Arthur O’Connor, Rosemary\nLatimer, Dorrie Mac Cann, Muriel MacMillan, Jon Mooney.\nGarrett Wren has agreed to act as Rector’s Church Warden and Peter Harding has agreed to act as Rector’s Glebe Warden."
    }
}