{
    "title": "Easter Vestry 2020",
    "date": "2020-04-12",
    "blurb": "This sermon is a powerful reminder of the blessings that come with being humble, merciful, and peace-loving. It emphasizes the importance of being pure in heart, hungering for righteousness, and enduring persecution for the sake of righteousness. The sermon concludes with a prayer for the church to be a welcoming place for all, yet strong against temptation.",
    "raw_text": "Collect of the Day\n\nAlmighty God,\nwho called your Church to bear witness\nthat you were in Christ reconciling the world to yourself:\nhelp us to proclaim the good news of your love,\nthat all who hear it may be drawn to you;\nthrough him who was lifted up on the cross,\nand reigns with you in the unity of the Holy Spirit,\none God, now and for ever.\n\nWhen Jesus saw the crowds, he went up the mountain; and after he sat down, his disciples came to him. Then he began to speak, and taught them, saying:\n\n>“Blessed are the poor in spirit, for theirs is the kingdom of heaven.\n>Blessed are those who mourn, for they will be comforted.\n>Blessed are the meek, for they will inherit the earth.\n>Blessed are those who hunger and thirst for righteousness, for they will be filled.\n>Blessed are the merciful, for they will receive mercy.\n>Blessed are the pure in heart, for they will see God.\n>Blessed are the peacemakers, for they will be called children of God.\n>Blessed are those who are persecuted for righteousness’ sake, for theirs is the kingdom of heaven.\n>Blessed are you when people revile you and persecute you and utter all kinds of evil against you falsely on my account. Rejoice and be glad, for your reward is great in heaven, for in the same way they persecuted the prophets who were before you.\n\nO God, make the door of this house\nWide enough to receive all who\nneed human love and fellowship;\nNarrow enough to shut put all envy, pride and strife.\nMake its threshold smooth enough\nto be no stumbling block to children, nor to straying feet,\nBut rugged and strong enough to turn back the tempter’s power.\nGod make the door of this house the gateway to thy divine kingdom.\nAmen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/Easter Vestry 2020 prayers.txt",
        "raw_ocr_content": "Collect of the Day\nAlmighty God,\nwho called your Church to bear witness\nthat you were in Christ reconciling the world to yourself:\nhelp us to proclaim the good news of your love,\nthat all who hear it may be drawn to you;\nthrough him who was lifted up on the cross,\nand reigns with you in the unity of the Holy Spirit,\none God, now and for ever.\nWhen Jesus saw the crowds, he went up the mountain; and after he sat down, his disciples\ncame to him. Then he began to speak, and taught them, saying:\n“Blessed are the poor in spirit, for theirs is the kingdom of heaven.\n“Blessed are those who mourn, for they will be comforted.\n“Blessed are the meek, for they will inherit the earth.\n“Blessed are those who hunger and thirst for righteousness, for they will be filled.\n“Blessed are the merciful, for they will receive mercy.\n“Blessed are the pure in heart, for they will see God.\n“Blessed are the peacemakers, for they will be called children of God.\n“Blessed are those who are persecuted for righteousness’ sake, for theirs is the kingdom of\nheaven.\n“Blessed are you when people revile you and persecute you and utter all kinds of evil\nagainst you falsely on my account. Rejoice and be glad, for your reward is great in heaven,\nfor in the same way they persecuted the prophets who were before you.\nO God, make the door of this house\nWide enough to receive all who\nneed human love and fellowship;\nNarrow enough to shut put all envy, pride and strife.\nMake its threshold smooth enough\nto be no stumbling block to children, nor to straying feet,\nBut rugged and strong enough to turn back the tempter’s power.\nGod make the door of this house the gateway to thy divine kingdom.\nAmen."
    }
}