{
    "title": "Tradition and Change",
    "date": "2012-04-15",
    "blurb": "In this sermon, Kevin reflects on the evolving nature of tradition within the church, emphasizing that change is not for its own sake but to adapt to the times while upholding the Gospel's timeless truths. He discusses initiatives to engage youth and maintain church traditions, acknowledging the contributions of various community members in supporting the church's growth and fellowship.",
    "raw_text": "Easter General Vestry - 15th April 2012\n\nAt last year's Easter General Vestry, Kevin reflected on Archbishop Jackson's Enthronement sermon, addressing the changing environment for proclaiming the Gospel in our generation. He discussed tradition as a living and developing phenomenon, with change not undertaken simply for its own sake.\n\nLater this month, the Archbishop is bringing the clergy together for a Forum to discuss Growth and Development. Rev George Lings, director of the Church Army Research Unit, will be the keynote speaker.\n\nKevin talks about the common experience of declining numbers in churches and initiatives to address these issues, such as the establishment of CORE and a parallel congregation in Rathmines.\n\nSt Mary's has initiated several projects to engage youth, including Youth Groups and services. However, funding is now limited, and the Youth project will continue on a reduced scale.\n\nSunday School has flourished with increased emphasis on worship participation, and new services like the Family Eucharist have been introduced to bridge traditional and contemporary styles.\n\nKevin thanks various community members for their contributions, including church wardens, the Select Vestry, and those involved in the Youth Project, Sunday School, and Parish Centre management. He also acknowledges the importance of fellowship within the church community.\n\nIn conclusion, Kevin announces new appointments for the coming year and reflects on the baptisms, weddings, and funerals he has performed, highlighting the ongoing life events within the church community.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Easter Vestry/eastervestry2012.txt",
        "raw_ocr_content": "Page 1 of 7\nEaster General Vestry -15th April 2012\nAt last year’s Easter General Vestry I reflected on Archbishop Jackson’s\nEnthronement sermon in which he addressed the changing environment in\nwhich the timeless truths of the Gospel are to be proclaimed in our own\ngeneration. He explored the idea of tradition as a living and developing\nphenomenon and change as not undertaken simply for the sake of change.\nLater this month the Archbishop is bringing the clergy of the Diocese together\nfor a Forum to discuss potential for Growth and Development at which the key\nnote speaker with be Rev George Lings, director of the Church Army Research\nUnit and member of the House of Bishops’ Working Party on Church Plants.\nThis Forum is taking place in the context of the changing environment in\nwhich the Church is now operating. Talking to colleagues in other parishes\nand in other denominations, there is a common experience of declining\nnumbers, absence of those in their teens, 20’s and 30’s. There has also been\nsome interesting initiatives to address these issues. Over 20 years ago we saw\nthe establishment of CORE, a new Church established within the family of the\nDiocese designed to reach out to those for whom the traditional Church\nstructures and worship patterns did not speak. The Parish of Rathmines has in\nthe last two years established a parallel congregation, sharing the same building\nbut offering a different style of Church in the Rathmines area.\nHere in St Mary’s we have taken a number of initiatives to address these issues\nin our own context. For the past three years we have been fortunate to have\nbenefitted from the services of our Youth Workers, initially Shaz Basdeo and\nfor the last two years, Stephen Byford. During this time we have seen the\nestablishment of two Youth Groups based here in St Mary’s along with a group\nPage 2 of 7\nEaster General Vestry -15th April 2012\nshared with Sutton Methodist Church. Stephen has also explored the whole\narea of Youth Services on an occasional basis on a Sunday evening. In\nresponse to requests from parents we have also moved the age for\nConfirmation preparation to 6th Class in National School. This has by and large\nworked well.\nThe establishment of the Youth Project was made possible by the interest we\nreceived on the sale of half the rectory site which was held on deposit prior to\nthe building of the new Rectory. This source of funding is now coming to an\nend and the Select Vestry have had to address the issue of our future strategy in\nour ministry to our young people. There was a unanimous view that we should\ncontinue but that this could only happen on a reduced scale. The Youth project\nteam have drawn up a reduced job description, identifying core elements that\nhave worked well. Stephen, after careful consideration, has indicated that this\narrangement will not be a practical proposition for him and so he will be\nleaving at the end of May. In his two years with us Stephen has earned the\naffection and respect of our young people, the parent body and the wider Parish\ncommunity and we thank him for all he has done and wish him well for the\nfuture. The revised position has been advertised and we would hope to\ninterview candidates in late May. We have also benefitted from a significant\nanonymous contribution which will enable the Select Vestry to continue\nfunding the Project on this reduced scale for a number of years.\nSunday School has continued to flourish under a collective leadership. We\nhave been encouraged by the way numbers have been maintained right up to\nEaster. One feature this year has been the increased emphasis on participation\nPage 3 of 7\nEaster General Vestry -15th April 2012\nin worship. Classes have been held in the Parish Centre on two Sundays of the\nmonth. There has been the long established Family Service, but in addition\nthere has been the introduction of the Family Eucharist. The purpose of this is\ntwo fold. One, it enables our Sunday School team to participate in the\nCommunion Service and secondly it provides our young people with a bridge\nbetween the Family Service and our other choral services of Morning Prayer\nand Holy Communion. Initiatives such as this do take time to settle down.\nThere was an issue at the beginning with noise but this has significantly\nimproved. Some do miss the choral elements at this service but others have\nexpressed an appreciation of the simpler style. I see this service as a work in\nprogress as we seek to provide a range of services that meet the needs of the\nwhole body of the parish. Last Sunday on Easter Day saw our two different\nstyles of service, using the same readings and by and large the same sermon.\nThere was the 9:30 service using the old communion liturgy and the 11:00\nwhich drew a large congregation of all ages. Each for me were wonderful acts\nof worship and bear witness to the place of tradition and innovation in the\nworshipping life of the Church. Last year I spoke of an ongoing dialogue\nbetween the tradition we have inherited and the evolving situation in which we\nfind ourselves called to witness to the Gospel in the time and place in which\nGod has placed us. The truth is no one group owns the worship of this place so\nit is important that the liturgical preferences of the whole family of the Church\nare reflected in the monthly cycle of our worship.\nFor the last 8 years our Church has benefitted from the talent and enthusiasm of\nFiona Henderson in her role of coordinating the floral decoration of the\nChurch. Fiona has brought her mixture of her skill, her enthusiasm,\nPage 4 of 7\nEaster General Vestry -15th April 2012\nimagination all coupled with that ability to encourage and enthuse others. she\nis now standing down and we are seeking others to continue her work. Until\nthat happens we may have to rely on artificial decorations. The best way we\ncan thank Fiona for her work over these last 8 years is in ensuring that the work\ngoes on.\nAs is customary, I want to thank a number of people who have served the\nParish over the last year. I thank the outgoing Church Wardens, Mrs Irene\nCollier, who has served for two years as Rector’s Church Warden, and Mrs\nFinola Young, who has served as People’s Church Warden, a position she has\nfilled this position for two years.\nI would like to thank the outgoing Select Vestry for their continued\ncommitment. I would like to thank two individuals for their particular ongoing\ncontribution. I speak of Audrey as she comes to the end of her first year as\nSecretary of our Select Vestry and Tadhg in his continuing stewardship of our\nfinances as Treasurer. In the midst of very heavy professional commitments\nTadhg has continued to provide very clear and professional advice as we have\nsought to steer ourselves through these troubled financial times.\nThis year our Glebe Wardens, Frank Macnamara and Eddie Kerr have\ncontinued in their work as Glebe Wardens. This is one of those unseen jobs\nthat is all too easily taken for granted – we notice when things are not done but\nwhen all is looking well we fail to recognise the amount of work that is done\nbehind the scenes with great willingness and cheerfulness. Thank you\ngentlemen.\nPage 5 of 7\nEaster General Vestry -15th April 2012\nI would like to thank Randal Henly for his continued service as both Organist\nand Editor of the Parish Magazine. I would like to thank him and the choir for\nthe lead they give us in our Sunday worship and also the work that goes into\nour special services at Harvest, Christmas and Easter. Randal continues to put\na great deal of energy into the production of the Parish Magazine. I would at\nthe same time like to thank the team of helpers who assemble and distribute the\nmagazine.\nI have already spoken of the work of the Sunday School Team and of the\ncontribution of Stephen our Youth Worker. I would want to pay particular\ntribute to Louise Fuller in the work she has done in coordinating the work of\nthe Youth Project Team, consisting of herself along with Troy Hopkins and\nAudrey Hamilton. There has been a great deal of work in the background in\nensuring that our Youth Project is able to continue. Louise has also been\nresponsible for the establishment and running of our Parent and Toddler Group\nwhich meets every Thursday from 9:30 till 12 and there is also a lovely\natmosphere in the Joshua Room.\nAt the other end of the age spectrum, our very successful Social Group\ncontinues to meet on alternate Tuesday afternoons. One Tuesday a month the\nactivities are based here in the Parish Centre and on the other Tuesday the\ngroup have organised a trip. Barbara Sargent has been very active in the\nestablishment and the running of this group. We are now moving towards a\nmore collective leadership in which individuals take on the role of organising\nparticular out door events.\nPage 6 of 7\nEaster General Vestry -15th April 2012\nWe would like to thank Mr Denis Headon for his stewardship of the Free Will\nOffering Envelopes – he is always ready to respond to requests for new sets of\nenvelopes\nI would like to thank Cathy Fennell for her continued work in managing our\nParish Centre. She has been very proactive in securing tenants so we have\nmaintained our income from bookings. I would also like to thank Jane\nCaldwell for the quiet efficiency with which she maintains all the necessary\nsupplies for the Parish Centre\nFor the last four years the Parish Fete has been under the very capable\nstewardship of Mrs Helen McVeigh and she has kindly agreed to take\nresponsibility for it this year. Helen has been under a great deal of pressure of\nlate due to the recent death of her father in England and I would appeal to folk\nto be even more willing to step up to the mark as the Fete approaches\nAn important aspect of our life is fellowship, whether in Church or out of\nChurch. I would like to thank some people in particular. I would like to thank\nDorothy MacCann for her continued work with the midweek coffee – this is a\nlovely opportunity for people to get together for worship and fellowship and\nchat over a cup of coffee. The coffee after Church each Sunday has been\nparticularly appreciated by those new to the Parish, providing as it does a\nchance to meet and establish contact with people in a way you cannot do on\nyour way out of the Church door. Thank you to Valerie for coordinating this\nand to the ladies who have taken on the job of serving it each Sunday. On the\nPage 7 of 7\nEaster General Vestry -15th April 2012\nodd Sunday we have missed it due to the absence of volunteers, which I think\nhas brought home to us how valuable this meeting after Church has become.\nOur thanks are also due to Mr Stan McMullen for his continued work as\ndistributor of the Church Review and to Eddie Kerr, who continues to look\nafter the Church of Ireland Gazette. Both would welcome new subscribers.\nThis year I performed Baptisms and\nI officiated at weddings.\nThis year I conducted the following funerals:\nHarry Brooks, Irene Trimble, Joan Pickard, Orla Ennis, Shelagh Wilkinson.\nI am pleased to announce that Mr Aubrey Mcmurtry has agreed to act as\nRector’s Church Warden for the coming year and that Mr Eddie Kerr has\nkindly agreed to continue as Rector’s Glebe Warden"
    }
}