{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Epiphany/year B/epiphany32021.txt",
        "raw_ocr_content": "Page 1 of 4\nEPIPHANY 3 – Year B – 2021 (alternative readings)\nLooking back to a time when we could invite as many people as we wanted into our\nhouses (and I suppose looking forward to the time when we will be able to do the\nsame again), when you are having people around for a meal or a party, one of the\ndecisions to be made as a host is that of how much to provide for our guests. Over\ndo it and you are left with a mountain of unconsumed food and drink that you don’t\nknow what to do with. Provide too little on the other hand and you end up with a\nsituation that is embarrassing for host and guest alike.\nThis is, at the lowest level, the situation presented to us in our Gospel reading\ntoday. A couple are celebrating their marriage. In the society of that time, this\nwould have been an event involving the whole community, spanning several days.\nFor the provisions of the wedding banquet to run out would have spelt humiliation\nfor the family in the face of the community.\nIt is into this situation that Jesus comes in our Gospel narrative. Let us just lay\naside the details of the story, the number of water jars, the number 6, even the\nquality of the wine that was brought to the master of the banquet.\nWhat I see is a situation transformed by the presence of Jesus. As I thought over\nthat I began to think how Christ can transform even our darkest moments and\nexperiences. I remember when I was in Northern Ireland in that period we now\nrefer to as ‘The Troubles’. Sunday by Sunday, we used to pray for peace in\nNorthern Ireland at a time when there was anything but peace. We prayed almost\ndespite ourselves, in our darker moments wondering was there any point.\nPage 2 of 4\nEPIPHANY 3 – Year B – 2021 (alternative readings)\nThe situation in Northern Ireland was changed, indeed transformed. Now there is\nstill work to do in building on the peace, but no-one can deny the transformation\nthat occurred. We get into the territory here of how God answers prayer. What do\nwe even mean when we say that God has answered prayer; or, for that matter, not\nanswered prayer? I do think prayer changes things. And prayer has the capacity to\nchange the people who pray – if I pray consistently for peace, I become more and\nmore an instrument of peace. God does work through people, through people\nchanging their attitudes, outlooks, behaviour.\nWhich leads me to a question – am I a person who is open to the promptings of the\nHoly Spirit, am I a person who is willing to change, to be used by God to change\nsituations of tension? Am I willing to go in the name of Christ to be an instrument\nof transformation, to bring light into situations of darkness, hope into situations of\ndespair?\nI think that is what lay at the heart of what President Joe Biden was talking about in\nhis Inaugural Address this week, as he encouraged the American people to listen to\nthose who differ from them, to seek peace rather than conflict, hope rather than\ndespair.\nPaul, in his various letters to the Churches, speaks of God working in and through\nthe life of his Church, through the lives of individual members of his Church. In\nhis letter to the Galatians, he says of himself:\nI have been crucified with Christ and I no longer live, but Christ lives in\nme. The life I now live in the body, I live by faith in the Son of God, who\nloved me and gave himself for me. Gal 2:20\nPage 3 of 4\nEPIPHANY 3 – Year B – 2021 (alternative readings)\nIn the coming weeks we will be following the early stages of the ministry of Jesus;\nthe call of those first disciples, his ministry of teaching and healing, the beginnings\nof his confrontation with the religious establishment that was to lead to his\nsuffering and death. Those first disciples were called not just to be followers; they\nwere called to go out in his name to teach, to heal, to be the lips, the hands, the feet\nof their master.\nWe read as our Gospel story today of an occasion that at one level was one of\npotentially acute embarrassment; on another level it was one of the transforming\npower of the presence of Jesus.\nIn our own day we are called not just to admire but to imitate the Christ who calls\nus to follow him. May we go out into whatever situation God places us this week;\nthat we might be the hands, the lips, the feet of Christ; that we might be enabled to\nbring something of his transforming, reconciling presence – may we be channels,\ninstruments of the love of God in Christ.\nPrayer of Saint Francis of Assisi\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nPage 4 of 4\nEPIPHANY 3 – Year B – 2021 (alternative readings)\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen"
    },
    "base": "{\n    \"title\": \"Transformation Through Christ\",\n    \"date\": \"2021-01-24\",\n    \"blurb\": \"In this sermon, Kevin reflects on the transformative power of Christ, using the story of the wedding at Cana as a metaphor. He discusses the potential of prayer to change situations and people, and the need for individuals to be open to the Holy Spirit's guidance. He also emphasizes the role of each believer as an instrument of peace and transformation, echoing the sentiments of St. Francis of Assisi.\",\n    \"raw_text\": \"Looking back to a time when we could invite as many people as we wanted into our houses (and I suppose looking forward to the time when we will be able to do the same again), when you are having people around for a meal or a party, one of the decisions to be made as a host is that of how much to provide for our guests. Over do it and you are left with a mountain of unconsumed food and drink that you don’t know what to do with. Provide too little on the other hand and you end up with a situation that is embarrassing for host and guest alike.\\n\\nThis is, at the lowest level, the situation presented to us in our Gospel reading today. A couple are celebrating their marriage. In the society of that time, this would have been an event involving the whole community, spanning several days. For the provisions of the wedding banquet to run out would have spelt humiliation for the family in the face of the community.\\n\\nIt is into this situation that Jesus comes in our Gospel narrative. Let us just lay aside the details of the story, the number of water jars, the number 6, even the quality of the wine that was brought to the master of the banquet.\\n\\nWhat I see is a situation transformed by the presence of Jesus. As I thought over that I began to think how Christ can transform even our darkest moments and experiences. I remember when I was in Northern Ireland in that period we now refer to as ‘The Troubles’. Sunday by Sunday, we used to pray for peace in Northern Ireland at a time when there was anything but peace. We prayed almost despite ourselves, in our darker moments wondering was there any point.\\n\\nThe situation in Northern Ireland was changed, indeed transformed. Now there is still work to do in building on the peace, but no-one can deny the transformation that occurred. We get into the territory here of how God answers prayer. What do we even mean when we say that God has answered prayer; or, for that matter, not answered prayer? I do think prayer changes things. And prayer has the capacity to change the people who pray – if I pray consistently for peace, I become more and more an instrument of peace. God does work through people, through people changing their attitudes, outlooks, behaviour.\\n\\nWhich leads me to a question – am I a person who is open to the promptings of the Holy Spirit, am I a person who is willing to change, to be used by God to change situations of tension? Am I willing to go in the name of Christ to be an instrument of transformation, to bring light into situations of darkness, hope into situations of despair?\\n\\nI think that is what lay at the heart of what President Joe Biden was talking about in his Inaugural Address this week, as he encouraged the American people to listen to those who differ from them, to seek peace rather than conflict, hope rather than despair.\\n\\nPaul, in his various letters to the Churches, speaks of God working in and through the life of his Church, through the lives of individual members of his Church. In his letter to the Galatians, he says of himself:\\n\\n> I have been crucified with Christ and I no longer live, but Christ lives in me. The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me. Gal 2:20\\n\\nIn the coming weeks we will be following the early stages of the ministry of Jesus; the call of those first disciples, his ministry of teaching and healing, the beginnings of his confrontation with the religious establishment that was to lead to his suffering and death. Those first disciples were called not just to be followers; they were called to go out in his name to teach, to heal, to be the lips, the hands, the feet of their master.\\n\\nWe read as our Gospel story today of an occasion that at one level was one of potentially acute embarrassment; on another level it was one of the transforming power of the presence of Jesus.\\n\\nIn our own day we are called not just to admire but to imitate the Christ who calls us to follow him. May we go out into whatever situation God places us this week; that we might be the hands, the lips, the feet of Christ; that we might be enabled to bring something of his transforming, reconciling presence – may we be channels, instruments of the love of God in Christ.\\n\\n> Prayer of Saint Francis of Assisi\\n> Lord, make me an instrument of your peace.\\n> Where there is hatred, let me sow love;\\n> where there is injury, pardon;\\n> where there is doubt, faith;\\n> where"
}