{
    "title": "Epiphany 1 - 2016",
    "date": "2016-01-10",
    "blurb": "This sermon reflects on the life and teachings of Jesus Christ. It discusses how Jesus was perceived in different ways by people - as a teacher, healer, and friend of the friendless. It emphasizes the important self-proclamations of Jesus, such as 'I am the good shepherd' and 'I am the light of the world'. The sermon concludes with the promise of Jesus to his disciples and to us, 'I am with you always.'",
    "raw_text": "We have just celebrated Christmas – the birth of our Lord Jesus Christ. The party is over – we’re back to school, back to work. Who did this child Jesus grow up to be.\n\nStarting with a few pictures of children who grew up to be famous – see if you can recognise them: Einstein, Wayne Rooney, Barack Obama. Children who grew up to be famous – scientist, footballer, President of the USA. Who did Jesus grow up to be?\n\nPeople experienced him in many different ways. Teacher, healer, friend of the friendless – he got into trouble. He said some important things about himself: 'I am the good shepherd', 'I am the light of the world'. His followers came to see him as something much more: 'You are the Christ'.\n\nWe have come to believe he is special and so we will say in our Creed. He has promised his disciples and he has promised us: 'I am with you always.' To us he says, 'Come follow me.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany12016family service.txt",
        "raw_ocr_content": "Epiphany 1 – 2016 – year C – Family Servicee\nWe have just celebrated Christmas – the birth of our Lord Jesus\nChrist.\nThe party is over – we’re back to school, back to work.\nWho did this child Jesus grow up to be.\nStarting with a few pictures of children who grew up to be famous –\nsee if you can recognise them\nEinstein\nWayne Rooney\nBarack Obama\nchildren who grew up to be famous – scientist, footballer, President\nof the USA\nWho did Jesus grow up to be?\nPeople experienced him in many different ways\nTeacher, healer, friend of the friendless – he got into trouble\nHe said some important things about himself\nI am the good shepherd\nI am the light of the world\nHis followers came to see him as something much more\nYou are the Christ,\nWe have come to believe he is special and so we will say in our Creed\nHe has promised his disciples and he has promised us\nI am with you always.\nto us he says ‘Come follow me’"
    }
}