{
    "title": "The Call and Vocation",
    "date": "2011-01-16",
    "blurb": "The sermon discusses the joy and significance of Baptism, the importance of names in the Bible, and the transformation of individuals when they accept God's call. It emphasizes the idea of vocation and purpose, using examples of biblical figures like Simon becoming Peter and Saul becoming Paul. The sermon also encourages reflection on one's discipleship and the reaffirmation of baptismal promises.",
    "raw_text": "EPIPHANY 2 – 2011 – Year A\n\nFor me, one of the joys of ministry has centred around the sacrament of Baptism. The arrival of a child is almost always an occasion of joy. There is the sense of anticipation of what lies ahead, there is hope, there are dreams and hopes for the future. With the arrival of a child in the home there is the question ‘What are you going to call your child? What will be his or her name?’ There is often a story behind the choice of a name – maybe the child is named after a parent, grand parent, close friend, someone who has inspired us. There is a strong tradition of choosing the name of a biblical character or saint. Or else a name is chosen because it has a particular meaning. In Genesis we read of Rachel as she died naming her son to whom she had just given birth Benomi, son of my sorrow. Jacob instead names him Benjamin, ‘son of my right hand’. The meaning of a name that is given to a child would be very important in the African tradition. It is lovely to hear the spiritual resonances of names chosen for a child – the very name representing the hopes the parents have for their child.\n\nThen, within the Biblical literature we get instances of names of individuals being changed at a particular point in their life story; Abram becomes Abraham, Jacob becomes Israel, Saul becomes Paul and in our Gospel reading today Simon becomes Peter. ‘You are Simon son of John. You are to be called Cephas’ (which is translated Peter).’\n\nThese are more than casual changes; more than ‘nick-names’ that we might give to each other. These changes occur at crucial times in their lives, represent new stages in their life before God – there is an element of vocation.\n\nThis is brought out in the choice of words in the original Greek in which our Gospel passage and Epistle are written:\n\nYou will be called Peter\nPaul called to be an apostle\nto those called to be saints\nby him you were called into the fellowship of his Son.\n\nThere is this same element of vocation, of purpose. As I look at these aspects of call, I also get a sense of movement. Simon, son of John, a Galilean fisherman, called to be Peter, disciple, central figure in the early growth of the Church. Saul, Pharisee, so sure that he is right and those early Christians are wrong, persecutor of the Church, himself called to be an apostle, destined to be the one through whom the Gospel would be taken out into the Roman world.\n\nThe Corinthian Christians, called to be saints; a community flawed by personality differences and jealousies and divisions yet called to proclaim Christ in a very varied and cosmopolitan community.\n\nThese are roles into which these people grew. God worked in and through their strengths and their weaknesses, their successes and their failures. I often find myself reflecting on the figure of Simon, called to be Peter. His life was a process of God taking the Simon he was and transforming him into the Peter he wanted him to be. That was not a uniform progression. There were moments of great faithfulness and also moments of abject failure\n\nNext month we will be commencing our next confirmation group. At the heart of the Confirmation Service is the reaffirmation of baptismal promises. At the Family Service in February, as the young people prepare to begin their course, I will be inviting everyone to reflect on the promises and confirmation, to reflect on our own discipleship, our own call.\n\nI often reflect on the text the Bishop of Aston took for his sermon at my own Confirmation, just before I came away to College.\n\n16 You did not choose me but I chose you. John 15:16\n\nWe are chosen not because we are especially virtuous, especially talented, especially anything – we are chosen, called to be saints, as we are in all our strengths, our weaknesses, our talents and our failures. And worship, in its broadest sense, is about offering our whole selves to God – our talents, our laughter and our love, our failure and our brokenness. The God we worship, the God who has called us and to whom we seek to respond, he will take us and use us to be his instruments wherever he has placed us – in the streets and the homes, the schools and the business, the shops, the pubs, the clubs, the meetings, the casual conservations, places where people are hurting, where people are being ignored.\n\nThis is the vocation, the calling of the Church as individuals and as a community in our country at this time.\n\n16 You did not choose me but I chose you. And I appointed you to go and bear fruit, fruit that will last, John 15:16\n\nMay we be faithful to his call, may we in our own individual and community life bear a rich harvest of love, of integrity, of justice and peace, that his Kingdom may be upheld, his Kingdom advanced in our country at this crucial time in our history.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany22011.txt",
        "raw_ocr_content": "Page 1 of 3\nEPIPHANY 2 – 2011 – Year A\nFor me, one of the joys of ministry has centred around the sacrament of\nBaptism. The arrival of a child is almost always an occasion of joy. There is\nthe sense of anticipation of what lies ahead, there is hope, there are dreams and\nhopes for the future. With the arrival of a child in the home there is the\nquestion ‘What are you going to call your child? What will be his or her\nname?’ There is often a story behind the choice of a name – maybe the child is\nnamed after a parent, grand parent, close friend, someone who has inspired us.\nThere is a strong tradition of choosing the name of a biblical character or saint.\nOr else a name is chosen because it has a particular meaning. In Genesis we\nread of Rachel as she died naming her son to whom she had just given birth\nBenomi, son of my sorrow. Jacob instead names him Benjamin, ‘son of my\nright hand’. The meaning of a name that is given to a child would be very\nimportant in the African tradition. It is lovely to hear the spiritual resonances\nof names chosen for a child – the very name representing the hopes the parents\nhave for their child.\nThen, within the Biblical literature we get instances of names of individuals\nbeing changed at a particular point in their life story; Abram becomes\nAbraham, Jacob becomes Israel, Saul becomes Paul and in our Gospel reading\ntoday Simon becomes Peter. ‘You are Simon son of John. You are to be called\nCephas’ (which is translated Peter).’\nThese are more than casual changes; more than ‘nick-names’ that we might\ngive to each other. These changes occur at crucial times in their lives,\nrepresent new stages in their life before God – there is an element of vocation.\nPage 2 of 3\nEPIPHANY 2 – 2011 – Year A\nThis is brought out in the choice of words in the original Greek in which our\nGospel passage and Epistle are written:\nYou will be called Peter\nPaul called to be an apostle\nto those called to be saints\nby him you were called into the fellowship of his Son.\nThere is this same element of vocation, of purpose. As I look at these aspects\nof call, I also get a sense of movement. Simon, son of John, a Galilean\nfisherman, called to be Peter, disciple, central figure in the early growth of the\nChurch. Saul, Pharisee, so sure that he is right and those early Christians are\nwrong, persecutor of the Church, himself called to be an apostle, destined to be\nthe one through whom the Gospel would be taken out into the Roman world.\nThe Corinthian Christians, called to be saints; a community flawed by\npersonality differences and jealousies and divisions yet called to proclaim\nChrist in a very varied and cosmopolitan community.\nThese are roles into which these people grew. God worked in and through\ntheir strengths and their weaknesses, their successes and their failures. I often\nfind myself reflecting on the figure of Simon, called to be Peter. His life was a\nprocess of God taking the Simon he was and transforming him into the Peter he\nwanted him to be. That was not a uniform progression. There were moments\nof great faithfulness and also moments of abject failure\nNext month we will be commencing our next confirmation group. At the heart\nof the Confirmation Service is the reaffirmation of baptismal promises. At the\nFamily Service in February, as the young people prepare to begin their course,\nPage 3 of 3\nEPIPHANY 2 – 2011 – Year A\nI will be inviting everyone to reflect on the promises and confirmation, to\nreflect on our own discipleship, our own call.\nI often reflect on the text the Bishop of Aston took for his sermon at my own\nConfirmation, just before I came away to College.\n16 You did not choose me but I chose you. John 15:16\nWe are chosen not because we are especially virtuous, especially talented,\nespecially anything – we are chosen, called to be saints, as we are in all our\nstrengths, our weaknesses, our talents and our failures. And worship, in its\nbroadest sense, is about offering our whole selves to God – our talents, our\nlaughter and our love, our failure and our brokenness. The God we worship,\nthe God who has called us and to whom we seek to respond, he will take us\nand use us to be his instruments wherever he has placed us – in the streets and\nthe homes, the schools and the business, the shops, the pubs, the clubs, the\nmeetings, the casual conservations, places where people are hurting, where\npeople are being ignored.\nThis is the vocation, the calling of the Church as individuals and as a\ncommunity in our country at this time.\n16 You did not choose me but I chose you. And I\nappointed you to go and bear fruit, fruit that will last,\nJohn 15:16\nMay we be faithful to his call, may we in our own individual and community\nlife bear a rich harvest of love, of integrity, of justice and peace, that his\nKingdom may be upheld, his Kingdom advanced in our country at this crucial\ntime in our history."
    }
}