{
    "title": "Being Different",
    "date": "2017-01-08",
    "blurb": "The sermon discusses the concept of being different, standing out in a crowd, and choosing to follow Christ. It emphasizes the importance of making conscious choices about our attitudes, behaviors, and life priorities. The sermon also explains the concept of 'metanoia', a Greek word used in the Bible, which means to repent, turn around, change direction, and take a different journey through life.",
    "raw_text": "Epiphany 1 – 2017 – year A – Family Service\n\nWhy mention Preston North End Football Club? They are in the FA Cup 3rd Round – playing Arsenal. There can be some pretty scary supporters. In recent years they maybe haven’t had much to cheer about. They were in the FA Cup Final – in 1954 against West Bromwich Albion, losing 3-2. There aren’t many supporters this side of the water – I knew one in Belfast. In fact you could say that to be a supporter of Preston North End is to stand out as different from everyone else.\n\nThis morning I want to talk of ways of being different, of standing out in a crowd. Some people dress differently and do their hair differently. Then we are all different. God loves us all, no matter where we come from, how old we are – even how we dress.\n\nThe difference we are talking about this morning is who we follow. The lesson told of Baptism of Jesus – I want to think about our own Baptism. When we have a Baptism, at one point in the service I will say:\n\n>In baptism, God calls us from darkness into his marvellous light. To follow Christ means dying to sin and rising to new life with him.\n\nThat means very consciously choosing – choosing different attitudes, different behaviours, different priorities in life in the sort of people we choose to be.\n\nThe Bible talks about repentance – it uses a Greek word: 'metanoia'. That’s what John and Jesus meant when they told people to 'repent'. Turn around, change direction, take a different journey through life.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany12017famserv.txt",
        "raw_ocr_content": "Page 1 of 2\nEpiphany 1 – 2017 – year A – Family Service\nUse powerpoint ‘Family Service – Jan 2017’\nSlide 1 –Preston North End Football Ground\nBad enough mentioning Birmingham City Football Club – why\nPreston?\nThey are in the FA Cup 3rd Round – playing Arsenal\nShow picture of mascot\nThere can be some pretty scary supporters. In recent years they maybe\nhaven’t had much to cheer about.\nThey were in the FA Cup Final – in 1954 against West Bromwich\nAlbion, losing 3-2\nShow picture teams coming out\nThere aren’t many supporters this side of the water – I knew one in\nBelfast. In fact you could say that to be a supporter of Preston North\nEnd is to stand out as different from everyone else.\nThis morning I want to talk of ways of being different, of standing out\nin a crowd\nShow slide of two punks\nSome people dress differently and do their hair differently.\nThen we are all different\nPage 2 of 2\nEpiphany 1 – 2017 – year A – Family Service\nGo through slides of black, Asian, old and young\nGod loves us all, no matter where we come from, how old we are –\neven how we dress.\nShow slide of two punks\nThe difference we are talking about this morning is who we follow\nShow slide of follow me\nLesson told of Baptism of Jesus – I want to think about our own\nBaptism. When we have a Baptism, at one point in the service I will\nsay:\nIn baptism, God calls us from darkness into his marvellous light.\nTo follow Christ means dying to sin and rising to new life with him.\nThat means very consciously choosing – choosing different attitudes,\ndifferent behaviours, different priorities in life in the sort of people we\nchoose to be.\nBible talks about repentance – it uses a Greek word:\nshow slide ‘metanoia’\nThat’s what John and Jesus meant when they told people to ‘repent’\nTurn around, change direction, take a different journey through life\nShow slide of follow me"
    }
}