{
    "title": "Following in the Footsteps of Jesus",
    "date": "2015-01-18",
    "blurb": "This sermon from 2015 discusses the concept of discipleship and what it means to follow Jesus. Drawing parallels between the biblical disciples and modern day followers, the sermon emphasizes that Jesus is not looking for casual followers but for committed disciples who are willing to leave everything behind. The sermon also contrasts the idea of following Jesus with following someone on social media, highlighting the depth and commitment required in discipleship.",
    "raw_text": "2nd Sunday of Epiphany – year B – 2015 – Family Service\n\n'Disciples - Following in the footsteps of Jesus’\n\nWell here we are at the beginning of 2015. Christmas is now well behind us. Back then we were listening to the story of the birth of Jesus. We are now starting to follow the story of Jesus the man. Last Sunday in Church we read about his baptism by John the Baptist in the River Jordan. Now we are starting to read about how he began to gather a group of people around him, his disciples.\n\nWhen Jesus said to someone, ‘Follow me?’ – what made them follow? Some like Andrew and Peter and Philip seemed keen from the word go – there was something about Jesus. Others weren’t quite so keen. Nathaniel wasn’t too impressed with the town Jesus came from – Messiah from Nazareth – you cannot be serious. But even Nathaniel when he met Jesus was impressed.\n\nBut why? These men left their jobs, their homes, their families to follow Jesus. Following Jesus was a serious business – serious for them, serious for Jesus. What did it mean?\n\nComing to our own day, when we talk of following a lot of people will be thinking of Facebook. For the few who haven’t heard of Facebook, people will establish their own page. And then people will start to contact you saying they would like to be friends, they would like to follow you on Facebook – read about what you think, what you like, what you had for breakfast. You could end up with lots of people following you.\n\nFollowing Jesus is not like following someone on Facebook. Jesus isn’t looking for people who are vaguely curious about him.\n\nGoing back to the Facebook page. If we like the look of someone’s page, or something on their page – it might be a photo or something they have written – you can not just say you are following them.\n\nAgain this does not really match up to what following Jesus means. He’s not looking for someone who is curious about him, he’s not even looking for someone who admires him.\n\nJesus is looking for disciples. Jesus is looking for friends. At the end of his ministry, on the night before he died, Jesus said this to the men who had followed him, who had heard him teach, seen him heal:\n\n> You are my friends when you do the things I command you.\n> I’m no longer calling you servants because servants don’t understand what their master is thinking and planning. No, I’ve named you friends because I’ve let you in on everything I’ve heard from the Father.\n> “You didn’t choose me, remember; I chose you, and put you in the world to bear fruit, fruit that won’t spoil. John 15:14ff\n\nPeople who want to listen to what he has to say, who want to learn, who want to walk in the footsteps of Jesus, who want to used by Jesus in the building of his Kingdom – he is looking for me and for you to be his disciples.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany22015family.txt",
        "raw_ocr_content": "Page 1 of 3\n2nd Sunday of Epiphany – year B – 2015 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nWell here we are at the beginning of 2015. Christmas is now well\nbehind us. Back then we were listening to the story of the birth of\nJesus.\nWe are now starting to follow the story of Jesus the man. Last Sunday\nin Church we read about his baptism by John the Baptist in the River\nJordan. Now we are starting to read about how he began to gather a\ngroup of people around him, his disciples.\nWhen Jesus said to someone, ‘Follow me?’ – what made them follow?\nSome like Andrew and Peter and Philip seemed keen from the word\ngo – there was something about Jesus. Others weren’t quite so keen.\nNathaniel wasn’t too impressed with the town Jesus came from –\nMessiah from Nazareth – you cannot be serious. But even Nathaniel\nwhen he met Jesus was impressed.\nBut why? These men left their jobs, their homes, their families to\nfollow Jesus.\nFollowing Jesus was a serious business – serious for them, serious for\nJesus.\nWhat did it mean?\nPage 2 of 3\n2nd Sunday of Epiphany – year B – 2015 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nComing to our own day, when we talk of following a lot of people\nwill be thinking of Facebook.\nFacebook Logo\nFor the few who haven’t heard of Facebook, people will establish\ntheir own page. And then people will start to contact you saying they\nwould like to be friends, they would like to follow you on Facebook –\nread about what you think, what you like, what you had for breakfast.\nYou could end up with lots of people following you.\nFollowing Jesus is not like following someone on Facebook. Jesus\nisn’t looking for people who are vaguely curious about him.\nGoing back to the Facebook page. If we like the look of someone’s\npage, or something on their page – it might be a photo or something\nthey have written – you can not just say you are following them\n‘Like’ Logo\nPage 3 of 3\n2nd Sunday of Epiphany – year B – 2015 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nyou can click on this icon and to say that you like what ever is on their\npage.\nAgain this does not really match up to what following Jesus means.\nHe’s not looking for someone who is curious about him, he’s not even\nlooking for someone who admires him.\nJesus is looking for disciples. Jesus is looking for friends. At the end\nof his ministry, on the night before he died, Jesus said this to the men\nwho had followed him, who had heard him teach, seen him heal:\nYou are my friends when you do the things I command you.\nI’m no longer calling you servants because servants don’t\nunderstand what their master is thinking and planning. No,\nI’ve named you friends because I’ve let you in on everything\nI’ve heard from the Father.\n“You didn’t choose me, remember; I chose you, and put you\nin the world to bear fruit, fruit that won’t spoil. John 15:14ff\n‘The Message’\nPeople who want to listen to what he has to say, who want to learn,\nwho want to walk in the footsteps of Jesus, who want to used by Jesus\nin the building of his Kingdom – he is looking for me and for you to\nbe his disciples."
    }
}