{
    "title": "Epiphany 3 - 1996",
    "date": "1996-01-21",
    "blurb": "In this sermon, Kevin discusses the importance of not letting our attachments to people, places, and traditions distract us from our commitment to God. He uses his experiences with different churches and congregations to illustrate this point. He emphasizes the urgency of Jesus' call to follow Him and the importance of focusing on the message of the Gospel rather than the preacher.",
    "raw_text": "“Rector, if this church closes you will never see me in church again”. A vivid memory from an unforgettable meeting with the Select Vestry of Rosenallis, one of the Mountmellick Group of Parishes.\n\nThe Parish had just been visited by the General Synod Commission on the use of Church buildings. This commission, once invited in by a diocese, had the power to order the closure of particular churches.\n\nThere was a clear case for the closure of one of our churches and this was accepted by the congregation itself. The commission however had also asked me for additional information concerning Rosenallis. This had lead to this particular meeting. I had explained the way I understood the commission's mind was working and the reasoning behind their thinking. As I say it was one of those meetings you do not forget in a hurry. I wrote to the commission urging caution on their behalf; this was a community with real potential. In the event Rosenallis was left to continue.\n\nWhile I could very much identify with the pain behind that man's declaration that he would never be in Church again if his own church was closed, the feelings that were aroused over this whole process focused in my own mind a real danger facing any Parish community. That is our principal allegiance can be centred on our own place of worship, our own tradition, rather than on God himself.\n\nHere we can get a real tension in our spiritual life. Places are important to us, people are important to us. I will always have very fond memories of St Lawrence's Church in Northfield, into which as a teenager I edged rather nervously one Sunday morning back in 1967. Fond memories too of a delightful old couple, Mr and Mrs Bennett who invited me to join them in their pew; of the Rector, Rev Bruce Morton, and his gentle encouragement in my search for God and later on as I thought of ordination.\n\nSt Lawrence’s was where I began my walk with God and its people and clergy were part and parcel of that. The time soon came for me to head off to University. Over the next seven years I was to live in a range of flats and worship in a variety of parish churches. In some the congregations were welcoming, others more reserved towards the new comer. That period of time emphasised for me the important truth that the God I met in St Lawrence’s was not confined to that Church. Some places do have a particular place In our memories, or have a particular atmosphere that helps us in our search for God. There is no doubt that if a congregation is open and friendly that mediates something of God's openness and friendliness towards us. But what we must never forget is that they are always subordinate to God. Places, people can help in our walk with God - they must never be allowed to replace it.\n\nThis matter of keeping a proper sense of proportion came more and more to my mind as I reflected on our readings for today - particularly the passages appointed as our Epistle and Gospel readings. In our Gospel passage we continue to reflect on Jesus calling his disciples. What strikes me as I read this passage is the urgency of the whole process. Jesus declares, \"The Kingdom of heaven is at hand”. The word in Greek that has been translated as “is at hand” means literally “has drawn near” This nearness of the Kingdom is an activity of God. In the life and ministry of Jesus God is making his move in bringing in his kingdom. Jesus sees Andrew and Peter and says \"follow me”. Again the words in Greek that we translate as \"Follow me” mean literally \"Come after me now” It is not an invitation to think about it at leisure, it is a call to respond.\n\nContrast this urgency of the Gospel passage with the willingness of the Corinthians to be side lined by secondary issues.\n\nIt is clear from this opening chapter of the first letter to the Corinthians that this was a Church that was in danger of being obsessed by individuals. No doubt some were particularly moved by the preaching of Apollos; others were particularly grateful for Paul's ministry; others felt a great attachment to Cephas (or Peter) That is just as true in our own day - we may warm to particular people. Paul's concern was that the preacher was becoming more important than the message. And so he demands \"Was Paul crucified for you?”. Particular people, particular places may be important to us in our walk with God but our attachment to them, our affection for them are not to be confused with our commitment to God who has drawn close to us in Christ.\n\nFor once people, places and yes, our traditions become the focus of our attention, then that attention is diverted from the cross which lies at the heart of our understanding of God's dealings with us - something of the urgency is taken out of it.\n\nOur Gospel passage has placed us at the beginning of the disciples' walk with Jesus. Whatever stage we are at in our own walk with God, let us be always thankful for the people and the places God has given us, that have helped us in our growth in faith. But let us also, in the words of the Epistle to the Hebrews, “fix our eyes on Jesus, the author and perfecter of our faith, who for the joy set before him endured the cross, scorning its shame, and sat down at the right hand of the throne of God. Consider him who endured such opposition from sinful men, so that you will not grow weary and lose heart.”",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Epiphany/year A/epiphany31996.txt",
        "raw_ocr_content": "Page 1 of 3\nEpiphany 3 – 1996 – year A\n“Rector, if this church closes you will never see me in church again”. A vivid\nmemory from an unforgettable meeting with the Select Vestry of Rosenallis, one of\nthe Mountmellick Group of Parishes.\nThe Parish had just been visited by the General Synod Commission on the use of\nChurch buildings. This commission, once invited in by a diocese, had the power to\norder the closure of particular churches.\nThere was a clear case for the closure of one of our churches and this was accepted by\nthe congregation itself. The commission however had also asked me for additional\ninformation concerning Rosenallis. This had lead to this particular meeting. I had\nexplained the way I understood the commission's mind was working and the reasoning\nbehind their thinking. As I say it was one of those meetings you do not forget in a\nhurry. I wrote to the commission urging caution on their behalf; this was a community\nwith real potential. In the event Rosenal1is was left to continue.\nWhile I could very much identify with the pain behind that man's declaration that he\nwould never be in Church again if his own church was closed, the feelings that were\naroused over this whole process focused in my own mind a real danger facing any\nParish community. That is our principal allegiance can be centred on our own place of\nworship, our own tradition, rather than on God himself.\nHere we can get a real tension in our spiritual life. Places are important to us, people\nare important to us. I will always have very fond memories of St Lawrence's Church\nin Northfield, into which as a teenager I edged rather nervously one Sunday morning\nback in 1967. Fond memories too of a delightful old couple, Mr and Mrs Bennett who\ninvited me to join them in their pew; of the Rector, Rev Bruce Morton, and his gentle\nencouragement in my search for God and later on as I thought of ordination.\nSt Lawrence’s was where I began my walk with God and its people and clergy were part\nPage 2 of 3\nEpiphany 3 – 1996 – year A\nand parcel of that. The time soon came for me to head off to University. Over the next\nseven years I was to live in a range of flats and worship in a variety of parish churches.\nIn some the congregations were welcoming, others more reserved towards the new\ncomer. That period of time emphasised for me the important truth that the God I met in\nSt Lawrence’s was not confined to that Church. Some places do have a particular place\nIn our memories, or have a particular atmosphere that helps us in our search for God.\nThere is no doubt that if a congregation is open and friendly that mediates something of\nGod's openness and friendliness towards us. But what we must never .J. forget is that\nthey are always subordinate to God. Places, people can help in our walk with God - they\nmust never be allowed to replace it.\nThis matter of keeping a proper sense of proportion came more and more to my mind as I\nreflected on our readings for today - particularly the passages appointed as our Epistle\nand Gospel readings. In our Gospel passage we continue to reflect on Jesus calling his\ndisciples. What strikes me as I read this passage is the urgency of the whole process.\nJesus declares, \"The Kingdom of :heaven is at hand” The word in Greek that has been\ntranslated as “is at 11and” means literally “has drawn near” This nearness of the Kingdom\nis an activity of God. In the life and ministry of Jesus God is making his move in\nbringing in :i1is kingdom. Jesus sees Andrew and Peter and says \"follow me” Again the\nwords in Greek that we translate as \"Follow me” mean literally \"Come after me now” It is\nnot an invitation to think about it at leisure, it is a call to respond\nContrast thi urgency of the Gospel passage with tile willingness of the Corinthians to be\nside lined by secondary issues.\nIt is clear from this opening chapter of tile first letter to the Corinthians that this was a\nChurch that was in danger of being obsessed by individuals. No doubt some were\nparticularly moved by the preaching of Apollos; others were particularly grateful for\nPaul's ministry; others felt a great attachment to Cephas (or Peter) That is just as true\nPage 3 of 3\nEpiphany 3 – 1996 – year A\nin our own day - we may warm to particular people.. Paul's concern was that the\npreacher was becoming more important than the message. And so he demands \"Was\nPaul crucified for you?”. Particular people, particular places may be important to us in\nour walk with God but our attachment to them, our affection for them are not to be\nconfused with our commitment to God who has drawn close to us in Christ.\nFor once people, places an yes, our traditions become the focus of our attention, then\nthat attention is diverted from the cross which 1ies at thee heart of our understanding of\nGod's dealings with us - something of the urgency is taken out of it.\nOur Gospel passage has placed us at the beginning of the disciples' walk with Jesus.\nWhatever stage we are at in our own walk 'with God, let us be always thankful for the\npeople and the places God has given us, that have helped us in our growth in faith. But\nlet us also, in the words of the Epistle to the Hebrews, “fix our eyes on Jesus, the\nauthor and perfecter of our faith, who for the joy set before him endured the cross,\nscorning its shame, and sat down at the right hand of the throne of God. Consider him\nwho endured such opposition from sinful men, so that you will not grow weary and\nlose heart.”"
    }
}