{
    "title": "Charisma and Spiritual Gifts",
    "date": "2016-01-17",
    "blurb": "In this sermon, Kevin discusses the concept of 'charisma' and its relation to leadership. He highlights the importance of charismatic leaders in history and their ability to inspire and transform societies. Kevin then connects this to the spiritual gifts (carisma) mentioned in Paul's first letter to the Church at Corinth. He emphasizes that these gifts are God-given and meant to be used for the service of God and the building up of His Kingdom.",
    "raw_text": "We are now moving into election mode both here and in the United States. Parties are already testing the water on what sort of campaign posters will be acceptable and which ones will just blow up in their faces – what is seen as simply negative campaigning and what is making a fair point. What is empty rhetoric and what is sound argument. What it comes down to is we are looking for leaders, who will be the best people to guide us through the next five years, or however long the next Dail survives.\n\nOne word that often comes up when we are looking for leaders is ‘charisma’. I suppose it is something that is hard to put your finger on but we recognise it when it is there. It is hard to define but it would generally be applied to people who seem to demand our attention, who stand out from among the crowd.\n\nNow we have seen some fairly awful characters in the past – I would think of Hitler and Stalin. Leaving those to one side, we can think of many more positive individuals who appeared at a crucial time in history in politics, in the church, in society at large. John Wesley, Daniel O’Connell must have had a great charisma – people would have travelled miles to hear them speak for hours at a time and they had a great impact in the emergence of Methodism, in Catholic Emancipation. Closer to our own time I think of Martin Luther King – as a teenager I remember being mesmerised by some of his epic speeches in the campaign for Civil Rights in America. Who can forget his ‘I have a dream speech’\n\n> I have a dream that one day this nation will rise up and live out the true meaning of its creed: \"We hold these truths to be self-evident, that all men are created equal.\"\n\n> I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character.\n\n> I have a dream today!\n\nCloser to home we think of Winston Churchill galvanising wartime Britain to take up the challenge, to defy the odds stacked against them, to stand firm. Here on this island we will be reflecting on those on all sides who shaped the events of the decade 1912-1922.\n\nLooking up the word ‘charisma’ in a dictionary we find an ability to inspire, to motivate; there is with this a sense of inspirational and transformational. In their ability to inspire, to motivate, to transform we can see how the likes of these charismatic characters Wesley, of O’Connell, of Churchill, of King were gifts to their generation, to society at large.\n\nI want to take this link between gift and charisma to our reading from Paul’s first letter to the Church at Corinth. For our word ‘charisma’ is derived from the Greek word carisma that Paul is using in this passage of ‘spiritual gifts’. In my Greek lexicon this word carisma is defined as ‘divinely conferred endowment or free gift. This is the first of a series of readings that we will be following this month from these closing chapters of the 1st Letter to the Ephesians, talking of the place of spiritual gifts in the Church. He begins, you will notice with reminding them of their recent conversion. Only recently they had been worshiping idols that did not speak now they are living in the life and power of the Spirit. He reminds them that there are varieties of gifts (carisma) but the same Spirit.\n\nLet us go back to Jesus’ own understanding of the nature and role of the Spirit as we read in John’s Gospel. The Spirit is a gift in itself. And so Jesus says to the disciples in the Upper Room:\n\n> 16 And I will ask the Father, and he will give you another Advocate, to be with you forever. 17 This is the Spirit of truth, whom the world cannot receive, because it neither sees him nor knows him. You know him, because he abides with you, and he will be in you. John 14:16,17\n\nThe Spirit is first and foremost God’s presence with us, a Spirit that will teach, the Advocate, the Holy Spirit, whom the Father will send in my name, will teach you everything, and remind you of all that I have said to you. John 14:26\n\nThe promised Spirit, will guide, will point us to Christ\n\n> When the Spirit of truth comes, he will guide you into all the truth; for he will not speak on his own, but will speak whatever he hears, and he will declare to you the things that are to come. 14 He will glorify me, because he will take what is mine and declare it to you. 15 All that the Father has is mine. For this reason I said that he will take what is mine and declare it to you. John 15:13-15\n\nAs the writer of the 1st Letter of John reminds us, the Spirit is a sign of our communion with Christ:\n\n> 13 By this we know that we abide in him and he in us, because he has given us of his Spirit. 14 And we have seen and do testify that the Father has sent his Son as the Savior of the world. 15 God abides in those who confess that Jesus is the Son of God, and they abide in God. 1 John 4:13-15\n\nIt is in that communion with Christ, in that presence of God in all the joys and sorrows of this life, in all the hurts and the pain, and the misunderstanding, in the whole range of our thoughts, our feelings, our doubts and our faith that we celebrate that fundamental carisma, that gift of the Holy Spirit. Remember when we were talking of leaders, of charismatic leadership. We initially said that we couldn’t define it but then some characteristics came through.\n\nThere was the power to inspire, to motivate, to transform. In the context of the New Testament carisma is a God given gift, given not just to a few but to the whole people of God. All through the Biblical canon, from the time of the call of Abram, God blesses his people in order that they might be a blessing. God give us gifts, carisma, amazing talents, insights, gifts of music, of art. of wisdom, of discernment, of service, of compassion, of healing of simple, practical common sense, that we may be used by God, of God, in the service of God, for the building up of God’s Kingdom in this place.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany22016.txt",
        "raw_ocr_content": "Page 1 of 4\nEPIPHANY 2 – 2016 – Year C\nWe are now moving into election mode both here and in the United States.\nParties are already testing the water on what sort of campaign posters will be\nacceptable and which ones will just blow up in their faces – what is seen as\nsimply negative campaigning and what is making a fair point. What is empty\nrhetoric and what is sound argument. What it comes down to is we are looking\nfor leaders, who will be the best people to guide us through the next five years,\nor however long the next Dail survives.\nOne word that often comes up when we are looking for leaders is ‘charisma’. I\nsuppose it is something that is hard to put your finger on but we recognise it\nwhen it is there. It is hard to define but it would generally be applied to people\nwho seem to demand our attention, who stand out from among the crowd.\nNow we have seen some fairly awful characters in the past – I would think of\nHitler and Stalin. Leaving those to one side, we can think of many more\npositive individuals who appeared at a crucial time in history in politics, in the\nchurch, in society at large. John Wesley, Daniel O’Connell must have had a\ngreat charisma – people would have travelled miles to hear them speak for\nhours at a time and they had a great impact in the emergence of Methodism, in\nCatholic Emancipation. Closer to our own time I think of Martin Luther King\n– as a teenager I remember being mesmerised by some of his epic speeches in\nthe campaign for Civil Rights in America. Who can forget his ‘I have a dream\nspeech’\nI have a dream that one day this nation will rise up and live out the true\nmeaning of its creed: \"We hold these truths to be self-evident, that all\nmen are created equal.\"\nPage 2 of 4\nEPIPHANY 2 – 2016 – Year C\nI have a dream that my four little children will one day live in a nation\nwhere they will not be judged by the color of their skin but by the\ncontent of their character.\nI have a dream today!\nCloser to home we think of Winston Churchill galvanising wartime Britain to\ntake up the challenge, to defy the odds stacked against them, to stand firm.\nHere on this island we will be reflecting on those on all sides who shaped the\nevents of the decade 1912-1922.\nLooking up the word ‘charisma’ in a dictionary we find an ability to inspire, to\nmotivate; there is with this a sense of inspirational and transformational. In\ntheir ability to inspire, to motivate, to transform we can see how the likes of\nthese charismatic characters Wesley, of O’Connell, of Churchill, of King were\ngifts to their generation, to society at large.\nI want to take this link between gift and charisma to our reading from Paul’s\nfirst letter to the Church at Corinth. For our word ‘charisma’ is derived from\nthe Greek word carisma that Paul is using in this passage of ‘spiritual gifts’.\nIn my Greek lexicon this word carisma is defined as ‘divinely conferred\nendowment or free gift. This is the first of a series of readings that we will be\nfollowing this month from these closing chapters of the 1st Letter to the\nEphesians, talking of the place of spiritual gifts in the Church. He begins, you\nwill notice with reminding them of their recent conversion. Only recently they\nhad been worshiping idols that did not speak now they are living in the life and\nPage 3 of 4\nEPIPHANY 2 – 2016 – Year C\npower of the Spirit. He reminds them that there are varieties of gifts (carisma)\nbut the same Spirit.\nLet us go back to Jesus’ own understanding of the nature and role of the Spirit\nas we read in John’s Gospel. The Spirit is a gift in itself. And so Jesus says to\nthe disciples in the Upper Room:\n16 And I will ask the Father, and he will give you another Advocate, to\nbe with you forever. 17 This is the Spirit of truth, whom the world\ncannot receive, because it neither sees him nor knows him. You know\nhim, because he abides with you, and he will be in you. John 14:16,17\nThe Spirit is first and foremost God’s presence with us, a Spirit that will teach,\nthe Advocate, the Holy Spirit, whom the Father will send in my name,\nwill teach you everything, and remind you of all that I have said to you.\nJohn 14:26\nThe promised Spirit, will guide, will point us to Christ\nWhen the Spirit of truth comes, he will guide you into all the truth; for\nhe will not speak on his own, but will speak whatever he hears, and he\nwill declare to you the things that are to come. 14 He will glorify me,\nbecause he will take what is mine and declare it to you. 15 All that the\nFather has is mine. For this reason I said that he will take what is mine\nand declare it to you. John 15:13-15\nAs the writer of the 1st Letter of John reminds us, the Spirit is a sign of our\ncommunion with Christ:\n13 By this we know that we abide in him and he in us, because he has\ngiven us of his Spirit. 14 And we have seen and do testify that the\nFather has sent his Son as the Savior of the world. 15 God abides in\nthose who confess that Jesus is the Son of God, and they abide in God.\n1 John 4:13-15\nIt is in that communion with Christ, in that presence of God in all the joys and\nsorrows of this life, in all the hurts and the pain, and the misunderstanding, in\nPage 4 of 4\nEPIPHANY 2 – 2016 – Year C\nthe whole range of our thoughts, our feelings, our doubts and our faith that we\ncelebrate that fundamental carisma, that gift of the Holy Spirit. Remember\nwhen we were talking of leaders, of charismatic leadership. We initially said\nthat we couldn’t define it but then some characteristics came through.\nThere was the power to inspire, to motivate, to transform. In the context of the\nNew Testament carisma is a God given gift, given not just to a few but to the\nwhole people of God. All through the Biblical canon, from the time of the call\nof Abram, God blesses his people in order that they might be a blessing. God\ngive us gifts, carisma, amazing talents, insights, gifts of music, of art. of\nwisdom, of discernment, of service, of compassion, of healing of simple,\npractical common sense, that we may be used by God, of God, in the service of\nGod, for the building up of God’s Kingdom in this place."
    }
}