{
    "title": "Epiphany 3 - 2016",
    "date": "2016-01-24",
    "blurb": "In this sermon, Kevin draws parallels between the game of Jenga and the interconnectedness of the Church community. He discusses the importance of compassion, courage, and action, using the example of Aung San Suu Kyi and the Parable of the Good Samaritan. Kevin emphasizes that every person and their gifts are valuable to the Church, and that the community is stronger with everyone's presence.",
    "raw_text": "Over the last few years, a feature of our Fete has been the various games overseen by our Youth Clubs that are set up near the entrance. One of these is a large game of Jenga. The game begins with a tower constructed of simple smooth oblong blocks. One by one the players remove the blocks until the removal of one of them causes the tower to collapse.\n\nIt is a game of inter-connectedness – the lower blocks all supporting the ones above. It is also a game of instability and weakening as more and more of the blocks are withdrawn.\n\nI thought of this as I reflected on the passage we read from Paul’s First Letter to the Corinthians. As I said last week, he is developing his thoughts on spiritual gifts in the context of the unity of the body. Every part has its place and no part is unimportant. As I was reflecting on this, I found myself also reading about one of the most influential voices for non violence in our generation, the Burmese activist Aung San Suu Kyi. The daughter of one of the leaders of the resistance to the Japanese occupation in the Second World War, she has taken a principled stand against the Burmese Military Regime, being held under house arrest for many years. Recently she lead the forces of democracy to victory in the latest elections in Burma. The writer of the book I am reading refers to her as a modern prophet of compassion.\n\nWhat are we talking about when we see that word compassion. Compassion has its roots not just in an external sympathy with another but rather an identification with another in their suffering. It is about the connection between the heart of my being and the heart of yours – and then following that connection. Compassion is about that interconnectedness that lies at the heart of the image of the body that Paul is using as he writes to the Church at Corinth.\n\nIn her own writings Aung San Suu Kyi talks of the way of compassion as the courage to see, the courage to feel and the courage to act.\n\nThe courage to see; this is to see beyond our own self interest, our own immediate concerns; to see the needs of the other, the one who is different. The great challenge to see our connection to those who seem to be different to us –the individuals or groups whose life style we cannot understand, the traveller, the refugee, the addict, the prisoner – we share a common humanity, we are connected by that common humanity.\n\nSo there is the courage to see;. There is also the courage to feel – to really enter into the hurt, the pain of the other. In Luke’s Gospel we read of Jesus coming across a funeral procession as a widow prepares to bury her only son. (Luke 7:13) Our English text says that Jesus ‘had compassion for her’. The Greek in which this passage was originally written is far more evocative. ejsplagcnivsqh – the root of that word refers to our bowels, our very innards –our Lord was moved to the very core of his being.\n\nAs I recalled a few weeks back, towards the end of my time in Ahoghill, a young man took his own life – understandably his parents and sister were devastated. As few days later, his father told me of a neighbour he barely knew approaching him in the street, simply shaking him by the hand and saying, ‘My heart is hurting for you.’ There was a connectedness, there was the courage to feel another man’s grief. This reminds me that we carry deep within us for one another the blessing of God.\n\nWe have looked at the way of compassion as the courage to see, the courage to feel – there is then the courage to act.\n\nAung San Suu Kyi has observed that ‘Love is an action; not just a state of mind.’ Or as we read in the First Letter of John:\n\n16 We know love by this, that he laid down his life for us--and we ought to lay down our lives for one another. 17 How does God's love abide in anyone who has the world's goods and sees a brother or sister in need and yet refuses help?\n\n18 Little children, let us love, not in word or speech, but in truth and action. 1 John 3:16-18\n\nOne of the best known of Jesus’ parables is the Parable of the Good Samaritan. In the story all three, the priest, the Levite and the Samaritan see the wounded man by the side of the road. It is quite possible that all three feel a basic sympathy. But only one made a connection, only one followed through in open ended action, stooping down, bandaging his wounds, taking him to an inn. I go back to that description of compassion I gave earlier: It is about the connection between the heart of my being and the heart of yours – and then following that connection.\n\nI said that Paul was talking about gifts – and I have been talking about connectedness in the body, in the community. In truth we cannot talk about exercise of gifts apart from our connectedness in the community. As I remarked last Sunday, we are all endowed with carisma, with gifts to be shared, to be excercised in the Body that is the Church. Every gift, every person is valuable. We are stronger for your presence, we are weaker in your absence.\n\nTo go back to our Jenga tower. With several bricks taken out, it may still stand but it is weaker, it is more fragile. To go back to words of Aung San Suu Kyi. ‘No single one of us is all important. But each one of us is essential’.\n\nMay we as we gather in this place, in all our difference, in all our diversity, recognise in each one of us a particular gift of God to his Church and may we each offer ourselves, our souls and bodies to be a living sacrifice.\n\nSend us out in the power of your Spirit to live and work to your praise and glory. Amen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany32016.txt",
        "raw_ocr_content": "Page 1 of 3\nEPIPHANY 3 – 2016 – Year C\nOver the last few years, a feature of our Fete has been the various games overseen\nby our Youth Clubs that are set up near the entrance. One of these is a large game\nof Jenga. The game begins with a tower constructed of simple smooth oblong\nblocks. One by one the players remove the blocks until the removal of one of\nthem causes the tower to collapse.\nIt is a game of inter-connectedness – the lower blocks all supporting the ones\nabove. It is also a game of instability and weakening as more and more of the\nblocks are withdrawn.\nI thought of this as I reflected on the passage we read from Paul’s First Letter to\nthe Corinthians. As I said last week, he is developing his thoughts on spiritual\ngifts in the context of the unity of the body. Every part has its place and no part is\nunimportant. As I was reflecting on this, I found myself also reading about one of\nthe most influential voices for non violence in our generation, the Burmese\nactivist Aung San Suu Kyi. The daughter of one of the leaders of the resistance to\nthe Japanese occupation in the Second World War, she has taken a principled\nstand against the Burmese Military Regime, being held under house arrest for\nmany years. Recently she lead the forces of democracy to victory in the latest\nelections in Burma. The writer of the book I am reading refers to her as a modern\nprophet of compassion.\nWhat are we talking about when we see that word compassion. Compassion has\nits roots not just in an external sympathy with another but rather an identification\nwith another in their suffering. It is about the connection between the heart of my\nbeing and the heart of yours – and then following that connection. Compassion is\nabout that interconnectedness that lies at the heart of the image of the body that\nPaul is using as he writes to the Church at Corinth.\nIn her own writings Aung San Suu Kyi.talks of the way of compassion as the\ncourage to see, the courage to feel and the courage to act.\nPage 2 of 3\nEPIPHANY 3 – 2016 – Year C\nThe courage to see; this is to see beyond our own self interest, our own\nimmediate concerns; to see the needs of the other, the one who is different. The\ngreat challenge to see our connection to those who seem to be different to us –the\nindividuals or groups whose life style we cannot understand, the traveller, the\nrefugee, the addict, the prisoner – we share a common humanity, we are\nconnected by that common humanity.\nSo there is the courage to see;. There is also the courage to feel – to really enter\ninto the hurt, the pain of the other. In Luke’s Gospel we read of Jesus coming\nacross a funeral procession as a widow prepares to bury her only son. (Luke\n7:13) Our English text says that Jesus ‘had compassion for her’. The Greek in\nwhich this passage was originally written is far more evocative. ejsplagcnivsqh\n– the root of that word refers to our bowels, our very innards –our Lord was\nmoved to the very core of his being.\nAs I recalled a few weeks back, towards the end of my time in Ahoghill, a young\nman took his own life – understandably his parents and sister were devastated.\nAs few days later, his father told me of a neighbour he barely knew approaching\nhim in the street, simply shaking him by the hand and saying, ‘My heart is hurting\nfor you.’ There was a connectedness, there was the courage to feel another man’s\ngrief. This reminds me that we carry deep within us for one another the blessing\nof God.\nWe have looked at the way of compassion as the courage to see, the courage to\nfeel – there is then the courage to act.\nAung San Suu Kyi has observed that ‘Love is an action; not just a state of mind.’\nOr as we read in the First Letter of John:\nPage 3 of 3\nEPIPHANY 3 – 2016 – Year C\n16 We know love by this, that he laid down his life for us--and we ought\nto lay down our lives for one another. 17 How does God's love abide in\nanyone who has the world's goods and sees a brother or sister in need\nand yet refuses help?\n18 Little children, let us love, not in word or speech, but in truth and\naction. 1 John 3:16-18\nOne of the best known of Jesus’ parables is the Parable of the Good Samaritan.\nIn the story all three, the priest, the Levite and the Samaritan see the wounded\nman by the side of the road. It is quite possible that all three feel a basic\nsympathy. But only one made a connection, only one followed through in open\nended action, stooping down, bandaging his wounds, taking him to an inn. I go\nback to that description of compassion I gave earlier: It is about the connection\nbetween the heart of my being and the heart of yours – and then following that\nconnection.\nI said that Paul was talking about gifts – and I have been talking about\nconnectedness in the body, in the community. In truth we cannot talk about\nexercise of gifts apart from our connectedness in the community. As I remarked\nlast Sunday, we are all endowed with carisma, with gifts to be shared, to be\nexcercised in the Body that is the Church. Every gift, every person is valuable.\nWe are stronger for your presence, we are weaker in your absence.\nTo go back to our Jenga tower. With several bricks taken out, it may still stand\nbut it is weaker, it is more fragile. To go back to words of Aung San Suu Kyi.\n‘No single one of us is all important. But each one of us is essential’.\nMay we as we gather in this place, in all our difference, in all our diversity,\nrecognise in each one of us a particular gift of God to his Church and may we\neach offer ourselves,\nour souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen."
    }
}