{
    "title": "The Power of the Spirit",
    "date": "2016-01-10",
    "blurb": "This sermon discusses the power of the Spirit, as described in the Bible. The speaker compares the Spirit to the wind, which is powerful yet elusive, and can never be controlled or constrained. The sermon also emphasizes that the Church should always point to Christ and remember that its traditions and heritage are never greater than Christ.",
    "raw_text": "One of the features of Irish and British conversation is the frequency with which we end up talking about the weather. We certainly have plenty to talk about at the minute. We are currently in the midst of some of the wettest, windiest weather that I can personally remember. We have seen the devastation that has been wrought on businesses, on communities and on individuals. Individuals, communities, governments seem powerless in the face of it all. When this bout of weather finally comes to an end and we manage to get a grasp on the extent and cost of the damage we can begin to reflect on the causes, to what extent this is climate change, to what extent is it due to bad planning policy.\n\nOur Psalm this morning is obviously inspired by the whole phenomenon of lightening, the sudden flash of lightening, the clap of thunder that seems to come out of the blue. There is something really impressive about lightening – the electrical energy released is massive and can cause huge damage to trees and buildings. This sort of power is obviously on the mind of the writer of Psalm 29.\n\nOur Old Testament and Gospel passages each in their own way speak of a power, simmering below the surface, waiting to be released into the world. The writer of our passage from Isaiah speaks of God’s coming act of liberation, of redemption, of a people released from captivity returning to the land of their forefathers. In our Gospel reading, as the crowds who came out to see him speculate as to whether John is the expected Messiah, John himself speaks of the one who will come. John baptised with water; the one who will follow will baptise with the Holy Spirit and with fire. Our Psalm and lessons speak each in their own idiom of latent power ready to be released.\n\nIn the Sundays of Advent, we heard much of the ministry of John the Baptist, as one sent to prepare the way for the coming of the Messiah. Today, the first Sunday after the Epiphany marks something of a transition as John slips into the background and Jesus comes to the fore. As part of that transition John points to Jesus, making the distinction, ‘I baptise with water, the one who is coming, … he will baptise with the Holy Spirit and with fire.’ He points to Jesus as one through whom God is acting in the world. And a specific aspect of that is the Spirit.\n\n'Spirit’ is a word we use to translate the Hebrew word ‘ruach’ and Greek word ‘pneuma’. Both has connotations of wind. Wind, by definition, is hard to define – where does it come from, where is it going. The wind is something to be harnessed, something to be followed but never to be controlled or constrained. Sometimes it is powerful, sometimes it is gentle – always elusive. This is very much the tone of the New Testament references to this Holy Spirit with which Jesus is to baptise. The Spirit descends on Jesus as a dove. The disciples receive it as the breath of the risen Christ yet it comes with wind and flame at Pentecost. The Spirit is to lead the disciples into all truth, will give them the power to witness. The Spirit is the Spirit of life, of truth. The Spirit is promised as Advocate and Guide. The Spirit, like the wind is not to be constrained, controlled by any categories we may seek to place upon it.\n\nAs John in his own day was to point his contemporaries to Jesus, so the Church, in our own day, is to point to Christ. Just as John pointed to one greater than himself so the Church must always remember that the Church, her traditions, her heritage are never greater than the Christ she proclaims. The One John was pointing to was not a ‘gentle Jesus, meek and mild’ but one who was coming to cleanse, to challenge, to redeem, to reclaim for God the world into which he was born. The Church is the Body of Christ, the Servant of Christ, the hands, the feet, the lips of Christ in the world of today. As such it is a community empowered and directed by the Spirit, a community open to and responsive to the Spirit, called to proclaim Christ afresh to each generation.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/epiphany12016.txt",
        "raw_ocr_content": "Page 1 of 3\n1st Sunday after the Epiphany – 2016 – year C\nOne of the features of Irish and British conversation is the frequency with\nwhich we end up talking about the weather. We certainly have plenty to talk\nabout at the minute. We are currently in the midst of some of the wettest,\nwindiest weather that I can personally remember. We have seen the\ndevastation that has been wrought on businesses, on communities and on\nindividuals. Individuals, communities, governments seem powerless in the\nface of it all. When this bout of weather finally comes to an end and we\nmanage to get a grasp on the extent and cost of the damage we can begin to\nreflect on the causes, to what extent this is climate change, to what extent is it\ndue to bad planning policy.\nOur Psalm this morning is obviously inspired by the whole phenomenon of\nlightening, the sudden flash of lightening, the clap of thunder that seems to\ncome out of the blue. There is something really impressive about lightening –\nthe electrical energy released is massive and can cause huge damage to trees\nand buildings. This sort of power is obviously on the mind of the writer of\nPsalm 29\nthe God of | glory | thunders; @\n5 The voice of the Lord | breaks the | cedar trees; @\n7 The voice of the Lord splits the flash of lightning;\n8. The voice of the Lord makes the oak trees writhe\nand strips the | forests | bare; @\nOur Old Testament and Gospel passages each in their own way speak of a\npower, simmering below the surface, waiting to be released into the world. The\nwriter of our passage from Isaiah speaks of God’s coming act of liberation, of\nredemption, of a people released from captivity returning to the land of their\nforefathers. In our Gospel reading, as the crowds who came out to see him\nPage 2 of 3\n1st Sunday after the Epiphany – 2016 – year C\nspeculate as to whether John is the expected Messiah, John himself speaks of\nthe one who will come. John baptised with water; the one who will follow will\nbaptise with the Holy Spirit and with fire. Our Psalm and lessons speak each in\ntheir own idiom of latent power ready to be released.\nIn the Sundays of Advent, we heard much of the ministry of John the Baptist,\nas one sent to prepare the way for the coming of the Messiah. Today, the first\nSunday after the Epiphany marks something of a transition as John slips into\nthe background and Jesus comes to the fore. As part of that transition John\npoints to Jesus, making the distinction, ‘I baptise with water, the one who is\ncoming, … he will baptise with the Holy Spirit and with fire.’ He points to\nJesus as one through whom God is acting in the world. And a specific aspect\nof that is the Spirit.\n‘Spirit’ is a word we use to translate the Hebrew word ‘ruach’ and Greek word\n‘pneuma’. Both has connotations of wind. Wind, by definition, is hard to\ndefine – where does it come from, where is it going. The wind is something to\nbe harnessed, something to be followed but never to be controlled or\nconstrained. Sometimes it is powerful, sometimes it is gentle – always elusive.\nThis is very much the tone of the New Testament references to this Holy Spirit\nwith which Jesus is to baptise. The Spirit descends on Jesus as a dove. The\ndisciples receive it as the breath of the risen Christ yet it comes with wind and\nflame at Pentecost. The Spirit is to lead the disciples into all truth, will give\nthem the power to witness. The Spirit is the Spirit of life, of truth. The Spirit\nPage 3 of 3\n1st Sunday after the Epiphany – 2016 – year C\nis promised as Advocate and Guide. The Spirit, like the wind is not to be\nconstrained, controlled by any categories we may seek to place upon it.\nAs John in his own day was to point his contemporaries to Jesus, so the\nChurch, in our own day, is to point to Christ. Just as John pointed to one\ngreater than himself so the Church must always remember that the Church, her\ntraditions, her heritage are never greater than the Christ she proclaims. The\nOne John was pointing to was not a ‘gentle Jesus, meek and mild’ but one who\nwas coming to cleanse, to challenge, to redeem, to reclaim for God the world\ninto which he was born. The Church is the Body of Christ, the Servant of\nChrist, the hands, the feet, the lips of Christ in the world of today. As such it is\na community empowered and directed by the Spirit, a community open to and\nresponsive to the Spirit, called to proclaim Christ afresh to each generation."
    }
}