{
    "title": "Following in the Footsteps of Jesus",
    "date": "2018-01-14",
    "blurb": "In this sermon, Kevin explores the concept of discipleship, contrasting it with the modern idea of 'following' someone on social media. He emphasizes that Jesus is looking for true disciples, not just admirers, and that discipleship involves a deep commitment and a willingness to learn and grow. The sermon also highlights the idea of Jesus as a gift from God, not to be admired from a distance but to be received and followed.",
    "raw_text": "2nd Sunday of Epiphany – year B – 2018 – Family Service\n\n'Disciples - Following in the footsteps of Jesus’\n\nWell here we are at the beginning of 2018. Christmas is now well behind us. Back then we were listening to the story of the birth of Jesus. We are now starting to follow the story of Jesus the man. This morning we are starting to read about how he began to gather a group of people around him, his disciples.\n\nWhen Jesus said to someone, ‘Follow me?’ – what made them follow? But why? These men left their jobs, their homes, their families to follow Jesus. Following Jesus was a serious business – serious for them, serious for Jesus. What did it mean?\n\nComing to our own day, when we talk of following a lot of people will be thinking of Facebook. For the few who haven’t heard of Facebook, people will establish their own page. And then people will start to contact you saying they would like to be friends, they would like to follow you on Facebook – read about what you think, what you like, what you had for breakfast. You could end up with lots of people following you.\n\nFollowing Jesus is not like following someone on Facebook. Jesus isn’t looking for people who are vaguely curious about him.\n\nGoing back to the Facebook page. If we like the look of someone’s page, or something on their page – it might be a photo or something they have written – you can not just say you are following them you can click on this icon and to say that you like what ever is on their page.\n\nAgain this does not really match up to what following Jesus means. He’s not looking for someone who is curious about him, he’s not even looking for someone who admires him.\n\nI want to use another illustration – can anyone tell me what this is? Hold up a fishing fly put up photo on screen This was given to me by an old man in Ahoghill – Tommy was a very good fisherman – he made his own fishing flies. I called in one day and he was making this one and he just gave it to me.\n\nIt is a gift I have often looked at; as I’ve admired it, I have often thought of Tommy – but I have never used the gift he gave me.\n\nA bit later on in John’s Gospel, Jesus meets Nicodemus, a man who was interested, who was curious – but did not want to commit himself. Jesus tells him ‘God so loved the world that he gave his only son.’\n\nSo I want to pick up on this idea of Jesus as God’s gift to us – a gift not just to be kept on a shelf, brought down occasionally to be admired, but a gift to be used – a gift to be received, a gift to be followed.\n\nJesus is looking for disciples – not just people who will admire him from a distance. Jesus is looking for friends. At the end of his ministry, on the night before he died, Jesus said this to the men who had followed him, who had heard him teach, seen him heal:\n\nYou are my friends when you do the things I command you. I’m no longer calling you servants because servants don’t understand what their master is thinking and planning. No, I’ve named you friends because I’ve let you in on everything I’ve heard from the Father.\n\n“You didn’t choose me, remember; I chose you, and put you in the world to bear fruit, fruit that won’t spoil. John 15:14ff ‘The Message’\n\nPeople who want to listen to what he has to say, who want to learn, who want to walk in the footsteps of Jesus, who want to used by Jesus in the building of his Kingdom – he is looking for me and for you to be his disciples.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year B/epiphany22018family.txt",
        "raw_ocr_content": "Page 1 of 4\n2nd Sunday of Epiphany – year B – 2018 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nWell here we are at the beginning of 2018. Christmas is now well\nbehind us. Back then we were listening to the story of the birth of\nJesus.\nWe are now starting to follow the story of Jesus the man. This\nmorning we are starting to read about how he began to gather a group\nof people around him, his disciples.\nWhen Jesus said to someone, ‘Follow me?’ – what made them follow?\nBut why? These men left their jobs, their homes, their families to\nfollow Jesus.\nFollowing Jesus was a serious business – serious for them, serious for\nJesus.\nWhat did it mean?\nComing to our own day, when we talk of following a lot of people\nwill be thinking of Facebook.\nFacebook Logo\nPage 2 of 4\n2nd Sunday of Epiphany – year B – 2018 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nFor the few who haven’t heard of Facebook, people will establish\ntheir own page. And then people will start to contact you saying they\nwould like to be friends, they would like to follow you on Facebook –\nread about what you think, what you like, what you had for breakfast.\nYou could end up with lots of people following you.\nFollowing Jesus is not like following someone on Facebook. Jesus\nisn’t looking for people who are vaguely curious about him.\nGoing back to the Facebook page. If we like the look of someone’s\npage, or something on their page – it might be a photo or something\nthey have written – you can not just say you are following them\n‘Like’ Logo\nyou can click on this icon and to say that you like what ever is on their\npage.\nAgain this does not really match up to what following Jesus means.\nHe’s not looking for someone who is curious about him, he’s not even\nlooking for someone who admires him.\nPage 3 of 4\n2nd Sunday of Epiphany – year B – 2018 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nI want to use another illustration – can anyone tell me what this is?\nHold up a fishing fly\nput up photo on screen\nThis was given to me by an old man in Ahoghill – Tommy was a very\ngood fisherman – he made his own fishing flies. I called in one day\nand he was making this one and he just gave it to me.\nIt is a gift I have often looked at; as I’ve admired it, I have often\nthought of Tommy – but I have never used the gift he gave me.\nA bit later on in John’s Gospel, Jesus meets Nicodemus, a man who\nwas interested, who was curious – but did not want to commit himself.\nJesus tells him ‘God so loved the world that he gave his only son.’\nSo I want to pick up on this idea of Jesus as God’s gift to us – a gift\nnot just to be kept on a shelf, brought down occasionally to be\nadmired, but a gift to be used – a gift to be received, a gift to be\nfollowed.\nJesus is looking for disciples – not just people who will admire him\nfrom a distance. Jesus is looking for friends. At the end of his\nPage 4 of 4\n2nd Sunday of Epiphany – year B – 2018 – Family Service\n‘Disciples - Following in the footsteps of Jesus’\nministry, on the night before he died, Jesus said this to the men who\nhad followed him, who had heard him teach, seen him heal:\nYou are my friends when you do the things I command you.\nI’m no longer calling you servants because servants don’t\nunderstand what their master is thinking and planning. No,\nI’ve named you friends because I’ve let you in on everything\nI’ve heard from the Father.\n“You didn’t choose me, remember; I chose you, and put you\nin the world to bear fruit, fruit that won’t spoil. John 15:14ff\n‘The Message’\nPeople who want to listen to what he has to say, who want to learn,\nwho want to walk in the footsteps of Jesus, who want to used by Jesus\nin the building of his Kingdom – he is looking for me and for you to\nbe his disciples."
    }
}