{
    "title": "Light of Epiphany",
    "date": "2017-01-22",
    "blurb": "This sermon reflects on the theme of light in the season of Epiphany, drawing from various biblical passages. It discusses the symbolism of light as the presence of God and how it guides us in life. It also highlights the transformative power of the Gospel, using real-life examples to illustrate the impact of forgiveness and reconciliation.",
    "raw_text": "We are now well into the season of Epiphany that follows on after Christmas. One of the themes of Epiphany is that of light. On the first Sunday of Epiphany I offered a definition of epiphany as “moments when God breaks through”, those moments of revelation, realisation, when God seems very real. I want to keep those two themes of light and those moments when God breaks through, seems very real together in our minds.\n\nLight is a word that crops up in our Old Testament, Psalm and Gospel today. In the book Genesis, light is the first act of God’s creation as God said; \"Let there be light\"; and there was light. 4 And God saw that the light was good; Gen 1:3,4\n\nLight as phenomenon enables us to see, it is everywhere, it is vital to all aspects of life. It is able to travel huge distances across the vast emptiness of space. Of the stars that we can see in the night sky, the closest to us is, Alpha Centauri is some 4.25 light years away – in other words it has taken 4.25 years for the light to travel from that star to the earth – Barack Obama hadn’t even been re-elected when the light we now see from that star set out for earth. Other stars are hundreds, thousands, millions of light years away from us.\n\nI think of words we read at Christmas from John’s Gospel: What has come into being 4 in him was life, and the life was the light of all people. 5 The light shines in the darkness, and the darkness did not overcome it. John 1:3,5\n\nThat light was of course the light of Christ. Death did not overcome him and the darkness of the world has never overcome him, his message, his gospel. One of my memories of a visit Auschwitz a few years ago was that of standing on the site of the death of Fr Maximillian Kolbe. Following an escape of a prisoner, ten inmates were sentenced to death by starvation in a punishment bunker. Fr Kolbe stepped forward to offer himself in place of a young man with wife and children. The simple cross that marks the spot in the midst of a camp in which over a million were to perish stands as a reminder of a light that shone in the midst of brutal darkness that nothing could put out.\n\nBefore the sophistication of sat navs and smartphones working with GPS satellites, navigators steered by the light of the stars. Then of course there are the lighthouses and navigation buoys that mark out danger and safe passages for ships travelling at night. I remember one night when we were in the North coming back into Carnlough on the North Antrim coast after a friend had taken us out fishing. As I looked towards the shore I was aware of not one light but a whole load of lights. There was the light house at the end of the pier - but not only that there were street lights, traffic lights, lights from shops and houses. My friend picked out the light of the lighthouse and steered by that and we arrived safely in the harbour. If he had picked the wrong light we would have ended up on rocks.\n\nIn our reading from Isaiah, a passage that is to be picked up in our Gospel reading, we read:\nThe people walking in darkness have seen a great light; on those living in the land of the shadow of death a light has dawned. (Isaiah 9:2)\n\nThroughout the scriptures, light symbolizes the presence of God. One of the titles we are told Jesus took for himself was that of light:\n\"I am the light of the world. Whoever follows me will never walk in darkness but will have the light of life.\" John 8:12\n\nThe life of Jesus, his teachings, his outreach to the sick and to those who were on the margins of society, his death and resurrection, for me are a guiding star, a light that gives direction and purpose. I remember talking to an old lady many years ago. She was recalling asking her father for advice on how you decided on what was the right or wrong thing to do in life. He replied by suggesting that if she thought of Jesus standing by her side as she made a particular choice, that she just ask herself ‘Do I feel comfortable with this?’ Not bad advice to give anyone, young or old. “Whoever follows me will never walk in darkness but will have the light of life.”\n\nAs we have thought about the light of Christ never being overcome, as we have spoken about the light of Christ giving direction and purpose to life, so we come to think of the power of the Gospel to change and transform. We live in a very practical age. ‘Relevance’ is a key word on many people’s lips as they look at philosophies, at structures in society, and, yes, at the Church and its message. Not so very long ago a member of the Parish wondered did what we say, did what we proclaim actually strike a chord with his children’s generation. That is a very fair point. But I would also say that in the light of what we have seen in Washington this week, the rhetoric of division, of fear, of distrust of the different that has preceded all this, then the Church, the Gospel has something very powerful to say to modern society – whether that society wants to hear that is another question entirely.\n\nAs I thought about this my mind went back to an event that was one of the defining moments of the Troubles in Northern Ireland. On Remembrance Sunday in Enniskillen 1987 the Provisional IRA planted a bomb at the War Memorial at which hundreds had gathered for the annual Remembrance Day Service. 12 were killed and 68 injured. In the wake of such an event one would have normally expected a swift Loyalist retaliation with Roman Catholic communities being bombed. But into that darkness Gordon Wilson, a pharmacist in the town, whose daughter Marie had died at his side in the blast, spoke words of forgiveness and reconciliation rooted in his profound Christian faith:\n\"I have lost my daughter, and we shall miss her\", he said, \"but I bear no ill will. I bear no grudge.”\n\nIt represented a turning point for community relations in the town of Enniskillen and emboldened many to redouble efforts in promoting reconciliation.\n\nI spoke at the outset of Epiphany in terms of “moments when God breaks through” That day in Enniskillen, in those words of Gordon Wilson, has always struck me as one of those moments of Epiphany, one of those “moments when God breaks through”; broke through not in the abstract but in the words and witness of one particular man.\n\nThis reminds me that Jesus spoke not only of himself in terms of light but also called his followers to be light.\n14 \"You are the light of the world. A city built on a hill cannot be hid. … 16 In the same way, let your light shine before others, so that they may see your good works and give glory to your Father in heaven Matt 5:14-16\n\nThis week, in our homes, our schools, our places of work and recreation may we be ones in whom and through God breaks through. In the words of the Blessing for the season of Epiphany: ‘Christ be manifest to you, that your lives may be a light to the world.’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany32017.txt",
        "raw_ocr_content": "Page 1 of 5\nEPIPHANY 3 – Year A – 2017\nWe are now well into the season of Epiphany that follows on after Christmas.\nOne of the themes of Epiphany is that of light. On the first Sunday of\nEpiphany I offered a definition of epiphany as “moments when God breaks\nthrough”, those moments of revelation, realisation, when God seems very real.\nI want to keep those two themes of light and those moments when God breaks\nthrough, seems very real together in our minds.\nLight is a word that crops up in our Old Testament, Psalm and Gospel today.\nIn the book Genesis, light is the first act of God’s creation as God said;\n\"Let there be light\"; and there was light. 4 And God saw that the light\nwas good; Gen 1:3,4\nLight as phenomenon enables us to see, it is everywhere, it is vital to all\naspects of life. It is able to travel huge distances across the vast emptiness of\nspace. Of the stars that we can see in the night sky, the closest to us is, Alpha\nCentauri is some 4.25 light years away – in other words it has taken 4.25 years\nfor the light to travel from that star to the earth – Barack Obama hadn’t even\nbeen re-elected when the light we now see from that star set out for earth.\nOther stars are hundreds, thousands, millions of light years away from us.\nI think of words we read at Christmas from John’s Gospel:\nWhat has come into being 4 in him was life, and the life was the light\nof all people. 5 The light shines in the darkness, and the darkness did\nnot overcome it. John 1:3,5\nThat light was of course the light of Christ. Death did not overcome him and\nthe darkness of the world has never overcome him, his message, his gospel.\nOne of my memories of a visit Auschwitz a few years ago was that of standing\non the site of the death of Fr Maximillian Kolbe. Following an escape of a\nPage 2 of 5\nEPIPHANY 3 – Year A – 2017\nprisoner, ten inmates were sentenced to death by starvation in a punishment\nbunker. Fr Kolbe stepped forward to offer himself in place of a young man\nwith wife and children. The simple cross that marks the spot in the midst of a\ncamp in which over a million were to perish stands as a reminder of a light that\nshone in the midst of brutal darkness that nothing could put out.\nBefore the sophistication of sat navs and smartphones working with GPS\nsatellites, navigators steered by the light of the stars. Then of course there are\nthe lighthouses and navigation buoys that mark out danger and safe passages\nfor ships travelling at night. I remember one night when we were in the North\ncoming back into Carnlough on the North Antrim coast after a friend had taken\nus out fishing. As I looked towards the shore I was aware of not one light but a\nwhole load of lights. There was the light house at the end of the pier - but not\nonly that there were street lights, traffic lights, lights from shops and houses.\nMy friend picked out the light of the lighthouse and steered by that and we\narrived safely in the harbour. If he had picked the wrong light we would have\nended up on rocks.\nIn our reading from Isaiah, a passage that is to be picked up in our Gospel\nreading, we read:\nThe people walking in darkness\nhave seen a great light;\non those living in the land of the shadow of death\na light has dawned. (Isaiah 9:2)\nThroughout the scriptures, light symbolizes the presence of God. One of the\ntitles we are told Jesus took for himself was that of light:\n\"I am the light of the world. Whoever follows me will never walk in\ndarkness but will have the light of life.\" John 8:12\nPage 3 of 5\nEPIPHANY 3 – Year A – 2017\nThe life of Jesus, his teachings, his outreach to the sick and to those who were\non the margins of society, his death and resurrection, for me are a guiding star,\na light that gives direction and purpose. I remember talking to an old lady\nmany years ago. She was recalling asking her father for advice on how you\ndecided on what was the right or wrong thing to do in life. He replied by\nsuggesting that if she thought of Jesus standing by her side as she made a\nparticular choice, that she just ask herself ‘Do I feel comfortable with this?’\nNot bad advice to give anyone, young or old. “Whoever follows me will never\nwalk in darkness but will have the light of life.\"\nAs we have thought about the light of Christ never being overcome, as we have\nspoken about the light of Christ giving direction and purpose to life, so we\ncome to think of the power of the Gospel to change and transform. We live in\na very practical age. ‘Relevance’ is a key word on many people’s lips as they\nlook at philosophies, at structures in society, and, yes, at the Church and its\nmessage. Not so very long ago a member of the Parish wondered did what we\nsay, did what we proclaim actually strike a chord with his children’s\ngeneration. That is a very fair point. But I would also say that in the light of\nwhat we have seen in Washington this week, the rhetoric of division, of fear, of\ndistrust of the different that has preceded all this, then the Church, the Gospel\nhas something very powerful to say to modern society – whether that society\nwants to hear that is another question entirely.\nAs I thought about this my mind went back to an event that was one of the\ndefining moments of the Troubles in Northern Ireland. On Remembrance\nSunday in Enniskillen 1987 the Provisional IRA planted a bomb at the War\nPage 4 of 5\nEPIPHANY 3 – Year A – 2017\nMemorial at which hundreds had gathered for the annual Remembrance Day\nService. 12 were killed and 68 injured. In the wake of such an event one\nwould have normally expected a swift Loyalist retaliation with Roman Catholic\ncommunities being bombed. But into that darkness Gordon Wilson, a\npharmacist in the town, whose daughter Marie had died at his side in the blast,\nspoke words of forgiveness and reconciliation rooted in his profound Christian\nfaith:\n\"I have lost my daughter, and we shall miss her\", he said, \"but I bear\nno ill will. I bear no grudge.”\nIt represented a turning point for community relations in the town of\nEnniskillen and emboldened many to redouble efforts in promoting\nreconciliation.\nI spoke at the outset of Epiphany in terms of “moments when God breaks\nthrough” That day in Enniskillen, in those words of Gordon Wilson, has\nalways struck me as one of those moments of Epiphany, one of those\n“moments when God breaks through”; broke through not in the abstract but in\nthe words and witness of one particular man.\nThis reminds me that Jesus spoke not only of himself in terms of light but also\ncalled his followers to be light.\n14 \"You are the light of the world. A city built on a hill cannot be hid.\n… 16 In the same way, let your light shine before others, so that they\nmay see your good works and give glory to your Father in heaven\nMatt 5:14-16\nThis week, in our homes, our schools, our places of work and recreation may\nwe be ones in whom and through God breaks through. In the words of the\nPage 5 of 5\nEPIPHANY 3 – Year A – 2017\nBlessing for the season of Epiphany: ‘Christ be manifest to you, that your lives\nmay be a light to the world.’"
    }
}