{
    "title": "The Value of Service",
    "date": "2020-01-19",
    "blurb": "In this sermon, Kevin reflects on his recent experiences of being on the receiving end of care and service. He discusses the importance of learning to receive, the power dynamics in service, and the need for stepping back and reflecting on life. He emphasizes that we are not indispensable and that God is found in all those who call on Christ as Lord.",
    "raw_text": "The last six weeks have been an interesting experience for me. For the first time in over forty years, I was not leading worship on Christmas Day. But there was more to it than that. I was on the receiving end of the care and attention of others.\n\nHow was I going to get cover for services? Two phone calls and a few emails my problem was sorted – many thanks to my colleagues Ken Sherwood and Robert Deane. A truth begins to dawn – you are not indispensable.\n\nThen of course once in hospital, I found myself depending on others – to get in and out of bed, go to the loo, the shower. Others were telling me what to do. For those of us used to being ‘in control’ of life, for those used to doing instead of watching, of giving rather than receiving, it can be a salutary lesson. Things do not ultimately depend on us being there, there will be others who can fill gaps. Learning to receive is an important lesson that some of us can find hard to learn.\n\nI remember discussing this with a senior colleague near the beginning of my ministry. He remarked that we can lay so much stress on the words ‘It is more blessed to give than to receive’ that we sometimes forget that the most precious gift we can give someone is to give them the opportunity to give to us. There can be a power dynamic in service – I am giving, you are receiving. As I say, to be, of necessity, on the receiving end was a salutary experience.\n\nOver this period, I made a conscious decision not to come to Church here in St Mary’s I had asked Ken and Robert to take the services – I was going to leave it to them! So the Sundays I was here in Howth, I headed down to All Saints in Raheny, where I had started off in ministry back in 1978. The worship was not that different to here, but the prayer book was used in a slightly different way – on the Sunday after Christmas, Morning Prayer, was said quietly and reflectively with no music – a deliberate contrast to the energy of the Christmas services.\n\nWhen we were in Belfast, one Sunday we attended a community Church in Antrim, which some of Rachel’s cousins now attend instead of their local Presbyterian Church. This was a very different type of Church which had attracted a very varied congregation in terms of age, social class, some heavily tattooed whom you would not see in many a mainstream Church. The worship was very different. This was a very outward community looking not only in terms of evangelism but also in serving the local community. In a Protestant community that has put very little emphasis on Holy Communion, each service starts with a very simple sharing of bread and wine, the latter from a shared cup, with which we would be familiar. On another occasion I attended St George’s, a Church of Ireland Church very much in the high Anglican tradition, which also has drawn a very varied community, which has reached out to the Iranian Christian community in Belfast.\n\nThere is a value in going outside our particular comfort zone with a genuine openness of mind. I suppose what these last six weeks have given me is an opportunity to step back, and reflect on life, what is important and what is not important.\n\nI suppose for this reason, when I came to reflect on the lessons set for today, the passage we read from Paul’s 1st letter to the Corinthians particularly appealed to me. Paul is writing to a community of new Christians, full of enthusiasm but one that is experiencing divisions among themselves. There are divisions based on personalities. People are obviously thankful to the individuals who had brought them to faith, be it Paul, or Apollos, or Cephas. It is natural to feel an affinity with particular people – be it on the basis of personality, way of speaking or whatever.\n\nLooking at the Church in Corinth from the outside, Paul is seeing this natural affinity with particular people, particular preachers manifesting itself in division and argument. In the process they are losing sight of the very Gospel that these individuals have proclaimed, the crucified, risen and ascended Christ that lies at the heart of it all.\n\nPaul is encouraging them to stop, to step back and see what is happening. Periodically we all need to stop, to step back, to allow our self space in our busy schedules to stop, to reflect on where we are in faith, in life in general. While I may not have chosen the reason for it, the last six weeks have been something of a gift as I have learned a lesson we all need to learn.\n\nWe are not indispensable.\n\nWe need to learn the value of service not only given but also received.\n\nGod is to be found, not only in my particular corner of the Church but in all those who call on Christ as Lord.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year A/epiphany32020.txt",
        "raw_ocr_content": "Page 1 of 4\nEpiphany 3 – Year A – 2020\nThe last six weeks have been an interesting experience for me. For the first\ntime in over forty years, I was not leading worship on Christmas Day. But\nthere was more to it than that. I was on the receiving end of the care and\nattention of others.\nHow was I going to get cover for services? Two phone calls and a few emails\nmy problem was sorted – many thanks to my colleagues Ken Sherwood and\nRobert Deane. A truth begins to dawn – you are not indispensable.\nThen of course once in hospital, I found myself depending on others – to get in\nand out of bed, go to the loo, the shower. Others were telling me what to do.\nFor those of us used to being ‘in control’ of life, for those used to doing\ninstead of watching, of giving rather than receiving, it can be a salutary lesson.\nThings do not ultimately depend on us being there, there will be others who\ncan fill gaps. Learning to receive is an important lesson that some of us can\nfind hard to learn.\nI remember discussing this with a senior colleague near the beginning of my\nministry. He remarked that we can lay so much stress on the words ‘It is more\nblessed to give than to receive’ that we sometimes forget that the most precious\ngift we can give someone is to give them the opportunity to give to us. There\ncan be a power dynamic in service – I am giving, you are receiving. As I say,\nto be, of necessity, on the receiving end was a salutary experience.\nPage 2 of 4\nEpiphany 3 – Year A – 2020\nOver this period, I made a conscious decision not to come to Church here in St\nMary’s I had asked Ken and Robert to take the services – I was going to leave\nit to them! So the Sundays I was here in Howth, I headed down to All Saints in\nRaheny, where I had started off in ministry back in 1978. The worship was not\nthat different to here, but the prayer book was used in a slightly different way –\non the Sunday after Christmas, Morning Prayer, was said quietly and\nreflectively with no music – a deliberate contrast to the energy of the Christmas\nservices.\nWhen we were in Belfast, one Sunday we attended a community Church in\nAntrim, which some of Rachel’s cousins now attend instead of their local\nPresbyterian Church. This was a very different type of Church which had\nattracted a very varied congregation in terms of age, social class, some heavily\ntattooed whom you would not see in many a mainstream Church. The worship\nwas very different. This was a very outward community looking not only in\nterms of evangelism but also in serving the local community. In a Protestant\ncommunity that has put very little emphasis on Holy Communion, each service\nstarts with a very simple sharing of bread and wine, the latter from a shared\ncup, with which we would be familiar. On another occasion I attended St\nGeorge’s, a Church of Ireland Church very much in the high Anglican\ntradition, which also has drawn a very varied community, which has reached\nout to the Iranian Christian community in Belfast.\nThere is a value in going outside our particular comfort zone with a genuine\nopenness of mind. I suppose what these last six weeks have given me is an\nPage 3 of 4\nEpiphany 3 – Year A – 2020\nopportunity to step back, and reflect on life, what is important and what is not\nimportant.\nI suppose for this reason, when I came to reflect on the lessons set for today,\nthe passage we read from Paul’s 1st letter to the Corinthians particularly\nappealed to me. Paul is writing to a community of new Christians, full of\nenthusiasm but one that is experiencing divisions among themselves. There are\ndivisions based on personalities. People are obviously thankful to the\nindividuals who had brought them to faith, be it Paul, or Apollos, or Cephas. It\nis natural to feel an affinity with particular people – be it on the basis of\npersonality, way of speaking or whatever.\nLooking at the Church in Corinth from the outside, Paul is seeing this natural\naffinity with particular people, particular preachers manifesting itself in\ndivision and argument. In the process they are losing sight of the very Gospel\nthat these individuals have proclaimed, the crucified, risen and ascended Christ\nthat lies at the heart of it all.\nPaul is encouraging them to stop, to step back and see what is happening.\nPeriodically we all need to stop, to step back, to allow our self space in our\nbusy schedules to stop, to reflect on where we are in faith, in life in general.\nWhile I may not have chosen the reason for it, the last six weeks have been\nsomething of a gift as I have learned a lesson we all need to learn.\nWe are not indispensable.\nWe need to learn the value of service not only given but also received.\nPage 4 of 4\nEpiphany 3 – Year A – 2020\nGod is to be found, not only in my particular corner of the Church but in\nall those who call on Christ as Lord."
    }
}