{
    "title": "Spiritual Gifts and Response to Suffering",
    "date": "2009-01-18",
    "blurb": "This sermon discusses the spiritual gifts and their place and purpose within the life of the Church. It emphasizes the importance of using these gifts for the common good, particularly in response to suffering, as exemplified by the earthquake in Haiti. The sermon encourages individuals to cherish, foster and use their spiritual gifts in the power of the Spirit.",
    "raw_text": "At the beginning of each week I print out for myself a copy of the Collect, Psalm and Lessons for the following Sunday. As I sit and think and think and sit particular words of themes strike a chord and then, with background reading, the sermon will begin to take shape. This week the passage that caught my attention was the portion set for the Epistle, 1st Corinthians chapter 12, and its references to spiritual gifts, their variety, their place and function within the life of the Church and the individual. The Collect for today seemed appropriate.\n\nThen something may happen during the week that blows all these developing thoughts all away. I speak of course of the earthquake that struck Haiti earlier in the week. I don’t think Hilary Clinton was far off the mark when she spoke of it of being of “biblical proportions”. How the poorest of the poor could be visited with disaster on such a cataclysmic scale is beyond our comprehension.\n\nI am not going to attempt a reflection on the problem of evil, the problem of why bad things happen to the innocent, the poor, the vulnerable. I do think we can reflect on what is to be our response in the face of suffering as individuals, as a community and as a nation. Events such as this certainly do serve to put a lot of things in perspective – whatever problems we are facing as we move into 2010, we have our health, our families and a roof over our heads.\n\nI want to stay with those themes of spiritual gifts, their place and purpose within the life of the Church. All too often discussion of spiritual gifts can become very introverted – what gift do I want, what would it do for my spirituality. The words of the Collect, our prayer for this week, steer me away from this:\n\n> Almighty God,\n> in Christ you make all things new:\n> Transform the poverty of our nature\n> by the riches of your grace,\n> and in the renewal of our lives\n> make known your heavenly glory;\n\nThe portion for the Epistle speaks of gifts given at the behest of the Spirit for the common good. So that lives transformed by the Spirit (in a manner of the Spirit’s choosing) may bear witness to the majesty and glory of God. What we are talking of here is authentic witness grounded in the realities and problems of the world in which we are placed.\n\nA number of nations, including Ireland, have already responded. The Church of Ireland Bishops Appeal has pledged an initial sum of €20,000 to be channelled through Christian Aid and Church Collections are to be made as a matter of urgency.\n\nDuring the week, as part of their own e-mail posting, Christian Aid included a prayer for the people of Haiti at this time, suggesting it be used in our worship. I have included it on this week’s lesson sheet for you to take home and use.\n\n> A prayer for Haiti - Christian Aid\n> Loving God of creation,\n> at this time of devastation\n> we hold before you the people of Haiti.\n> When the damage is unimaginable,\n> and the suffering seems overwhelming,\n> remind us that every person affected\n> is loved, honoured and precious in your sight.\n> We remember all those who have been hurt;\n> all who have lost their homes, livelihoods and loved ones.\n> Work through us to bring healing\n> to broken and distorted lives,\n> peace to those who have been thrown into despair,\n> light to those in darkness,\n> and hope to those who fear.\n> We ask this in the name of Jesus\n> in whom all life and grace is found.\n> Work through us to bring healing\n> to broken and distorted lives,\n> peace to those who have been thrown into despair,\n> light to those in darkness,\n> and hope to those who fear\n\nSituations such as this raise questions.\nWhat is the point of prayer?\nHow does God answer prayer such as this?\nThe answer lies in the words of the prayer itself: ‘Work through us’.\n\nGod works in and through people. As we pray for other people so we must, as part of that prayer, offer ourselves, that we might be part of the answer to our own prayers. God will work in Haiti in and through people on the ground to bring healing, peace, hope and light into the midst of appalling tragedy. We, for our part, can empower such people through our gifts, our service..\n\nStepping back from the particularity of Haiti, it does set me thinking about this whole issue of authentic witness in the ongoing life of the Church. Lives transformed by the Spirit, bearing witness to the majesty, the glory and the love of God in the particular situations and circumstances in which we are placed.\n\nWhat are the gifts that God has given to you and to me. As Paul reminds his readers, ‘To each is given the manifestation of the Spirit ..’; gifts of discernment, of encouragement, of service, of power. Gifts given not for our own benefit or pride but ‘for the common good’. For the building up of the Church, for the encouragement of those in adversity, for the advancement of reconciliation and justice – that God’s will may be done in and through us in the world in which we live, in our homes, our schools and businesses, this community in which we are set.\n\nWhat gift has God given you? Cherish that gift, foster that gift and use it in the power of the Spirit.\n\n> Almighty God,\n> in Christ you make all things new:\n> Transform the poverty of our nature\n> by the riches of your grace,\n> and in the renewal of our lives\n> make known your heavenly glory;\n> through Jesus Christ our Lord.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/Epiphany 2 - 2009.txt",
        "raw_ocr_content": "Page 1 of 3\n2nd Sunday of Epiphany – 2010 – year C\nAt the beginning of each week I print out for myself a copy of the Collect, Psalm and\nLessons for the following Sunday. As I sit and think and think and sit particular words of\nthemes strike a chord and then, with background reading, the sermon will begin to take\nshape. This week the passage that caught my attention was the portion set for the Epistle,\n1st Corinthians chapter 12, and its references to spiritual gifts, their variety, their place and\nfunction within the life of the Church and the individual. The Collect for today seemed\nappropriate.\nThen something may happen during the week that blows all these developing thoughts all\naway. I speak of course of the earthquake that struck Haiti earlier in the week. I don’t\nthink Hilary Clinton was far off the mark when she spoke of it of being of “biblical\nproportions”. How the poorest of the poor could be visited with disaster on such a\ncataclysmic scale is beyond our comprehension.\nI am not going to attempt a reflection on the problem of evil, the problem of why bad\nthings happen to the innocent, the poor, the vulnerable. I do think we can reflect on what\nis to be our response in the face of suffering as individuals, as a community and as a\nnation. Events such as this certainly do serve to put a lot of things in perspective –\nwhatever problems we are facing as we move into 2010, we have our health, our families\nand a roof over our heads.\nI want to stay with those themes of spiritual gifts, their place and purpose within the life of\nthe Church. All too often discussion of spiritual gifts can become very introverted – what\ngift do I want, what would it do for my spirituality. The words of the Collect, our prayer\nfor this week, steer me away from this:\nAlmighty God,\nin Christ you make all things new:\nTransform the poverty of our nature\nby the riches of your grace,\nand in the renewal of our lives\nmake known your heavenly glory;\nThe portion for the Epistle speaks of gifts given at the behest of the Spirit for the common\ngood. So that lives transformed by the Spirit (in a manner of the Spirit’s choosing) may\nbear witness to the majesty and glory of God. What we are talking of here is authentic\nwitness grounded in the realities and problems of the world in which we are placed.\nPage 2 of 3\n2nd Sunday of Epiphany – 2010 – year C\nA number of nations, including Ireland, have already responded. The Church of Ireland\nBishops Appeal has pledged an initial sum of €20,000 to be channelled through Christian\nAid and Church Collections are to be made as a matter of urgency.\nDuring the week, as part of their own e-mail posting, Christian Aid included a prayer for\nthe people of Haiti at this time, suggesting it be used in our worship. I have included it on\nthis week’s lesson sheet for you to take home and use.\nA prayer for Haiti - Christian Aid\nLoving God of creation,\nat this time of devastation\nwe hold before you the people of Haiti.\nWhen the damage is unimaginable,\nand the suffering seems overwhelming,\nremind us that every person affected\nis loved, honoured and precious in your sight.\nWe remember all those who have been hurt;\nall who have lost their homes, livelihoods and loved ones.\nWork through us to bring healing\nto broken and distorted lives,\npeace to those who have been thrown into despair,\nlight to those in darkness,\nand hope to those who fear.\nWe ask this in the name of Jesus\nin whom all life and grace is found.\nWork through us to bring healing\nto broken and distorted lives,\npeace to those who have been thrown into despair,\nlight to those in darkness,\nand hope to those who fear\nSituations such as this raise questions.\nWhat is the point of prayer?\nPage 3 of 3\n2nd Sunday of Epiphany – 2010 – year C\nHow does God answer prayer such as this?\nThe answer lies in the words of the prayer itself: ‘Work through us’.\nGod works in and through people. As we pray for other people so we must, as part of that\nprayer, offer ourselves, that we might be part of the answer to our own prayers. God will\nwork in Haiti in and through people on the ground to bring healing, peace, hope and light\ninto the midst of appalling tragedy. We, for our part, can empower such people through\nour gifts, our service..\nStepping back from the particularity of Haiti, it does set me thinking about this whole\nissue of authentic witness in the ongoing life of the Church. Lives transformed by the\nSpirit, bearing witness to the majesty, the glory and the love of God in the particular\nsituations and circumstances in which we are placed.\nWhat are the gifts that God has given to you and to me. As Paul reminds his readers, ‘To\neach is given the manifestation of the Spirit ..’; gifts of discernment, of encouragement, of\nservice, of power. Gifts given not for our own benefit or pride but ‘for the common good’.\nFor the building up of the Church, for the encouragement of those in adversity, for the\nadvancement of reconciliation and justice – that God’s will may be done in and through us\nin the world in which we live, in our homes, our schools and businesses, this community\nin which we are set.\nWhat gift has God given you? Cherish that gift, foster that gift and use it in the power of\nthe Spirit.\nAlmighty God,\nin Christ you make all things new:\nTransform the poverty of our nature\nby the riches of your grace,\nand in the renewal of our lives\nmake known your heavenly glory;\nthrough Jesus Christ our Lord."
    }
}