{
    "title": "From Cheers to Jeers",
    "date": "2014-04-16",
    "blurb": "This sermon reflects on the betrayal of Jesus by Judas during Holy Week. It explores the motivations behind Judas' actions and the concept of personal agendas. It emphasizes that God's purposes are not limited by our own narrow visions and that He works through us despite our imperfections.",
    "raw_text": "I grew up in Birmingham in the 50’s and 60’s. It was the time of the Cold War. I remember vividly the fear that went through Britain during the Cuban Missile Crisis, as the world teetered on the edge of nuclear conflict. Reports of espionage trials, trials of those accused of spying for Russia, would appear in the paper from time to time.\n\nI recall as a youngster, as one of these trials was featuring in a radio news bulletin, asking my mother the meaning of the word treason. Remember at that stage the ravages of the 2nd World War were still a recent memory. I remember my mother saying that she felt to betray your country was an awful thing to do.\n\nTreason, treachery always attracted the severest of penalties. In Tudor times it was to be hung, drawn and quartered. In more recent times terrorist groups in the North abandoned the bodies of suspected traitors in unmarked graves.\n\nAnd so the figure of Judas has always attracted particular dislike as the story of the Last Supper, the Betrayal in the Garden has been told. The thought that one of the closest confidants of Jesus, who had seen him heal, seen him feed the crowds, heard him preach; one of those who had walked the hills and roads of Galilee – the thought just seems too much.\n\nOf course there has been endless speculation as to what prompted Judas to do this. Was it sheer greed, was it the action of a deeply disillusioned man – had Jesus fallen so short of his expectations of what a Messiah would be like?\n\nSome have even argued that he was trying to force Jesus’ hand so that once he was in the hands of the authorities, facing death he would have to act to bring in the Kingdom. This is what I said, speculation and no more than that. But there is a common thread running through all the suggestions that I think gives us food to think about in our own reflections. It is the matter of agendas – Judas bringing something of his own agenda to how he saw things working out.\n\nIt is easy to distance ourselves from the figure of Judas but if I am brutally honest, there is very possibly something of Judas in each one of us. This is where the subject of agendas comes to my mind. I can offer my service – but it can be on my terms. I can bring my own expectations to things and if these are not met then I can withdraw my service, my support. We can couch this very politely, even under the cloak of principle. Jesus, for whatever reasons, disappointed Judas, did not meet Judas’ expectations – and Judas left the light and the fellowship and walked out into the night.\n\nAs the door closes behind him Jesus says a remarkable thing.\n\nNow the Son of Man has been glorified, and God has been glorified in him.\n\nAs we progress through John’s Gospel towards the Cross – it becomes increasingly clear that the coming sacrifice is one that is freely embraced. This is not something that happens to Jesus – this is something that Jesus does, freely and willingly. He will stand before Pilate – in John’s account it is not so much a matter of Pilate interrogating Jesus, it is Jesus who is in control. As he dies on the Cross, John tells us of Jesus proclaiming, ‘It is finished’. The task is done, the job is accomplished. I recall Professor Vokes, who lectured us in St John’s Gospel declaring that John presents us with a picture of Jesus reigning from the Cross.\n\nAnd it all begins with Judas walking out into the dark.\n\nWhat all this reminds me is that God’s purposes in me, in you, in the Church are not limited by my own narrow vision, my own limited agendas. God works in and though me, through you, through the Church in all its imperfection.\n\nGod chooses to work in and through us but he is not limited by us. Jesus had called Judas to follow him but Jesus was not going to be limited by the limitations of Judas.\n\nWe come to God as we are, in all our limitations, all our imperfections, all our limited agendas. God takes us as we are, loves us as we are, seeks to work in and through us. God is glorified even in our failure, even in our inadequacy – for nothing, not even us, can ultimately frustrate his purposes of love for all mankind.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2014/From Cheeers to Jeers - Wednesday - Betrayal and Glory.txt",
        "raw_ocr_content": "Page 1 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week\nWednesday – Betrayal and Glory\nI grew up in Birmingham in the 50’s and 60’s. It was the time of the Cold\nWar. I remember vividly the fear that went through Britain during the Cuban\nMissile Crisis, as the world teetered on the edge of nuclear conflict. Reports of\nespionage trials, trials of those accused of spying for Russia, would appear in\nthe paper from time to time.\nI recall as a youngster, as one of these trials was featuring in a radio news\nbulletin, asking my mother the meaning of the word treason. Remember at that\nstage the ravages of the 2nd World War were still a recent memory. I remember\nmy mother saying that she felt to betray your country was an awful thing to do.\nTreason, treachery always attracted the severest of penalties. In Tudor times it\nwas to be hung, drawn and quartered. In more recent times terrorist groups in\nthe North abandoned the bodies of suspected traitors in unmarked graves.\nAnd so the figure of Judas has always attracted particular dislike as the story of\nthe Last Supper, the Betrayal in the Garden has been told. The thought that\none of the closest confidants of Jesus, who had seen him heal, seen him feed\nthe crowds, heard him preach; one of those who had walked the hills and roads\nof Galilee – the thought just seems to much.\nOf course there has been endless speculation as to what prompted Judas to do\nthis. Was it sheer greed, was it the action of a deeply disillusioned man – had\nJesus fallen so short of his expectations of what a Messiah would be like?\nSome have even argued that he was trying to force Jesus’ hand so that once he\nwas in the hands of the authorities, facing death he would have to act to bring\nPage 2 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week\nWednesday – Betrayal and Glory\nin the Kingdom. This is what I said, speculation and no more than that. But\nthere is a common thread running through all the suggestions that I think gives\nus food to think about in our own reflections. It is the matter of agendas –\nJudas bringing something of his own agenda to how he saw things working out.\nIt is easy to distance ourselves from the figure of Judas but if I am brutally\nhonest, there is very possibly something of Judas in each one of us. This is\nwhere the subject of agendas comes to my mind. I can offer my service – but it\ncan be on my terms. I can bring my own expectations to things and if these are\nnot met then I can withdraw my service, my support. We can couch this very\npolitely, even under the cloak of principle. Jesus, for whatever reasons,\ndisappointed Judas, did not meet Judas’ expectations – and Judas left the light\nand the fellowship and walked out into the night.\nAs the door closes behind him Jesus says a remarkable thing.\nNow the Son of Man has been glorified, and God has been glorified in him.\nAs we progress through John’s Gospel towards the Cross – it becomes\nincreasingly clear that the coming sacrifice is one that is freely embraced. This\nis not something that happens to Jesus – this is something that Jesus does,\nfreely and willingly. He will stand before Pilate – in John’s account it is not so\nmuch a matter of Pilate interrogating Jesus, it is Jesus who is in control. As he\ndies on the Cross, John tells us of Jesus proclaiming, ‘It is finished’. The task\nis done, the job is accomplished. I recall Professor Vokes, who lectured us in\nSt John’s Gospel declaring that John presents us with a picture of Jesus\nreigning from the Cross.\nPage 3 of 3\nHOLY WEEK 2014 – From Cheers to Jeers\nJohannine readings for Holy Week\nWednesday – Betrayal and Glory\nAnd it all begins with Judas walking out into the dark.\nWhat all this reminds me is that God’s purposes in me, in you, in the Church\nare not limited by my own narrow vision, my own limited agendas. God works\nin and though me, through you, through the Church in all its imperfection.\nGod chooses to work in and through us but he is not limited by us. Jesus had\ncalled Judas to follow him but Jesus was not going to be limited by the\nlimitations of Judas.\nWe come to God as we are, in all our limitations, all our imperfections, all our\nlimited agendas. God takes us as we are, loves us as we are, seeks to work in\nand through us. God is glorified even in our failure, even in our inadequacy –\nfor nothing, not even us, can ultimately frustrate his purposes of love for all\nmankind."
    }
}