{
    "title": "Pilate's Questions",
    "date": "2011-04-22",
    "blurb": "In this sermon, Kevin explores the conflict between Pilate and Jesus, and the different concepts of Kingship they represent. He highlights the short-term considerations that often govern our actions and the importance of recognizing Jesus as a King. He emphasizes the Kingdom Jesus represents, based on service, righteousness, repentance, forgiveness, and reconciliation, and the offer of forgiveness and reconciliation even in the midst of condemnation.",
    "raw_text": "Holy Week – 2011 – Pilate’s Questions\nGood Friday – ‘What I have written, I have written’\n\n'What I have written, I have written.'\n\nOver these nights of Holy Week we have been meditating upon the meeting between Pilate and Jesus. In the course of that meeting we have recognised many of the conflicts within ourselves as we seek to follow Jesus.\n\nJesus spoke of a pattern of Kingship quite alien to that understood by Pilate. Pilate's concept of Kingship would have been seen in terms of power, of authority and splendour; of the king’s will imposed by force if necessary. The values of Jesus' Kingdom were, indeed are, quite different. Righteousness, repentance, forgiveness, love. We are attracted by Jesus - but in what we call the real world, Pilate's way of thinking seems to be the only one that works. We need to be reminded that it is Jesus' concept of Kingdom that has outlasted all the Kingdoms of men and to which we are called to give our allegiance.\n\nIn Pilate's eyes, Jesus doesn't seem to be in touch with reality. A mob screaming for his blood and he goes on about truth; a nice topic for a fireside discussion maybe but not much to do with real life. Jesus has an unsettling habit of expecting us to apply his teaching in all situations. He doesn't seem to understand how thing operate in the real world. Pilate reminds him 'Do you not realise that I have power to release you and power to crucify you?' Jesus in turn reminds him that he only has that power because God has given it to him. Even the most powerful in this world will have to account for how they have used their power. For ourselves, we tend to assume that we have absolute authority in our own lives. That what I think, what I want is what is important.\n\nWe are all on this earth for a limited time. The time will come when each of us will have to account for how we have used the opportunities of this life, for the priorities we have established in life, for the importance we have set on the life and ministry of Jesus, what difference it has made in our own life.\n\nWe have also seen the relationship between the chief priests and Pilate. There would have been no love lost between these men. The chief priests and the people would have loathed Pilate and all he stood for. Pilate would not have thought any better of them. He was there on behalf of Rome to keep them under control. The chief priests only brought Jesus to Pilate because only Pilate had the authority to order what they wanted - the death of Jesus. Pilate didn't really want to get involved in their squabbles; he didn't really want to crucify this man who was no obvious threat to him or to Rome. The chief priests point out that anyone claiming to be a King was a threat to Caesar - that if Pilate were to release Jesus he would be betraying Caesar.\n\nPilate cannot afford a report like that getting back to Rome so he begins the trial. 'Shall I crucify your King?' he demands. The chief priests reply, 'We have no king but Caesar.' In so doing they have denied before Pilate their deepest aspirations to be rid of Rome; they deny their deep religious conviction that God and God alone is the true King of Israel. To get rid of Jesus, they are prepared to deny all of this.\n\nHow often in life are our actions governed by short term considerations. If I do this I will look a fool - if I say this people will think that I am weak - so I compromise as to what I know is right. Better be wrong than be thought a fool.\n\nThe whole sorry business has now come to a close. Pilate now orders Jesus to be crucified and the whole grizzly process of flogging and humiliation before Jesus is nailed to the Cross to die the death of a criminal. But Pilate has the last word - nailed to the cross above the prisoner is the charge on which he was condemned: ' Jesus of Nazareth, King of the Jews.', written in Latin, in Greek and in Hebrew, so that all who pass by might know who was hanging there.\n\nThe chief priests complain, 'Do not say King of the Jews but rather that he claimed to be the King of the Jews'. Do they feel a little uncomfortable with what they have done this day. But Pilate is adamant; 'What I have written, I have written.' - the original Greek of the text is very forceful.\n\nWe need to recognise who hangs there upon the Cross. This is no fraud, no pretender to a throne - this is truly a King. All too often the world cannot cope with the Kingdom he represents. A Kingdom based not on self but on service, not on might, on getting my own way, but on righteousness. A Kingdom that demands of its subjects repentance and forgiveness and reconciliation. In the light of that Kingdom, the selfishness and the pettiness and the malice that is part of human nature is shown up for what it is.\n\nThat is what has Jesus on the Cross - the evil that is in man feels threatened by goodness and will use anything - even a hated Roman Governor to get rid of it. In our own day we can be a little more subtle - we can call it left wing, right wing or just plane irresponsible - we don't like it and we try to discredit it. But it is not Jesus who stands condemned on the cross - it is man.\n\nBut the amazing truth about Good Friday is that even in the midst of our condemnation we are offered forgiveness and reconciliation. On the Cross, God in Jesus accepts the worst that man can do - and still loves him. Jesus, arms stretched out on the Cross, longs to embrace us in his love. Longs for us to recognise in the futility of trusting in our own strength - for it will fail in time of crisis. Longs for us to recognise the futility of trusting in our own goodness - for none of us is good enough to earn his love. He longs for us simply to accept the love that is so freely offered on the Cross and respond in loving him in all we do in daily living.\n\nLove so amazing, so divine,\nDemands my soul, my life, my all.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2011/goodfriday2011.txt",
        "raw_ocr_content": "Page 1 of 4\nHoly Week – 2011 – Pilate’s Questions\nGood Friday – ‘’What I have written, I have written’\n'What I have written, I have written.'\nOver these nights of Holy Week we have been meditating upon the meeting\nbetween Pilate and Jesus. In the course of that meeting we have recognised many\nof the conflicts within ourselves as we seek to follow Jesus.\nJesus spoke of a pattern of Kingship quite alien to that understood by Pilate.\nPilate's concept of Kingship would have been seen in terms of power, of authority\nand splendour; of the king’s will imposed by force if necessary. The values of\nJesus' Kingdom were, indeed are, quite different. Righteousness, repentance,\nforgiveness, love. We are attracted by Jesus - but in what we call the real world,\nPilate's way of thinking seems to be the only one that works. We need to be\nreminded that it is Jesus' concept of Kingdom that has outlasted all the Kingdoms\nof men and to which we are called to give our allegiance.\nIn Pilate's eyes, Jesus doesn't seem to be in touch with reality. A mob screaming\nfor his blood and he goes on about truth; a nice topic for a fireside discussion\nmaybe but not much to do with real life. Jesus has an unsettling habit of expecting\nus to apply his teaching in all situations. He doesn't seem to understand how thing\noperate in the real world. Pilate reminds him 'Do you not realise that I have power\nto release you and power to crucify you?' Jesus in turn reminds him that he only\nhas that power because God has given it to him. Even the most powerful in this\nworld will have to account for how they have used their power. For ourselves, we\ntend to assume that we have absolute authority in our own lives. That what I\nthink, what I want is what is important.\nPage 2 of 4\nHoly Week – 2011 – Pilate’s Questions\nGood Friday – ‘’What I have written, I have written’\nWe are all on this earth for a limited time. The time will come when each of us\nwill have to account for how we have used the opportunities of this life, for the\npriorities we have established in life, for the importance we have set on the life\nand ministry of Jesus, what difference it has made in our own life.\nWe have also seen the relationship between the chief priests and Pilate. There\nwould have been no love lost between these men. The chief priests and the people\nwould have loathed Pilate and all he stood for. Pilate would not have thought any\nbetter of them. He was there on behalf of Rome to keep them under control. The\nchief priests only brought Jesus to Pilate because only Pilate had the authority to\norder what they wanted - the death of Jesus. Pilate didn't really want to get\ninvolved in their squabbles; he didn't really want to crucify this man who was no\nobvious threat to him or to Rome. The chief priests point out that anyone\nclaiming to be a King was a threat to Caesar - that if Pilate were to release Jesus\nhe would be betraying Caesar.\nPilate cannot afford a report like that getting back to Rome so he begins the trial.\n'Shall I crucify your King?' he demands. The chief priests reply, 'We have no king\nbut Caesar.' In so doing they have denied before Pilate their deepest aspirations to\nbe rid of Rome; they deny their deep religious conviction that God and God alone\nis the true King of Israel. To get rid of Jesus, they are prepared to deny all of this.\nPage 3 of 4\nHoly Week – 2011 – Pilate’s Questions\nGood Friday – ‘’What I have written, I have written’\nHow often in life are our actions governed by short term considerations. If I do\nthis I will look a fool - if I say this people will think that I am weak - so I\ncompromise as to what I know is right. Better be wrong than be thought a fool.\nThe whole sorry business has now come to a close. Pilate now orders Jesus to be\ncrucified and the whole grizzly process of flogging and humiliation before Jesus is\nnailed to the Cross to die the death of a criminal. But Pilate has the last word -\nnailed to the cross above the prisoner is the charge on which he was condemned: '\nJesus of Nazareth, King of the Jews.', written in Latin, in Greek and in Hebrew, so\nthat all who pass by might know who was hanging there.\nThe chief priests complain, 'Do not say King of the Jews but rather that he\nclaimed to be the King of the Jews'. Do they feel a little uncomfortable with what\nthey have done this day. But Pilate is adamant; 'What I have written, I have\nwritten.' - the original Greek of the text is very forceful.\nWe need to recognise who hangs there upon the Cross. This is no fraud, no\npretender to a throne - this is truly a King. All too often the world cannot cope\nwith the Kingdom he represents. A Kingdom based not on self but on service, not\non might, on getting my own way, but on righteousness. A Kingdom that\ndemands of its subjects repentance and forgiveness and reconciliation. In the light\nof that Kingdom, the selfishness and the pettiness and the malice that is part of\nhuman nature is shown up for what it is.\nPage 4 of 4\nHoly Week – 2011 – Pilate’s Questions\nGood Friday – ‘’What I have written, I have written’\nThat is what has Jesus on the Cross - the evil that is in man feels threatened by\ngoodness and will use anything - even a hated Roman Governor to get rid of it. In\nour own day we can be a little more subtle - we can call it left wing, right wing or\njust plane irresponsible - we don't like it and we try to discredit it. But it is not\nJesus who stands condemned on the cross - it is man.\nBut the amazing truth about Good Friday is that even in the midst of our\ncondemnation we are offered forgiveness and reconciliation. On the Cross, God\nin Jesus accepts the worst that man can do - and still loves him. Jesus, arms\nstretched out on the Cross, longs to embrace us in his love. Longs for us to\nrecognise in the futility of trusting in our own strength - for it will fail in time of\ncrisis. Longs for us to recognise the futility of trusting in our own goodness - for\nnone of us is good enough to earn his love. He longs for us simply to accept the\nlove that is so freely offered on the Cross and respond in loving him in all we do\nin daily living.\nLove so amazing, so divine,\nDemands my soul, my life, my all."
    }
}