{
    "title": "Harvest Thanksgiving 2011",
    "date": "2011-10-02",
    "blurb": "This sermon, given on Harvest Thanksgiving 2011, emphasizes the importance of gratitude for the blessings of harvest and the earth's resources. It also highlights the need for care and concern for others, especially those in less fortunate circumstances. The sermon calls for action in contributing to emergency appeals and supporting fair trade.",
    "raw_text": "## PART 1\n\nThank you a very important word – it involves gratitude – a recognition that someone has done something for us that someone has given us something that we value. It makes us feel good – good about ourselves – good about what we have received. Lesson reminds us of ingratitude – of not saying thank you – that what we have received – that what has been given to us is ours thank you very much. Trouble with ingratitude is that we no longer value what we have been given – we don’t treat it as a gift. Rivers are meant to flow clean, provide water fit for people to drink, in which they can wash – all too often they are treated like rubbish tips.\n\n## PART 2\n\nThe air we breathe – clean air – free from pollution, from poisons from factories, from traffic – we have filled it with pollution from our cars, from our factories, we have changed the atmosphere of this earth so that we are now beginning to change the climate. Let us not forget who gave us this beautiful earth and let us be thankful. So let us be thankful. We give thanks today for all the blessings of harvest. In the decorations of this Church, in our prayers, in our gifts we will are reminded of all the good things we enjoy.\n\nAs we watch our TV screens we are conscious that not all are as blessed as we are. Over this weekend we have been worried that our water supply may be reduced. But in other parts of the world drought, real drought is a harsh reality. In sub Saharan Africa the desert is advancing, in other parts the rains have failed.\n\n## PART 3\n\nLand where once farmers were able to graze their cattle and grow crops is now dried up. For us a dry spell is an inconvenience, our lawns dry out, our plants don’t do as well. For farmers such as this it brings disaster, the loss of their cattle, the loss of their livelihood – how are they to care for their families? How are we to be thankful? Part of our thankfulness is in a willingness to care – part of that care is in contributing to emergency appeals such as the one after the earthquake in Haiti. But care must go deeper – our care must enable people to stand on their own two feet – that is why schemes such as Bothar and the Christian Aid gift catalogue at Christmas are so valuable.\n\nWe must recognise that there is a severe trade imbalance between the rich and the poor which leave producers of crops poorly paid while producers in the West make profits on products such as coffee and chocolate – we cannot single handedly change world trade structures but we can where possible buy Fair Trade products in our shops. So let us be truly thankful and show that thankfulness in concern for others.\n\n## PART 4\n\nHave you ever wondered what goes in to the production of our food and the many commodities we all enjoy? A few weeks ago there was an accident in a coal mine in Wales in which four men died, a reminder of the risks others have to take to bring us our fuel.\n\nI remember just after I came here walking the pier one morning and watching a boat out in the bay pulling up lobster pots. It was a cold wet windy day and the sea was rough and I remember thinking ‘You would want to be getting a good price for your lobsters on a day like that.’\n\nOr we go to the fish shop and there is not much variety and we complain that there is not much in and forget the conditions in which the men who bring us our fish have to work.\n\nThe memorial down near the yacht club is a silent reminder of those who have set out to sea and have not come back, leaving behind parents, wives, children, friends. This year we have very deliberately included a maritime flavour in our harvest decoration to remind us of those in our own community who harvest the sea.\n\nWe remember also those who care for them on our behalf, the crews of the lifeboats who go out in all weathers to go to the aid of those at sea. So let us be truly thankful this day. Thankful to the God who has given us this beautiful, fruitful earth to enjoy and to sustain us.\n\nLet us show our gratitude in caring for this earth and sharing our good things with those who have none. Let us be thankful to those who labour on the land to bring us our food, those who work in mines and on oil and gas rigs to bring us our fuel and those who go out from this village of Howth to gather our fish from the sea.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/harvest2011.txt",
        "raw_ocr_content": "Page 1 of 5\nHarvest Thanksgiving – 2011 – All Age Service\nPART 1\nThank you a very important word – it involves gratitude – a recognition that\nsomeone has done xsomething for us\nthat someone has given us something that we value\nIt makes us feel good – good about ourselves – good about what we have\nreceived\nLesson reminds us of ingratitude – of not saying thank you – that what we have\nreceived – that what has been given to us is ours thank you very much.\nTrouble with ingratitude is that we no longer value what we have been given –\nwe don’t treat it as a gift\nRivers are meant to flow clean, provide water fit for people to drink, in which\nthey can wash – all too often they are treated like rubbish tips\nPage 2 of 5\nHarvest Thanksgiving – 2011 – All Age Service\nThe air we breathe – clean air – free from pollution, from poisons from\nfactories, from traffic – we have filled it with pollution from our cars, from our\nfactories, we have changed the atmosphere of this earth so that we are now\nbeginning to change the climate.\nLet us not forget who gave us this beautiful earth and let us be thankful.\nPART 2\nSo let us be thankful\nWe give thanks today for all the blessings of harvest. In the decorations of this\nChurch, in our prayers, in our gifts we will are reminded of all the good things\nwe enjoy.\nAs we watch our TV screens we are conscious that not all are as blessed as we\nare. Over this weekend we have been worried that our water supply may be\nreduced. But in other parts of the world drought, real drought is a harsh reality.\nIn sub Saharan Africa the desert is advancing, in other parts the rains have\nfailed.\nPage 3 of 5\nHarvest Thanksgiving – 2011 – All Age Service\nLand where once farmers were able to graze their cattle and grow crops is now\ndried up. For us a dry spell is an inconvenience, our lawns dry out, our plants\ndon’t do as well. For farmers such as this it brings disaster, the loss of their\ncattle, the loss of their livelihood – how are they to care for their families?\nHow are we to be thankful? Part of our thankfulness is in a willingness to care\n– part of that care is in contributing to emergency appeals such as the one after\nthe earthquake in Haiti. But care must go deeper – our care must enable people\nto stand on their own two feet – that is why schemes such as Bothar and the\nChristian Aid gift catalogue at Christmas are so valuable.\nWe must recognise that there is a severe trade imbalance between the rich and\nthe poor which leave producers of crops poorly paid while producers in the\nWest make profits on products such as coffee and chocolate – we cannot single\nhandedly change world trade structures but we can where possible buy Fair\nTrade products in our shops.\nSo let us be truly thankful and show that thankfulness in concern for others.\nPART 3\nHave you ever wondered what goes in to the production of our food and the\nmany commodities we all enjoy? A few weeks ago there was an accident in a\ncoal mine in Wales in which four men died, a reminder of the risks others have\nto take to bring us our fuel.\nPage 4 of 5\nHarvest Thanksgiving – 2011 – All Age Service\nI remember just after I came here walking the pier one morning and watching a\nboat out in the bay pulling up lobster pots. It was a cold wet windy day and the\nsea was rough and I remember thinking ‘You would want to be getting a good\nprice for your lobsters on a day like that.’\nOr we go to the fish shop and there is not much variety and we complain that\nthere is not much in and forget the conditions in which the men who bring us\nour fish have to work.\nThe memorial down near the yacht club is a silent reminder of those who have\nset out to sea and have not come back, leaving behind parents, wives, children,\nfriends. This year we have very deliberately included a maritime flavour in our\nharvest decoration to remind us of those in our own community who harvest\nthe sea.\nWe remember also those who care for them on our behalf, the crews of the\nlifeboats who go out in all weathers to go to the aid of those at sea.\nSo let us be truly thankful this day.\nThankful to the God who has given us this beautiful, fruitful earth to enjoy and\nto sustain us.\nLet us show our gratitude in caring for this earth and sharing our good things\nwith those who have none.\nPage 5 of 5\nHarvest Thanksgiving – 2011 – All Age Service\nLet us be thankful to those who labour on the land to bring us our food, those\nwho work in mines and on oil and gas rigs to bring us our fuel and those who\ngo out from this village of Howth to gather our fish from the sea."
    }
}