{
    "title": "Here is your King!",
    "date": "2011-04-21",
    "blurb": "This sermon, delivered during Holy Week in 2011, focuses on the trial of Jesus before Pilate as told by St John. It explores the contrasting world views and kingdoms represented by Jesus and Pilate. The sermon delves into the concept of the Kingdom of God, as represented by Jesus, and the Kingdom of the world, as represented by the Emperor and Pilate. It challenges listeners to consider who their King is and to whom they owe their ultimate spiritual allegiance.",
    "raw_text": "HOLY WEEK – 2011 –Pilate’s Questions\nThursday – ‘Here is your King!’\nWe are continuing tonight in our reflections on the trial of Jesus before Pilate as told to us by St John. It was, as we have been thinking, an encounter not just between two very different individuals but two very different world views, two very different kingdoms.\n\nThe drama we have been following is drawing to a conclusion as Pilate presents Jesus, now adorned in Crown of Thorns and Purple Robe, bearing the scars of a Roman flogging; ‘Here is your King!’ Only for the crowd to roar back, ‘Away with him! Away with him! Crucify him!’ We now sense that Pilate is almost playing with the crowd. The figure of Jesus is almost a side issue in the point that Pilate is now about to make. Pointing to the tragic figure at his side, he demands, ‘Shall I crucify your King?’ The Chief Priests reply, ‘We have no King but the Emperor.’\n\nEarlier Pilate had offered to release Jesus and the crowd had chosen Barabbas instead. Now their choice is even more profound. As I said earlier, Jesus and Pilate represent two very different world views, two very different kingdoms; the Kingdom of God as represented by Jesus and the Kingdom of the world as represented by the Emperor and his representative Pilate and all the power at their command. The religious leaders, so convinced that Jesus is a heretic who must be eliminated at all costs, have chosen the Emperor.\n\nPilate has made his point and Jesus is handed over to be crucified.\n\n‘Here is your King!’ Who is our King? To whom, to what do we owe our ultimate spiritual allegiance?\n\nThe concepts of King and Kingdom run all through the Gospel accounts. It is clear that from the very outset of his public ministry Jesus saw his ministry in terms of the dawning of the Kingdom of God, proclaiming:\nFrom that time on Jesus began to proclaim, ‘Repent, for the Kingdom of heaven has come near.’ Matt 4:17\n\nHe saw the Kingdom present not just in his own ministry but in the lives of those who followed and in the vulnerable.\nMt 5:3 \"Blessed are the poor in spirit, for theirs is the kingdom of heaven. Matt 5:3\n\nIn a passage of teaching in chapter 13 of St Matthew’s Gospel Jesus seems to be piling one illustration on another as he seeks to impart to his hearers the nature of the Kingdom he has come to proclaim, that he in inviting them to enter upon. The Kingdom of heaven is like someone who sowed good seed in his field; is like a mustard seed that grew into a huge plant; is like treasure hidden in a field; is like a merchant in search of fine pearls; is like a net thrown into the sea; is like a landowner who went out early in the morning to hire labourers for his vineyard.\n\nAll these represent initiatives of grace, of something remarkable there to be found by those prepared to seek, to search, to wait: there is an element of the unexpected, the hoped for. As we hear in the Sermon on the Mount:\n\"Ask, and it will be given you; search, and you will find; knock, and the door will be opened for you. 8 For everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. Matt 7:7ff\n\nThere is an almost child-like innocence to those words that becomes harder and harder for us as we move into adulthood. As we take on our responsibilities at home, in the work place, in the community, as we attain a certain standing in the eyes of those around us, so we lose some of the open trust towards God that is a mark of the Kingdom. For there is something in each one of us that desires certainty, which wants to retain control. To follow the King is to follow the way of open-ended service, of trust; it is to pray with him the words of Gethsemene ‘Take this cup from me – yet not my will but yours be done.’ As Jesus told his followers:\n\"If any want to become my followers, let them deny themselves and take up their cross and follow me. 25 For those who want to save their life will lose it, and those who lose their life for my sake will find it. Matt 16:24ff\n\nWe prefer to stay with what is safe, what has always been. So for the chief priests it was better to stay with Pilate and the Empire he represented and get rid of this troublesome preacher who threatened the order they were used to and in which they had an honoured place.\n\n‘Here is your King!’ There is an element of proclamation, however unintended in Pilate’s words. We are not only invited into the Kingdom, we are also called to be signs of the Kingdom in the world in which we live.\n\nOnce Jesus was asked by the Pharisees when the kingdom of God was coming, and he answered, \"The kingdom of God is not coming with things that can be observed; 21 nor will they say, 'Look, here it is!' or 'There it is!' For, in fact, the kingdom of God is among you.\" Luke 17:20\n\nEach day we pray, ‘Your Kingdom come, your will be done’ and each day that prayer is answered. The Kingdom of God is among you. The Kingdom of God is here, in the people I meet, the vulnerable ones, the disagreeable ones, the threatening ones, the humble ones, the gentle ones; the Kingdom is here in the streets, the homes the shops, the places of business and recreation – for nothing, no-one, no situation is outside the scope of the Kingdom, the Kingdom of which you and I are called to be living signs; to be the light, the salt, the yeast of God in the world of today. We are called to show that even in situations of conflict there is the way of reconciliation; that even in situations of prejudice there is the way of respect; and that even in situations of hurt there is healing and restoration.\n\n‘Here is your King!’\n\nJesu, Jesu, I thee adore.\nO help me love thee more and more.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2011/holyweek2011thurs.txt",
        "raw_ocr_content": "Page 1 of 4\nHOLY WEEK – 2011 –Pilate’s Questions\nThursday – ‘Here is your King!’\nWe are continuing tonight in our reflections on the trial of Jesus before Pilate\nas told to us by St John. It was, as we have been thinking, an encounter not\njust between two very different individuals but two very different world views,\ntwo very different kingdoms.\nThe drama we have been following is drawing to a conclusion as Pilate\npresents Jesus, now adorned in Crown of Thorns and Purple Robe, bearing the\nscars of a Roman flogging; ‘Here is your King!’ Only for the crowd to roar\nback, ‘Away with him! Away with him! Crucify him!’ We now sense that\nPilate is almost playing with the crowd. The figure of Jesus is almost a side\nissue in the point that Pilate is now about to make. Pointing to the tragic figure\nat his side, he demands, ‘Shall I crucify your King?’ The Chief Priests reply,\n‘We have no King but the Emperor.’\nEarlier Pilate had offered to release Jesus and the crowd had chosen Barabbas\ninstead. Now their choice is even more profound. As I said earlier, Jesus and\nPilate represent two very different world views, two very different kingdoms;\nthe Kingdom of God as represented by Jesus and the Kingdom of the world as\nrepresented by the Emperor and his representative Pilate and all the power at\ntheir command. The religious leaders, so convinced that Jesus is a heretic who\nmust be eliminated at all costs, have chosen the Emperor.\nPilate has made his point and Jesus is handed over to be crucified.\nPage 2 of 4\nHOLY WEEK – 2011 –Pilate’s Questions\nThursday – ‘Here is your King!’\n‘Here is your King!’ Who is our King? To whom, to what do we owe our\nultimate spiritual allegiance?\nThe concepts of King and Kingdom run all through the Gospel accounts. It is\nclear that from the very outset of his public ministry Jesus saw his ministry in\nterms of the dawning of the Kingdom of God, proclaiming:\nFrom that time on Jesus began to proclaim, ‘Repent, for the Kingdom\nof heaven has come near.’ Matt 4:17\nHe saw the Kingdom present not just in his own ministry but in the lives of\nthose who followed and in the vulnerable.\nMt 5:3 \"Blessed are the poor in spirit, for theirs is the kingdom of heaven. Matt 5:3\nIn a passage of teaching in chapter 13 of St Matthew’s Gospel Jesus seems to\nbe piling one illustration on another as he seeks to impart to his hearers the\nnature of the Kingdom he has come to proclaim, that he in inviting them to\nenter upon. The Kingdom of heaven is like someone who sowed good seed in\nhis field; is like a mustard seed that grew into a huge plant; is like treasure\nhidden in a field; is like a merchant in search of fine pearls; is like a net\nthrown into the sea; is like a landowner who went out early in the morning to\nhire labourers for his vineyard.\nAll these represent initiatives of grace, of something remarkable there to be\nfound by those prepared to seek, to search, to wait: there is an element of the\nunexpected, the hoped for. As we hear in the Sermon on the Mount:\n\"Ask, and it will be given you; search, and you will find; knock,\nand the door will be opened for you. 8 For everyone who asks\nreceives, and everyone who searches finds, and for everyone who\nknocks, the door will be opened. Matt 7:7ff\nPage 3 of 4\nHOLY WEEK – 2011 –Pilate’s Questions\nThursday – ‘Here is your King!’\nThere is an almost child-like innocence to those words that becomes harder and\nharder for us as we move into adulthood. As we take on our responsibilities at\nhome, in the work place, in the community, as we attain a certain standing in\nthe eyes of those around us, so we lose some of the open trust towards God that\nis a mark of the Kingdom. For there is something in each one of us that desires\ncertainty, which wants to retain control. To follow the King is to follow the\nway of open-ended service, of trust; it is to pray with him the words of\nGethsemene ‘Take this cup from me – yet not my will but yours be done.’ As\nJesus told his followers:\n\"If any want to become my followers, let them deny themselves\nand take up their cross and follow me. 25 For those who want to\nsave their life will lose it, and those who lose their life for my\nsake will find it. Matt 16:24ff\nWe prefer to stay with what is safe, what has always been. So for the chief\npriests it was better to stay with Pilate and the Empire he represented and get\nrid of this troublesome preacher who threatened the order they were used to\nand in which they had an honoured place.\n‘Here is your King!’ There is an element of proclamation, however unintended\nin Pilate’s words. We are not only invited into the Kingdom, we are also called\nto be signs of the Kingdom in the world in which we live.\nOnce Jesus was asked by the Pharisees when the kingdom of\nGod was coming, and he answered, \"The kingdom of God is not\ncoming with things that can be observed; 21 nor will they say,\n'Look, here it is!' or 'There it is!' For, in fact, the kingdom of\nGod is among you.\" Luke 17:20\nPage 4 of 4\nHOLY WEEK – 2011 –Pilate’s Questions\nThursday – ‘Here is your King!’\nEach day we pray, ‘Your Kingdom come, your will be done’ and each day that\nprayer is answered. The Kingdom of God is among you. The Kingdom of\nGod is here, in the people I meet, the vulnerable ones, the disagreeable ones,\nthe threatening ones, the humble ones, the gentle ones; the Kingdom is here in\nthe streets, the homes the shops, the places of business and recreation – for\nnothing, no-one, no situation is outside the scope of the Kingdom, the\nKingdom of which you and I are called to be living signs; to be the light, the\nsalt, the yeast of God in the world of today. We are called to show that even in\nsituations of conflict there is the way of reconciliation; that even in situations\nof prejudice there is the way of respect; and that even in situations of hurt there\nis healing and restoration.\n‘Here is your King!’\nJesu, Jesu, I thee adore.\nO help me love thee more and more."
    }
}