{
    "title": "Light, Hope, Peace",
    "date": "2009-11-18",
    "blurb": "In this sermon, Kevin speaks at the funeral of Jenny Newell, emphasizing the themes of light, hope, and peace. He encourages the mourners to remember the happier times with Jenny and not let the darkness of her passing overshadow her life. He also speaks about the hope that death is not the end and that nothing can separate us from the love of God. Finally, he talks about the peace that comes from God, a peace that surpasses all understanding.",
    "raw_text": "As Jenny was brought into this chapel, Karl lit and candle and placed it on his Mum’s coffin. The light of a candle is a sign for me of Light, Hope, Peace. It is a sign of light in the midst of darkness. This has been a dark, distressing time for you all as you mourn the passing of Jenny, 34, a young woman who died before her time. Our memories at the moment are dominated by the recent past but they do not tell the whole story of Jenny Newell. So into the darkness of the present we bring the light of past happier time. Karl has memories of a loving mother who adored him and loved him to bits. Fred and Jean have memories of a lively, intelligent, loving daughter who loved them, who knew their love for her. They recall her love for animals of any description – Fred said the other day, the house at times was like a little house on the prairie. They recall, after the worry of her finding work, how she really enjoyed her time in Aran Air – she enjoyed the work and she was good at it. Redundancy came as an awful blow to her. Graham of course has memories of a sister with whom he grew up. These memories are as much part of the story of Jenny – the light of the candle is a reminder not to let the darkness of our most recent memories tell the whole story of Jenny as mother, as daughter, sister and friend. May God shed his light on our memories of Jenny Newell.\n\nThe light of the candle is also a symbol of hope. Again much of our recent experience of life has been coloured by despair and Jenny’s death on Saturday seemed to crown that. As we look through the biblical story there is something vital about life. Life always has the final word. For the people of Israel, the despair of slavery in Egypt is followed by life in the Promised Land. In the life of Jesus, the darkness of Gethsemane, the death of Calvary, in turn gives way to resurrection – death gives way to life. So, in the light of the candle of hope, we meet in the face of death to declare that death is not the end, death does not have the final word, not for us, not for those we love, not for Jenny. As we heard in our reading of Paul’s letter to the Church at Rome:\n\n> I am persuaded that neither death, nor life,\n> nor angels, nor principalities,\n> nor powers, nor things present, nor things to come,\n> nor height, nor depth, nor anything else in all creation,\n> will be able to separate us from the love of God in Christ Jesus our Lord.\n> Romans 8: 38,39\n\nNothing will be able to separate us.\n\nThe flame of the candle is also a symbol of peace. There is something soothing, something calming as we look into the flame. There is a deeper peace we seek to lay hold of today, a peace that comes from God alone, a God who hears and feels our pain. A peace that comes from an assurance that even in the midst of the shock and the pain, we are not alone; the God who, in the person of Jesus knows, really knows in his own person the reality of darkness, of pain, of fear, of death itself; this God is with us. Our hope for Jenny herself is peace – no more despair, no more pain, no more emptiness but peace, a warm and luxuriant peace in the welcoming present of a loving and merciful God..\n\nLet us hear afresh the promise of Christ himself as we entrust ourselves and Jenny to the God and Father of our Lord Jesus Christ.\n\n> 27 Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled, and do not let them be afraid. John 14:27",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Jenny Newell.txt",
        "raw_ocr_content": "Page 1 of 2\nFuneral of Jenny Newell – 18th November 2009\nAs Jenny was brought into this chapel, Karl lit and candle and placed it on his\nMum’s coffin. The light of a candle is a sign for me of\nLight\nHope\nPeace.\nIt is a sign of light in the midst of darkness. This has been a dark, distressing\ntime for you all as you mourn the passing of Jenny, 34, a young woman who\ndied before her time. Our memories at the moment are dominated by the\nrecent past but they do not tell the whole story of Jenny Newell. So into the\ndarkness of the present we bring the light of past happier time. Karl has\nmemories of a loving mother who adored him and loved him to bits. Fred and\nJean have memories of a lively, intelligent, loving daughter who loved them,\nwho knew their love for her. They recall her love for animals of any\ndescription – Fred said the other day, the house at times was like a little house\non the prairie. They recall, after the worry of her finding work, how she really\nenjoyed her time in Aran Air – she enjoyed the work and she was good at it.\nRedundancy came as an aweful blow to her. Graham of course has memories\nof a sister with whom he grew up. These memories are as much part of the\nstory of Jenny – the light of the candle is a reminder not to let the darkness of\nour most recent memories tell the whole story of Jenny as mother, as daughter,\nsister and friend. May God shed his light on our memories of Jenny Newell.\nThe light of the candle is also a symbol of hope. Again much of our recent\nexperience of life has been coloured by despair and Jenny’s death on Saturday\nseemed to crown that. As we look through the biblical story there is something\nPage 2 of 2\nFuneral of Jenny Newell – 18th November 2009\nvital about life. Life always has the final word. For the people of Israel, the\ndespair of slavery in Egypt is followed by life in the Promised Land. In the life\nof Jesus, the darkness of Gethsemene, the death of Calvary, in turn gives way\nto resurrection – death gives way to life. So, in the light of the candle of hope,\nwe meet in the face of death to declare that death is not the end, death does not\nhave the final word, not for us, not for those we love, not for Jenny. As we\nheard in our reading of Paul’s letter to the Church at Rome:\nI am persuaded that neither death, nor life,\nnor angels, nor principalities,\nnor powers, nor things present, nor things to come,\nnor height, nor depth, nor anything else in all creation,\nwill be able to separate us from the love of God in Christ Jesus our Lord.\nRomans 8: 38,39\nNothing will be able to separate us.\nThe flame of the candle is also a symbol of peace. There is something\nsoothing, something calming as we look into the flame. There is a deeper\npeace we seek to lay hold of today, a peace that comes from God alone, a God\nwho hears and feels our pain. A peace that comes from an assurance that even\nin the midst of the shock and the pain, we are not alone; the God who, in the\nperson of Jesus knows, really knows in his own person the reality of darkness,\nof pain, of fear, of death itself; this God is with us. Our hope for Jenny herself\nis peace – no more despair, no more pain, no more emptiness but peace, a\nwarm and luxuriant peace in the welcoming present of a loving and merciful\nGod..\nLet us hear afresh the promise of Christ himself as we entrust ourselves and\nJenny to the God and Father of our Lord Jesus Christ.\n27 Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not\nlet your hearts be troubled, and do not let them be afraid. John 14:27"
    }
}