{
    "title": "Remembering John Rudd",
    "date": "2010-11-19",
    "blurb": "This sermon is a tribute to Mr. John Rudd, a man of great pride in his family and achievements. Despite his declining health, he fought bravely and continued to attend church services. He was a man of great interest in sports and held a significant position in his professional life. His life is celebrated with affection and thanksgiving.",
    "raw_text": "Funeral of Mr John Rudd – Howth – 19th November 2010\n\nMy first memory of Mr John Rudd is at the evening service here in St Mary’s at which he was a regular attender for as long as he was able, sitting alongside his life long friend Derek Moody and Don Jermyn.\n\nThen I came to meet him in his house on the Strand Road and was shown up to that lovely upstairs sitting room which he told me with great glee that the planners had tried to scupper. There in that room were two things that gave him great pleasure: the TV which enabled him to keep up with sport and the binoculars on the window sill used to watch the rich variety of wild life on the strand and on Bull Island. Also around the room and around the house were the pictures, photos of family down through the years, pictures that Charm had painted that were pointed out with great pride.\n\nJohn took a great pride in his family; pride in the family he grew up in, the academic and professional achievements of his brother and sisters; immense pride in his own wife and children and grandchildren, he took great pleasure in the fact that they were all close at hand. John’s daughter Jackie is going to speak on behalf of the family of their memories of John.\n\nAs I say I remember a man who took great pride in the achievements and talents of others. It was only from others that I came to learn of the position he rose to in his professional life, joining the Bank of Ireland as a clerk and rising to Secretary to the Board, gaining the trust and respect of others in a different era of Irish banking.\n\nThen of course there was that life long interest and participation in sport, hockey, golf, tennis, rugby, all avidly followed in later life on the TV. He was of course for some considerable time Secretary of Howth Golf Club. These are just a few reflections on the life of this very understated man whose life we celebrate today.\n\nJohn’s health had been in decline for a number of years. But for John Rudd this was a battle to be fought with no quarter given. He continued to drive the car to Church, then when that became impractical he continued to attend evening service along with Charm for as long as he possibly could. He did not want any fuss so he resisted me coming down to the pew to give him communion and only latterly did he ask for communion in the house. Friendships meant a great deal to him; in my early days in the Parish I would have seen him at the Marine where he had gone to meet up with friends – in all this supported by his wife Charm and daughters. After a spell in hospital it became clear he would need more intensive care but the family were determined that that care would be given at home.\n\nAnd so for the last few months, he has been cared for at home by Charm and their daughters, supported by the wonderful band of carers; this enabled John to stay in his own home and to die on Tuesday night at home, in the love and care of his beloved wife and family.\n\nOur recent experience of John has been one of his illness but today is a day to look back with pride, with affection, with thanksgiving on the life of John Rudd as husband, father, grandfather, business man, friend and to give thanks to God for all that he has meant and all that he will continue to mean in the lives of family and friends.\n\nWe come to set the mystery of death in the context of our Christian faith. We are approaching Christmas, the feast of the Incarnation, Emmanuel, God among us in the person of Jesus Christ. Soon we will hear those lovely words from St John’s Gospel:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nDarkness has not had the last word in the life of John Rudd. Sickness, weakness has not had the final say. In fellowship with John, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep and the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nA passage I often find myself turning to at a time of a funeral is from St Paul's second letter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home. The words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for John Rudd, that all the limitations of these latter years, the frailty, along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ.\n\nI will close with a prayer that brings home to me the hope that we have in Christ for ourselves and for those who have gone before us in the faith.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/John Rudd.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mr John Rudd – Howth – 19th November 2010\nMy first memory of Mr John Rudd is at the evening service here in St Mary’s at which he\nwas a regular attender for as long as he was able, sitting alongside his life long friend\nDerek Moody and Don Jermyn.\nThen I came to meet him in his house on the Strand Road and was shown up to that lovely\nupstairs sitting room which he told me with great glee that the planners had tried to\nscupper. There in that room were two things that gave him great pleasure: the TV which\nenabled him to keep up with sport and the binoculars on the window sill used to watch the\nrich variety of wild life on the strand and on Bull Island. Also around the room and\naround the house were the pictures, photos of family down through the years, pictures that\nCharm had painted that were pointed out with great pride.\nJohn took a great pride in his family; pride in the family he grew up in, the academic and\nprofessional achievements of his brother and sisters; immense pride in his own wife and\nchildren and grandchildren, he took great pleasure in the fact that they were all close at\nhand. John’s daughter Jackie is going to speak on behalf of the family of their memories\nof John.\nAs I say I remember a man who took great pride in the achievements and talents of others.\nIt was only from others that I came to learn of the position he rose to in his professional\nlife, joining the Bank of Ireland as a clerk and rising to Secretary to the Board, gaining the\ntrust and respect of others in a different era of Irish banking.\nThen of course there was that life long interest and participation in sport, hockey, golf,\ntennis, rugby, all avidly followed in later life on the TV. He was of course for some\nconsiderable time Secretary of Howth Golf Club. These are just a few reflections on the\nlife of this very understated man whose life we celebrate today.\nJohn’s health had been in decline for a number of years. But for John Rudd this was a\nbattle to be fought with no quarter given. He continued to drive the car to Church, then\nPage 2 of 3\nFuneral of Mr John Rudd – Howth – 19th November 2010\nwhen that became impractical he continued to attend evening service along with Charm\nfor as long as he possibly could. He did not want any fuss so he resisted me coming down\nto the pew to give him communion and only latterly did he ask for communion in the\nhouse. Friendships meant a great deal to him; in my early days in the Parish I would have\nseen him at the Marine where he had gone to meet up with friends – in all this supported\nby his wife Charm and daughters. After a spell in hospital it became clear he would need\nmore intensive care but the family were determined that that care would be given at home.\nAnd so for the last few months, he has been cared for at home by Charm and their\ndaughters, supported by the wonderful band of carers; this enabled John to stay in his own\nhome and to die on Tuesday night at home, in the love and care of his beloved wife and\nfamily.\nOur recent experience of John has been one of his illness but today is a day to look back\nwith pride, with affection, with thanksgiving on the life of John Rudd as husband, father,\ngrandfather, business man, friend and to give thanks to God for all that he has meant and\nall that he will continue to mean in the lives of family and friends.\nWe come to set the mystery of death in the context of our Christian faith. We are\napproaching Christmas, the feast of the Incarnation, Emmanuel, God among us in the\nperson of Jesus Christ. Soon we will hear those lovely words from St John’s Gospel:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nDarkness has not had the last word in the life of John Rudd. Sickness, weakness has not\nhad the final say. In fellowship with John, we follow a Lord who knows what death, what\nsuffering, what loss is all about; one who knew what it was like to weep and the grave of\nhis friend Lazarus. Not only that, he is the one who was raised triumphant over death,\nbreaking the power of death itself. Knowing in his own person what it was all about, I\nPage 3 of 3\nFuneral of Mr John Rudd – Howth – 19th November 2010\nfind in him one to whom I cam come in my own time of suffering and find real comfort,\nreal strength and real hope.\nA passage I often find myself turning to at a time of a funeral is from St Paul's second\nletter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this\nPaul presents us with the reality of our own mortality and death, he talks very plainly of\nthe body wearing out. But just as he talks of the reality of physical decline and death,\nPaul talks of our new heavenly home. The words that really stand out for me are ; \"So\nthat what is mortal may be swallowed up by life.\" This is our hope for John Rudd, that all\nthe limitations of these latter years, the frailty, along with all the limitations that go with\nbeing human are \"swallowed up by life\", that is our inheritance in Christ.\nI will close with a prayer that brings home to me the hope that we have in Christ for\nourselves and for those who have gone before us in the faith.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose\nthem in giving, so we have not lost them by their return. What thou gavest thou takest not\naway, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal\nand love is immortal, and death is only an horizon, and an horizon is nothing save the limit\nof our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that\nwe may see more clearly; and draw us closer to thyself that we may know ourselves to be\nnearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be for evermore."
    }
}