{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Last Sunday after Trinity - 2009.txt",
        "raw_ocr_content": "Page 1 of 4\nLast Sunday after Trinity – 2009 – year B\n“What do you want me to do for you? – My teacher, let me see again.” Mk 10:51)\nThere is a thread that connects our Gospel reading for today with that for last\nSunday. Both concern a request brought to Jesus. In last Sunday’s reading,\nJames and John come to Jesus seeking places of prominence in the Kingdom of\nGod over and above the rest of the disciples. This Sunday, Bartimaeus comes\nwith his simple, heart felt plea, ‘Lord, I just want to see again.’\nAs we meet Sunday by Sunday for prayer, it is in itself a reminder that our\nprayer has to be more than just an attempt to twist God’s arm to get him to see\nthings our way. It is more a matter of tuning in, seeking a harmony between\nmy hopes and fears and desires and the mind and purposes of God.\nTo return to our Gospel reading, ‘What do you want me to do for you?’ On that\nroadside we have a coming together of Bartimaeus in his blindness and Jesus in\nhis compassion and power to heal. Others had tried to shut Bartimaeus up, to\ntell him to leave Jesus alone. Jesus calls him to his side – Bartimaeus goes\naway his sight restored.\nWhat exactly is going on in the healing ministry of Jesus? As we read the\ntexts, yes, we read of physical symptoms – but more than that. We read of\nfaith, on other occasions of sins forgiven. The Greek word that is translated\nhere as ‘heal’ , also has connotations of salvation, of making whole.\nYour faith has healed you; your faith has saved you; your faith has made you\nwhole. Jesus in his ministry touched and responded to the whole person,\nbody, mind and soul.\nPage 2 of 4\nLast Sunday after Trinity – 2009 – year B\nA few years ago, in the Report of the Church’s Ministry for Healing to the\nGeneral Synod of the Church of Ireland, there was a definition of Christian\nHealing that has always appealed to me:\n‘Christian Healing is God meeting us at our point of deepest need.’\nWhat are our deepest needs? Yes we may have physical ailments, the legs are\nnot a supple, the back not as flexible, the eyes not as sharp as they used to be.\nThere may be more serious problems, life threatening disease that brings us\nface to face with our own mortality, maybe even causing us to question does\nanyone care, does God even care. There are needs that go beyond the physical\n– needs of love, of acceptance, of hope, of strength. Even in my darkest\nmoments I find these in the life and person of Jesus.\nA young student, with all the certainty that only the young can bring to these\nissues, once challenged a University Chaplain, “Religion is just a crutch.” to\nwhich the Chaplain replied, “Which of us is not limping?” Each of us has\nneeds of love, of acceptance, of hope and strength that God alone can meet.\nAs I have remarked several times over the last few weeks, ours is an\nincarnational faith, God comes to us in the person of Jesus. As we have been\nreminded in our reading from the Letter to the Hebrews, in Jesus, God himself\nknows what it is like to know pain, loneliness, times of despair, rejection,\nsuffering and even death itself – so I can come to him in confidence knowing\nhe knows what it is to be human and all that that entails.\nPage 3 of 4\nLast Sunday after Trinity – 2009 – year B\nA second aspect of incarnational faith is that God has chosen to work through\npeople, through the Church, through the likes of you and me. In recognising\nthe healing ministry of Jesus, God present in the world, continuing to be\npresent and working in and through the life of his Church, we then must come\nto see the Church as a community of healing, a community that recognises and\nresponds , that meets people at their point of deepest need. This is where the\nNew Testament expression of the Church as the Body of Christ is very\npowerful. We, as members of the Body of Christ, are called to be nothing less\nthan instruments; living, loving instruments of the healing and reconciling love\nof Christ in the world of today.\nThe community that worships, that celebrates the love of God in Christ must\ntherefore be the community that goes out into the world to witness to that love.\nOur total life as a community, our worship, the way we conduct our business,\nthe things we do together socially, we do as a community of healing, a\ncommunity that recognises and responds, that meets people at their point of\ndeepest need.\nJust in closing, could I ask you to turn to hymn 503 and I will just read it.\nHymn 503\n1 Make me a channel of your peace:\nwhere there is hatred let me bring your love,\nwhere there is injury, your pardon, Lord,\nand where there’s doubt, true faith in you:\nO Master, grant that I may never seek\nso much to be consoled as to console;\nto be understood, as to understand,\nto be loved, as to love with all my soul!\n2 Make me a channel of your peace:\nwhere there’s despair in life let me bring hope,\nPage 4 of 4\nLast Sunday after Trinity – 2009 – year B\nwhere there’s darkness, only light,\nand where there’s sadness, ever joy:\nO Master, grant that I may never seek\nso much to be consoled as to console;\nto be understood, as to understand,\nto be loved, as to love with all my soul!\n3 Make me a channel of your peace:\nit is in pardoning that we are pardoned,\nin giving of ourselves that we receive,\nand in dying that we’re born to eternal life.\nSebastian Temple (1928-97)\nbased on ‘Prayer of St Francis of Assisi’\nMay God enable each one of us to look at each other through the eyes of Christ\nhimself, to recognise the deepest needs, that we may be instruments of the\nhealing, reconciling, strengthening love of Christ, that we may in our total life\ntogether be a community of healing."
    },
    "base": "{\n  \"title\": \"Healing and Wholeness\",\n  \"date\": \"2009-10-25\",\n  \"blurb\": \"Kevin's sermon on the Last Sunday after Trinity in 2009 focuses on the theme of healing and the role of faith in the healing ministry of Jesus. He discusses the physical and spiritual needs that Jesus addresses, emphasizing the incarnational aspect of faith and the church's role as a community of healing. The sermon encourages us to be instruments of Christ's love and to meet others at their point of deepest need.\",\n  \"raw_text\": \"Last Sunday after Trinity \\u2013 2009 \\u2013 year B\\n\\n\\u201cWhat do you want me to do for you? \\u2013 My teacher, let me see again.\\u201d (Mk 10:51)\\n\\nThere is a thread that connects our Gospel reading for today with that for last Sunday. Both concern a request brought to Jesus. In last Sunday\\u2019s reading, James and John come to Jesus seeking places of prominence in the Kingdom of God over and above the rest of the disciples. This Sunday, Bartimaeus comes with his simple, heartfelt plea, \\u2018Lord, I just want to see again.\\u2019\\n\\nAs we meet Sunday by Sunday for prayer, it is in itself a reminder that our prayer has to be more than just an attempt to twist God\\u2019s arm to get him to see things our way. It is more a matter of tuning in, seeking a harmony between my hopes and fears and desires and the mind and purposes of God.\\n\\nTo return to our Gospel reading, \\u2018What do you want me to do for you?\\u2019 On that roadside we have a coming together of Bartimaeus in his blindness and Jesus in his compassion and power to heal. Others had tried to shut Bartimaeus up, to tell him to leave Jesus alone. Jesus calls him to his side \\u2013 Bartimaeus goes away his sight restored.\\n\\nWhat exactly is going on in the healing ministry of Jesus? As we read the texts, yes, we read of physical symptoms \\u2013 but more than that. We read of faith, on other occasions of sins forgiven. The Greek word that is translated here as \\u2018heal\\u2019 also has connotations of salvation, of making whole. Your faith has healed you; your faith has saved you; your faith has made you whole. Jesus in his ministry touched and responded to the whole person, body, mind and soul.\\n\\nA few years ago, in the Report of the Church\\u2019s Ministry for Healing to the General Synod of the Church of Ireland, there was a definition of Christian Healing that has always appealed to me:\\n\\n\\u2018Christian Healing is God meeting us at our point of deepest need.\\u2019\\n\\nWhat are our deepest needs? Yes we may have physical ailments, the legs are not as supple, the back not as flexible, the eyes not as sharp as they used to be. There may be more serious problems, life-threatening disease that brings us face to face with our own mortality, maybe even causing us to question does anyone care, does God even care. There are needs that go beyond the physical \\u2013 needs of love, of acceptance, of hope, of strength. Even in my darkest moments I find these in the life and person of Jesus.\\n\\nA young student, with all the certainty that only the young can bring to these issues, once challenged a University Chaplain, \\u201cReligion is just a crutch.\\u201d to which the Chaplain replied, \\u201cWhich of us is not limping?\\u201d Each of us has needs of love, of acceptance, of hope and strength that God alone can meet.\\n\\nAs I have remarked several times over the last few weeks, ours is an incarnational faith, God comes to us in the person of Jesus. As we have been reminded in our reading from the Letter to the Hebrews, in Jesus, God himself knows what it is like to know pain, loneliness, times of despair, rejection, suffering and even death itself \\u2013 so I can come to him in confidence knowing he knows what it is to be human and all that that entails.\\n\\nA second aspect of incarnational faith is that God has chosen to work through people, through the Church, through the likes of you and me. In recognizing the healing ministry of Jesus, God present in the world, continuing to be present and working in and through the life of his Church, we then must come to see the Church as a community of healing, a community that recognizes and responds, that meets people at their point of deepest need. This is where the New Testament expression of the Church as the Body of Christ is very powerful. We, as members of the Body of Christ, are called to be nothing less than instruments; living, loving instruments of the healing and reconciling love of Christ in the world of today.\\n\\nThe community that worships, that celebrates the love of God in Christ must therefore be the community that goes out into the world to witness to that love. Our total life as a community, our worship, the way we conduct our business, the things we do together socially, we do as a community of healing, a community that recognizes and responds, that meets people at their point of deepest need.\\n\\nJust in closing, could I ask you to turn to hymn 503 and I will just read it.\\n\\n> Hymn 503\\n> 1 Make me a channel of your peace:\\n> where there is hatred let me bring your love,\\n> where there is injury, your pardon, Lord,\\n> and where there\\u2019s doubt, true faith in you:\\n> O Master, grant that I may never seek\\n> so much to be consoled as to console;\\n> to be understood, as to understand,\\n> to be loved, as to love with all my soul!\\n\\n> 2 Make me a channel of your peace:\\n> where there\\u2019s despair in life let me bring hope,\\n> where there\\u2019s darkness, only light,\\n> and where there\\u2019s sadness, ever joy:\\n> O Master, grant that I may never"
}