{
    "title": "Blessing of Love",
    "date": "2014-06-04",
    "blurb": "Kevin's sermon on the occasion of Lee Siwon and Shin Jin Hee's wedding blessing emphasizes the spiritual clothing of compassion, kindness, humility, and love as described in Colossians 3:12 and 1 Corinthians 13:4-7. He encourages the couple to embody these virtues in their marriage, dealing with challenges through Christ-like love, and wishes them joy and happiness in their life together.",
    "raw_text": "Blessing of Marriage of Lee Siwon and Shin Jin Hee – 4th June 2014\n\nSiwon, it is a pleasure to welcome you back to St Mary’s. During your time living with Alison you were part of the Church, the Body of Christ in this place. It is with great joy that we welcome you today as you return with your beautiful wife Jin Hee to ask God’s blessing on your marriage.\n\nI invite you both to think back to the time you first noticed each other, to the time you became friends, the time you fell in love and realised that you wanted to spend the rest of your lives with each other.\n\nYour wedding day was a very special day, today is a special day. On special days we pay attention to how we will look, what we will wear. What we choose to wear is very personal - it says a lot about how we see ourselves, how we want other people to see us.\n\nIn our reading from Paul’s letter to the Colossians, Paul talks about clothing – not the clothing we see in the windows of the shops on the high street – he is talking rather of our spiritual clothing. He says:\n\n> As God's chosen ones, holy and beloved, clothe yourselves with compassion, kindness, humility, meekness, and patience.\n> Colossians 3:12\n\nThese characteristics of compassion, of kindness, of humility should be as obvious as the clothes we wear – as we care for one another, defer to one another, forgive one another. He goes on\n\n> Above all, clothe yourselves with love, which binds everything together in perfect harmony. Col 3:14\n\nLet the peace of Christ rule in your hearts, let the word of Christ dwell in you richly. Clothe yourselves with love – Christ centred, Christ like love.\n\nPaul talks more of the nature of this Christ centred, Christ like love that we are to show to one another in the first of his letters to the Church at Corinth.\n\n> Love is patient; love is kind; love is not envious or boastful or arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice in wrongdoing, but rejoices in the truth. It bears all things, believes all things, hopes all things, endures all things. ! Cor 13:4-7\n\nAs I read that I often think back to a young woman who was married in Ahoghill when I was there. She told me one time that when she was annoyed she used to go to her room and read this passage – Love is PATIENT, love is KIND.\n\nThere are times when we will annoy one another, when we will disappoint one another, when we will fail one another – this does not mean that failure, that disappointment do not matter – of course they do. It is how we deal with them that is important. In a good marriage these are dealt with in and through that Christ centred, Christ like love that we are talking about – to which we can bring our love, our hurts, our regrets, our hopes.\n\nSiwon, Jin Hee may you know that love, may you show that in your own life together. May your marriage be a source of joy and happiness to you and to all those you love – may God bless you both in all that lies ahead of you.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Wedding/Lee Siwon and Shin Jin Hee (S Korea) - Wedding Blessing.txt",
        "raw_ocr_content": "Page 1 of 2\nBlessing of Marriage of Lee Siwon and Shin Jin Hee – 4th June 2014\nSiwon, it is a pleasure to welcome you back to St Mary’s. During your time\nliving with Alison you were part of the Church, the Body of Christ in this\nplace. It is with great joy that we welcome you today as you return with your\nbeautiful wife Jin Hee to ask God’s blessing on your marriage.\nI invite you both to think back to the time you first noticed each other, to the\ntime you became friends, the time you fell in love and realised that you wanted\nto spend the rest of your lives with each other.\nYour wedding day was a very special day, today is a special day. On special\ndays we pay attention to how we will look, what we will wear. What we\nchoose to wear is very personal - it says a lot about how we see ourselves, how\nwe want other people to see us.\nIn our reading from Paul’s letter to the Colossians, Paul talks about clothing –\nnot the clothing we see in the windows of the shops on the high street – he is\ntalking rather of our spiritual clothing. He says:\nAs God's chosen ones, holy and beloved, clothe yourselves with\ncompassion, kindness, humility, meekness, and patience.\nColossians 3:12\nThese characteristics of compassion, of kindness, of humility should be as\nobvious as the clothes we wear – as we care for one another, defer to one\nanother, forgive one another. He goes on\nAbove all, clothe yourselves with love, which binds everything\ntogether in perfect harmony. Col 3:14\nLet the peace of Christ rule in your hearts, let the word of Christ dwell in you\nrichly. Clothe yourselves with love – Christ centred, Christ like love.\nPage 2 of 2\nBlessing of Marriage of Lee Siwon and Shin Jin Hee – 4th June 2014\nPaul talks more of the nature of this Christ centred, Christ like love that we are\nto show to one another in the first of his letters to the Church at Corinth.\nLove is patient; love is kind; love is not envious or boastful or\narrogant 5 or rude. It does not insist on its own way; it is not irritable\nor resentful; 6 it does not rejoice in wrongdoing, but rejoices in the\ntruth. 7 It bears all things, believes all things, hopes all things, endures\nall things. ! Cor 13:4-7\nAs I read that I often think back to a young woman who was married in\nAhoghill when I was there. She told me one time that when she was annoyed\nshe used to go to her room and read this passage – Love is PATIENT, love is\nKIND.\nThere are times when we will annoy one another, when we will disappoint one\nanother, when we will fail one another – this does not mean that failure, that\ndisappointment do not matter – of course they do. It is how we deal with them\nthat is important. In a good marriage these are dealt with in and through that\nChrist centred, Christ like love that we are talking about – to which we can\nbring our love, our hurts, our regrets, our hopes.\nSiwon, Jin Hee may you know that love, may you show that in your own life\ntogether. May your marriage be a source of joy and happiness to you and to all\nthose you love – may God bless you both in all that lies ahead of you."
    }
}