{
    "title": "The Recipe of Life",
    "date": "2015-03-01",
    "blurb": "The sermon focuses on the importance of following God's 'recipe' for life. It uses the analogy of baking a cake, emphasizing that just as a cake requires the right ingredients and instructions, so does a fulfilling life require adherence to God's teachings. The sermon was part of a service involving a confirmation class, who are preparing to affirm their faith.",
    "raw_text": "Today after service we are going to taste results of people's baking. Thought I would have a go. Could I have some helpers? Ask for flour, eggs, water, oil etc – mix it up – place in tin - anyone want to lick the spoon? You don't think it will turn out like that. What's wrong? – haven't followed the recipe, haven't followed the rules.\n\nThis morning our confirmation class are helping in our service, reading lessons, leading prayers. As they get ready for their confirmation we are beginning to think about God – God who made this wonderful world, God as our Father, a Father who wants the very best for us, to live life to the full.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent32015famserv.txt",
        "raw_ocr_content": "Need ingredients for ‘cake’ plus bowl and mixing spoon and cake tin\nToday after service we are going to taste results of people’s baking\nThought I would have a go\nCould I have some helpers?\nAsk for flour, eggs, water, oil etc – mix it up – place in tin - anyone\nwant to lick the spoon? You don’t think it will turn out like that\nWhat’s wrong? – haven’t followed the recipe\nhaven’t followed the rules\nThis morning our confirmation class are helping in our service,\nreading lessons, leading prayers.\nAs they get ready for their confirmation we are beginning to think\nabout God – God who made this wonderful world, God as our Father,\na Father who wants the very best for us, to live life to the full.\ntalk through the slides"
    }
}