{
    "title": "Journey of Faith",
    "date": "2012-03-04",
    "blurb": "This sermon is about the journey of faith, likening it to a physical journey through the city of Kathmandu. It discusses the challenges and uncertainties faced, but also the unexpected help and guidance received. The sermon emphasizes the importance of trust and perseverance, even when the path seems unclear.",
    "raw_text": "I recall when Rachel and I were in Nepal last year, we spent several days in Kathmandu. Kathmandu is a remarkable place. It is a city of huge contrasts. The palaces of the now deposed king stand cheek by jowl with places of great poverty. The roads are dreadful; the city seems to be in the midst of a permanent traffic jam – cars, buses, bikes barely moving, horns being constantly sounded, yet no-one seems to get annoyed. We felt safe in that city, even walking down the side street our hotel was on after dark. People seemed genuinely anxious to help the stranger, usually without any expectation of reward – indeed would often be turned down. Finding yourself through the maze of streets could be a challenge to say the very least.\n\nI recall one afternoon, we had been to the office of the company that had arranged a guide for our trek and we got hopelessly lost getting back to our hotel. We called into a shop looking for directions. The owner immediately told his assistant to walk with us to our hotel. We set off after our guide. We went down side streets, through narrow alleyways, across waste ground. There were times when I began to get worried and I began to wonder, does he know where he is going, are we being lead into a trap. Then all of a sudden, we came out of an alleyway and there before us was our hotel. We expressed our gratitude and offered a small tip. This was firmly refused and our guide went off leaving us with a beautiful smile of someone who was happy to have helped a stranger.\n\nI have often, in the context of Baptism, referred to our Christian life as a journey, the journey of a lifetime. Rather like our journey back to our hotel that day, sometimes the route seems straightforward enough, other times we are left wondering are we on the right track at all; sometimes we have confidence in our guide and at other times not. Times when are faith is very real, other times when can definitely identify with the father’s cry, ‘Lord I believe, help my unbelief!’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent22012.txt",
        "raw_ocr_content": "I recall when Rachel and I were in Nepal last year, we spent several days in\nKathmandu. Kathmandu is a remarkable place. It is a city of huge contrasts.\nThe palaces of the now deposed king stand cheek by jowl with places of great\npoverty. The roads are dreadful; the city seems to be in the midst of a\npermanent traffic jam – cars, buses, bikes barely moving, horns being\nconstantly sounded, yet no-one seems to get annoyed. We felt safe in that city,\neven walking down the side street our hotel was on after dark. People seemed\ngenuinely anxious to help the stranger, usually without any expectation of\nreward – indeed would often be turned down. Finding yourself through the\nmaze of streets could be a challenge to say the very least.\nI recall one afternoon, we had been to the office of the company that had\narranged a guide for our trek and we got hopelessly lost getting back to our\nhotel. We called into a shop looking for directions. The owner immediately\ntold his assistant to walk with us to our hotel. We set off after our guide. We\nwent down side streets, through narrow alleyways, across waste ground. There\nwere times when I began to get worried and I began to wonder, does he know\nwhere he is going, are we being lead into a trap. Then all of a sudden, we came\nout of an alleyway and there before us was our hotel. We expressed our\ngratitude and offered a small tip. This was firmly refused and our guide went\noff leaving us with a beautiful smile of someone who was happy to have helped\na stranger.\nI have often, in the context of Baptism, referred to our Christian life as a\njourney, the journey of a lifetime. Rather like our journey back to our hotel\nthat day, sometimes the route seems straightforward enough, other times we\nare left wondering are we on the right track at all; sometimes we have\nconfidence in our guide and at other times not. Times when are faith is very\nreal, other times when can definitely identify with the father’s cry, ‘Lord I\nbelieve, help my unbelief!’"
    }
}