{
    "title": "Love and Lent",
    "date": "2016-02-14",
    "blurb": "On Valentine's Day, which also marks the first day of Lent, the sermon explores the concept of love. It emphasizes the importance of showing love through actions, not just words. It also highlights the need to show love for God by caring for the world He has given us.",
    "raw_text": "Today is Valentine’s Day and also the first day of Lent. The first lesson tells people what they are to do when they first enter the land God is giving them. God had shown his love by rescuing them from slavery in Egypt – this is going to be a way of saying not just thank you to God but saying ‘I love you’. The second lesson is the story of Jesus being tempted in the wilderness – Jesus is showing he loves God more than anything else the tempter can offer him.\n\nHow do we show our love to people we care about? Is a messy bedroom saying ‘Mum, I really love you’? Of course its not just little people throw tantrums. So its not enough just to say ‘I love you’ to someone we love – we have to show that love in the way we treat them, in the way we speak to them, in the way we appreciate them.\n\nIt is the same with God. We say we love God – we need to think a bit about how we show that. We come to Church this morning to sing our praises, to pray for ourselves and for other people – and that is important. But God wants more than that – In the Bible we read ‘If anyone says he loves God and hates his brother he is a liar’ God really does care about how we treat one another.\n\nGod has given us this wonderful world to live in – like that messy bedroom we have messed it up. So this Sunday we are thinking of love, our love for one another and our love for God. On Valentines day we think of how we show our love to those who are special to us. Today we are invited to do something practical to show our love for God in doing something tidy up this particular corner of this beautiful word that God has made for our enjoyment.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent12016 - Family Service.txt",
        "raw_ocr_content": "Page 1 of 3\nLENT 1 – 2016 – Year C – Family Service\nValentines Day.\nToday is Valentine’s Day\nImage of card\n– any one got any cards?\nany one send any?\nWhy do people do that? Doing something special for someone we\nlove\nsend flowers – give them a special treat\nSpecial way of saying something simple – ‘I love you’\nToday is also the first day of Lent\n1st Lesson tells people what they are to do when they first enter the\nland God is giving them. God had shown his love by rescuing them\nfrom slavery in Egypt – this is going to be a way of saying not just\nthank you to God but saying ‘I love you’\n2nd Lesson is the story of Jesus being tempted in the wilderness – Jesus\nis showing he loves God more than anything else the tempter can offer\nhim\nHow do we show our love to people we care about\nPage 2 of 3\nLENT 1 – 2016 – Year C – Family Service\nValentines Day.\nImage of messy bedroom\nIs this saying ‘Mum, I really love you’?\nImage of grumpy child\nOf course its not just little people throw tantrums\nImage of bad tempered man\nSo its not enough just to say ‘I love you’ to someone we love – we\nhave to show that love in the way we treat them, in the way we speak\nto them, in the way we appreciate them.\nIt is the same with God. We say we love God – we need to think a bit\nabout how we show that. We come to Church this morning to sing\nour praises, to pray for ourselves and for other people – and that is\nimportant.\nBut God wants more than that – In the Bible we read ‘If anyone says\nhe loves God and hates his brother he is a liar’ God really does care\nabout how we treat one another. So in the Burrow this term the staff\nhave been laying a lots of stress on good manners, on friendship, on\nhelping one another.\nPage 3 of 3\nLENT 1 – 2016 – Year C – Family Service\nValentines Day.\nGod has given us this wonderful world to live in – like that messy\nbedroom we have messed it up\nImage of littered beach\nImage of oil slick and bird\nDoes not just happen elsewhere – this image was made up of litter that\nhas been dropped on our streets, on our beaches here in Howth and\nSutton.\nImage of litter heart\nSo this Sunday we are thinking of love, our love for one another and\nour love for God.\nOn Valentines day we think of how we show our love to those who\nare special to us. Today we are invited to do something practical to\nshow our love for God in doing something tidy up this particular\ncorner of this beautiful word that God has made for our enjoyment."
    }
}