{
    "title": "We Are Not Kings",
    "date": "2020-03-07",
    "blurb": "This sermon discusses the human perception of control over the world and its consequences. It draws parallels between the biblical plagues of Egypt and the modern-day disasters like Covid-19, wildfires, and floods. The sermon emphasizes that despite our advancements, we are not the masters of nature and our actions have consequences.",
    "raw_text": "Fintan O’Toole – Irish Times – Corona Virus – we are not kings Sat 7/3/20\n\nIt is the locusts that make this moment in history seem so biblical. The plague of locusts is one of the 10 catastrophes visited upon the Egyptians in the Book of Exodus. The images of the vast and relentless swarms that have rampaged through Ethiopia, Somalia and Kenya, infesting hundreds of thousands of hectares of crops, pasture and forest, seem to take us back to the ancient Egypt of Moses and the pharaoh, bringing the myth horribly alive.\n\nAnd though we do not (yet) have rivers of blood or invasions of frogs, we do have the fierce storms and the apocalyptic wildfires and the recurrent floods – and of course the plague of Covid-19.\n\nThese disasters are not all directly related to each other: the virus and the locusts are special bonuses added to the climate-related adversities. But even apart from the human misery they bring, they do have something fundamental in common. If these events had come together at almost any time and in almost any culture in the pre-modern world, people would have agreed on what they meant: God is angry with us. We have done something bad and we are being punished for it.\n\nMost of us don’t think like that anymore. We tend to agree with the great polemicist of the Enlightenment, Voltaire, who responded to the terrible earthquake that destroyed Lisbon, and killed tens of thousands of its inhabitants, in 1755 by taunting those who believed it was God’s punishment for sin with the mangled bodies of the innocent dead:\n\nAnd can you then impute a sinful deed\nTo babes who on their mothers’ bosoms bleed?\n\nAs Voltaire was suggesting, the idea that catastrophes are the work of divine providence was cruel and stupid. In Irish history, for example, it influenced some of the worst of the official British responses to the Great Hunger (God’s way of teaching the Irish continence).\n\nBut it did at least have one virtue: it reminded us that there are limits to human control of the world. The point of the biblical story of the plagues of Egypt is that the pharaoh thinks he is all powerful. He thinks the world obeys his will and that there is nothing higher than his commands. It seems rather mean of God to use the poor unfortunate people of Egypt to show him otherwise, but that’s how these lessons tend to be delivered in mythic stories.\n\nLords of creation\n\nThe counter-myth of modernity, on the other hand, is that we humans are indeed the lords of creation. Beginning in Europe about 500 years ago, an ideology of limitless domination took hold. Religious change emphasised the idea that humans are outside of and above the natural world, building on God’s alleged instruction to Adam in the Book of Genesis to subdue the Earth and all its creatures.\n\n(In fact, as biblical scholars have long pointed out, the divine injunction is that humans must care for (abad) and cultivate (shamar) the Garden of Eden. The first word means “to serve”, the second is best translated as “to keep” or “to preserve”.)\n\nThe “discovery” of the New World laid open vast new territories (and indigenous peoples who could be seen as merely “natural” and therefore not fully human) to be claimed, controlled, dominated, exploited and physically transformed. The scientific revolution seemed to open up the possibility that all the forces of the physical universe, whether seen or unseen, could be understood, categorised and shaped to serve human needs.\n\nWe are now living with the logical culmination of this idea. In August 2016, the International Geological Congress formally ruled that we are now in a new era, the Anthropocene. We had been in the Holocene epoch, which lasted for roughly 12,000 years, from the end of the last ice age. This was the eon in which all human civilisation developed. But we are not in it anymore.\n\nWe have made a new Earth but we still have to live on the old one\n\nThe Anthropocene is the term coined by Paul Crutzen and Eugene Stoermer in 2000 to denote the new geological era in which many conditions and processes on Earth are profoundly altered by the impact of humans. It is defined as “the period of Earth’s history during which humans have a decisive influence on the state, dynamics and future of the Earth system”.\n\nWe have made a new world, one in which there is no longer a clear distinction between humanity and nature.\n\nThe coronavirus, in a sense, “knows” this. It is exploiting the opportunities opened up by the dawn of the Anthropocene. It has used our systems of control over the animal world as a pathway to travel between species. And it has taken a trip on our hyper-globalised networks of exchange, using human suitcases to transport itself with astonishing rapidity around the world.\n\nDramatic manifestation\n\nOur bodies are its ticket to ride on planes, ships, trains and buses. Of course, there is nothing new about possible pandemics. But the speed of the spread of this coronavirus is a dramatic manifestation of the nature of the new epoch.\n\nAnd like the wildfires and the floods, the virus has exposed the great weakness within the human triumph. We are providence now, but we are far from divine. We have made a new Earth but we still have to live on the old one. We have not come nearly as far as we like to imagine from the Egypt of Moses and the pharaoh and the 10 calamities.\n\nWe can’t stop floodwaters from drowning our fields and streets or fire from consuming farms and forests. We can’t even make tiny viruses just go away and leave us alone. We can’t stop floating strands of RNA, invisible to our naked eyes, from stilling the hubbub of our vast cities and bringing our great economic systems to a halt.\n\nThere is something bitterly apt in the fact that coronaviruses take their name from the Latin corona, a crown. Their form is that of the traditional human symbol of dominion and domination.\n\nThey come to tell us that they are as much kings of the world as we are. We are not enslaved to nature anymore – but we are not its masters either. We have made a world in which it is not God who punishes us for our misdeeds. We do that entirely for ourselves.\n\nThe price for our victory is that we have made an Earth that is subject, not just to our genius, but to our foolishness, our rapacity and our inability to imagine consequences until they are lapping at our doors.\n\nIt took us millenniums to acquire the pride of conquerors. We have only a few decades to learn the humility of survivors.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent32020 - Fintan O_Toole article.txt",
        "raw_ocr_content": "Page 1 of 3\nFintan O’Toole – Irish Times – Corona Virus – we are not kings Sat 7/3/20\nIt is the locusts that make this moment in history seem so biblical. The plague of locusts is one of the 10\ncatastrophes visited upon the Egyptians in the Book of Exodus. The images of the vast and relentless\nswarms that have rampaged throughEthiopia,SomaliaandKenya, infesting hundreds of thousands of\nhectares of crops, pasture and forest, seem to take us back to the ancient Egyptof Moses and the\npharaoh, bringing the myth horribly alive.\nAnd though we do not (yet) have rivers of blood or invasions of frogs, we do have the fierce storms and\nthe apocalyptic wildfires and the recurrent floods – and of course the plague of Covid-19.\nThese disasters are not all directly related to each other: the virus and the locusts are special bonuses\nadded to the climate-related adversities. But even apart from the human misery they bring, they do\nhave something fundamental in common. If these events had come together at almost any time and in\nalmost any culture in the pre-modern world, people would have agreed on what they meant: God is\nangry with us. We have done something bad and we are being punished for it.\nMost of us don’t think like that anymore. We tend to agree with the great polemicist of the\nEnlightenment, Voltaire, who responded to the terrible earthquake that destroyed Lisbon, and killed\ntens of thousands of its inhabitants, in 1755 by taunting those who believed it was God’s punishment for\nsin with the mangled bodies of the innocent dead:\nAnd can you then impute a sinful deed\nTo babes who on their mothers’ bosoms bleed?\nAs Voltaire was suggesting, the idea that catastrophes are the work of divine providence was cruel and\nstupid. In Irish history, for example, it influenced some of the worst of the official British responses to\nthe Great Hunger (God’s way of teaching the Irish continence).\nvolume is 80%volume is gedemptvolume is 80%volume is gedempt\nBut it did at least have one virtue: it reminded us that there are limits to human control of the world.\nThe point of the biblical story of the plagues of Egypt is that the pharaoh thinks he is all powerful. He\nthinks the world obeys his will and that there is nothing higher than his commands. It seems rather\nmean of God to use the poor unfortunate people of Egypt to show him otherwise, but that’s how these\nlessons tend to be delivered in mythic stories.\nLords of creation\nThe counter-myth of modernity, on the other hand, is that we humans are indeed the lords of creation.\nBeginning inEuropeabout 500 years ago, an ideology of limitless domination took hold. Religious\nPage 2 of 3\nFintan O’Toole – Irish Times – Corona Virus – we are not kings Sat 7/3/20\nchange emphasised the idea that humans are outside of and above the natural world, building on God’s\nalleged instruction to Adam in the Book of Genesis to subdue the Earth and all its creatures.\n(In fact, as biblical scholars have long pointed out, the divine injunction is that humans must care for\n(abad) and cultivate (shamar) the Garden ofEden. The first word means “to serve”, the second is best\ntranslated as “to keep” or “to preserve”.)\nThe “discovery” of the New World laid open vast new territories (and indigenous peoples who could be\nseen as merely “natural” and therefore not fully human) to be claimed, controlled, dominated, exploited\nand physically transformed. The scientific revolution seemed to open up the possibility that all the\nforces of the physical universe, whether seen or unseen, could be understood, categorised and shaped\nto serve human needs.\nWe are now living with the logical culmination of this idea. In August 2016, the International Geological\nCongress formally ruled that we are now in a new era, the Anthropocene. We had been in the Holocene\nepoch, which lasted for roughly 12,000 years, from the end of the last ice age. This was the eon in which\nall human civilisation developed. But we are not in it anymore.\nWe have made a new Earth but we still have to live on the old one\nThe Anthropocene is the term coined byPaul CrutzenandEugene Stoermerin 2000 to denote the new\ngeological era in which many conditions and processes on Earth are profoundly altered by the impact of\nhumans. It is defined as “the period of Earth’s history during which humans have a decisive influence on\nthe state, dynamics and future of the Earth system”.\nWe have made a new world, one in which there is no longer a clear distinction between humanity and\nnature.\nThe coronavirus, in a sense, “knows” this. It is exploiting the opportunities opened up by the dawn of\nthe Anthropocene. It has used our systems of control over the animal world as a pathway to travel\nbetween species. And it has taken a trip on our hyper-globalised networks of exchange, using human\nsuitcases to transport itself with astonishing rapidity around the world.\nDramatic manifestation\nOur bodies are its ticket to ride on planes, ships, trains and buses. Of course, there is nothing new about\npossible pandemics. But the speed of the spread of this coronavirus is a dramatic manifestation of the\nnature of the new epoch.\nAnd like the wildfires and the floods, the virus has exposed the great weakness within the human\ntriumph. We are providence now, but we are far from divine. We have made a new Earth but we still\nhave to live on the old one. We have not come nearly as far as we like to imagine from the Egypt of\nMoses and the pharaoh and the 10 calamities.\nPage 3 of 3\nFintan O’Toole – Irish Times – Corona Virus – we are not kings Sat 7/3/20\nWe can’t stop floodwaters from drowning our fields and streets or fire from consuming farms and\nforests. We can’t even make tiny viruses just go away and leave us alone. We can’t stop floating strands\nof RNA, invisible to our naked eyes, from stilling the hubbub of our vast cities and bringing our great\neconomic systems to a halt.\nThere is something bitterly apt in the fact that coronaviruses take their name from the Latin corona, a\ncrown. Their form is that of the traditional human symbol of dominion and domination.\nThey come to tell us that they are as much kings of the world as we are. We are not enslaved to nature\nanymore – but we are not its masters either. We have made a world in which it is not God who punishes\nus for our misdeeds. We do that entirely for ourselves.\nThe price for our victory is that we have made an Earth that is subject, not just to our genius, but to our\nfoolishness, our rapacity and our inability to imagine consequences until they are lapping at our doors.\nIt took us millenniums to acquire the pride of conquerors. We have only a few decades to learn the\nhumility of survivors."
    }
}