{
    "title": "Born of the Spirit",
    "date": "2017-03-12",
    "blurb": "In this family service for the second Sunday of Lent, Kevin explores the conversation between Jesus and Nicodemus, emphasizing the concept of being 'born again' and the significance of the Holy Spirit. He reflects on the importance of personal relationships with God, symbolized by the prayer of Confirmation. The sermon also touches on understanding Jesus as a teacher, friend, and healer, and the transformative power of the cross.",
    "raw_text": "LENT 2 – 2017 – Year A\nFamily Service\n\nWe've just heard that conversation between Jesus and Nicodemus. There was talk of the Spirit. I thought of the prayer that Archbishop Jackson is going to say over each of our Confirmation candidates at the end of April. Confirm, O Lord, your servant...\n\nTalking to our Confirmation candidates – rest of you can listen in. What is the Archbishop, what are the rest of us asking for in that prayer of Confirmation? Gospel talks of being born again, born from above – Lots of adults have problems getting their heads around that one.\n\nLet's go back to the very start. The day you were born is special, we celebrate it. For your Mum, that was a day in a lifetime – that was the day she gave birth to you. Not just special to Mum – you are special to God.\n\nBeen thinking a lot about that in our Confirmation classes. God making the world, God making us, making us in his image. Not as if God made us and then gets bored with us. God wants a relationship with us. Can only have a relationship with someone you know. We thought of ways in which God shows himself – in creation, in other people.\n\nWe thought about Jesus, what he means to us. We used the expression 'Jesus – God's way of showing us what God is like'. We thought about Jesus as teacher, as friend, as healer. We thought about the cross – what does it mean to say Jesus dies for us – what does it mean to say the cross breaks the power of sin – remember the exercise we did – we wrote some regret on a piece of paper – no-one else saw it – and we burned it.\n\nIn his time with the disciples, Jesus spoke of sending the Holy Spirit, a comforter, a guide.\n\nHoly Spirit – God's way of being with us. Going back to our Gospel – Jesus and Nicodemus. Jesus talks of wind – where does it come from, where is it going. Anyone who sails or windsurfs knows the importance of that. When I have been out on a boat, I am always struck by the way a sailor keeps a constant eye on the wind. Misjudge the strength or direction of the wind, lose speed, capsize, or other horrible things.\n\nWhat Jesus is saying is that we need to be prepared to watch out for the Spirit, to listen, and just be still. That will lead us into prayer – that is the next stage of our journey towards confirmation.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Lent/year A/lent22017 - family service.txt",
        "raw_ocr_content": "Page 1 of 3\nLENT 2 – 2017 – Year A\nFamily Service\nWe’ve just heard that conversation between Jesus and Nicodemus\nThere was talk of the Spirit.\nI thought of the prayer that Archbishop Jackson is going to say over\neach of our Confirmation candidates at the end of April.\nConfirm O Lord your servant ………\nTalking to our Confirmation candidates – rest of you can listen in\nWhat is the Archbishop, what are the rest of us asking for in that\nprayer of Confirmation?\nGospel talks of being born again, born from above – Lots of adults\nhave problems getting their heads around that one.\nLet’s go back to the very start. The day you were born is special, we\ncelebrate it.\nFor your Mum that was a day in a lifetime – that was the day she gave\nbirth to you.\nNot just special to Mum – you are special to God.\nPage 2 of 3\nLENT 2 – 2017 – Year A\nFamily Service\nBeen thinking a lot about that in our Confirmation classes.\nGod making the world, God making us, making us in his image\nNot as if God made us and then gets bored with us.\nGod wants a relationship with us.\nCan only have a relationship with someone you know. We thought of\nways in which God shows himself – in creation, in other people.\nWe thought about Jesus, what he means to us.\nWe used the expression ‘Jesus – God’s way of showing us what God\nis like’\nWe thought about Jesus as teacher, as friend, as healer. We thought\nabout the cross – what does it mean to say Jesus dies for us – what\ndoes it mean to say the cross breaks the power of sin – remember the\nexercise we did – we wrote some regret on a piece of paper – no-one\nelse saw it – and we burned it.\nIn his time with the disciples Jesus spoke of sending the Holy Spirit, a\ncomforter, a guide\nPage 3 of 3\nLENT 2 – 2017 – Year A\nFamily Service\nHoly Spirit – God’s way of being with us.\nGoing back to our Gospel – Jesus and Nicodemus\nJesus talks of wind – where does it come from, where is it going.\nAnyone who sails or windsurfs knows the importance of that. When I\nhave been out on a boat I am always struck by the way a sailor keeps a\nconstant eye on the wind. Misjudge the strength or direction of the\nwind, lose speed, capsize or other horrible things.\nWhat Jesus is saying is that we need to be prepared to watch out for\nthe Spirit, to listen, and just be still\nThat will lead us into prayer – that is the next stage of our journey\ntowards confirmation."
    }
}