{
    "title": "Journey of Faith",
    "date": "2013-02-24",
    "blurb": "This sermon, delivered during the second week of Lent in 2013, explores the concept of life and faith as a journey. It emphasizes the importance of the promises made during Baptism and how these set the stage for a lifelong journey of discovery and growth in faith. The sermon also highlights the communal aspect of this journey, urging the congregation to support and accompany each other.",
    "raw_text": "As we come out of the winter months and see signs of new growth, we feel we can start looking forward to the summer. Some I know are planning their holidays – where are we going – how will we travel. Once on the road there is a mixture of anticipation – once my caravan goes through Sutton Cross I am beginning to look forward to meals in the open air, cycling country lanes. There can be an element of impatience – the cries from the back seat, ‘Are we there yet? How much longer till we get there?’\n\nOf course life is a journey. At each stage we can look back, look forward; at each stage there is something to learn, to discover. There is a story I have told before from Spike Milligan’s book, ‘Puckoon’ set at the time of partition in a totally dysfunctional village on the Irish border. On this particular day the sun is shining and the central character Mulligan is happy, supremely happy. Suddenly he thinks ‘Could this be the happiest day of my life?’ And the very thought made him miserable. There is always more ahead of us on the journey of life, more to discover about myself, about life, about the world.\n\nLast week, as we began our thoughts over Lent about Baptism, I remarked that faith is a journey, a journey of a life time. Baptism marks the beginning of that journey. In the course of our service of Baptism, we lay down a number of markers for the journey. At the outset of the journey, the parents and the god parents make undertakings about the context in which these children will be brought up, that they will provide an environment within which the values of the Gospel will be upheld.\n\nBy your own prayers and example, by your teaching and love, will you encourage them in the life and faith of the Christian community? With the help of God, we will. By your teaching and your love. Children learn from what we say – but they also learn from who we are.\n\nI spoke earlier of life, of faith as a journey, always more ahead of us. As I have often said, the questions that lie at the heart of Baptism and Confirmation are questions not of people who have arrived but questions of people on a journey, with more to discover, more to learn of what it means to be a follower of Christ, a member of the Body of Christ. I can answer with integrity Do you renounce the deceit and corruption of evil – but evil is still at work in my life. There is still work to do, still further to travel on the journey.\n\nSimilarly I can reply with integrity Do you submit to Christ as Lord – but there is still work to do, there are still parts of my life where Christ is kept at a distance. But I am on that journey of discovery. I go back to some of my favourite words from Paul’s letter to the Philippians:\n\nI’m not saying that I have this all together, that I have it made. But I am well on my way, reaching out for Christ, who has so wondrously reached out for me. Friends, don’t get me wrong: By no means do I count myself an expert in all of this, but I’ve got my eye on the goal, where God is beckoning us onward—to Jesus. I’m off and running, and I’m not turning back. (Philippians 3:12-14 The Message)\n\nWe are on a journey, I am well on my way, reaching out for Christ, who has so wondrously reached out for me. Our life journey, our faith journey – these are not undertaken as solo ventures. We travel in the company of others. Children come with their parents. Parents come with family and friends. The preferred setting for Baptism is one where the wider congregation is present. These questions are not just questions for the parents and godparents. They are not just questions for confirmation candidates later on this year. They are questions for us all as we journey on through life.\n\nThere is that other promise undertaken at Baptism. You have heard these our brothers and sisters respond to Christ. Will you support them in this calling? The congregation answers We will support them. The congregation is not just there as spectators, we are there as participants, promising to accompany the children, the parents and godparents on the journey, offering our support and encouragement, in the welcome we give them when they come to join in the worship of the Church. But I just want to finish by lifting this question beyond the children we welcome today. Let us think for a moment of how do we accompany one another on this journey of life, of faith? It was said of the early Christian community, ‘See how these Christians love one another’. We come here not as isolated individuals, we come as parents, as husbands, wives, as those in work, as those retired, as those just starting out on life in school, in college. We come with our hopes and our fears; fears for the future, about health, about getting old, about our employment, our mortgage, our parents, our children, our marriage. How can we support one another in our calling?\n\nWe are a family on a journey travelling the journey of life, of faith together. ‘Are we there yet? Are we there yet?’ No, not yet. Yet more lies ahead, more to discover, more to learn from each other, more opportunities to help and support one another.\n\nGrow old along with me! The best is yet to be, The last of life, for which the first was made: Our times are in His hand Who saith \"A whole I planned, Youth shows but half; trust God: see all, nor be afraid!''",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent22013.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 2 – 2013 – year C\nBaptism – The Promises\nAs we come out of the winter months and see signs of new growth, we feel we\ncan start looking forward to the summer. Some I know are planning their\nholidays – where are we going – how will we travel. Once on the road there is\na mixture of anticipation – once my caravan goes through Sutton Cross I am\nbeginning to look forward to meals in the open air, cycling country lanes.\nThere can be an element of impatience – the cries from the back seat, ‘Are we\nthere yet? How much longer till we get there?’\nOf course life is a journey. At each stage we can look back, look forward; at\neach stage there is something to learn, to discover. There is a story I have told\nbefore from Spike Milligan’s book, ‘Puckoon’ set at the time of partition in a\ntotally dysfunctional village on the Irish border. On this particular day the sun\nis shining and the central character Mulligan is happy, supremely happy.\nSuddenly he thinks ‘Could this be the happiest day of my life?’ And the very\nthought made him miserable. There is always more ahead of us on the journey\nof life, more to discover about myself, about life, about the world.\nLast week, as we began our thoughts over Lent about Baptism, I remarked that\nfaith is a journey, a journey of a life time. Baptism marks the beginning of that\njourney. In the course of our service of Baptism, we lay down a number of\nmarkers for the journey. At the outset of the journey, the parents and the god\nparents make undertakings about the context in which these children will be\nbrought up, that they will provide an environment within which the values of\nthe Gospel will be upheld.\nBy your own prayers and example, by your teaching and love,\nwill you encourage them in the life and faith of the Christian\ncommunity?\nWith the help of God, we will.\nBy your teaching and your love. Children learn from what we say – but they\nalso learn from who we are.\nPage 2 of 3\nLent 2 – 2013 – year C\nBaptism – The Promises\nI spoke earlier of life, of faith as a journey, always more ahead of us. As I have\noften said, the questions that lie at the heart of Baptism and Confirmation are\nquestions not of people who have arrived but questions of people on a journey,\nwith more to discover, more to learn of what it means to be a follower of\nChrist, a member of the Body of Christ. I can answer with integrity\nDo you renounce the deceit and corruption of evil – but evil is still at work in\nmy life. There is still work to do, still further to travel on the journey.\nSimilarly I can reply with integrity\nDo you submit to Christ as Lord – but there is still work to do, there are still\nparts of my life where Christ is kept at a distance.\nBut I am on that journey of discovery. I go back to some of my favourite\nwords from Paul’s letter to the Philippians:\nI’m not saying that I have this all together, that I have it made. But I\nam well on my way, reaching out for Christ, who has so wondrously\nreached out for me. Friends, don’t get me wrong: By no means do I\ncount myself an expert in all of this, but I’ve got my eye on the goal,\nwhere God is beckoning us onward—to Jesus. I’m off and running, and\nI’m not turning back. (Philippians 3:12-14 The Message)\nWe are on a journey, I am well on my way, reaching out for Christ, who has so\nwondrously reached out for me.\nOur life journey, our faith journey – these are not undertaken as solo ventures.\nWe travel in the company of others. Children come with their parents. Parents\ncome with family and friends. The preferred setting for Baptism is one where\nthe wider congregation is present. These questions are not just questions for\nthe parents and godparents. They are not just questions for confirmation\ncandidates later on this year. They are questions for us all as we journey on\nthrough life.\nPage 3 of 3\nLent 2 – 2013 – year C\nBaptism – The Promises\nThere is that other promise undertaken at Baptism.\nYou have heard these our brothers and sisters respond to Christ.\nWill you support them in this calling?\nThe congregation answers\nWe will support them.\nThe congregation is not just there as spectators, we are there as participants,\npromising to accompany the children, the parents and godparents on the\njourney, offering our support and encouragement, in the welcome we give\nthem when they come to join in the worship of the Church. But I just want to\nfinish by lifting this question beyond the children we welcome today. Let us\nthink for a moment of how do we accompany one another on this journey of\nlife, of faith? It was said of the early Christian community, ‘See how these\nChristians love one another’. We come here not as isolated individuals, we\ncome as parents, as husbands, wives, as those in work, as those retired, as those\njust starting out on life in school, in college. We come with our hopes and our\nfears; fears for the future, about health, about getting old, about our\nemployment, our mortgage, our parents, our children, our marriage. How can\nwe support one another in our calling?\nWe are a family on a journey travelling the journey of life, of faith together.\n‘Are we there yet? Are we there yet?’ No, not yet. Yet more lies ahead, more\nto discover, more to learn from each other, more opportunities to help and\nsupport one another.\nGrow old along with me!\nThe best is yet to be,\nThe last of life, for which the first was made:\nOur times are in His hand\nWho saith \"A whole I planned,\nYouth shows but half; trust God: see all, nor be afraid!''"
    }
}