{
    "title": "The Special Pet",
    "date": "2013-03-10",
    "blurb": "This sermon uses the metaphor of a pet to explore the challenges and rewards of parenthood. It highlights the responsibilities and dedication required in raising a child, from constant care and attention to dealing with mess and mischief. The sermon concludes with a surprise reveal, using a mirror to show that the 'special pet' is in fact the listener themselves, prompting reflection on self-care and personal growth.",
    "raw_text": "Anyone have a pet?\nWould anyone like a pet? What sort?\n\nI have a pet here - a very special sort of pet.\nAnyone like to look after it for me?\nWarning - it does take quite a bit of looking after.\nWhen young needs feeding maybe 8 times a day - even in the middle of the night.\nMakes a rather smelly mess at times that has to be cleaned up - needs lots of baths.\n\nAs it gets bigger you have to spend a lot of time talking to it, playing with it, taking it for walks - can be a bit naughty and also leave quite a lot of mess around the house when it is playing.\n\nThen there is the worry, sleepless nights - this stage lasts a long time, years, all the times it is growing. As it gets older it could get into quite a bit of trouble. It will actually grow to be as big as you are.\n\nAnyone like to have a look at this special pet?\n\nWho would have the patience to look after a pet like that?",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent4mother2013.txt",
        "raw_ocr_content": "Anyone have a pet?\nWould anyone like a pet? What sort?\n(Box with hole in side – holding mirror in hand in box)\nI have a pet here – a very special sort of pet.\nAnyone like to look after it for me?\nWarning – it does take quite a bit of looking after.\nWhen young needs feeding maybe 8 times a day – even in the middle\nof the night.\nMakes a rather smelly mess at times that has to be cleaned up – needs\nlots of baths.\nAs it gets bigger you have to spend a lot of time talking to it, playing\nwith it, taking it for walks – can be a nit naughty and also leave quite\na lot of mess around the house when it is playing.\nThen there is the worry, sleepless nights – this stage lasts a long time,\nyears, all the times it is growing. As it gets older it could get into\nquite a bit of trouble. It will actually grow to be as big as you are.\nAnyone like to have a look at this special pet?\n(Open box and let child see face in the mirror – then show mirror to\neveryone else)\nWho would have the patience to look after a pet like that?"
    }
}