{
    "title": "Lent 2 - St Patrick's Day 2014",
    "date": "2014-03-16",
    "blurb": "This sermon reflects on the spirituality of the Celtic Church and its rediscovery in the life of the Iona community. It draws upon the image of the beloved disciple, leaning on Jesus' breast at the last supper, listening to the heart beat of God. It also discusses the Synod of Whitby in 664, the meeting between the Celtic and Roman Christian missions, and the influence of St John and St Peter on these missions.",
    "raw_text": "It was the year 664. The Synod of Whitby, summoned by Oswy, King of Northumbria met in the Abbey of Whitby, the home of a mixed religious community under the leadership of Abbess Hilda. It was a meeting between two Christian missions, the Celtic and the Roman. The Celtic had come through Lindisfarne, Iona and the mission lead by Columba from these shores. In their spirituality they would have looked to St John. The other had come from the south, through Canterbury and Rome and would have looked to St Peter. The main issue settled in that Synod was the date on which Easter was to be observed and Oswy came down on the side of the mission from Canterbury. Eventually the Celtic Church adopted the Roman date for Easter.\n\nOn this Sunday closest to St Patrick’s Day, I want to reflect on something of the spirituality of the Celtic Church and the ways in which it has been rediscovered in the life of the Iona community and the life and witness of George McLeod, who pioneered the rebuilding of the Abbey in 1938.\n\nI go back to that image of the beloved disciple, leaning on Jesus’ breast at the last supper – listening to the heart beat of God. I would turn also to the opening chapter of John’s Gospel that we read from at Christmas.\n\nAnd as we confess in the Nicene Creed:\n\nWe believe in one God,\nthe Father, the Almighty,\nmaker of heaven and earth,\nof all that is,\nseen and unseen.\n\nWe believe in one Lord, Jesus Christ,\nthe only Son of God,\neternally begotten of the Father,\nGod from God, Light from Light,\ntrue God from true God,\nbegotten, not made,\nof one Being with the Father.\n\nThrough him all things were made.\n\nThe writers of the Creed, the Apostle John paint this wonderful image of Christ the incarnate Word at the very heart of creation, source of all that is.\n\nWe see it in some of the prayers of the Celtic Church in which God is invoked not as one separate, apart from creation:\n\nYou are the peace of all things calm\nYou are the place to hide from harm\nYou are the light that shines in dark\nYou are the heart's eternal spark\nYou are the door that's open wide\nYou are the guest who waits inside\nYou are the stranger at the door\nYou are the calling of the poor\n\nYou are my Lord and with me from ill\nYou are the light, the truth, the way\nYou are my Saviour this very day.\n\nWe see it in the art forms associated with the Celtic Church, the high crosses in which themes of scripture are interwoven with different aspects of the created order. We see it also in the wonderful illuminated manuscripts such as the Book of Kells, the Garland of Howth.\n\nIt is there in that hymn that is characteristic of the Irish Church, St Patrick’s Breastplate (number 322 in our Hymn Book) In this hymn a number of themes are held together in one confession of faith. There are the great biblical themes of Christ’s incarnation, his suffering, death and resurrection, the service of the saints through the ages. Then in verse 4 the writer rehearses the powers of nature all bearing witness to the wonder and glory of God.\n\nI bind unto myself today\nthe virtues of the star-lit heaven,\nthe glorious sun’s life-giving ray,\nthe whiteness of the moon at even,\nthe flashing of the lightning free,\nthe whirling winds’ tempestuous shocks,\nthe stable earth, the deep salt sea\naround the old eternal rocks.\n\nAll this crowned with that Christ centred invocation\n\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist to comfort and restore me,\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\n\nIn recent years there has been a rediscovery of the riches of the Celtic tradition. In 1938 George McLeod, until then a Presbyterian minister in the Govan district of Glasgow, lead a group to Iona with a vision of rebuilding not only the structure of the old Abbey but also its spirituality, combined with his own passion for justice and peace in the world. Part of the outworking of this has been the hymn writing of John Bell, several of whose hymns are in our hymn book.\n\nI will close with a prayer by George McLeod, modelled on that Christ centred prayer from the Breastplate.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent22014stpatrick.txt",
        "raw_ocr_content": "Page 1 of 7\nLent 2 – as for St Patrick – 2014\nIt was the year 664. The Synod of Whitby, summoned by Oswy, King of\nNorthumbria met in the Abbey of Whitby, the home of a mixed religious\ncommunity under the leadership of Abbess Hilda. It was a meeting between\ntwo Christian missions, the Celtic and the Roman. The Celtic had come\nthrough Lindisfarne, Iona and the mission lead by Columba from these shores.\nIn their spirituality they would have looked to St John. The other had come\nfrom the south, through Canterbury and Rome and would have looked to St\nPeter. The main issue settled in that Synod was the date on which Easter was\nto be observed and Oswy came down on the side of the mission from\nCanterbury. Eventually the Celtic Church adopted the Roman date for Easter.\nThe two missions that met at Whitby represented two different perspectives,\ntwo ways of seeing things. The Celtic, now pushed out to the fringes, was very\nmuch inspired by John. He is remembered as the beloved disciple who leaned\nagainst Jesus at the Last Supper, He had become an image of the practice of\nlistening for the heart beat of God, listening for God at the heart of life. The\nsouthern mission, looking to Peter, saw God revealed in the life and worship of\nthe Church.\nOn this Sunday closest to St Patrick’s Day, I want to reflect on something of\nthe spirituality of the Celtic Church and the ways in which it has been\nrediscovered in the life of the Iona community and the life and witness of\nGeorge McLeod, who pioneered the rebuilding of the Abbey in 1938.\nPage 2 of 7\nLent 2 – as for St Patrick – 2014\nI go back to that image of the beloved disciple, leaning on Jesus’ breast at the\nlast supper – listening to the heart beat of God. I would turn also to the\nopening chapter of John’s Gospel that we read from at Christmas.\n1In the beginning was the Word, and the Word was with God, and the\nWord was God. 2He was in the beginning with God. 3All things came\ninto being through him, and without him not one thing came into being.\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it. John 1:1ff\nAnd as we confess in the Nicene Creed:\nWe believe in one God,\nthe Father, the Almighty,\nmaker of heaven and earth,\nof all that is,\nseen and unseen.\nWe believe in one Lord, Jesus Christ,\nthe only Son of God,\neternally begotten of the Father,\nGod from God, Light from Light,\ntrue God from true God,\nbegotten, not made,\nof one Being with the Father.\nThrough him all things were made.\nThe writers of the Creed, the Apostle John paint this wonderful image of Christ\nthe incarnate Word at the very heart of creation, source of all that is.\nWe see it in some of the prayers of the Celtic Church in which God is invoked\nnot as one separate, apart from creation:\nYou are the peace of all things calm\nYou are the place to hide from harm\nYou are the light that shines in dark\nYou are the heart's eternal spark\nYou are the door that's open wide\nYou are the guest who waits inside\nYou are the stranger at the door\nYou are the calling of the poor\nPage 3 of 7\nLent 2 – as for St Patrick – 2014\nYou are my Lord and with me from ill\nYou are the light, the truth, the way\nYou are my Saviour this very day.\nWe see it in the art forms associated with the Celtic Church, the high crosses in\nwhich themes of scripture are interwoven with different aspects of the created\norder. We see it also in the wonderful illuminated manuscripts such as the\nBook of Kells, the Garland of Howth.\nIt is there in that hymn that is characteristic of the Irish Church, St Patrick’s\nBreastplate (number 322 in our Hymn Book) In this hymn a number of themes\nare held together in one confession of faith. There are the great biblical themes\nof Christ’s incarnation, his suffering, death and resurrection, the service of the\nsaints through the ages. Then in verse 4 the writer rehearses the powers of\nnature all bearing witness to the wonder and glory of God.\nI bind unto myself today\nthe virtues of the star-lit heaven,\nthe glorious sun’s life-giving ray,\nthe whiteness of the moon at even,\nthe flashing of the lightning free,\nthe whirling winds’ tempestuous shocks,\nthe stable earth, the deep salt sea\naround the old eternal rocks.\nAll this crowned with that Christ centred invocation\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist to comfort and restore me,\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\nPage 4 of 7\nLent 2 – as for St Patrick – 2014\nIn recent years there has been a rediscovery of the riches of the Celtic tradition.\nIn 1938 George McLeod, until then a Presbyterian minister in the Govan\ndistrict of Glasgow, lead a group to Iona with a vision of rebuilding not only\nthe structure of the old Abbey but also its spirituality, combined with his own\npassion for justice and peace in the world. Part of the outworking of this has\nbeen the hymn writing of John Bell, several of whose hymns are in our hymn\nbook.\nI will close with a prayer by George McLeod, modelled on that Christ centred\nprayer from the Breastplate.\nPage 5 of 7\nLent 2 – as for St Patrick – 2014\nPage 6 of 7\nLent 2 – as for St Patrick – 2014\nListening for the heartbeat of God page 84ff\nPage 7 of 7\nLent 2 – as for St Patrick – 2014"
    }
}