{
    "title": "Lent 5 - 2020",
    "date": "2020-03-29",
    "blurb": "This sermon reflects on the challenges and lessons of the Covid-19 pandemic, drawing on reflections from Bill Gates. It emphasizes the importance of community, faith, and self-reflection in these trying times. The sermon also discusses the story of the resurrection of Lazarus, drawing parallels to the metaphorical 'tombs' we find ourselves in and the power of Jesus to release us from them.",
    "raw_text": "Where would we be without WhatsApp? Over this past while, as we have been confined to our homes, we can’t meet up with our friends, we can’t play sport and we have even been forced not to meet for services in our Churches, the seriousness of the crisis we face has sunk in.\n\nI have received lots of WhatsApp feeds relating to Covid-19 – some of them very funny. I have also received some that really make you think. I think of one I received a few days ago containing reflections by Bill Gates, the man who set up Microsoft, the system that runs a lot of our computers and phones. He was thinking about what Covid-19 could teach us. It is quite a long piece, but a few sections really stood out for me:\n\n> 9) It is reminding us that the power of freewill is in our hands. We can choose to cooperate and help each other, to share, to give, to help and to support each other or we can choose to be selfish, to hoard, to look after only our self. Indeed, it is difficulties that bring out our true colours.\n\n> 14) Whereas many see the Corona/ Covid-19 virus as a great disaster, I prefer to see it as a ‘great corrector’. It is sent to remind us of the important lessons that we seem to have forgotten and it is up to us if we will learn them or not.\n\nI’ve spent a lot of time on the phone these days, just keeping in touch with people. These reflections of Bill Gates seem to strike a chord with a lot of what people have been saying to me. If nothing else comes out of this whole mess, our enforced confinement may make us stop and take stock, just think about what is really important to us – family, community, faith – that I am more than what I earn, more than what I consume.\n\nTaking stock, setting priorities applies to all areas of life. Young people as they choose what subjects to study, what careers they are going to follow need to take a look at what they are good at, what they are not so good at, what really interests and excites them.\n\nAt this particular time a number of our young people in our parish here in Howth are preparing for confirmation. This is one of those times in our lives when we are invited to stop and take stock. They are being invited to take for themselves the promises made on their behalf by their parents and godparents when they were baptized.\n\nDo you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?\n\nThese are questions not just for our youngsters but for all of us, whatever our age – they are a kind of checklist for life. What are our priorities? What direction is our life taking? A number of years ago, people used to wear a wristband with the inscription ‘WWJD’ – ‘What would Jesus do?’ The idea would be that when we’re in a difficult situation, we would just ask ourselves, ‘What would Jesus do here?’ Are we going to go with Christ, or are we going to go our own way?\n\nOur reading this Sunday is the account we find in John’s Gospel of the raising of Lazarus. Some have likened the tomb Lazarus lay in to the metaphorical tombs we find ourselves in: tombs of habits we long to leave behind, attitudes that we know are not right, prejudices about other people or groups in society, selfishness – but all these seem to be so much part of us, they are hard to shake off.\n\nIn these times of reflection, of taking stock of where we are and who we are, Jesus stands at the door of our own particular tomb and says, ‘Come out!’ He invites us to let him release us from obsession with ourselves to serve one another; release us from all that stops us from seeing in others, whatever their race, their gender, their culture, their sexuality, fellow human beings, fellow children of God.\n\nTo go back to that WhatsApp message I received, that reflection by Bill Gates on what this virus is teaching us:\n\n> 2) It is reminding us that we are all connected and something that affects one person has an effect on another. It is reminding us that the false borders that we have put up have little value as this virus does not need a passport. It is reminding us, by oppressing us for a short time, of those in this world whose whole life is spent in oppression.\n\n> 7) It is reminding us that our true work is not our job, that is what we do, not what we were created to do. Our true work is to look after each other, to protect each other and to be of benefit to one another.\n\nMay we be set free from our tombs of sin and self to do just that in the world of today.\n\nI will just finish with a prayer of blessing I would sometimes use:\n\nGo forth into the world in peace.\nBe of good courage.\nHold fast that which is good.\nRender to no one evil for evil.\nStrengthen the fainthearted.\nSupport the weak.\nHelp the afflicted.\nShow love to everyone.\nLove and serve the Lord, rejoicing in the power of the Holy Spirit; and the blessing of almighty God, the Father, the Son, and the Holy Spirit, be among you and remain with you always. Amen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent52020.txt",
        "raw_ocr_content": "Page 1 of 4\nLENT 5 – 2020 – Year A\nLink to service on YouTube https://youtu.be/EV3lwCgQiE0\nWhere would we be without WhatsApp? Over this past while, as we have been\nconfined to our homes, we can’t meet up with our friends, we can’t play sport\nand we have even been forced not to meet for services in our Churches, the\nseriousness of the crisis we face has sunk in.\nI have received lots of WhatsApp feeds relating to Covid-19 – some of them\nvery funny. I have also received some that really make you think. I think of\none I received a few days ago containing reflections by Bill Gates, the man\nwho set up Microsoft, the system that runs a lot of our computers and phones.\nHe was thinking about what Covid-19 could teach us. It is quite a long piece,\nbut a few sections really stood out for me:\n9) It is reminding us that the power of freewill is in our hands. We can\nchoose to cooperate and help each other, to share, to give, to help and\nto support each other or we can choose to be selfish, to hoard, to look\nafter only our self. Indeed, it is difficulties that bring out our true\ncolours.\n14) Whereas many see the Corona/ Covid-19 virus as a great disaster,\nI prefer to see it as a ‘great corrector’.\nIt is sent to remind us of the important lessons that we seem to have\nforgotten and it is up to us if we will learn them or not.\nI’ve spent a lot of time on the phone these days, just keeping in touch with\npeople. These reflections of Bill Gates seem to strike a chord with a lot of\nwhat people have been saying to me. If nothing else comes out of this whole\nmess, our enforced confinement may make us stop and take stock, just think\nabout what is really important to us – family, community, faith – that I am\nmore than what I earn, more than what I consume.\nPage 2 of 4\nLENT 5 – 2020 – Year A\nTaking stock, setting priorities applies to all areas of life. Young people as\nthey choose what subjects to study, what careers they are going to follow need\nto take a look at what they are good at, what they are not so good at, what\nreally interests and excites them.\nAt this particular time a number of our young people in our parish here in\nHowth are preparing for confirmation. This is one of those times in our lives\nwhen we are invited to stop and take stock. They are being invited to take for\nthemselves the promises made on their behalf by their parents and godparents\nwhen they were baptized.\nDo you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?\nThese are questions not just for our youngsters but for all of us, whatever our\nage – they are a kind of checklist for life. What are our priorities? What\ndirection is our life taking? A number of years ago, people used to wear a\nwristband with the inscription ‘WWJD’ – ‘What would Jesus do?’ The idea\nwould be that when we’re in a difficult situation, we would just ask ourselves,\n‘What would Jesus do here?’ Are we going to go with Christ, or are we going\nto go our own way?\nPage 3 of 4\nLENT 5 – 2020 – Year A\nOur reading this Sunday is the account we find in John’s Gospel of the raising\nof Lazarus. Some have likened the tomb Lazarus lay in to the metaphorical\ntombs we find ourselves in: tombs of habits we long to leave behind, attitudes\nthat we know are not right, prejudices about other people or groups in society,\nselfishness – but all these seem to be so much part of us, they are hard to shake\noff.\nIn these times of reflection, of taking stock of where we are and who we are,\nJesus stands at the door of our own particular tomb and says, ‘Come out!’ He\ninvites us to let him release us from obsession with ourselves to serve one\nanother; release us from all that stops us from seeing in others, whatever their\nrace, their gender, their culture, their sexuality, fellow human beings, fellow\nchildren of God.\nTo go back to that WhatsApp message I received, that reflection by Bill Gates\non what this virus is teaching us:\n2) It is reminding us that we are all connected and something that\naffects one person has an effect on another. It is reminding us that the\nfalse borders that we have put up have little value as this virus does\nnot need a passport. It is reminding us, by oppressing us for a short\ntime, of those in this world whose whole life is spent in oppression.\n7) It is reminding us that our true work is not our job, that is what we\ndo, not what we were created to do.\nOur true work is to look after each other, to protect each other and to\nbe of benefit to one another.\nMay we be set free from our tombs of sin and self to do just that in the world of\ntoday.\nPage 4 of 4\nLENT 5 – 2020 – Year A\nI will just finish with a prayer of blessing I would sometimes use:\nGo forth into the world in peace.\nBe of good courage.\nHold fast that which is good.\nRender to no one evil for evil.\nStrengthen the fainthearted.\nSupport the weak.\nHelp the afflicted.\nShow love to everyone.\nLove and serve the Lord,\nrejoicing in the power of the Holy Spirit;\nand the blessing of almighty God,\nthe Father, the Son, and the Holy Spirit,\nbe among you and remain with you always. Amen."
    }
}