{
    "title": "Letter of Christ",
    "date": "2012-03-11",
    "blurb": "This sermon reflects on the life of St. Patrick and his spiritual awakening during his time as a slave. It emphasizes the concept of self-surrender and humility, drawing parallels to the teachings of Christ. The sermon concludes with a powerful prayer from the Methodist Covenant Service, expressing a commitment to selfless service and surrender to God's will.",
    "raw_text": "3rd Sunday of Lent - 2012 – year B\nSunday before St Patrick’s Day\n\nOne of the views we enjoyed from the Rectory in Ahoghill was that of Slemish. Slemish, the core of a long dormant volcano dominates the landscape around Ballymena. Situated just outside the village of Broughshane, it is reputed to be the spot where Patrick, who as a young man was captured from his home and family in Britain, served as a slave tending sheep.\n\nIn the ‘Confessions’, reputed to be written by Patrick towards the end of his life, the Saint speaks of that time in terms of a growing spiritual awakening, seeing it in terms of God disciplining him. After some six years, Patrick escapes and returns to England and to his family. He is trained for ministry, probably in France, though he regards himself as having little learning.\n\nIn the course of his ‘Confessions’ he speaks of a sense of call to return to Ireland. He faced severe opposition from some within the Church who cited his lack of learning, his dissolute life style before his conversion. None the less he returns. His ministry is marked by times of success (he speaks with obvious pride in the numbers he brought to baptism); times also of repeated brushes with death and imprisonment as well as an ongoing inner struggle to remain true to the Christ who had called him.\n\nI am left with a picture of a very human figure, aware of his failings yet feeling compelled to fulfil the ministry to which he had been called, aware that it is only by grace that he can fulfil it. There is an expression that occurs near the beginning of the ‘Confessions’ that stood out for me and one that seemed to set the tone of the rest of the book. He described his own vocation, and that of any believer, to be ‘a letter of Christ bearing salvation to the uttermost parts of the world.’ (Patrick in his own words – J Duffy – p 14)\n\nYou and I each called to be ‘a letter of Christ bearing salvation to the uttermost parts of the world’; called to proclaim Christ, to witness to Christ, to be Christ. What does it mean, ‘to be Christ’, to model something of his life in the world of today?\n\nLast Sunday we read of Jesus’ rebuke to Peter after Peter had chided him when he had spoken of his coming suffering and death. He went on, if you recall, to say to his disciples; ‘If anyone would come after me he must deny himself and take up his cross and follow me. For whoever wants to save his life will lose it but whoever loses his life for me and for the gospel will save it.’ This saving and losing and losing and saving is at the heart of the way of Christ.\n\nThe way of Christ is the way of letting go; letting go of our attachment to the things that seem to be so important that are in fact so transitory; it is to follow in the steps of him who at Gethsemene prayed, ‘Let this cup pass from me, yet not my will but yours be done.’; who taught us to pray, ‘Your will be done on earth as it is in heaven’; who says to those who would listen, ‘He who exalts himself will be humbled and he who humbles himself will be exalted.’\n\nWe see this most powerfully in the Cross. It is an act of letting go, of total self surrender through which God’s power breaks through into the world. As we will say together in our Eucharistic Prayer:\n\n‘He opened wide his arms upon the cross\nand, with love stronger than death,\nhe made the perfect sacrifice for sin.’\n\nThat is what Paul is talking about in the passage we read as our Epistle as he speaks of God’s foolishness as wiser than human wisdom, God’s weakness as stronger than human strength. It is in the Cross that God’s power breaks through into my life. It is in the cry of dereliction ‘My God! My God! Why have you abandoned me?’ that I realise God’s total identification with our human condition. That in Christ, God knows what it is to be human, knows what it is to be me, that I am not alone, that I am loved, that I am cherished as a child of God.\n\nThe early Celtic Church had a very strong sense of not only following Christ but also that of Christ travelling the journey with us. In the Breast Plate, an early Irish hymn attributed to St Patrick (hymn 322 in our book), we have a love expression of Christ accompanying, enfolding us, living within us as we travel the road.\n\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist to comfort and restore me,\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\n\nPatrick spoke of himself, of all believers, as ‘a letter of Christ’. This is the Christ we are to take out into the world. This is the Christ who has promised to be with us as we go out in his name. The Christ who emptied himself, who drew alongside the sick, the rejected, the despised, who turned the other cheek, who went the extra mile, who gave himself; whose love has the power to change my life, change all our lives and through us the world in which we live.\n\nThe prayer from the Methodist Covenant Service expresses something of a response to this self giving love.\n\nI am no longer my own but yours,\nsend me where you will,\nrank me with whom you will;\nlet me be employed for you,\nor laid aside for you;\nexalted for you,\nor brought low for you;\nlet me be full, let me be empty;\nlet me have all things,\nlet me have nothing;\nFreely and whole heartedly\nI yield my life and all I possess\nto your pleasure and disposal.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent32012930.txt",
        "raw_ocr_content": "3rd Sunday of Lent - 2012 – year B\nSunday before St Patrick’s Day\nOne of the views we enjoyed from the Rectory in Ahoghill was that of\nSlemish. Slemish, the core of a long dormant volcano dominates the landscape\naround Ballymena. Situated just outside the village of Broughshane, it is\nreputed to be the spot where Patrick, who as a young man was captured from\nhis home and family in Britain, served as a slave tending sheep.\nIn the ‘Confessions’, reputed to be written by Patrick towards the end of his\nlife, the Saint speaks of that time in terms of a growing spiritual awakening,\nseeing it in terms of God disciplining him. After some six years, Patrick\nescapes and returns to England and to his family. He is trained for ministry,\nprobably in France, though he regards himself as having little learning.\nIn the course of his ‘Confessions’ he speaks of a sense of call to return to\nIreland. He faced severe opposition from some within the Church who cited\nhis lack of learning, his dissolute life style before his conversion. None the less\nhe returns. His ministry is marked by times of success (he speaks with obvious\npride in the numbers he brought to baptism); times also of repeated brushes\nwith death and imprisonment as well as an ongoing inner struggle to remain\ntrue to the Christ who had called him.\nI am left with a picture of a very human figure, aware of his failings yet felling\ncompelled to fulfil the ministry to which he had been called, aware that it is\nonly by grace that he can fulfil it. There is an expression that occurs near the\nbeginning of the ‘Confessions’ that stood out for me and one that seemed to set\nPage 1 of 4\n3rd Sunday of Lent - 2012 – year B\nSunday before St Patrick’s Day\nthe tone of the rest of the book. He described his own vocation, and that of any\nbeliever, to be ‘a letter of Christ bearing salvation to the uttermost parts of the\nworld.’ (Patrick in his own words – J Duffy – p 14)\nYou and I each called to be ‘a letter of Christ bearing salvation to the uttermost\nparts of the world’; called to proclaim Christ, to witness to Christ, to be Christ.\nWhat does it mean, ‘to be Christ’, to model something of his life in the world\nof today?\nLast Sunday we read of Jesus’ rebuke to Peter after Peter had chided him when\nhe had spoken of his coming suffering and death. He went on, if you recall, to\nsay to his disciples; ‘If anyone would come after me he must deny himself and\ntake up his cross and follow me. For whoever wants to save his life will lose it\nbut whoever loses his life for me and for the gospel will save it.’ This saving\nand losing and losing and saving is at the heart of the way of Christ.\nThe way of Christ is the way of letting go; letting go of our attachment to the\nthings that seem to be so important that are in fact so transitory; it is to follow\nin the steps of him who at Gethsemene prayed, ‘Let this cup pass from me, yet\nnot my will but yours be done.’; who taught us to pray, ‘Your will be done on\nearth as it is in heaven’; who says to those who would listen, ‘He who exalts\nhimself will be humbled and he who humbles himself will be exalted.’\nPage 2 of 4\n3rd Sunday of Lent - 2012 – year B\nSunday before St Patrick’s Day\nWe see this most powerfully in the Cross. It is an act of letting go, of total self\nsurrender through which God’s power breaks through into the world. As we\nwill say together in our Eucharistic Prayer:\n‘He opened wide his arms upon the cross\nand, with love stronger than death,\nhe made the perfect sacrifice for sin.’\nThat is what Paul is talking about in the passage we read as our Epistle as he\nspeaks of God’s foolishness as wiser than human wisdom, God’s weakness as\nstronger than human strength. It is in the Cross that God’s power breaks\nthrough into my life. It is in the cry of dereliction ‘My God! My God! Why\nhave you abandoned me?’ that I realise God’s total identification with our\nhuman condition. That in Christ, God knows what it is to be human, knows\nwhat it is to be me,, that I am not alone, that I am loved, that I am cherished as\na child of God.\nThe early Celtic Church had a very strong sense of not only following Christ\nbut also that of Christ travelling the journey with us. In the Breast Plate, an\nearly Irish hymn attributed to St Patrick (hymn 322 in our book), we have a\nlove expression of Christ accompanying, enfolding us, living within us as we\ntravel the road.\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist to comfort and restore me,\nPage 3 of 4\n3rd Sunday of Lent - 2012 – year B\nSunday before St Patrick’s Day\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\nPatrick spoke of himself, of all believers, as ‘a letter of Christ’. This is the\nChrist we are to take out into the world. This is the Christ who has promised to\nbe with us as we go out in his name. The Christ who emptied himself, who\ndrew alongside the sick, the rejected, the despised, who turned the other cheek,\nwho went the extra mile, who gave himself; whose love has the power to\nchange my life, change all our lives and through us the world in which we live.\nThe prayer from the Methodist Covenant Service expresses something of a\nresponse to this self giving love.\nI am no longer my own but yours,\nsend me where you will,\nrank me with whom you will;\nlet me be employed for you,\nor laid aside for you;\nexalted for you,\nor brought low for you;\nlet me be full, let me be empty;\nlet me have all things,\nlet me have nothing;\nFreely and whole heartedly\nI yield my life and all I possess\nto your pleasure and disposal.\nPage 4 of 4"
    }
}