{
    "title": "Imperfections and Grace",
    "date": "2020-03-01",
    "blurb": "This sermon, delivered on the first Sunday of Lent in 2020, explores the theme of human imperfection and God's grace. It reflects on the fallibility of even the most respected figures, such as Jean Vanier, and the ability of God to work through flawed individuals. It emphasizes the understanding and mercy of Jesus, who experienced human life and its challenges.",
    "raw_text": "LENT 1 – Year A – 2020\n\nFor he himself knows of what we are made; he remembers that we are but dust. Prayer of committal, Funeral Service BCP2004\n\nOver the years, I have long admired the work of the late Jean Vanier, founder of the L’Arche community, a community in which able and disabled live together in Christian community in mutual respect. They have a house here in Baldoyle. I’ve gone to hear Jean Vanier on a number of occasions, the last time in Taize only two years ago. I have a number of his books in my study that have given me much food for thought over the years.\n\nLike many I found myself deeply shocked and saddened at a report, itself commissioned by the L’Arche Community, that revealed a darker side to the life of Jean Vanier.\n\nI found myself thinking. A realisation came to my mind that even the very best of us are flawed human beings. My mind went back to the circumstances that lead up to my arrival in the Parish of Ahoghill. My predecessor, who had served faithfully for 30 years, exercising a wonderful pastoral ministry, had been caught out in a scandal and had taken his own life. The Parish was distraught as they sought to reconcile their memories of a faithful pastor who had seen them through so much both as individuals and as a community, and the tragedy of the scandal that had lead him to take his own life.\n\nOver the last weekend my mind went back to the end of a Bible study. We were all chatting over a cup of tea and my predecessor’s name came up. An old lady leant back in her chair and said, ‘I will never understand what he did – but boy he was good to us.’\n\nFor he himself knows of what we are made; he remembers that we are but dust.\n\nThis morning, the First Sunday in Lent, our Old Testament Lesson is part of the account of the Fall, the Temptation in the Garden of Eden. I just want to get behind the images of serpent, of forbidden fruit and go to the fundamental truth behind this well known story. From the very outset, man is understood as having been created free. Man is free; free to be faithful, free to fail.\n\nBut it goes further than that. Failure is not the end of the story. God does not wash his hands of man. God continues to call, continues to engage with man. As the Old Testament story progresses, we see major figures emerge who respond to God’s call; Abram, Isaac, Jacob, David. Each are presented as real human beings with strengths and weaknesses, instances of great faithfulness, instances of abject failure. Abram in Egypt, in fear for his life, passes his wife off as his sister. Jacob deceives his father Isaac to rob his brother Esau of his father’s final blessing. David abuses his power, seducing Bathsheba, arranging the certain death of her husband Uriah.\n\nGod works through human beings, despite their weaknesses, despite their failure – and is not ultimately frustrated even by their wickedness.\n\nFor he himself knows of what we are made; he remembers that we are but dust.\n\nGod comes among us in the Incarnation, in the person of Jesus. He lived among us, grew up in a human family, knew what it was to laugh, to weep, to be lonely, abandoned. Our Gospel reading speaks of Temptation. But Jesus’ experience of temptation in the Gospels goes beyond what we read of this morning. And so I find myself turning to those words in the letter to the Hebrews:\n\nFor we do not have a high priest who is unable to empathize with our weaknesses, but we have one who has been tempted in every way, just as we are —yet he did not sin. Let us then approach God’s throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need. Hebrews 4:15ff\n\nGod in Jesus knows, really knows what it is like to be human. He knows the pressures we face. He is one who not only knows; he is one who understands, one in whom we may receive mercy and find grace to help us in our time of need.\n\nI look back to that night in Ahoghill Parish and remember a people who still could not understand, still felt the hurt of what my predecessor had done, but who looked back in thankfulness to a ministry in which they had experienced God’s love in their midst and thanked God for him.\n\nThe L’Arche Community are in the process of coming to terms with what they have learned of the darker side of one they held in huge regard. People have been hurt and they must never be forgotten. Something remarkable happened in the establishment of L’Arche that would not have happened in quite the same way without the drive and vision of Jean Vanier. It is our hope and prayer that that work will continue.\n\nIt is a reminder that God can, and does, do remarkable things in and through the lives of imperfect and flawed human beings – and from that I take great comfort.\n\nFor he himself knows of what we are made; he remembers that we are but dust.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent12020.txt",
        "raw_ocr_content": "Page 1 of 5\nLENT 1 – Year A – 2020\nFor he himself knows of what we are made;\nhe remembers that we are but dust.\nPrayer of committal, Funeral Service BCP2004\nOver the years, I have long admired the work of the late Jean Vanier,\nfounder of the L’Arche community, a community in which able and\ndisabled live together in Christian community in mutual respect. They\nhave a house here in Baldoyle. I’ve gone to hear Jean Vanier on a\nnumber of occasions, the last time in Taize only two years ago. I have a\nnumber of his books in my study that have given me much food for\nthought over the years.\nLike many I found myself deeply shocked and saddened at a report,\nitself commissioned by the L’Arche Community, that revealed a darker\nside to the life of Jean Vanier.\nI found myself thinking. A realisation came to my mind that even the\nvery best of us are flawed human beings. My mind went back to the\ncircumstances that lead up to my arrival in the Parish of Ahoghill. My\npredecessor, who had served faithfully for 30 years, exercising a\nwonderful pastoral ministry, had been caught out in a scandal and had\ntaken his own life. The Parish was distraught as they sought to reconcile\ntheir memories of a faithful pastor who had seen them through so much\nPage 2 of 5\nLENT 1 – Year A – 2020\nboth as individuals and as a community, and the tragedy of the scandal\nthat had lead him to take his own life.\nOver the last weekend my mind went back to the end of a Bible study.\nWe were all chatting over a cup of tea and my predecessor’s name came\nup. An old lady leant back in her chair and said, ‘I will never understand\nwhat he did – but boy he was good to us.’\nFor he himself knows of what we are made;\nhe remembers that we are but dust.\nThis morning, the First Sunday in Lent, our Old Testament Lesson is\npart of the account of the Fall, the Temptation in the Garden of Eden. I\njust want to get behind the images of serpent, of forbidden fruit and go\nto the fundamental truth behind this well known story. From the very\noutset, man is understood as having been created free. Man is free; free\nto be faithful, free to fail.\nBut it goes further than that. Failure is not the end of the story. God\ndoes not wash his hands of man. God continues to call, continues to\nengage with man. As the Old Testament story progresses, we see major\nfigures emerge who respond to God’s call; Abram, Isaac, Jacob, David.\nEach are presented as real human beings with strengths and weaknesses,\ninstances of great faithfulness, instances of abject failure. Abram in\nPage 3 of 5\nLENT 1 – Year A – 2020\nEgypt, in fear for his life, passes his wife off as his sister. Jacob\ndeceives his father Isaac to rob his brother Esau of his father’s final\nblessing. David abuses his power, seducing Bathsheba, arranging the\ncertain death of her husband Uriah.\nGod works through human beings, despite their weaknesses, despite\ntheir failure – and is not ultimately frustrated even by their wickedness.\nFor he himself knows of what we are made;\nhe remembers that we are but dust.\nGod comes among us in the Incarnation, in the person of Jesus. He lived\namong us, grew up in a human family, knew what it was to laugh, to\nweep, to be lonely, abandoned. Our Gospel reading speaks of\nTemptation. But Jesus’ experience of temptation in the Gospels goes\nbeyond what we read of this morning. And so I find myself turning to\nthose words in the letter to the Hebrews:\nFor we do not have a high priest who is unable to empathize\nwith our weaknesses, but we have one who has been tempted\nin every way, just as we are —yet he did not sin. Let us then\napproach God’s throne of grace with confidence, so that we\nmay receive mercy and find grace to help us in our time of\nneed.\nHebrews 4:15ff\nGod in Jesus knows, really knows what it is like to be human. He\nknows the pressures we face. He is one who not only knows; he is one\nPage 4 of 5\nLENT 1 – Year A – 2020\nwho understands, one in whom we may receive mercy and find grace to\nhelp us in our time of need.\nI look back to that night in Ahoghill Parish and remember a people who\nstill could not understand, still felt the hurt of what my predecessor had\ndone, but who looked back in thankfulness to a ministry in which they\nhad experienced God’s love in their midst and thanked God for him.\nThe L’Arche Community are in the process of coming to terms with\nwhat they have learned of the darker side of one they held in huge\nregard. People have been hurt and they must never be forgotten.\nSomething remarkable happened in the establishment of L’Arche that\nwould not have happened in quite the same way without the drive and\nvision of Jean Vanier. It is our hope and prayer that that work will\ncontinue.\nIt is a reminder that God can, and does, do remarkable things in and\nthrough the lives of imperfect and flawed human beings – and from that\nI take great comfort.\nFor he himself knows of what we are made;\nhe remembers that we are but dust.\nPage 5 of 5\nLENT 1 – Year A – 2020"
    }
}