{
    "title": "Follow the Maker's Instructions",
    "date": "2012-03-11",
    "blurb": "This sermon emphasizes the importance of recognizing our unique talents and using them to serve God and others. It highlights the significance of the commandments as the 'maker's instructions' for leading a righteous life. The sermon also reminds us that we are all made in God's image and should strive to reflect His light in our daily lives.",
    "raw_text": "Show video clip of 'Dog Music'\n\nThere are things that we are good at and things we aren't. Examples of things people are good at and not good at – running & ice skating. Sometimes we say someone was made to be a runner, a singer, a doctor. If we have a real talent someone will tell us to go and take lessons, go and get trained.\n\nWe are all different, we are all going to be good and different things but we all have one thing in common. We are all made in the image of God, we are all trying to follow Christ. At the end of the Service of Baptism I will say to the newly baptised:\n\n>You have received the light of Christ, walk in this light all the days of your life. Shine as a light in the world, to the glory of God the Father\n\nWe have a little poster at home that says, 'To get the best results, follow the maker's instructions.' That is where our Old Testament Lesson comes in, the giving of the commandments.\n\nIn the Book Exodus we hear of God bringing his people out of slavery in Egypt and then on Mount Sinai the people are told 'You are my people' – this is the best way for you to live. Keep a place for God in your lives for worship, for service. Respect one another – so don't cheat one another, don't lie to one another, don't steal, don't kill.\n\nThen alongside all of this we have the teachings and example of Jesus. To go back to the dog – he wasn't very good at playing the piano or singing but I'm sure he was good at lots of other things. All of us have a particular talent, something we are good at – celebrate that and develop that.\n\nAll of us are made in God's image, made for God's service – to get the best results, let us all 'Follow the maker's instructions' that we can do our best for God and for one another.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent32012famserv.txt",
        "raw_ocr_content": "Page 1 of 2\nLent 3 – year B – 2012 – Family Service\nShow video clip of ‘Dog Music’\nThere are things that we are good at and things we aren’t\nExamples of things people are good at and not good at – running & ice skating\nSometimes we say someone was made to be a runner, a singer, a doctor.\nIf we have a real talent someone will tell us to go and take lessons, go and get\ntrained.\nWe are all different, we are all going to be good and different things but we all\nhave one thing in common. We are all made in the image of God, we are all\ntrying to follow Christ.\nAt the end of the Service of Baptism I will say to the newly baptised\nYou have received the light of Christ, walk in this light all\nthe days of your life. Shine as a light in the world, to the\nglory of God the Father\nWe have a little poster at home that says, ‘To get the best results,\nfollow the maker’s instructions.’ That is where our Old Testament\nLesson comes in, the giving of the commandments.\nPage 2 of 2\nLent 3 – year B – 2012 – Family Service\nIn the Book Exodus we hear of God bringing his people out of\nslavery in Egypt and then on Mount Sinai the people are told ‘You\nare my people’ – this is the best way for you to live.\nKeep a place for God in your lives for worship, for service.\nRespect one another – so don’t cheat one another, don’t lie to one\nanother, don’t steal, don’t kill.\nThen alongside all of this we have the teachings and example of\nJesus.\nTo go back to the dog – he wasn’t very good at playing the piano or\nsinging but I’m sure he was good at lots of other things.\nAll of us have a particular talent, something we are good at –\ncelebrate that and develop that.\nAll of us are made in God’s image, made for God’s service – to get\nthe best results, let us all ‘Follow the maker’s instructions’ that we\ncan do our best for God and for one another."
    }
}