{
    "title": "Unconditional Love",
    "date": "2012-03-18",
    "blurb": "Kevin explores the concept of unconditional love in the context of Mothering Sunday, relating it to the love of God and the love within a community of faith. He emphasizes the importance of forgiveness, graciousness, and positive parenting, drawing parallels between our relationships with each other and our relationship with God.",
    "raw_text": "I want to begin this morning reflecting on the topic of unconditional love. A love that is simply given, bestowed on the beloved. A love that still loves in the face of ingratitude, tantrums, hurts. A love that is always open to the future. I would suspect that as we do this we will think of close friends, of partners – we will all think of parental love, and in particular the love of a mother.\n\nThis day, Mothering Sunday, is a day of particular thanksgiving. Mothering Sunday speaks not just of maternal love – it was also a day during the season of Lent on which Christians used to return to the Church where they found faith, their ‘Mother church’. For myself it is always a day on which I remember with particular fondness the Parish Church of St Lawrence in Northfield in Birmingham and the people who encouraged me in my early days in the faith.\n\nThere are a whole range of expressions that have been used over the years to define what we mean by the word ‘Church’ – Body of Christ, pilgrim people, people of God. There is one definition of Church that I first heard at a diocesan retreat when I was in Mountmellick that chimes in with these thoughts of unconditional love. It is the Church as ‘a community of friends drawn together by the friendship of Jesus.’\n\nWhat I have always liked about that is that it expresses our understanding of who we are, beginning with a realisation of God’s love for us in Christ. For at the heart of any understanding of the Church must lie the fundamental concept of relationship – a relationship with one another, a relationship with God. This is turn resonates with our second lesson from Paul’s letter to the Colossians and in particular his injunction:\n\n13Bear with one another and, if anyone has a complaint against another, forgive each other; just as the Lord has forgiven you, so you also must forgive.\n\n‘Forgive, just as the Lord has forgiven you.’ This is not to be a grudging forgiveness but one freely given, reflecting something of Christ’s love for us. This is brought out in the language Paul uses in the original Greek in which he wrote this passage. There are a number of words in Greek that are translated as ‘forgive’ in our New Testament – each will carry its own particular nuance. There are the words ‘’ἀφίδι’ and ‘’ἀπολύω’, which carry legal overtones, an overturning or remission of a sentence or punishment that is imposed. The word used here is quite different, ‘χαρίζομαι’, which has the same root as the word χαίρω, which has overtones of gladness, of graciousness.\n\nIn other words there is a graciousness to the forgiveness that is offered, both God’s forgiveness of us and the forgiveness that we must offer to one another. It is this graciousness that is to be the mark of this community of friends, drawn together by the friendship of Jesus. We are if you like to model in our dealings with one another what we have experienced in our relationship with God. The unstinting love of God, the love that goes the extra mile, that turns the other cheek, that goes to the cross – this is the love that we are called to model in our own lives.\n\nThis takes me back to what we were thinking about at the beginning, the whole issue of unconditional love. As we were thinking about that our thoughts turned to the love we experienced in our homes, the love of parent, the love of mother. This all brings home to me the vital role of positive parenting in the life of our society. So often in our own lives, we model what we experience. Tragically we all too often see this when things go wrong. The abuser all too often has been abused in the past. Those who have witnessed violence in the home, all too often go on to be violent in their own homes. The home is truly the primary school in life, it is the place where attitudes are formed, attitudes to other people, to ourselves, to wider society. It is here we learn the value of tolerance, of integrity, it is here we learn the importance of respect, respect for others, respect for ourselves.\n\nSo today we remember with thanks giving the love that we have received in our own homes and families, the lessons of life, the values we were imbued with. We give thanks for the Christian communities within which we were encouraged in the faith, the individuals through whom we saw and experienced Christ. As part of this community of friends, drawn together by the friendship of Jesus, may we be enabled, in the situations God places us in this week, to show something of that reconciling, life enhancing love in the world of today.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent42012.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 4 – Mothering Sunday – 2012 – Year B\nI want to begin this morning reflecting on the topic of unconditional love. A\nlove that is simply given, bestowed on the beloved. A love that still loves in the\nface of ingratitude, tantrums, hurts. A love that is always open to the future. I\nwould suspect that as we do this we will think of close friends, of partners – we\nwill all think of parental love, and in particular the love of a mother.\nThis day, Mothering Sunday, is a day of particular thanksgiving. Mothering\nSunday speaks not just of maternal love – it was also a day during the season of\nLent on which Christians used to return to the Church where they found faith,\ntheir ‘Mother church’. For myself it is always a day on which I remember with\nparticular fondness the Parish Church of St Lawrence in Northfield in\nBirmingham and the people who encouraged me in my early days in the faith.\nThere are a whole range of expressions that have been used over the years to\ndefine what we mean by the word ‘Church’ – Body of Christ, pilgrim people,\npeople of God. There is one definition of Church that I first heard at a diocesan\nretreat when I was in Mountmellick that chimes in with these thoughts of\nunconditional love. It is the Church as ‘a community of friends drawn together\nby the friendship of Jesus.’\nWhat I have always liked about that is that it expresses our understanding of\nwho we are, beginning with a realisation of God’s love for us in Christ. For at\nthe heart of any understanding of the Church must lie the fundamental concept\nof relationship – a relationship with one another, a relationship with God. This\nis turn resonates with our second lesson from Paul’s letter to the Colossians and\nin particular his injunction:\nPage 2 of 3\nLent 4 – Mothering Sunday – 2012 – Year B\n13Bear with one another and, if anyone has a complaint against another,\nforgive each other; just as the Lord has forgiven you, so you also must\nforgive.\n‘Forgive, just as the Lord has forgiven you.’ This is not to be a grudging\nforgiveness but one freely given, reflecting something of Christ’s love for us.\nThis is brought out in the language Paul uses in the original Greek in which he\nwrote this passage. There are a number of words in Greek that are translated as\n‘forgive’ in our New Testament – each will carry its own particular nuance.\nThere are the words ‘’’ and ‘’’, which carry legal overtones, an\noverturning or remission of a sentence or punishment that is imposed. The\nword used here is quite different, ‘’, which has the same root as the\nword which has overtones of gladness, of graciousness.\nIn other words there is a graciousness to the forgiveness that is offered, both\nGod’s forgiveness of us and the forgiveness that we must offer to one another.\nIt is this graciousness that is to be the mark of this community of friends, drawn\ntogether by the friendship of Jesus. We are if you like to model in our dealings\nwith one another what we have experienced in our relationship with God. The\nunstinting love of God, the love that goes the extra mile, that turns the other\ncheek, that goes to the cross – this is the love that we are called to model in our\nown lives.\nThis takes me back to what we were thinking about at the beginning, the whole\nissue of unconditional love. As we were thinking about that our thoughts turned\nto the love we experienced in our homes, the love of parent, the love of mother.\nThis all brings home to me the vital role of positive parenting in the life of our\nPage 3 of 3\nLent 4 – Mothering Sunday – 2012 – Year B\nsociety. So often in our own lives, we model what we experience. Tragically\nwe all too often see this when things go wrong. The abuser all too often has\nbeen abused in the past. Those who have witnessed violence in the home, all\ntoo often go on to be violent in their own homes. The home is truly the primary\nschool in life, it is the place where attitudes are formed, attitudes to other\npeople, to ourselves, to wider society. It is here we learn the value of tolerance,\nof integrity, it is here we learn the importance of respect, respect for others,\nrespect for ourselves.\nSo today we remember with thanks giving the love that we have received in our\nown homes and families, the lessons of life, the values we were imbued with.\nWe give thanks for the Christian communities within which we were\nencouraged in the faith, the individuals through whom we saw and experienced\nChrist. As part of this community of friends, drawn together by the friendship\nof Jesus, may we be enabled, in the situations God places us in this week, to\nshow something of that reconciling, life enhancing love in the world of today."
    }
}