{
    "title": "Choices in Lent",
    "date": "2009-03-08",
    "blurb": "In this sermon, Kevin explores the concept of temptation and choices, emphasizing that they are part and parcel of our human condition. He encourages us to let our Christian commitment challenge our social and cultural norms. He highlights the importance of self-denial and conforming to Christ in our decision-making process, especially in times of societal challenges.",
    "raw_text": "Last Sunday, the first Sunday in Lent, our Gospel reading made reference to the temptations of Jesus in the wilderness. It is a familiar story – but the familiarity and its associations with the desert tends to foster the idea that temptation was for Jesus a once off effort, that, once overcome, did not have to be faced again.\n\nOh that it was that easy. You and I know that temptation is part and parcel of our human condition, something to be faced on an ongoing basis – for we are free individuals not puppets under the control of some divine puppet master. We are free to make choices – good choices, bad choices, difficult choices. We are frequently faced with dilemmas when all our options are fraught with difficulty.\n\nIf that is true for us then, if we really believe in the humanity of Jesus, it was true for him – otherwise his humanity is but a delusion. Indeed, if you look through the Gospel accounts, temptation, choices are a thread running through the whole story as a recurring theme. Take our Gospel reading today. Jesus had been speaking of his coming suffering and death and Peter, in our account rebukes him. ‘Lord, don’t talk like that; this need not happen’ – other, easier paths to follow. What is significant in this story is that this temptation, this choice is not presented by an adversary – it comes from a friend, a companion, one seriously concerned at the path a friend is taking.\n\nAnd so I want to move away from this word temptation and develop our thoughts along the line of choices. Choices that present themselves in the course of daily life; choices that are in fact part of my daily life.\n\nHow do we deal with these? To be honest with ourselves, most of these will be handled instinctively – not so much without thought as thoughts that are conditioned by our circumstances, the social norms we have been brought up with, our home and family background, the social circles in which we move..\n\nBut are we to be just a product of our home and society background? We have after all seen how rising prosperity produced fundamental changes in Irish society, not all of it for the better.\n\nTo what extent do we allow our spiritual and specifically Christian commitment to challenge, or at least interrogate these social and cultural norms? A number of years ago it became quite the thing in certain Church groupings to wear a wrist band bearing the initials WWJD, standing for ‘What would Jesus do?’ The idea behind it was quite simple. The wristband was a reminder to the wearer that, when faced with a difficult decision, they should set that decision within the context of their understanding of the teachings of Jesus. That can be a bit simplistic – there are issues facing us in contemporary society for which it is hard, if not impossible, to find a direct reference in the Gospel accounts of Jesus’ teachings. But the Gospels take us beyond the realm of actions to that of the attitudes that lie behind these actions; attitudes that stand the test of time, that have the power to inform and transform our responses to the choices that fade us in contemporary life.\n\n‘If any want to become my followers, let them deny themselves and take up their cross and follow me.’ Adopt something of the same self-denying, self-emptying ethic of the Christ we week to serve.\n\nMore than an imitation of Christ, there is a conforming to Christ. It calls to mind Paul’s injunction to the Philippians: ‘Let the same mind be in you that was in Christ Jesus,’ I spoke earlier of allowing our Christian convictions to challenge, to interrogate the cultural and social norms that mould the choices we make as individuals, as a society. Temptation, the presentation of choices if you like, not so much something in the desert, on the periphery, the margins of life – but very much part of life, part of our human condition as individuals created free before God. These choices are faced not in isolation from God but in fellowship, in partnership with the God we seek to serve.\n\nThere are fundamental choices we now face as a society. How these are faced is going to determine the future direction and health of our society. In times of financial stringency it is very tempting to retreat into ourselves, to look after number 1. Nations can retreat into protectionism, society can fragment into competing factions, blaming the other for the problems that have descended upon us. We blame the politicians, the banks, the public services, those who have come from overseas. As individuals we can retreat from our obligations to help those less fortunate that ourselves. In the short term the weak and the marginalised suffer but we are all impoverished as a society, as we become a harsher, meaner society.\n\nThe teaching of Jesus as presented in our Gospel reading presents us with a radical alternative to the response of looking after self:\n\n‘‘If any want to become my followers, let them deny themselves and take up their cross and follow me. 35For those who want to save their life will lose it, and those who lose their life for my sake, and for the sake of the gospel, will save it. 36For what will it profit them to gain the whole world and forfeit their life?’’",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent22009.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 2 – 2012 – year B\nLast Sunday, the first Sunday in Lent, our Gospel reading made reference to\nthe temptations of Jesus in the wilderness. It is a familiar story – but the\nfamiliarity and its associations with the desert tends to foster the idea that\ntemptation was for Jesus a once off effort, that, once overcome, did not have to\nbe faced again.\nOh that it was that easy. You and I know that temptation is part and parcel of\nour human condition, something to be faced on an ongoing basis – for we are\nfree individuals not puppets under the control of some divine puppet master.\nWe are free to make choices – good choices, bad choices, difficult choices.\nWe are frequently faced with dilemmas when all our options are fraught with\ndifficulty.\nIf that is true for us then, if we really believe in the humanity of Jesus, it was\ntrue for him – otherwise his humanity is but a delusion. Indeed, if you look\nthrough the Gospel accounts, temptation, choices are a thread running through\nthe whole story as a recurring theme. Take our Gospel reading today. Jesus\nhad been speaking of his coming suffering and death and Peter, in our account\nrebukes him. ‘Lord, don’t talk like that; this need not happen’ – other, easier\npaths to follow. What is significant in this story is that this temptation, this\nchoice is not presented by an adversary – it comes from a friend, a companion,\none seriously concerned at the path a friend is taking.\nAnd so I want to move away from this word temptation and develop our\nthoughts along the line of choices. Choices that present themselves in the\ncourse of daily life; choices that are in fact part of my daily life.\nPage 2 of 3\nLent 2 – 2012 – year B\nHow do we deal with these? To be honest with ourselves, most of these will be\nhandled instinctively – not so much without thought as thoughts that are\nconditioned by our circumstances, the social norms we have been brought up\nwith, our home and family background, the social circles in which we move..\nBut are we to be just a product of our home and society background? We have\nafter all seen how rising prosperity produced fundamental changes in Irish\nsociety, not all of it for the better.\nTo what extent do we allow our spiritual and specifically Christian\ncommitment to challenge, or at least interrogate these social and cultural\nnorms? A number of years ago it became quite the thing in certain Church\ngroupings to wear a wrist band bearing the initials WWJD, standing for ‘What\nwould Jesus do?’ The idea behind it was quite simple. The wristband was a\nreminder to the wearer that, when faced with a difficult decision, they should\nset that decision within the context of their understanding of the teachings of\nJesus. That can be a bit simplistic – there are issues facing us in contemporary\nsociety for which it is hard, if not impossible, to find a direct reference in the\nGospel accounts of Jesus’ teachings. But the Gospels take us beyond the realm\nof actions to that of the attitudes that lie behind these actions; attitudes that\nstand the test of time, that have the power to inform and transform our\nresponses to the choices that fade us in contemporary life.\n‘If any want to become my followers, let them deny themselves and take up\ntheir cross and follow me.’ Adopt something of the same self-denying, self-\nemptying ethic of the Christ we week to serve.\nMore than an imitation of Christ, there is a conforming to Christ. It calls to\nmind Paul’s injunction to the Philippians: ‘Let the same mind be in you that\nwas in Christ Jesus,’ I spoke earlier of allowing our Christian convictions to\nPage 3 of 3\nLent 2 – 2012 – year B\nchallenge, to interrogate the cultural and social norms that mould the choices\nwe make as individuals, as a society. Temptation, the presentation of choices if\nyou like, not so much something in the desert, on the periphery, the margins of\nlife – but very much part of life, part of our human condition as individuals\ncreated free before God. These choices are faced not in isolation from God but\nin fellowship, in partnership with the God we seek to serve.\nThere are fundamental choices we now face as a society. How these are faced\nis going to determine the future direction and health of our society. In times of\nfinancial stringency it is very tempting to retreat into ourselves, to look after\nnumber 1. Nations can retreat into protectionism, society can fragment into\ncompeting factions, blaming the other for the problems that have descended\nupon us. We blame the politicians, the banks, the public services, those who\nhave come from overseas. As individuals we can retreat from our obligations\nto help those less fortunate that ourselves. In the short term the weak and the\nmarginalised suffer but we are all impoverished as a society, as we become a\nharsher, meaner society.\nThe teaching of Jesus as presented in our Gospel reading presents us with a\nradical alternative to the response of looking after self:\n‘‘If any want to become my followers, let them deny themselves and take up\ntheir cross and follow me. 35For those who want to save their life will lose it,\nand those who lose their life for my sake, and for the sake of the gospel, will\nsave it. 36For what will it profit them to gain the whole world and forfeit their\nlife?’’"
    }
}