{
    "title": "Mothering Sunday",
    "date": "2010-03-14",
    "blurb": "This sermon, delivered on Mothering Sunday in 2010, explores the concept of home and the role of mothers. It emphasizes the importance of living together, loving together, and learning together. It also highlights the crucial role of mothers in nurturing, understanding, and caring for their families.",
    "raw_text": "Lent 4 – 2010 – Mothering Sunday – Family Service\n\nShow model of a house\n\nWhat is the difference between a house and a home?\n\nA house is the building – might be big or small – set in Howth or Darndale.\n\nA home is about not just the building but the people who live there.\n\nOne of the insights of the writer of Genesis is when he writes of God, having brought into being all the wonders of creation, saying ‘It is not good for man to be alone’.\n\nGod has made us to live together – home is where we learn the complicated business of living with others: the simple things, sharing meals, sharing tasks, relaxing together, playing together – the importance of understanding, of consideration.\n\nIt goes further than that. We read in the Bible that God is love and we also read that we are made in the image of God – so love and the capacity to love is an important part of our makeup.\n\nSo God has made us to love together – home is where we first experience love. As children we know what it is to be loved by our parents – we learn what it is to be valued, to be special. As parents it is probably the most valuable gift we can give to our children, to one another.\n\nLiving together, loving together, home is where we learn together.\n\nWhen I was in Birmingham a few weeks back I took my two sons to see the house I had grown up in – the house that had been my home. Saw the window of the front room, where we had sat down together for Sunday meals, looked around the back, saw the window of what had been my bedroom, the back garden where we had played together and thought of what I had learned in that house that at one stage was my home. The importance of being loved, of caring for one another, of integrity, of loyalty, of work.\n\nSo the home is where we experience what it is to live together, to love together, a place where we learn some of the most important lessons of life.\n\nAt the heart of that is the mother. The one who brought us to birth, the one who cares for our needs, who listens to our joys, our problems, our disappointments, one who understands – the one who is often forgotten, taken for granted.\n\nSo today, Mothering Sunday is a day to thank God for mothers, for wives, and to show in some small way that we do care, we are thankful.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent42010.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 4 – 2010 – Mothering Sunday – Family Service\nShow model of a house\nWhat is difference between a house and a home?\nHouse is the building – might be big or small – set in Howth or\nDarndale.\nHome is about not just the building but the people who live there.\nOne of the insights of the writer of Genesis is when he writes of God,\nhaving brought into being all the wonders of creation, saying ‘It is not\ngood for man to be alone’.\nGod has made us to live together – home is where we learn the\ncomplicated business of living with others:\nthe simple things, sharing meals, sharing tasks, relaxing together,\nplaying together – the importance of understanding, of consideration.\nIt goes further than that. We read in the Bible that God is love and we\nalso read that we are made in the image of God – so love and the\ncapacity to love is an important part of our makeup.\nPage 2 of 3\nLent 4 – 2010 – Mothering Sunday – Family Service\nSo God has made us to love together – home is where we first\nexperience love. As children we know what it is to be loved by our\nparents – we learn what it is to be valued, to be special. As parents it\nis probably the most valuable gift we can give to our children, to one\nanother.\nLiving together, loving together, home is where we learn together.\nWhen I was in Birmingham a few weeks back I took my two sons to\nsee the house I had grown up in – the house that had been my home.\nSaw the window of the front room, where we had sat down together\nfor Sunday meals, looked around the back, saw the window of what\nhad been my bedroom, the back garden where we had played together\nand thought of what I had learned in that house that at one stage was\nmy home. The importance of being loved, of caring for one another,\nof integrity, of loyalty, of work.\nSo the home is where we experience what it is to live together, to love\ntogether, a place where we learn some of the most important lessons\nof life.\nAt the heart of that is the mother. The one who brought us to birth,\nthe one who cares for our needs, who listens to our joys, our problems,\nPage 3 of 3\nLent 4 – 2010 – Mothering Sunday – Family Service\nour disappointments, one who understands – the one who is often\nforgotten, taken for granted.\nSo today, Mothering Sunday is a day to thank God for mothers, for\nwives, and to show in some small way that we do care, we are\nthankful."
    }
}