{
    "title": "Temptation and Identity",
    "date": "2019-03-10",
    "blurb": "In this sermon, Kevin explores the concept of temptation, using the example of Jesus in the wilderness. He discusses the struggle of being true to oneself in the face of temptation and the importance of not taking the easy option. He encourages us to be trustworthy, compassionate, and forgiving, striving to do what Jesus would do in any given situation.",
    "raw_text": "Last Wednesday, as Elke and I were preparing the pizza that is served at the start of each of our Confirmation classes (the youngsters have just come direct from the Burrow School), Elke proceeded to prepare a serving of popcorn in the microwave. This was put into a bowl in the centre of the table with a note placed over it 'Do not touch!' It was interesting to watch their reaction. Hands reached out and then pulled back. In the course of the class, we got them to talk about their feelings, their reactions. It wasn't a very dramatic temptation. It would not have mattered if the popcorn had not been there – they didn't actually need it. There was that ongoing experience of temptation, that nagging feeling.\n\nJesus in the wilderness – basic line behind all the questions is 'Is this really worth it? – there are easier ways to do this?'\n\nThat is how temptation really hits us – is all this really worth it – ah go on, go on, go on – take the easy option.\n\nIf you're learning music - Do you really have to practice\n\nIf you are doing sport - Do you really have to train\n\nSchool work can be an awful drag\n\nGoing back to Jesus and his temptations – the questions were about being true to who he was.\n\nSame for us – temptation and our response to temptation is about being true to who we are. People talk about being your own person not what other people telling you what you ought to be.\n\nBeing true to ourselves as followers of Jesus\n\nBeing trustworthy, being compassionate, being forgiving – trying to do what Jesus would do in whatever situation we find ourselves in.\n\n> Prayer of St Ignatius\n\n> Teach us, good Lord, to serve thee as thou deservest;\n\n> To give, and not to count the cost,\n\n> to fight, and not to heed the wounds,\n\n> to toil, and not to seek for rest,\n\n> to labor, and not to ask for any reward,\n\n> save that of knowing that we do thy will.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent12029famserv.txt",
        "raw_ocr_content": "Page 1 of 2\nLent 1 – year C – 2019 – Family Service\nUse powerpoint for Lent 1 2019 in powerpoint section of Sermons file\nLast Wednesday, as Elke and I were preparing the pizza that is served at the start of each\nof our Confirmation classes (the youngsters have just come direct from the Burrow\nSchool), Elke proceeded to prepare a serving of popcorn in the microwave. This was put\ninto a bowl in the centre of the table with a note placed over it ‘Do not touch!’ It was\ninteresting to watch their reaction. Hands reached out and then pulled back. In the course\nof the class, we got them to talk about their feelings, their reactions. It wasn’t a very\ndramatic temptation. It would not have mattered if the popcorn had not been there – they\ndidn’t actually need it. There was that ongoing experience of temptation, that nagging\nfeeling.\nJesus in the wilderness – basic line behind all the questions is ‘Is this\nreally worth it? – there are easier ways to do this?\nThat is how temptation really hits us – is all this really worth it – ah go\non, go on, go on – take the easy option.\nIf you’re learning music - Do you really have to practice (slides)\nIf you are doing sport - Do you really have to train (slides)\nSchool work can be an awful drag (slides)\nGoing back to Jesus and his temptations – the questions were about\nbeing true to who he was. (Cartoon slide of Jesus)\nSame for us – temptation and our response to temptation is about\nbeing true to who we are. People talk about being your own person\nnot what other people telling you what you ought to be.\nPage 2 of 2\nLent 1 – year C – 2019 – Family Service\nUse powerpoint for Lent 1 2019 in powerpoint section of Sermons file\nBeing true to ourselves as followers of Jesus (slide of WWJD\nwritsband)\nBeing trustworthy, being compassionate, being forgiving – trying to\ndo what Jesus would do in whatever situation we find ourselves in.\nPrayer of St Ignatius\nTeach us, good Lord, to serve thee as thou deservest;\nTo give, and not to count the cost,\nto fight, and not to heed the wounds,\nto toil, and not to seek for rest,\nto labor, and not to ask for any reward,\nsave that of knowing that we do thy will."
    }
}