{
    "title": "Mothering Sunday - Year A",
    "date": "2020-03-22",
    "blurb": "This sermon, delivered on Mothering Sunday in 2020, reflects on the profound effects of the Covid-19 pandemic on society. It emphasizes the importance of community in these trying times and the hope symbolized by children, who represent the future. The sermon also draws parallels between the current crisis and the biblical story of Jeremiah, highlighting the resilience and hope inherent in humanity.",
    "raw_text": "This has been some week. As the Taoiseach said on Tuesday night, St Patrick’s Day 2020 will be a St Patrick’s Day we will remember for the rest of our lives; no parades, no crowds out enjoying themselves, an eerie quiet on the streets all over Ireland.\n\nThis is something that is having a profound effect on us all. As I went down to Supervalu the other morning, there was the queue waiting to go in; the path marked off in 2 metre sections to keep us apart. Then I went in and began to walk around the store. Everyone was observing the social distancing, keeping 2 meters apart, not even talking to each other. There is a sense of isolation being built up in our lives that is going to be with us for the next few months.\n\nThe separation is very necessary if we are going to combat this virus. But how can we mitigate the sense of isolation that can eat into our spirits. As I said last Sunday, picking up on a comment made by Fintan O’Toole in an article he wrote in the Irish Times:\n\n> Covid-19 has indeed reminded us that we are not kings. It may in time teach us an equally powerful lesson, that in these times of prosperity we may have forgotten, the power of community.\n\nToday, Mothering Sunday, we celebrate family, that basic community in our society. It is a day for thankfulness, for our mothers, for those who brought us to birth; those from whom we first learned what it was to be loved, what it was to love.\n\nWe celebrate children. Children throughout the years have represented the future. Without children, communities have no future, schools cannot be maintained, neither can Parish communities. Children represent hope.\n\nHope is a difficult word to use at this time with a quarter of our workforce facing redundancy There are many businesses that only a month ago were prosperous, maybe contemplating expansion, now face the possibility of closure. There are people whose jobs were secure a few weeks ago now facing possible unemployment, leaving mortgages, rents, plans all in doubt. To talk of hope seems to rub salt into the wound.\n\nI was struck by comments by Lara Marlowe, a former war correspondent, now living and working in Paris, in Thursday’s Irish Times. In recent days, politicians across the world have been referring to the fight against Covid-19 in terms of war. She wrote:\n\n> Wars amplify the best and worst in human character. We’ve seen videos of shoppers fighting over toilet rolls. But I also know Parisians who give away food and precious surgical masks.\n\n> Wars teach us a sense of perspective. Petty arguments and problems subside in the face of the knowledge that thousands will die. One feels embarrassed for having worried about retrieving the dry cleaning or missing an appointment with the hairdresser when the lockdown started. Laura Marlowe Irish Times, Thursday 19th March 2020\n\nShe finishes:\n\n> Perhaps the most important thing I learned from wars is that they always end, sooner or later.\n\nThis is where I return to that comment that children are a sign of hope. This present war, this present crisis will come to an end. It will be difficult; it will take its toll. But our children will grow up. They will develop their own careers. They will build their own homes and rear their own families\n\nAs I thought on this, my mind turned to the Book of the Prophet Jeremiah. He was writing in Jerusalem, in the context of political melt-down, the impending destruction of Jerusalem and exile in Babylon. People were getting out of Jerusalem, anyone with property was selling it to give themselves hard cash. They were becoming refugees, wanting to start a new life in a new, safer environment for themselves and their families. Jeremiah buys property:\n\n> And I bought the field at Anathoth from my cousin Hanamel, and weighed out the money to him, seventeen shekels of silver. I signed the deed, sealed it, got witnesses, and weighed the money on scales. Then I took the sealed deed of purchase, containing the terms and conditions, and the open copy; and I gave the deed of purchase to Baruch son of Neriah son of Mahseiah, in the presence of my cousin Hanamel, in the presence of the witnesses who signed the deed of purchase,\n\n> I charged Baruch, saying, Thus says the Lord of hosts, the God of Israel: Take these deeds, both this sealed deed of purchase and this open deed, and put them in an earthenware jar, in order that they may last for a long time. For thus says the Lord of hosts, the God of Israel: Houses and fields and vineyards shall again be bought in this land. Jer 32:9-15\n\nA few months ago, I was privileged to visit the city of Beirut, itself destroyed in an horrific civil war but now once more a lively cosmopolitan city. I was there to see some of the work sponsored by Tearfund being undertaken among Syrian refugees. I recall visiting a family, sitting in their tent. An old lady was speaking of the home, the olive groves they had left behind. She smiled and said ‘Aleppo is a beautiful city.’ Is, not was; I sensed in those words a fierce hope that her city of Aleppo, of which she was so proud, now in ruins, will rise again.\n\nAs a society, we will get through this. Grandparents will once again be able to hug their grandchildren; business life will start up again; we will be able to meet again in our pubs, our cafes, our Churches. It will be hard, it will take its toll. In the process we will discover, we are indeed already discovering the value of community.\n\nAs we recalled last Sunday, in writing to that lively, individualistic, inspired yet flawed Church in Corinth, Paul uses the illustration of the Body as he explores the meaning of what it is to be Church, what it is to be community; the body made up of very varied, distinctive parts. Each has its own function, each has its own intrinsic worth. In the context of Church, in the context of community we are called to have a care and concern for each other. He writes:\n\n> God has so arranged the body, giving the greater honour to the inferior member, that there may be no dissension within the body, but the members may have the same care for one another. If one member suffers, all suffer together with it; if one member is honoured, all rejoice together with it.\n\n> Now you are the body of Christ and individually members of it. 1 Corinthians 12:24-27\n\nI will just close with words of Leo Varadkar the other night:\n\n> In years to come… let them say of us… when things were at their worst… we were at our best.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent42020.txt",
        "raw_ocr_content": "Page 1 of 5\nLENT 4 – Mothering Sunday – Year A – 2020\nService recorded in St Mary’s for Sunday 22nd March\nhttps://youtu.be/Iq1VL9147rk\nThis has been some week. As the Taoiseach said on Tuesday night, St\nPatrick’s Day 2020 will be a St Patrick’s Day we will remember for the rest of\nour lives; no parades, no crowds out enjoying themselves, an eerie quiet on the\nstreets all over Ireland.\nThis is something that is having a profound effect on us all. As I went down to\nSupervalu the other morning, there was the queue waiting to go in; the path\nmarked off in 2 metre sections to keep us apart. Then I went in and began to\nwalk around the store. Everyone was observing the social distancing, keeping\n2 meters apart, not even talking to each other. There is a sense of isolation\nbeing built up in our lives that is going to be with us for the next few months.\nThe separation is very necessary if we are going to combat this virus. But how\ncan we mitigate the sense of isolation that can eat into our spirits. As I said last\nSunday, picking up on a comment made by Fintan O’Toole in an article he\nwrote in the Irish Times:\nCovid-19 has indeed reminded us that we are not kings. It may in\ntime teach us an equally powerful lesson, that in these times of\nprosperity we may have forgotten, the power of community.\nToday, Mothering Sunday, we celebrate family, that basic community in our\nsociety. It is a day for thankfulness, for our mothers, for those who brought us\nPage 2 of 5\nLENT 4 – Mothering Sunday – Year A – 2020\nto birth; those from whom we first learned what it was to be loved, what it was\nto love.\nWe celebrate children. Children throughout the years have represented the\nfuture. Without children, communities have no future, schools cannot be\nmaintained, neither can Parish communities. Children represent hope.\nHope is a difficult word to use at this time with a quarter of our workforce\nfacing redundancy There are many businesses that only a month ago were\nprosperous, maybe contemplating expansion, now face the possibility of\nclosure. There are people whose jobs were secure a few weeks ago now facing\npossible unemployment, leaving mortgages, rents, plans all in doubt. To talk\nof hope seems to rub salt into the wound.\nI was struck by comments by Lara Marlowe, a former war correspondent, now\nliving and working in Paris, in Thursday’s Irish Times. In recent days,\npoliticians across the world have been referring to the fight against Covid-19 in\nterms of war. She wrote:\nWars amplify the best and worst in human character. We’ve seen\nvideos of shoppers fighting over toilet rolls. But I also know Parisians\nwho give away food and precious surgical masks.\n………………………………..\nWars teach us a sense of perspective. Petty arguments and problems\nsubside in the face of the knowledge that thousands will die. One feels\nembarrassed for having worried about retrieving the dry cleaning or\nmissing an appointment with the hairdresser when the lockdown\nstarted. Laura Marlowe Irish Times, Thursday 19th March 2020\nShe finishes:\nPage 3 of 5\nLENT 4 – Mothering Sunday – Year A – 2020\nPerhaps the most important thing I learned from wars is that they\nalways end, sooner or later.\nThis is where I return to that comment that children are a sign of hope. This\npresent war, this present crisis will come to an end. It will be difficult; it will\ntake its toll. But our children will grow up. They will develop their own\ncareers. They will build their own homes and rear their own families\nAs I thought on this, my mind turned to the Book of the Prophet Jeremiah. He\nwas writing in Jerusalem, in the context of political melt-down, the impending\ndestruction of Jerusalem and exile in Babylon. People were getting out of\nJerusalem, anyone with property was selling it to give themselves hard cash.\nThey were becoming refugees, wanting to start a new life in a new, safer\nenvironment for themselves and their families. Jeremiah buys property:\nAnd I bought the field at Anathoth from my cousin Hanamel, and\nweighed out the money to him, seventeen shekels of silver. I signed\nthe deed, sealed it, got witnesses, and weighed the money on scales.\nThen I took the sealed deed of purchase, containing the terms and\nconditions, and the open copy; and I gave the deed of purchase to\nBaruch son of Neriah son of Mahseiah, in the presence of my cousin\nHanamel, in the presence of the witnesses who signed the deed of\npurchase,\nI charged Baruch, saying, Thus says the Lord of hosts, the God of\nIsrael: Take these deeds, both this sealed deed of purchase and this\nopen deed, and put them in an earthenware jar, in order that they may\nlast for a long time. For thus says the Lord of hosts, the God of Israel:\nHouses and fields and vineyards shall again be bought in this land. Jer\n32:9-15\nA few months ago, I was privileged to visit the city of Beirut, itself destroyed\nin an horrific civil war but now once more a lively cosmopolitan city. I was\nthere to see some of the work sponsored by Tearfund being undertaken among\nPage 4 of 5\nLENT 4 – Mothering Sunday – Year A – 2020\nSyrian refugees. I recall visiting a family, sitting in their tent. An old lady was\nspeaking of the home, the olive groves they had left behind. She smiled and\nsaid ‘Aleppo is a beautiful city.’ Is, not was; I sensed in those words a fierce\nhope that her city of Aleppo, of which she was so proud, now in ruins, will rise\nagain.\nAs a society, we will get through this. Grandparents will once again be able to\nhug their grandchildren; business life will start up again; we will be able to\nmeet again in our pubs, our cafes, our Churches. It will be hard, it will take its\ntoll. In the process we will discover, we are indeed already discovering the\nvalue of community.\nAs we recalled last Sunday, in writing to that lively, individualistic, inspired\nyet flawed Church in Corinth, Paul uses the illustration of the Body as he\nexplores the meaning of what it is to be Church, what it is to be community;\nthe body made up of very varied, distinctive parts. Each has its own function,\neach has its own intrinsic worth. In the context of Church, in the context of\ncommunity we are called to have a care and concern for each other. He writes:\nGod has so arranged the body, giving the greater honour to the inferior\nmember, that there may be no dissension within the body, but the\nmembers may have the same care for one another. If one member\nsuffers, all suffer together with it; if one member is honoured, all\nrejoice together with it.\nNow you are the body of Christ and individually members of it.\n1 Corinthians 12:24-27\nI will just close with words of Leo Varadkar the other night:\nPage 5 of 5\nLENT 4 – Mothering Sunday – Year A – 2020\nIn years to come… let them say of us… when things were at their worst… we\nwere at our best."
    }
}