{
    "title": "Journey to Confirmation",
    "date": "2019-03-31",
    "blurb": "Kevin shares about the journey of the confirmation group, their activities, and their study of the Parable of the Prodigal Son. He emphasizes the importance of acknowledging mistakes and making a fresh start, symbolized by the group exercise of writing down regrets and burning them. He invites the congregation to support these young people in their spiritual journey.",
    "raw_text": "## LENT 4 – Year C – 2019 – Confirmation Group Service\n\nFor the last number of weeks in the announcements I have been announcing the Confirmation classes. Elke and I have been meeting up with them after school each Wednesday afternoon. This year there are nine: Matthew Bray, Aelfreda Young, Jayne Mangan, Ava Doyle, Amy Ennis-Crosbie, Elsie Bath, Justin O’Neill, Louise Riis Byrne and Simon Fogarty. Elke and I have really enjoyed our time working with them. You are a credit to your parents, to the School – you are also a credit to yourselves.\n\nWe start off our sessions with pizza – they have come straight from School and we chat about what has been going on before getting down to work. Each week Elke has devised an activity that introduces the topic of the day. Over the weeks we’ve been together we’ve covered a lot of ground. I want to commend this group for the way that they have engaged with each topic we’ve introduced them to.\n\nA few weeks ago, in to get them to think about the Church in the world outside, we welcomed Emma Lynch of Tearfund who talked to them about their work with refugees in Lebanon and in South Sudan. They decided they wanted to do something practical and they participated in the Tearfund National Coffee morning, organising ‘Coffee to go – for those who had to go’. How much did you raise? Then which of you were interviewed by Spirit Radio.\n\nThen last Wednesday we were getting ready for today. We gave them each a copy of the lesson for today, the Parable of the Prodigal Son and sent them off by themselves to think about and reflect and underline the bits that spoke to them. I’ve got the sheets here – it was lovely to read over them and I will be sharing some of their insights later. They will lead us in prayer, using prayers that they have written themselves.\n\nSo we invite you to share with them in this act of worship as they move towards their confirmation.\n\n## SERMON\n\nThe group have just introduced us to the Lesson for today, the Parable of the Prodigal Son. It is not the lesson that would usually be read on Mothering Sunday – it is the lesson set for the 4th Sunday of Lent.\n\nIt is the story of a family – rebellious younger son, resentful older son, parent caught in the middle.\n\nSome of the things highlighted:\n\n- The impatience of the younger brother – he wanted his freedom now\n- His freedom and the way he used it did not bring happiness – began to hurt.\n- Brought him to his senses – he knew he had done wrong – he knew he had hurt his father.\n- As he headed home he was expecting nothing but overwhelmed by the love and welcome of the father.\n\nDraws together some of the things we’ve been thinking about. We did a section on the commandments – I always ask ‘Honour your father and your mother – how is that one going?’\n\nI reminded you that your parents were once your age – they actually don’t want to see you hurt, that they are a source of wisdom. I also suggested that when you get to 25 your views may not be so dissimilar – I would suspect that you are still not sure about that one.\n\nLike the younger son in the parable, we do make mistakes and we do get things wrong – how do we move on from that. We did an exercise I do with most groups to illustrate the completeness of God’s forgiveness when we make mistakes, when we acknowledge those mistakes and make a fresh start.\n\nEach of you got a bit of paper – I asked you to write down one regret that no one else saw – just between you and God. And then we burned them and mixed all the ashes up until there was just dust.\n\nI would ask you the members of the Parish to remember this wonderful group of young people as they continue their journey to Confirmation and beyond. Each of you should have got a slip of paper with the name of one of them. Just remember him or her in your thoughts and prayers in these coming weeks.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent42019confirmationgroupservice.txt",
        "raw_ocr_content": "Page 1 of 4\nLENT 4 – Year C – 2019 – Confirmation Group Service\nINTRODUCTION\nFor the last number of weeks in the announcements I have been announcing the\nConfirmation classes.\nElke and I have been meeting up with them after school each Wednesday\nafternoon.\nThis year there are nine: Matthew Bray, Aelfreda Young, Jayne Mangan,\nAva Doyle, Amy Ennis-Crosbie, Elsie Bath, Justin O’Neill, Louise Riis\nByrne and Simon Fogarty. Elke and I have really enjoyed our time working\nwith them. You are a credit to your parents, to the School – you are also a\ncredit to your selves.\nWe start off our sessions with pizza – they have come straight from School and\nwe chat about what has been going on before getting down to work. Each\nweek Elke has devised an activity that introduces the topic of the day. Over the\nweeks we’ve been together we’ve covered a lot of ground. I want to commend\nthis group for the way that they have engaged with each topic we’ve introduced\nthem to.\nA few weeks ago, in to get them to think about the Church in the world outside,\nwe welcomed Emma Lynch of Tearfund who talked to them about their work\nPage 2 of 4\nLENT 4 – Year C – 2019 – Confirmation Group Service\nwith refugees in Lebanon and in South Sudan. They decided they wanted to do\nsomething practical and they participated in the Tearfund National Coffee\nmorning, organising ‘Coffee to go – for those who had to go’. How much did\nyou raise? Then which of you were interviewed by Spirit Radio.\nThen last Wednesday we were getting ready for today. We gave them each a\ncopy of the lesson for today, the Parable of the Prodigal Son and sent them off\nby themselves to think about and reflect and underline the bits that spoke to\nthem. I’ve got the sheets here – it was lovely to read over them and I will be\nsharing some of their insights later. They will lead us in prayer, using prayers\nthat they have written themselves.\nSo we invite you to share with them in this act of worship as they move\ntowards their confirmation.\nPage 3 of 4\nLENT 4 – Year C – 2019 – Confirmation Group Service\nSERMON\nThe group have just introduced us to the Lesson for today, the Parable of the\nProdigal Son. It is not the lesson that would usually be read on Mothering\nSunday – it is the lesson set for the 4th Sunday of Lent.\nIt is the story of a family – rebellious younger son, resentful older son, parent\ncaught in the middle.\nSome of the things highlighted:\nThe impatience of the younger brother – he wanted his freedom now\nHis freedom and the way he used it did not bring happiness – began\nto hurt.\nBrought him to his senses – he knew he had done wrong – he knew he\nhad hurt his father.\nAs he headed home he was expecting nothing but overwhelmed by the\nlove and welcome of the father.\nDraws together some of the things we’ve been thinking about. We did a\nsection on the commandments – I always ask ‘Honour your father and your\nmother – how is that one going?’\nI reminded you that your parents were once your age – they actually don’t want\nto see you hurt, that they are a source of wisdom. I also suggested that when\nPage 4 of 4\nLENT 4 – Year C – 2019 – Confirmation Group Service\nyou get to 25 your views may not be so dissimilar – I would suspect that you\nare still not sure about that one.\nLike the younger son in the parable, we do make mistakes and we do get things\nwrong – how do we move on from that. We did an exercise I do with most\ngroups to illustrate the completeness of God’s forgiveness when we make\nmistakes, when we acknowledge those mistakes and make a fresh start.\nEach of you got a bit of paper – I asked you to write down one regret that no\none else saw – just between you and God. And then we burned them and\nmixed all the ashes up until there was just dust.\nI would ask you the members of the Parish to remember this wonderful group\nof young people as they continue their journey to Confirmation and beyond.\nEach of you should have got a slip of paper with the name of one of them. Just\nremember him or her in your thoughts and prayers in these coming weeks."
    }
}