{
    "title": "Seeing Jesus",
    "date": "2021-03-21",
    "blurb": "This sermon, delivered on the fifth Sunday of Lent in 2021, explores the desire of unnamed Greeks to see Jesus. It discusses the anticipation and tension surrounding Jesus' entry into Jerusalem, the expectations of the people, and the subsequent disappointment when Jesus did not fit into their preconceived notions. The sermon emphasizes that Jesus cannot be owned or controlled by any group and challenges listeners to reflect on their own understanding and portrayal of Jesus.",
    "raw_text": "LENT 5 – Year B – 2021\n\n‘Sir, we would like to see Jesus.’\n\nSo spoke a group of un-named Greeks who had approached Philip, one of the followers of Jesus. This little incident took place shortly after Jesus’ triumphal entry into Jerusalem. Opinions in the city that day were divided – the crowds were excited; they had heard news of the raising of Lazarus from the dead in Bethany and were looking for further signs from Jesus. The religious authorities were troubled by the impact that this travelling preacher was making.\n\nAll this in the run up to Passover when feelings always ran high in the city, Passover was the time when some expected the Messiah to come – it was a time when those in authority would be on their guard. The religious authorities would have been wary of crackpots causing trouble at this most solemn time in the Jewish year and the excitement caused by the entry of Jesus into Jerusalem would have done nothing to allay those fears. The Roman authorities would have had their own concerns about nationalist uprisings. At this time of year, the Roman Governor would have moved from his more comfortable residence in Caesarea to Jerusalem, ready to stamp on any trouble – again the fervour with which the crowds had welcomed Jesus would not have eased these concerns.\n\nThese un-named Greeks are themselves clearly curious as to who is at the centre of this excitement.\n\nJohn tells us that when Andrew and Philip go to tell Jesus of the visitors, Jesus speaks of his own coming glorification. But it is not a glory as the world understands it. The glory that Jesus alludes to is associated with service, with self-giving and death. He goes on to make clear that this is not just a matter for him – it is to be the vocation of all who would follow him. ‘Whoever serves me must follow me and where I am, my servant also will be.’\n\n‘Sir, we would like to see Jesus.’ Is this the Jesus that the world wants to see? In the triumphal entry into Jerusalem, they had seen the Jesus they had wanted to see – or thought they wanted to see. They saw a charismatic preacher who made life uncomfortable for the powers that be. Some saw perhaps a national leader who would be a focus for an uprising against the hated Roman Governor. They saw someone who was ‘on their side’. But of course Jesus is not on anyone’s side. Jesus cannot be owned, cannot, will not, be contained by any one group. He is not the property of any one religious group or political ideology.\n\nThat is perhaps why things turned sour in the days that followed. Once it was clear that Jesus could not be owned, could not be controlled – then he had to go.\n\nBut the issue here is more than one of the rapidly declining popularity of Jesus. For as Jesus reminded his hearers; ‘Now is the time of judgement on this world; now the prince of this world will be driven out. But I, when I am lifted up form the earth, will draw all men to myself.’\n\nNow is the time for judgement. The word we translate as judgement is the Greek word κρίσις. And what is crisis? – it is a situation or state of affairs demanding an immediate decision or action if the situation is not to descend into chaos. It speaks of opportunities that cannot, must not be let slip.\n\nThe cross is an occasion of judgement, of crisis. The cross demands decision – are we to stand alongside the crucified or those who lead him to the cross. I have always valued the Church of Ireland tradition of observing Holy Week, the emphasis we have placed on the services on Good Friday and Easter. It is a time to take a step back from the busyness of life, to reflect on the values and priorities of faith.\n\nThe request, ‘Sir, we would see Jesus.’ raises another issue in my mind. Those Greeks had a Jesus-in-the-flesh they could hear, see and touch. The world of today still says, ‘we would like to see Jesus’. How can the world of today meet Jesus except through us, his followers, the Church? In a sense we have to be in our own day the Andrews and the Philips – those who will point to Jesus, show something of his compassion and love, give voice to his teaching, his demands and his warnings to the world in which we live.\n\nBut of course we can only show Jesus to the extent we know him, to the extend that we have let his life, his teachings, his redeeming love impact on our own hearts.\n\nThis is where the passage appointed as the Old Testament reading for today speaks to me:\n\n31The days are surely coming, says the LORD, when I will make a new covenant with the house of Israel and the house of Judah…….. I will put my law within them, and I will write it on their hearts; and I will be their God, and they shall be my people. Jeremiah 31:31ff\n\nThis is where the new covenant must be written – on the hearts and minds of the People of God. Only then can we as individuals and as a community show Jesus to the world at large. May God give us grace to receive him into our hears and proclaim his message in the world of today.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year B/lent52021.txt",
        "raw_ocr_content": "Page 1 of 4\nLENT 5 – Year B – 2021\n‘Sir, we would like to see Jesus.’\nSo spoke a group of un-named Greeks who had approached Philip, one of the\nfollowers of Jesus. This little incident took place shortly after Jesus’ triumphal\nentry into Jerusalem. Opinions in the city that day were divided – the crowds\nwere excited; they had heard news of the raising of Lazarus from the dead in\nBethany and were looking for further signs from Jesus. The religious\nauthorities were troubled by the impact that this travelling preacher was\nmaking.\nAll this in the run up to Passover when feelings always ran high in the city,\nPassover was the time when some expected the Messiah to come – it was a\ntime when those in authority would be on their guard. The religious authorities\nwould have been wary of crackpots causing trouble at this most solemn time in\nthe Jewish year and the excitement caused by the entry of Jesus into Jerusalem\nwould have done nothing to allay those fears. The Roman authorities would\nhave had their own concerns about nationalist uprisings. At this time of year,\nthe Roman Governor would have moved from his more comfortable residence\nin Caesarea to Jerusalem, ready to stamp on any trouble – again the fervour\nwith which the crowds had welcomed Jesus would not have eased these\nconcerns.\nThese un-named Greeks are themselves clearly curious as to who is at the\ncentre of this excitement.\nPage 2 of 4\nLENT 5 – Year B – 2021\nJohn tells us that when Andrew and Philip go to tell Jesus of the visitors, Jesus\nspeaks of his own coming glorification. But it is not a glory as the world\nunderstands it. The glory that Jesus alludes to is associated with service, with\nself-giving and death. He goes on to make clear that this is not just a matter for\nhim – it is to be the vocation of all who would follow him. ‘Whoever serves\nme must follow me and where I am, my servant also will be.’\n‘Sir, we would like to see Jesus.’ Is this the Jesus that the world wants to see?\nIn the triumphal entry into Jerusalem, they had seen the Jesus they had wanted\nto see – or thought they wanted to see. They saw a charismatic preacher who\nmade life uncomfortable for the powers that be. Some saw perhaps a national\nleader who would be a focus for an uprising against the hated Roman\nGovernor. They saw someone who was ‘on their side’. But of course Jesus is\nnot on anyone’s side. Jesus cannot be owned, cannot, will not, be contained by\nany one group. He is not the property of any one religious group or political\nideology.\nThat is perhaps why things turned sour in the days that followed. Once it was\nclear that Jesus could not be owned, could not be controlled – then he had to\ngo.\nBut the issue here is more than one of the rapidly declining popularity of Jesus.\nFor as Jesus reminded his hearers; ‘Now is the time of judgement on this\nworld; now the prince of this world will be driven out. But I, when I am lifted\nup form the earth, will draw all men to myself.’\nPage 3 of 4\nLENT 5 – Year B – 2021\nNow is the time for judgement. The word we translate as judgement is the\nGreek word κρίσις. And what is crisis? – it is a situation or state of affairs\ndemanding an immediate decision or action if the situation is not to descend\ninto chaos. It speaks of opportunities that cannot, must not be let slip.\nThe cross is an occasion of judgement, of crisis. The cross demands decision –\nare we to stand alongside the crucified or those who lead him to the cross. I\nhave always valued the Church of Ireland tradition of observing Holy Week,\nthe emphasis we have placed on the services on Good Friday and Easter. It is a\ntime to take a step back from the busyness of life, to reflect on the values and\npriorities of faith.\nThe request, ‘Sir, we would see Jesus.’ raises another issue in my mind. Those\nGreeks had a Jesus-in-the-flesh they could hear, see and touch. The world of\ntoday still says, ‘we would like to see Jesus’. How can the world of today meet\nJesus except through us, his followers, the Church? In a sense we have to be in\nour own day the Andrews and the Philips – those who will point to Jesus, show\nsomething of his compassion and love, give voice to his teaching, his demands\nand his warnings to the world in which we live.\nBut of course we can only show Jesus to the extent we know him, to the extend\nthat we have let his life, his teachings, his redeeming love impact on our own\nhearts.\nPage 4 of 4\nLENT 5 – Year B – 2021\nThis is where the passage appointed as the Old Testament reading for today\nspeaks to me:\n31The days are surely coming, says the LORD, when I will make a\nnew covenant with the house of Israel and the house of Judah………..\nI will put my law within them, and I will write it on their hearts; and I\nwill be their God, and they shall be my people. Jeremiah 31:31ff\nThis is where the new covenant must be written – on the hearts and minds of\nthe People of God. Only then can we as individuals and as a community show\nJesus to the world at large. May God give us grace to receive him into our\nhears and proclaim his message in the world of today."
    }
}