{
    "title": "Thirst for God",
    "date": "2010-03-07",
    "blurb": "In this sermon from Lent 3, 2010, Kevin uses the metaphor of a marathon runner's thirst to explore our spiritual thirst for God. He discusses the different ways 'thirst' is used in the Bible, from physical need to spiritual desire, and how our thirst for God is a fundamental part of our humanity. The sermon concludes with the idea that there is a God-shaped hole in our lives that only God can fill.",
    "raw_text": "One of the hazards of city life around the time of a bank holiday is the City marathon, whether it be in London, Belfast, New York or Dublin or a or a host of other centres. The streets in the centre are shut down, traffic diverted or held up to let the runners go through. Apart from some mild frustration on the part of some who might come across it unawares, there is a general feeling of well being as runners in all shapes, sizes, physical condition and costume . You get the professionals, like the Kenyans who storm ahead of the field, keeping up an amazing pace right through the race.. Then of course there are the ones in funny costumes – time for them is immaterial, they are there to enjoy themselves and make money for their chosen charity.\n\nIn between those two extremes you get those who have prepared themselves – they have the right kit, they have followed a disciplined training programme, eaten the right foods and have set themselves a personal target – it might be four, three and a half or three hours or whatever. But of course things can go wrong – you might pick up an injury, on the day it might be too hot, cold or windy – or you might have forgotten something. I remember one year watching the finishers in the Belfast Marathon coming in – it had been a lot warmer than anticipated and I recall seeing one runner in a bad way – she had obviously prepared, she wasn’t carrying any excess weight, she was in the right running gear, she had the right shoes but she was clearly suffering from dehydration, over the course of the run she had not taken on enough water. Dehydration, a ravenous, debilitating thirst is one of the hazards of long distance running – which is why they say you should always make friends with your water bottle.\n\nThe image of that poor girl, staggering over the finishing line in Belfast, came to me as I read our Old Testament Lesson and Psalm for today which both open with that theme of thirst.\n\nIf you follow the use of the word ‘thirst’ or ‘thirsty’ through the Bible you get a range of usage from that physical, debilitating thirst I saw in the runner in Belfast to a thirst on a more spiritual level.\n\nThere is a thirst that characterises a suffering that comes from a people’s rejection of God, that carries with it the flavour of judgement, the consequences, the outworking of their disobedience. And so Isaiah can write:\n\n> Therefore my people go into exile without knowledge;\n> their nobles are dying of hunger,\n> and their multitude is parched with thirst. (Is 5:13)\n\nThere is a thirst that characterises a suffering that awakens a realisation of a dependence upon God. Looking back to the provision of manna and water to the people in their desert wanderings, the prophet looks forward in hope. Just as those leaving Egypt were not left destitute, so the needs of the exiles returning from Babylon will be met.\n\n> They shall feed along the ways\n> on all the bare heights shall be their pasture;\n> they shall not hunger or thirst,\n> neither scorching wind not sun shall strike them down,\n> for he who has pity on them will lead them,\n> and by springs of water will guide them. (Is 49:9,10)\n\nThen there is that thirst that goes deeper than satisfying a physical need. A thirst characterised by the opening words of our Old Testament and Psalm:\n\n> Everyone who thirsts, come to the waters ..... Isaiah 55:1\n> O God, you are my God .... my soul is athirst for you. Ps63:1\n\nAs I pondered over these two passages, the thought occurred to me that the word thirst has two connotations – there is the actual condition of thirst and there is thirst as a desire. So when I say ‘I am thirsty’ it not only speaks of a felt need but also a desire to satisfy that need.\n\nWhen I say that I am made in the image of God, I am acknowledging that I am more than my physical body, my appetites, my needs. There is another dimension to my being. I am more than what I possess, more than the clothes I wear, the job I have, the car I drive, the house I live in. There is a fundamental truth in that opening question and answer of the Shorter Catechism of the Presbyterian church:\n\n> ‘What is man’s chief end?\n> Man’s chief end is to glorify God and enjoy him forever.’\n\nMade in the image of God, there is a spiritual dimension to our life, that must be nurtured if we are to fully enter into our humanity. There is a deep seated hunger within each one of us that cannot be met by the material, the physical, the sensual.\n\nMore than that there is a sense in which the God who made me is the God who seeks me, offering me sustenance to satisfy my hunger. The same God who sought out a people languishing in exile in Babylon, who came to Moses as he tended his father-in-law’s sheep, to Elijah in the cave invites each one of us into a closer fellowship. There is a persistence to that call that will not go away. We may ignore it, we may even try to silence it but it will not go away. That persistence in the face of all my attempts to ignore is wonderfully expressed in the opening words of the poem ‘The Hound of Heaven’\n\n> I fled Him down the nights and down the days\n> I fled Him down the arches of the years\n> I fled Him down the labyrinthine ways\n> Of my own mind, and in the midst of tears\n> I hid from him, and under running laughter.\n> ……………………\n> They beat, and a Voice beat,\n> More instant than the feet:\n> All things betray thee who betrayest me.\n\nWe gather here as a fellowship of those\n\nIt has been said that there is a God shaped hole in our lives that God alone can fill.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/Lent 3 - 2010.txt",
        "raw_ocr_content": "Page 1 of 4\nLent 3 – 2010 – Year C\nOne of the hazards of city life around the time of a bank holiday is the City marathon,\nwhether it be in London, Belfast, New York or Dublin or a or a host of other centres. The\nstreets in the centre are shut down, traffic diverted or held up to let the runners go through.\nApart from some mild frustration on the part of some who might come across it unawares,\nthere is a general feeling of well being as runners in all shapes, sizes, physical condition\nand costume . You get the professionals, like the Kenyans who storm ahead of the field,\nkeeping up an amazing pace right through the race.. Then of course there are the ones in\nfunny costumes – time for them is immaterial, they are there toi enjoy themselves and\nmake money for their chosen charity.\nIn between those two extremes you get those who have prepared themselves – they have\nthe right kit, they have followed a disciplined training programme, eaten the right foods\nand have set themselves a personal target – it might be four, three and a half or three hours\nor whatever. But of course things can go wrong – you might pick up an injury, on the day\nit might be too hot, cold or windy – or you might have forgotten something. I remember\none year watching the finishers in the Belfast Marathon coming in – it had been a lot\nwarmer than anticipated and I recall seeing one runner in a bad way – she had obviously\nprepared, she wasn’t carrying any excess weight, she was in the right running gear, she\nhad the right shoes but she was clearly suffering from dehydration, over the course of the\nrun she had not taken on enough water. Dehydration, a ravenous, debilitating thirst is one\nof the hazards of long distance running – which is why they say you should always make\nfriends with your water bottle.\nThe image of that poor girl, staggering over the finishing line in Belfast, came to me as I\nread our Old Testament Lesson and Psalm for today which both open with that theme of\nthirst.\nPage 2 of 4\nLent 3 – 2010 – Year C\nIf you follow the use of the word ‘thirst’ or ‘thirsty’ through the Bible you get a range of\nusage from that physical, debilitating thirst I saw in the runner in Belfast to a thirst on a\nmore spiritual level.\nThere is a thirst that characterises a suffering that comes from a people’s rejection of God,\nthat carries with it the flavour of judgement, the consequences, the outworking of their\ndisobedience. And so Isaiah can write:\nTherefore my people go into exile without knowledge;\ntheir nobles are dying of hunger,\nand their multitude is parched with thirst. (Is 5:13)\nThere is a thirst that characterises a suffering that awakens a realisation of a dependence\nupon God. Looking back to the provision of manna and water to the people in their desert\nwanderings, the prophet looks forward in hope. Just as those leaving Egypt were not left\ndestitute, so the needs of the exiles returning from Babylon will be met.\nThey shall feed along the ways\non all the bare heights shall be their pasture;\nthey shall not hunger or thirst,\nneither scorching wind not sun shall strike them down,\nfor he who has pity on them will lead them,\nand by springs of water will guide them. (Is 49:9,10)\nThen there is that thirst that goes deeper than satisfying a physical need. A thirst\ncharacterised by the opening words of our Old Testament and Psalm:\nEveryone who thirsts, come to the waters ..... Isaiah 55:1\nO God, you are my God .... my soul is athirst for you. Ps63:1\nAs I pondered over these two passages, the thought occurred to me that the word thirst has\ntwo connotations – there is the actual condition of thirst and there is thirst as a desire. So\nwhen I say ‘I am thirsty’ it not only speaks of a felt need but also a desire to satisfy that\nneed.\nPage 3 of 4\nLent 3 – 2010 – Year C\nWhen I say that I am made in the image of God, I am acknowledging that I am more than\nmy physical body, my appetites, my needs. There is another dimension to my being. I am\nmore than what I possess, more than the clothes I wear, the job I have, the car I drive, the\nhouse I live in. There is a fundamental truth in that opening question and answer of the\nShorter Catechism of the Presbyterian church:\n‘What is man’s chief end?\nMan’s chief end is to glorify God and enjoy him forever.’\nMade in the image of God, there is a spiritual dimension to our life, that must be nurtured\nif we are to fully enter into our humanity. There is a deep seated hunger within each one\nof us that cannot be met by the material, the physical, the sensual.\nMore than that there is a sense in which the God who made me is the God who seeks me,\noffering me sustenance to satisfy my hunger. The same God who sought out a people\nlanguishing in exile in Babylon, who came to Moses as he tended his father-in-law’s\nsheep, to Elijah in the cave invites each one of us into a closer fellowship. There is a\npersistence to that call that will not go away. We may ignore it, we may even try to\nsilence it but it will not go away. That persistence in the face of all my attempts to ignore\nis wonderfully expressed in the opening words of the poem ‘The Hound of Heaven’\nI fled Him down the nights and down the days\nI fled Him down the arches of the years\nI fled Him down the labyrinthine ways\nOf my own mind, and in the midst of tears\nI hid from him, and under running laughter.\n………………………………..\nThey beat, and a Voice beat,\nMore instant than the feet:\nAll things betray thee who betrayest me.\nWe gather here as a fellowship of those\nPage 4 of 4\nLent 3 – 2010 – Year C\nIt has been said that there is a God shaped hole in our lives that God alone can fill."
    }
}