{
    "title": "Extravagance of Love",
    "date": "2019-04-07",
    "blurb": "In this sermon, Kevin delves into the story of Mary anointing Jesus' feet with expensive perfume, a moment of calm amidst the tumultuous events leading up to Jesus' crucifixion. He explores the themes of exuberance and extravagance, drawing parallels with the Incarnation and the self-emptying, self-abandoning love of Christ. He encourages listeners to respond to Christ's love with the same extravagance, allowing it to permeate every aspect of their lives.",
    "raw_text": "On this 5th Sunday in Lent, that in earlier years was known as Passion Sunday, we have read as our Gospel reading that lovely passage from St John, giving us the anointing of Jesus in Bethany. But before we go to the passage itself, let us take a look at the wider setting of the story. The Gospel writers tell their story in two ways; first in the individual passages themselves and secondly in the order in which they group their material.\n\nThis passage is placed between two crucial events in the ministry of Jesus as it moves towards the climax of the Passion, Death and Resurrection of Jesus. The first is the raising of Lazarus. John tells us that the religious authorities, on seeing the response of the crowd to this, decide the time has finally come when they will have to make a move against him before he causes trouble and brings the wrath of the Roman authorities down on their heads. In their meeting, Caiaphas declares, 'it is better for you that one man die for the people than that the whole nation perish.' (John 11:50)\n\nThe second event is the Triumphal entry into the city of Jerusalem – John’s account is lower key than that given by the other Gospel writers. Between these two events John inserts this moment of calm into the story. We are in Bethany, where Lazarus had been raised from the dead. Jesus is guest of honour at a meal. Lazarus is there as are his two sisters; Martha, the archetypal hostess, is there serving the meal. Then we are told that Mary, quite spontaneously takes a large jar of expensive perfume and proceeds to lavishly anoint Jesus’ feet, wiping them with her hair – the house was filled with the fragrance of the perfume.\n\nThere is something outrageous in this, the gesture itself, the very cost of the perfume, the fragrance everywhere. Maybe, secretly, we are saying 'You know Judas may have had a point.' There was an exuberance, an extravagance to all of this. Those words carry with them a sense of nothing held back. I just want to stay with those words, exuberance, extravagance as we reflect on the wider vocation of Jesus as we draw close to Holy Week and Easter.\n\nThe extravagance of the Incarnation, God coming among us in the person of Jesus. Again and again I find myself returning to Paul’s words as he writes to the Philippians:\n\n> Let the same mind be in you that was in Christ Jesus,\n> though he was in the form of God,\n> did not regard equality with God\n> as something to be exploited,\n> but emptied himself,\n> taking the form of a slave,\n> being born in human likeness.\n> And being found in human form,\n> he humbled himself\n> and became obedient to the point of death—\n> even death on a cross. (Phil 2:5ff)\n\nHe emptied himself, literally stripped himself of all rank. He became like us in every way. He knew what it was like to share our humanity; what it was like to laugh, to cry, to know friendship, hostility, loneliness, danger, death. There is an extravagance, an exuberance here in which nothing is held back.\n\nPaul says to his readers 'Let the same mind be in you'. The word Paul uses here, φρονεῖτε, has its root in a word that means literally 'diaphragm, midriff' and then is applied to the mind, the intellect. I get a sense, 'Have this same gut-feeling within you.' This same extravagance of mind, an openness of heart as we respond to the love of God in Christ.\n\nTo go back to our Gospel reading, the fragrance of the perfume that Mary poured on Jesus’ feet, filling the whole house; there was no part of that house, no corner, no cupboard left untouched by that fragrance. May our response to Christ’s self-emptying, self-abandoning love have something of that all-pervading nature of Mary’s perfume, spreading into every nook and cranny of our lives.\n\nJesus called his disciples to an expansive response. Luke tells us of him telling the disciples:\n\n> Do not judge, and you will not be judged. Do not condemn, and you will not be condemned. Forgive, and you will be forgiven. Give, and it will be given to you. (Luke 6:37)\n\nIt is said of love that if we seek to hold onto it, we lose it. If we share it we get so much more back in return. The fragrance spreading out from us into the world about us. There is something here of that same exuberance, extravagance in those words as he continues:\n\n> A good measure, pressed down, shaken together and running over, will be poured into your lap. For with the measure you use, it will be measured to you.\n\nLove given in response to love; love overflowing from my life into the world about me. We are about to enter into the mystery of Good Friday and Easter, the triumph of life over death, light over darkness. May we who have been touched by the love of God in Christ be ones in whom and through whom that love, that light, that fragrance is manifest in the world about us.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent52019.txt",
        "raw_ocr_content": "Page 1 of 3\nLENT 5 – Year C – 2019 – Christ Church Cathedral\nOn this 5th Sunday in Lent, that in earlier years was known as Passion Sunday,\nwe have read as our Gospel reading that lovely passage from St John, giving us\nthe anointing of Jesus in Bethany. But before we go to the passage itself, let us\ntake a look at the wider setting of the story. The Gospel writers tell their story\nin two ways; first in the individual passages themselves and secondly in the\norder in which they group their material.\nThis passage is placed between two crucial events in the ministry of Jesus as it\nmoves towards the climax of the Passion, Death and Resurrection of Jesus.\nThe first is the raising of Lazarus. John tells us that the religious authorities,\non seeing the response of the crowd to this, decide the time has finally come\nwhen they will have to make a move against him before he causes trouble and\nbrings the wrath of the Roman authorities down on their heads. In their\nmeeting, Caiaphas declares,\n‘it is better for you that one man die for the people than that the whole\nnation perish.’ John 11:50\nThe second event is the Triumphal entry into he city of Jerusalem – John’s\naccount is lower key than that given by the other Gospel writers.\nBetween these two events John inserts this moment of calm into the story. We\nare in Bethany, where Lazarus had been raised from the dead. Jesus is guest of\nhonour at a meal. Lazarus is there as are his two sisters; Martha, the\narchetypal hostess, is there serving the meal. Then we are told that Mary, quite\nspontaneously takes a large jar of expensive perfume and proceeds to lavishly\nanoint Jesus’ feet, wiping them with her hair – the house was filled with the\nfragrance of the perfume.\nPage 2 of 3\nLENT 5 – Year C – 2019 – Christ Church Cathedral\nThere is something outrageous in this, the gesture itself, the very cost of the\nperfume, the fragrance everywhere. Maybe, secretly, we are saying ‘You\nknow Judas may have had a point.’ There was an exuberance, an extravagance\nto all of this. Those words carry with them a sense of nothing held back. I just\nwant to stay with those words, exuberance, extravagance as we reflect on the\nwider vocation of Jesus as we draw close to Holy Week and Easter.\nThe extravagance of the Incarnation, God coming among us in the person of\nJesus. Again and again I find myself returning to Paul’s words as he writes to\nthe Philippians:\nLet the same mind be in you that was in Christ Jesus,\nthough he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\nbut emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\nhe humbled himself\nand became obedient to the point of death—\neven death on a cross. Phil 2:5ff\nHe emptied himself, literally stripped himself of all rank. He became like us in\nevery way. He knew what it was like to share our humanity; what it was like to\nlaugh, to cry, to know friendship, hostility, loneliness, danger, death. There is\nan extravagance, an exuberance here in which nothing is held back.\nPaul says to his readers ‘Let the same mind be in you’. The word Paul uses\nhere, φρονεῖτε, has its root in a word that means literally ‘diaphragm, midriff’\nand then is applied to the mind, the intellect. I get a sense, ‘Have this same\nPage 3 of 3\nLENT 5 – Year C – 2019 – Christ Church Cathedral\ngut-feeling within you.’ This same extravagance of mind, an openness of heart\nas we respond to the love of God in Christ.\nTo go back to our Gospel reading, the fragrance of the perfume that Mary\npoured on Jesus’ feet, filling the whole house; there was no part of that house,\nno corner, no cupboard left untouched by that fragrance. May our response to\nChrist’s self-emptying, self-abandoning love have something of that all-\npervading nature of Mary’s perfume, spreading into every nook and cranny of\nour lives.\nJesus called his disciples to an expansive response. Luke tells us of him telling\nthe disciples:\nDo not judge, and you will not be judged. Do not condemn, and you\nwill not be condemned. Forgive, and you will be forgiven. Give, and it\nwill be given to you.” Luke 6:37\nIt is said of love that if we seek to hold onto it, we lose it. If we share it we get\nso much more back in return. The fragrance spreading out from us into the\nworld about us. There is something here of that same exuberance,\nextravagance in those words as he continues:\nA good measure, pressed down, shaken together and running over,\nwill be poured into your lap. For with the measure you use, it will be\nmeasured to you.\nLove given in response to love; love overflowing from my life into the world\nabout me. We are about to enter into the mystery of Good Friday and Easter,\nthe triumph of life over death, light over darkness. May we who have been\ntouched by the love of God in Christ be ones in whom and through whom that\nlove, that light, that fragrance is manifest in the world about us."
    }
}