{
    "title": "Baptism: The Journey of Faith",
    "date": "2013-03-03",
    "blurb": "This sermon, delivered during Lent in 2013, focuses on the sacrament of Baptism. It explores the significance of Baptism as a sacrament of beginning and inclusion, rooted in the death and resurrection of Jesus. The sermon emphasizes the journey of faith that begins with Baptism and continues throughout a Christian's life, highlighting the importance of community and the promises made during the Baptismal service.",
    "raw_text": "Baptism – receive the sign of the Cross\n\nOver this season of Lent I am taking the opportunity to reflect on the Sacrament of Baptism as practiced in the Church of Ireland. Marking as it does the beginnings of Christian life it is a sacrament of beginning, a sacrament of inclusion. It is a sacrament that has its roots in the death and resurrection of Jesus and so in the very early days of the Church Baptism was celebrated at Easter and Lent was a period of preparation for those who were coming to be baptised.\n\nBaptism is about membership, membership of the Church, membership of the Body of Christ. Paul speaks of the Christian life as a growing into him who is the head, into Christ, 16 from whom the whole body, joined and knit together by every ligament with which it is equipped, as each part is working properly, promotes the body's growth in building itself up in love. Eph 4:15,16\n\nBaptism, birth, coming to faith, are but beginnings that are to be built upon. As we are reminded in the service of Baptism, faith is a journey, a journey of a life time, a growing into Christ.\n\nLast Sunday it was our privilege to welcome three young children into the family of the Church. In the course of that service we reflected on the promises that lie at the heart of that service. There are the promises made by the parents regarding their upbringing of their children; the promises that were made on behalf of these children that our Confirmation Candidates will be making in their own name at Confirmation after Easter; promises made by the congregation to welcome and to encourage these children on their Christian journey.\n\nThe promises of Baptism are profound promises that go to the heart of our identity:\n\nDo you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?\n\nAs I always say these are not questions of people who have arrived, who have got it all sorted; these are questions of people on a journey, a journey into Christ, becoming more like Christ, making Christ present in the world in which we live and work.\n\nIn the Baptismal service, following on from the promises, the child is signed with the sign of the cross. As we do so we use the following words (they are printed out on your lesson sheet):\n\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\n\nMay almighty God deliver you from the powers of darkness, restore in you the image of his glory, and lead you in the light and obedience of Christ. Amen.\n\nI want to reflect on this in the context of the portion we read as our Old Testament Lesson this morning, from Isaiah 55. This comes at the end of the portion of Isaiah, chapters 40-55, that is often known as 2nd Isaiah. This is thought to be of later origin than the first part. The first part, set in Jerusalem as the city is about to fall, speaks of a judgement that is coming on city and upon the nation. The second portion, set in the context of the Exile in Babylon, speaks of hope, of renewal, of the prospect of a return to the Promised Land.\n\nThe portion we read today begins with words of open invitation. Water, wine, milk, honey all speak of the generous provision that awaited God’s people in the Promised Land as they journeyed through the deserts of Sinai.\n\n1Everyone who thirsts,\ncome to the waters;\nand you that have no money,\ncome, buy and eat!\nCome, buy wine and milk\nwithout money and without price.\n2Why do you spend your money for that which is not bread,\nand your labour for that which does not satisfy? Isaiah 55:1,2\n\nJust as God invites his people so they for their part must respond.\n\n6Seek the LORD while he may be found,\ncall upon him while he is near;\n7let the wicked forsake their way,\nand the unrighteous their thoughts;\nlet them return to the LORD, that he may have mercy on them,\nand to our God, for he will abundantly pardon.\n\nWhat we have here in this short passage is a coming together of two fundamental truths of God’s gracious provision and man’s response. I would often say that Baptism expresses a similar truth; God has given his all in Christ; it is for me to pick it up and run with it. And so we say ‘Receive the sign of the cross’, receive the sign of your redemption. Then live as a disciple of Christ, finish the race, keep the faith. You’ve started the journey; come, continue that journey with us.\n\nThen come the words spoken by the whole congregation:\n\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\n\nThese mirror words that we say in the Eucharistic Prayer in our Communion Service:\n\nTherefore, Father, with this bread and this cup\nwe do as Christ your Son commanded:\nwe remember his passion and death,\nwe celebrate his resurrection and ascension,\nand we look for the coming of his kingdom.\n\nAs ones baptised into the death and resurrection of our Lord Jesus Christ, in word, in sacrament, in bread and wine, in daily living we encourage one another as we go out from here to be the hands, the feet, the lips of Christ in the world of today. This section of the Baptismal Service ends with a prayer for the one about to be baptised:\n\nMay almighty God deliver you from the powers of darkness, restore in you the image of his glory, and lead you in the light and obedience of Christ. Amen.\n\nMay God restore in you the image of his glory. I get a picture here of deep inner healing that goes to the very heart of who I am, of who we are, before God. We are made in the image of God, yet so often that image is obscured by pride, by selfishness; by just me being me, in the frailty, the wilfulness, the forgetfulness of my humanity. It is as I undertake this journey of faith, this journey with Christ, into Christ, as I learn in daily living what it is to repent of the sins that separate me from God and neighbour, what it is to submit to Christ as Lord, so that walking in the light and obedience of Christ I may show to the world something of the God in whom I live and move and have my being.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/lent32013.txt",
        "raw_ocr_content": "Page 1 of 4\nLENT 3 – 2013 – Year 3\nBaptism – receive the sign of the Cross\nOver this season of Lent I am taking the opportunity to reflect on the\nSacrament of Baptism as practiced in the Church of Ireland. Marking\nas it does the beginnings of Christian life it is a sacrament of\nbeginning, a sacrament of inclusion. It is a sacrament that has its roots\nin the death and resurrection of Jesus and so in the very early days of\nthe Church Baptism was celebrated at Easter and Lent was a period of\npreparation for those who were coming to be baptised.\nBaptism is about membership, membership of the Church,\nmembership of the Body of Christ. Paul speaks of the Christian life as\na growing into\nhim who is the head, into Christ, 16 from whom the whole body,\njoined and knit together by every ligament with which it is\nequipped, as each part is working properly, promotes the body's\ngrowth in building itself up in love. Eph 4:15,16\nBaptism, birth, coming to faith, are but beginnings that are to be built\nupon. As we are reminded in the service of Baptism, faith is a\njourney, a journey of a life time, a growing into Christ.\nLast Sunday it was our privilege to welcome three young children into\nthe family of the Church. In the course of that service we reflected on\nthe promises that lie at the heart of that service. There are the\npromises made by the parents regarding their upbringing of their\nchildren; the promises that were made on behalf of these children that\nour Confirmation Candidates will be making in their own name at\nConfirmation after Easter; promises made by the congregation to\nwelcome and to encourage these children on their Christian journey.\nPage 2 of 4\nLENT 3 – 2013 – Year 3\nBaptism – receive the sign of the Cross\nThe promises of Baptism are profound promises that go to the heart of\nour identity:\nDo you reject the devil and all proud rebellion against God?\nDo you renounce the deceit and corruption of evil?\nDo you repent of the sins that separate us from God and neighbour?\nDo you turn to Christ as Saviour?\nDo you submit to Christ as Lord?\nDo you come to Christ, the Way, the Truth and the Life?\nAs I always say these are not questions of people who have arrived,\nwho have got it all sorted; these are questions of people on a journey,\na journey into Christ, becoming more like Christ, making Christ\npresent in the world in which we live and work.\nIn the Baptismal service, following on from the promises, the child is\nsigned with the sign of the cross. As we do so we use the following\nwords (they are printed out on your lesson sheet):\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\nI want to reflect on this in the context of the portion we read as our\nOld Testament Lesson this morning, from Isaiah 55. This comes at\nthe end of the portion of Isaiah, chapters 40-55, that is often known as\n2nd Isaiah. This is thought to be of later origin than the first part. The\nfirst part, set in Jerusalem as the city is about to fall, speaks of a\nPage 3 of 4\nLENT 3 – 2013 – Year 3\nBaptism – receive the sign of the Cross\njudgement that is coming on city and upon the nation. The second\nportion, set in the context of the Exile in Babylon, speaks of hope, of\nrenewal, of the prospect of a return to the Promised Land.\nThe portion we read today begins with words of open invitation.\nWater, wine, milk, honey all speak of the generous provision that\nawaited God’s people in the Promised Land as they journeyed through\nthe deserts of Sinai.\n1Everyone who thirsts,\ncome to the waters;\nand you that have no money,\ncome, buy and eat!\nCome, buy wine and milk\nwithout money and without price.\n2Why do you spend your money for that which is not bread,\nand your labour for that which does not satisfy? Isaiah 55:1,2\nJust as God invites his people so they for their part must respond.\n6Seek the LORD while he may be found,\ncall upon him while he is near;\n7let the wicked forsake their way,\nand the unrighteous their thoughts;\nlet them return to the LORD, that he may have mercy on them,\nand to our God, for he will abundantly pardon.\nWhat we have here in this short passage is a coming together of two\nfundamental truths of God’s gracious provision and man’s response. I\nwould often say that Baptism expresses a similar truth; God has given\nhis all in Christ; it is for me to pick it up and run with it. And so we\nsay ‘Receive the sign of the cross’, receive the sign of your\nredemption. Then live as a disciple of Christ, finish the race, keep the\nfaith. You’ve started the journey; come, continue that journey with us.\nThen come the words spoken by the whole congregation:\nPage 4 of 4\nLENT 3 – 2013 – Year 3\nBaptism – receive the sign of the Cross\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\nThese mirror words that we say in the Eucharistic Prayer in our\nCommunion Service:\nTherefore, Father, with this bread and this cup\nwe do as Christ your Son commanded:\nwe remember his passion and death,\nwe celebrate his resurrection and ascension,\nand we look for the coming of his kingdom.\nAs ones baptised into the death and resurrection of our Lord Jesus\nChrist, in word, in sacrament, in bread and wine, in daily living we\nencourage one another as we go out from here to be the hands, the\nfeet, the lips of Christ in the world of today. This section of the\nBaptismal Service ends with a prayer for the one about to be baptised:\nMay almighty God deliver you from the powers of darkness,\nrestore in you the image of his glory,\nand lead you in the light and obedience of Christ. Amen.\nMay God restore in you the image of his glory. I get a picture here of\ndeep inner healing that goes to the very heart of who I am, of who we\nare, before God. We are made in the image of God, yet so often that\nimage is obscured by pride, by selfishness; by just me being me, in the\nfrailty, the wilfulness, the forgetfulness of my humanity. It is as I\nundertake this journey of faith, this journey with Christ, into Christ, as\nI learn in daily living what it is to repent of the sins that separate me\nfrom God and neighbour, what it is to submit to Christ as Lord, so that\nwalking in the light and obedience of Christ I may show to the world\nsomething of the God in whom I live and move and have my being."
    }
}