{
    "title": "Reflection on Corona Virus Epidemic",
    "date": "2020-03-07",
    "blurb": "This sermon reflects on the Corona Virus Epidemic, drawing parallels with biblical stories and the human tendency to believe in our own omnipotence. It emphasizes the importance of community and our responsibilities to each other during such times.",
    "raw_text": "LENT 3 – Year A – 2020\nReflection on Corona Virus Epidemic\n\nWhenever I pick up my Irish Times I often look out for what Fintan O’Toole is writing about. I don’t always agree with what he says but he does have a knack of putting his finger on the core of the issue he is discussing.\n\nIn the Saturday edition of last weekend, his article carried the headline; ‘Covid-19 has come to tell us that we are not kings of the world.’ He began:\n\n> It is the locusts that make this moment in history seem so biblical. The plague of locusts is one of the 10 catastrophes visited upon the Egyptians in the Book of Exodus. The images of the vast and relentless swarms that have rampaged through Ethiopia, Somalia and Kenya, infesting hundreds of thousands of hectares of crops, pasture and forest, seem to take us back to the ancient Egypt of Moses and the pharaoh, bringing the myth horribly alive.\n\nAnd though we do not (yet) have rivers of blood or invasions of frogs, we do have the fierce storms and the apocalyptic wildfires and the recurrent floods – and of course the plague of Covid-19.\n\nIn the context of ancient Egypt, people would have deduced the meaning behind all of this. God is angry and he is visiting punishment on us. We don’t tend to think in these terms anymore, that catastrophes are the work of a divine Providence. Having said that, O’Toole goes to make the following observation, regarding the lessons of catastrophic events:\n\n> But it did at least have one virtue: it reminded us that there are limits to human control of the world. The point of the biblical story of the plagues of Egypt is that the pharaoh thinks he is all powerful. He thinks the world obeys his will and that there is nothing higher than his commands. It seems rather mean of God to use the poor unfortunate people of Egypt to show him otherwise, but that’s how these lessons tend to be delivered in mythic stories.\n\nThere are limits to human control of the world. But, as O’Toole goes on to point out, the counter myth of modernity is that we humans are indeed the lords of creation. Back in the time of the Enlightenment, an ideology of limitless domination took hold. The view prevailed that humans are outside of and above the natural world, building on God’s instruction to Adam in the Book of Genesis to subdue the Earth and all its creatures.\n\nAt the same time the “discovery” of the New World laid open vast new territories to be claimed, controlled, dominated, exploited and physically transformed. The scientific revolution and the industrial revolution that followed, seemed to open up the possibility that all the forces of the physical universe, whether seen or unseen, could be understood, categorised and shaped to serve human needs.\n\nWe are now living with the logical culmination of this idea. We have reached a stage in the earth’s history during which humans have a decisive influence on the state, dynamics and future of the Earth system.\n\nWe have made a new world, one in which there is no longer a clear distinction between humanity and nature. O’Toole concludes:\n\n> The coronavirus, in a sense, “knows” this. It has used our systems of control over the animal world as a pathway to travel between species. And it has taken a trip on our hyper-globalised networks of exchange, using human suitcases to transport itself with astonishing rapidity around the world.\n\nAnd like the wildfires and the floods, the virus has exposed the great weakness within the human triumph. We are providence now, but we are far from divine. We have made a new Earth but we still have to live on the old one. We have not come nearly as far as we like to imagine from the Egypt of Moses and the pharaoh and the 10 calamities.\n\nAs I re-read that article with its headline; ‘Covid-19 has come to tell us that we are not kings of the world.’, my mind turned to the Parable Jesus told of the Rich Fool. This is a story of a man who feels he is in control. He has done well, he makes provision for the future – but just as Pharaoh was unable to prevail against the biblical plagues, he was still subject to his own mortality.\n\nTo return to our own situation, there is something bitterly apt in the fact that coronaviruses take their name from the Latin corona, a crown. Their form is that of the traditional human symbol of dominion and domination. They come to tell us that they are as much kings of the world as we are. We are not enslaved to nature anymore – but we are not its masters either.\n\nSo the corona virus reminds us that we are not all powerful, as individuals, as society, as a species.\n\nWe may not be all powerful but we are not powerless. There is the power of our responsibility, as individuals, as a community. In writing to that lively, individualistic, inspired yet flawed Church in Corinth, Paul uses the illustration of the Body as he explores the meaning of what it is to be Church, what it is to be community; the body made up of very varied, distinctive parts. Each has its own function, each has its own intrinsic worth. In the context of Church, in the context of community we are called to have a care and concern for each other. He writes:\n\n> God has so arranged the body, giving the greater honour to the inferior member, that there may be no dissension within the body, but the members may have the same care for one another. If one member suffers, all suffer together with it; if one member is honoured, all rejoice together with it.\n\nNow you are the body of Christ and individually members of it.\n\nIn the present context we have been given very specific advice regarding how to protect ourselves and others in respect of personal hygiene (hand washing, coughing and sneezing etiquette), in social distancing and, in the event of infection, isolating ourselves. So, we have closed our schools, museums etc; many social activities here in St Mary’s have been suspended – the Bridge Club, Men’s Breakfast, Youth Club and Confirmation Group. As a Church, we have been given very specific advice, based on medical expertise, as to how we make changes in our worship. Handshakes and the exchange of the Peace have been suspended, as is receiving the wine from a shared cup. If I am negligent in any of these areas, this may have implications not just for me but for whoever I come into contact with.\n\nThis is a time to come together as a community, to recognises our responsibilities to ourselves and to each other. To recognise how my behaviour has impact on my neighbour. Hopefully we will see a decline in the incidence of mass stockpiling, that we recognise that others too may need the toilet rolls, the bread, the pasta that I am stacking into my trolley. That we watch out for each other, for the vulnerable, for those who live alone; that we do the simple errand, make that simple phone call; that we lift the aloneness of those who are alone.\n\nCovid-19 has indeed reminded us that we are not kings. It may in time teach us an equally powerful lesson, that in these times of prosperity we may have forgotten, the power of community.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year A/lent32020.txt",
        "raw_ocr_content": "Page 1 of 5\nLENT 3 – Year A – 2020\nReflection on Corona Virus Epidemic\nWhenever I pick up my Irish Times I often look out for what Fintan O’Toole is\nwriting about. I don’t always agree with what he says but he does have a\nknack of putting his finger on the core of the issue he is discussing.\nIn the Saturday edition of last weekend, his article carried the headline; ‘Covid-\n19 has come to tell us that we are not kings of the world.’ He began:\nIt is the locusts that make this moment in history seem so biblical. The\nplague of locusts is one of the 10 catastrophes visited upon the\nEgyptians in the Book of Exodus. The images of the vast and\nrelentless swarms that have rampaged\nthrough Ethiopia, Somalia and Kenya, infesting hundreds of thousands\nof hectares of crops, pasture and forest, seem to take us back to the\nancient Egypt of Moses and the pharaoh, bringing the myth horribly\nalive.\nAnd though we do not (yet) have rivers of blood or invasions of frogs,\nwe do have the fierce storms and the apocalyptic wildfires and the\nrecurrent floods – and of course the plague of Covid-19.\nIrish Times, Saturday March 7th 2020\nIn the context of ancient Egypt, people would have deduced the meaning\nbehind all of this. God is angry and he is visiting punishment on us. We don’t\ntend to think in these terms anymore, that catastrophes are the work of a divine\nProvidence. Having said that, O’Toole goes to make the following\nobservation, regarding the lessons of catastrophic events:\nBut it did at least have one virtue: it reminded us that there are limits\nto human control of the world. The point of the biblical story of the\nplagues of Egypt is that the pharaoh thinks he is all powerful. He\nthinks the world obeys his will and that there is nothing higher than\nhis commands. It seems rather mean of God to use the poor\nunfortunate people of Egypt to show him otherwise, but that’s how\nthese lessons tend to be delivered in mythic stories.\nIrish Times, Saturday March 7th 2020\nPage 2 of 5\nLENT 3 – Year A – 2020\nReflection on Corona Virus Epidemic\nThere are limits to human control of the world. But, as O’Toole goes on to\npoint out, the counter myth of modernity is that we humans are indeed the lords\nof creation. Back in the time of the Enlightenment, an ideology of limitless\ndomination took hold. The view prevailed that humans are outside of and\nabove the natural world, building on God’s instruction to Adam in the Book of\nGenesis to subdue the Earth and all its creatures.\nAt the same time the “discovery” of the New World laid open vast new\nterritories to be claimed, controlled, dominated, exploited and physically\ntransformed. The scientific revolution and the industrial revolution that\nfollowed, seemed to open up the possibility that all the forces of the physical\nuniverse, whether seen or unseen, could be understood, categorised and shaped\nto serve human needs.\nWe are now living with the logical culmination of this idea. We have reached\na stage in the earth’s history during which humans have a decisive influence on\nthe state, dynamics and future of the Earth system.\nWe have made a new world, one in which there is no longer a clear distinction\nbetween humanity and nature. O’Toole concludes:\nThe coronavirus, in a sense, “knows” this. It has used our systems of\ncontrol over the animal world as a pathway to travel between species.\nAnd it has taken a trip on our hyper-globalised networks of exchange,\nusing human suitcases to transport itself with astonishing rapidity\naround the world.\nAnd like the wildfires and the floods, the virus has exposed the great\nweakness within the human triumph. We are providence now, but we\nare far from divine. We have made a new Earth but we still have to\nlive on the old one. We have not come nearly as far as we like to\nPage 3 of 5\nLENT 3 – Year A – 2020\nReflection on Corona Virus Epidemic\nimagine from the Egypt of Moses and the pharaoh and the 10\ncalamities.\nIrish Times, Saturday March 7th 2020\nAs I re-read that article with its headline; ‘Covid-19 has come to tell us that we\nare not kings of the world.’, my mind turned to the Parable Jesus told of the\nRich Fool. This is a story of a man who feels he is in control. He has done\nwell, he makes provision for the future – but just as Pharaoh was unable to\nprevail against the biblical plagues, he was still subject to his own mortality.\nTo return to our own situation, there is something bitterly apt in the fact that\ncoronaviruses take their name from the Latin corona, a crown. Their form is\nthat of the traditional human symbol of dominion and domination. They come\nto tell us that they are as much kings of the world as we are. We are not\nenslaved to nature anymore – but we are not its masters either.\nSo the corona virus reminds us that we are not all powerful, as individuals, as\nsociety, as a species.\nWe may not be all powerful but we are not powerless. There is the power of\nour responsibility, as individuals, as a community. In writing to that lively,\nindividualistic, inspired yet flawed Church in Corinth, Paul uses the illustration\nof the Body as he explores the meaning of what it is to be Church, what it is to\nbe community; the body made up of very varied, distinctive parts. Each has\nits own function, each has its own intrinsic worth. In the context of Church, in\nthe context of community we are called to have a care and concern for each\nother. He writes:\nPage 4 of 5\nLENT 3 – Year A – 2020\nReflection on Corona Virus Epidemic\nGod has so arranged the body, giving the greater honour to the inferior\nmember, that there may be no dissension within the body, but the\nmembers may have the same care for one another. If one member\nsuffers, all suffer together with it; if one member is honoured, all\nrejoice together with it.\nNow you are the body of Christ and individually members of it.\n1 Corinthians 12:24-27\nIn the present context we have been given very specific advice regarding how\nto protect ourselves and others in respect of personal hygiene (hand washing,\ncoughing and sneezing etiquette), in social distancing and, in the event of\ninfection, isolating ourselves. So, we have closed our schools, museums etc;\nmany social activities here in St Mary’s have been suspended – the Bridge\nClub, Men’s Breakfast, Youth Club and Confirmation Group. As a Church, we\nhave been given very specific advice, based on medical expertise, as to how we\nmake changes in our worship. Handshakes and the exchange of the Peace have\nbeen suspended, as is receiving the wine from a shared cup. If I am negligent\nin any of these areas, this may have implications not just for me but for\nwhoever I come into contact with.\nThis is a time to come together as a community, to recognises our\nresponsibilities to ourselves and to each other. To recognise how my\nbehaviour has impact on my neighbour. Hopefully we will see a decline in the\nincidence of mass stockpiling, that we recognise that others too may need the\ntoilet rolls, the bread, the pasta that I am stacking into my trolley. That we\nwatch out for each other, for the vulnerable, for those who live alone; that we\ndo the simple errand, make that simple phone call; that we lift the aloneness of\nthose who are alone.\nPage 5 of 5\nLENT 3 – Year A – 2020\nReflection on Corona Virus Epidemic\nCovid-19 has indeed reminded us that we are not kings. It may in time teach\nus an equally powerful lesson, that in these times of prosperity we may have\nforgotten, the power of community."
    }
}