{
    "title": "The Image of Faith",
    "date": "2012-02-26",
    "blurb": "Kevin reflects on the importance of engaging with the Scriptures, not just as stories to be heard, but as transformative teachings that shape our lives. He uses the analogy of becoming 'illustrators' of the stories we hear, embodying the teachings of Jesus in our daily lives. The sermon encourages us to be 'people of the Beatitudes', living expressions of Jesus' teachings, and to allow the Bible to resonate with and challenge our daily living.",
    "raw_text": "Lent 1 – 2012 – year B\n\nJust before Christmas, our older son Anthony had to be away on business for two weeks leaving our daughter-in-law Angie to look after the two children. During that time Rachel and I would head across some nights to help her put the children to bed. One particular night, I was putting Ryan down to sleep, leaving Angie to feed Rory. That night Ryan was missing his father and took a dim view of Grandpa putting him to bed instead of his Mum. I explained that I would read him his story and Mum would be up to kiss him goodnight. The child, barely two and a half, stood up in his cot, with a look that was the spitting image of his father, and declared, 'I want my Mummy – you get out.' I looked at him and thought, 'Child, you are the image of your father.'\n\nToday, in our Gospel reading, we read of the Baptism and of his temptations in the wilderness. We read sections of this story of Jesus, Sunday by Sunday. The rationale for that is in our Gospel reading for today, as the voice from heaven declares, you are my son. As we read this we recall the account of the Transfiguration, that we read last Sunday, and the words heard by the disciples: 'This is my Son... listen to him.'\n\nAnd so the Scriptures lie at the heart of our worship. One of the features of our Anglican tradition is our ordered reading of the Scriptures, Sunday by Sunday. In the course of our three-year cycle of readings, we reflect on all the major themes of scripture and our readings are drawn from all sections of the Bible.\n\nDuring the week I was in the Burrow School for their Assembly. On that occasion, the Assembly had been prepared by 4th Class. They began by asking us to think of stories that we enjoyed and then went on to think of the stories that Jesus told. Last Friday they were thinking about the Parable of the Sower. They then said something that I found very profound. They said, when we get really engaged in a story, really drawn into that story, we become the illustrators of that story.\n\nThat set me thinking about the words that we heard last Sunday. 'This is my Son, whom I love. Listen to him.' At what level do we listen to the story we hear read Sunday by Sunday here in Church? Between now and Easter, we will be following the story of Jesus as he journeys towards Jerusalem. We will hear of his teaching, his healing. We will hear of ways in which he challenged people to think differently – differently about God, about each other, about other people – and finally we will hear of the events that lead up to his death on the Cross and his resurrection.\n\nWhat does it mean for us to become illustrators of that story? What that means for me is that we don't just hear the story; we become changed by the story. There is a lovely old prayer that asks that what we hear with our ears, we may believe in our hearts and what we believe in our hearts we may practice in our lives. Brother Roger of Taize used to have a lovely expression. He said that we are called to be a 'people of the Beatitudes'. In other words, we don't just hear the words of Jesus in the Sermon on the Mount, we become living expressions of that teaching:\n\n> Blessed are the meek, blessed are the peacemakers, blessed are the merciful, blessed are those who hunger and thirst after righteousness.\n\nIt has been said of the Bible, that it is not just a matter of us reading the Bible, the Bible reads us. When this happens, there is a resonance between the words we read, the words we hear and our daily living. On occasions, this will be one of encouragement; on other occasions, the words we read and hear will challenge us. What we are talking about here is an engagement with the Scriptures, that as we read and hear the scriptures we not only hear and read the words of the Bible but in and through them hear God's word to us and for us.\n\nBlessed Lord, who caused all holy Scriptures to be written for our learning: help us so to hear them, to read, mark, learn and inwardly digest them that, through patience, and the comfort of your holy word, we may embrace and forever hold fast the hope of everlasting life, which you have given us in our Saviour Jesus Christ, who is alive and reigns with you, in the unity of the Holy Spirit, one God, now and forever.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Lent/year B/lent12012.txt",
        "raw_ocr_content": "Page 1 of 3\nLent 1 – 2012 – year B\nJust before Christmas, our older son Anthony had to be away on business for\ntwo weeks leaving our daughter in law Angie to look after the two children.\nDuring that time Rachel and myself would head across some nights to help her\nput the children to bed. On one particular night, I had headed across and I was\nin the process of putting Ryan down to sleep, leaving Angie to feed Rory. That\nnight Ryan was missing his father and took a dim view of Granpa putting him\nto bed instead of his Mum. I explained that I would read him his story and\nMum would be up to kiss him night night. The child, barely two and a half,\nstood up in his cot, with a look that was the spitten image of his father, and\ndeclared, ‘I want my Mummy – you get out.’ I looked at him and thought,\n‘Child, you are the image of your father.’\nToday, in our Gospel reading, we read of the Baptism and of his temptations in\nthe wilderness. We read sections of this story of Jesus, Sunday by Sunday.\nThe rationale for that is in our Gospel reading for today, as the voice form\nheaven declares, you are my son. As we read this we recall the account of the\nTransfiguration, that we read last Sunday, and the words heard by the disciples:\n‘This is my Son …. listen to him,.’\nAnd so the Scriptures lie at the heart of our worship. One of the features of our\nAnglican tradition is our ordered reading of the Scriptures, Sunday by Sunday.\nIn the course of our three year cycle of readings we reflect on all the major\nthemes of scripture and our readings are drawn from all sections of the Bible.\nDuring the week I was in the Burrow School for their Assembly. On that\noccasion the Assembly had been prepared by 4th Class. They began by asking\nPage 2 of 3\nLent 1 – 2012 – year B\nus to think of stories that we enjoyed and then went on to think of the stories\nthat Jesus told. Last Friday they were thinking about the Parable of the Sower.\nThey then said something that I found very profound. They said, when we get\nreally engaged in a story, really drawn into that story, we become the\nillustrators of that story.\nThat set me thinking about the words that we heard last Sunday. ‘This is my\nSon, whom I love. Listen to him’. At what level do we listen to the story we\nhear read Sunday by Sunday here in Church? Between now and Easter we will\nbe following the story of Jesus as he journeys towards Jerusalem. We will hear\nof his teaching, his healing. We will hear of ways in which he challenged\npeople to think differently – differently about God, about each other, about\nother people – and finally we will hear of the events that lead up to his death on\nthe Cross and his resurrection.\nWhat does it mean for us to become illustrators of that story? What that means\nfor me is that we don’t just hear the story; we become changed by the story.\nThere is a lovely old prayer that asks that what he hear with our ears, we may\nbelieve in our hearts and what we believe in our hearts we may practice in our\nlives. Brother Roger of Taize used to have a lovely expression. He said that\nwe are called to be a ‘people of the Beatitudes’. In other words we don’t just\nhear the words of Jesus in the Sermon on the Mount, we become living\nexpressions of that teaching:\nBlessed are the meek, blessed are the peacemakers, blessed are the merciful,\nblessed are those who hunger and thirst after righteousness.\nPage 3 of 3\nLent 1 – 2012 – year B\nIt has been said of the Bible, that it is not just a matter of us reading the\nBible, the Bible reads us. When this happens, there is a resonance\nbetween the words we read, the words we hear and our daily living. On\noccasions, this will be one of encouragement; on other occasions the\nwords we read and hear will challenge us. What we are talking about here\nis an engagement with the Scriptures, that as we read and hear the\nscriptures we not only hear and read the words of the Bible but in and\nthrough them hear God’s word to us and for us.\nBlessed Lord,\nwho caused all holy Scriptures to be written for our learning:\nhelp us so to hear them,\nto read, mark, learn and inwardly digest them\nthat, through patience, and the comfort of your holy word,\nwe may embrace and for ever hold fast\nthe hope of everlasting life,\nwhich you have given us in our Saviour Jesus Christ,\nwho is alive and reigns with you,\nin the unity of the Holy Spirit,\none God, now and for ever."
    }
}