{
    "title": "Remembering Leslie Hopkins",
    "date": "2012-12-08",
    "blurb": "This sermon is a tribute to Leslie Hopkins, a man of sharp intellect, faith, and devotion to his family. It reflects on his life, his contributions, and his faith. The sermon also provides comfort and hope in the face of loss, drawing on scripture to provide strength and reassurance.",
    "raw_text": "Funeral of Leslie Hopkins – Howth – 8th December 2012\n\nLeslie Hopkins – man of sharp intellect, research chemist, respected by his peers. Sportsman, keen rugby player and later referee. Man of faith, regular in worship, always ready to offer his service. Devoted husband, father and grandfather.\n\nOn this the day of their Dad’s funeral, Troy and Gary have shared with us memories of Les. They have remembered their father in the days of his health, a man of great ability. A research chemist who worked for a number of years in Kenya before returning to Ireland. He worked for many years in the IIRS. A man ready to share his many gifts with others. Here in the Parish we remember a man who helped establish one of the early Youth Groups, one who served on the Parents’ Association in the Burrow School, who administered the Garden of Remembrance when it was first developed. We remember a man with a gentle humour and ready smile. The family remember a devoted husband, father and grandfather.\n\nFor Leslie, for Anne and the family, these last few years have not been easy. Not easy for Leslie as he lost his independence; not easy for Anne, for Sharon, Garry and Troy as they watched the slow decline of one who had been such a rock in their lives. I was always struck by the very obvious love and affection between them.\n\nOn an occasion such as this I often find myself searching for a verse of scripture that draws my thoughts together. I found myself turning to the First Letter to Timothy. The Apostle gives his advice to the younger man:\n\n'But as for you, man of God, pursue righteousness, godliness, faith, love, endurance, gentleness. 12 Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Tim 6:11 ff'\n\n'pursue righteousness, godliness, faith, love, endurance, gentleness.’ This seems to me to draw together so many of the memories of Leslie Hopkins that I came to know, that I know so many of you remember today with love and affection. Leslie has fought the good fight and now is at peace.\n\nWe come to set the mystery of death in the context of our Christian faith. We are approaching Christmas, the feast of the Incarnation, Emmanuel, God among us in the person of Jesus Christ. Soon we will hear those lovely words from St John’s Gospel:-\n\n'4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.'\n\nDarkness has not had the last word in the life of Leslie Hopkins. Sickness, weakness has not had the final say. In fellowship with Leslie, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nA passage I often find myself turning to at a time of a funeral is from St Paul's second letter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home.\n\nThe words that really stand out for me are ; 'So that what is mortal may be swallowed up by life.' This is our hope for Leslie Hopkins this day, that all the limitations of these latter years, the frailty, along with all the limitations that go with being human are 'swallowed up by life', that is our inheritance in Christ in the closer presence of our heavenly Father.\n\nSo today we gather to thank God for Leslie Hopkins, for the many different ways he touched our lives, for his love, his gentle humour, his quiet courage in the face of developing illness, his intellect, his faithfulness in the tasks to which God called him. We come to pray for his family, for Anne, for Sharon, Gary and Troy, his brother and grandchildren and for all who loved him.\n\nWe gather to set his life and our lives in the context of our faith in a loving and living God as we commend Jack, loving father, wonderful human being into the hands of a loving heavenly Father.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Leslie Hopkins.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Leslie Hopkins – Howth – 8th December 2012-12-08\nLeslie Hopkins – man of sharp intellect, research chemist, respected by his\npeers. Sportsman, keen rugby player and later referee. Man of faith, regular in\nworship, always ready to offer his service. Devoted husband, father and\ngrandfather\nOn this the day of their Dad’s funeral, Troy and Gary have shared with us\nmemories of Les. They have remembered their father in the days of his health,\na man of great ability. A research chemist who worked for a number of years\nin Kenya before returning to Ireland. He worked for many years in the IIRS.\nA man ready to share his many gifts with others. Here in the Parish we\nremember a man who helped establish one of the early Youth Groups, one who\nserved on the Parents’ Association in the Burrow School, who administered the\nGarden of Remembrance when it was first developed. We remember a man\nwith a gentle humour and ready smile. The family remember a devoted\nhusband, father and grandfather.\nFor Leslie, for Anne and the family, these last few years have not been easy.\nNot easy for Leslie as he lost his independence; not easy for Anne, for Sharon,\nGarry and Troy as they watched the slow decline of one who had been such a\nrock in their lives. I was always struck by the very obvious love and affection\nbetween them.\nOn an occasion such as this I often find myself searching for a verse of\nscripture that draws my thoughts together. I found myself turning to the First\nLetter to Timothy. The Apostle gives his advice to the younger man:\nPage 2 of 3\nFuneral of Leslie Hopkins – Howth – 8th December 2012-12-08\nBut as for you, man of God, pursue righteousness, godliness,\nfaith, love, endurance, gentleness. 12 Fight the good fight of the\nfaith; take hold of the eternal life, to which you were called and\nfor which you made the good confession in the presence of\nmany witnesses. 1 Tim 6:11 ff\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ This\nseems to me to draw together so many of the memories of Leslie Hopkins that I\ncame to know, that I know so many of you remember today with love and\naffection. Leslie has fought the good fight and now is at peace\nWe come to set the mystery of death in the context of our Christian faith. We\nare approaching Christmas, the feast of the Incarnation, Emmanuel, God\namong us in the person of Jesus Christ. Soon we will hear those lovely words\nfrom St John’s Gospel:-\n4What has come into being in him was life, and the life was\nthe light of all people. 5The light shines in the darkness, and\nthe darkness did not overcome it.\n12But to all who received him, who believed in his name, he\ngave power to become children of God, 13who were born, not\nof blood or of the will of the flesh or of the will of man, but of\nGod.\nDarkness has not had the last word in the life of Leslie Hopkins. Sickness,\nweakness has not had the final say. In fellowship with Leslie, we follow a\nLord who knows what death, what suffering, what loss is all about; one who\nknew what it was like to weep at the grave of his friend Lazarus. Not only that,\nhe is the one who was raised triumphant over death, breaking the power of\ndeath itself. Knowing in his own person what it was all about, I find in him\nPage 3 of 3\nFuneral of Leslie Hopkins – Howth – 8th December 2012-12-08\none to whom I cam come in my own time of suffering and find real comfort,\nreal strength and real hope.\nA passage I often find myself turning to at a time of a funeral is from St Paul's\nsecond letter to the Church at Corinth. the end of chapter 4 and the beginning\nof chapter 5. In this Paul presents us with the reality of our own mortality and\ndeath, he talks very plainly of the body wearing out. But just as he talks of the\nreality of physical decline and death, Paul talks of our new heavenly home.\nThe words that really stand out for me are ; \"So that what is mortal may be\nswallowed up by life.\" This is our hope for Leslie Hopkins this day, that all\nthe limitations of these latter years, the frailty, along with all the limitations\nthat go with being human are \"swallowed up by life\", that is our inheritance in\nChrist in the closer presence of our heavenly Father.\nSo today we gather to thank God for Leslie Hopkins, for the many different\nways he touched our lives, for his love, his gentle humour, his quiet courage in\nthe face of developing illness, his intellect, his faithfulness in the tasks to\nwhich God called him. We come to pray for his family, for Anne, for Sharon,\nGary and Troy, his brother and grandchildren and for all who loved him.\nWe gather to set his life and our lives in the context of our faith in a loving and\nliving God as we commend Jack, loving father, wonderful human being into\nthe hands of a loving heavenly Father."
    }
}