{
    "title": "Ordination of Linda Frost",
    "date": "2014-09-21",
    "blurb": "This sermon is about the ordination of Linda Frost to the priesthood. The sermon emphasizes the importance of service, faith, and dedication in the ministry. It also highlights the significance of personal faith and the need for spiritual nourishment and growth through prayer and scripture reading.",
    "raw_text": "Ordination of Rev Linda Frost to the Priesthood\nSt John’s Cathedral, Sligo – 21st September 2014\n‘For Christ’s love compels us’\n\nFirst of all might I say what a privilege it is for me to be standing here on the occasion of the Ordination of Linda Frost as Priest and I would like to thank Bishop Ferran for the invitation to preach on this occasion. It has been a pleasure to have worked with Linda as she served her time as Deacon Intern in Howth Parish. Linda, it is a sign of the affection and esteem in which you are held that so many have come here to be with you today.\n\nAt the start of this service Bishop Ferran asked you:\n“Do you believe in your heart that God has called you to the office and work of a priest in his Church?” And you replied: “I believe that God has called me.”\n\nThis isn’t something you realised today – this conviction has been part of your life, something you have wrestled with (supported by Steve along the way).\n\nSo you can no doubt identify with Paul’s words to the Church at Corinth that Steve read for us earlier: ‘For Christ’s love compels us.’ The word that Paul has used here for ‘compel’ has connotations of coercion, of seizing hold of you, laying siege.\n\nSo here you are Linda. You have survived selection. You have survived your training – in that you have had the love and support of your husband Steve and the family. And Steve, on behalf of the Church, I thank you for the love and support you have given to Linda during this time. Linda, you survived your internship in Howth and even your dissertation.\n\nIn a short while, you will be asked to take your ordination vows that I always see as helping to put a shape on our ministry. I invite you and your new parishioners to reflect on these promises and how they will impact on your life together.\n\n‘For Christ’s love compels us …because we are convinced that one died for all.’\n\nLinda, you will be asked to do many things, you will offer to do many things in the course of your ministry – chairing meetings of Vestry, of Boards of management along with washing up, locking up, setting up tables, putting away tables, cutting grass, weeding paths. It is right that we should share the load of these ordinary tasks with members of our Parishes. But we must never lose sight of why we are here.\n\nAnd so Bishop Ferran will ask you:\nDo you believe and accept the Holy Scriptures as revealing all things necessary for eternal salvation through faith in Jesus Christ?\nAnswer I do.\n\nDo you believe and accept the doctrine of the Christian faith as the Church of Ireland has received it?\nAnswer I do.\n\nIn your ministry will you expound the Scriptures and teach that doctrine?\nAnswer By the help of God, I will.\n\nOur ministry, our whole ministry, must be built on the bed rock of our commitment to the Gospel of our Lord Jesus Christ. That must come through in our ministry of teaching, our pastoral work and yes even in the stacking of chairs, the clearing of weeds. We live in a world of hierarchies and even in the life of the Church it is easy to slip into the mindset of hierarchies.\n\nIn Luke’s Gospel, we read of Jesus reminding his disciples\n\nBut he said to them, \"The kings of the Gentiles lord it over them; and those in authority over them are called benefactors. 26 But not so with you; rather the greatest among you must become like the youngest, and the leader like one who serves. 27 For who is greater, the one who is at the table or the one who serves? Is it not the one at the table? But I am among you as one who serves. Luke 22:25-27\n\nSo Bishop Ferran will ask of you:\nWill you be faithful in visiting the sick, in caring for the poor and needy, and in helping the oppressed?\nAnswer By the help of God, I will.\n\nLinda, as you showed so wonderfully during your time with us in Howth, an integral part of your ministry will be your service of the people of your Parish. Your pastoral ministry, your ministry of word and sacrament are not separate, they are two sides of the same coin. Your pastoral ministry will enrich your teaching ministry and your teaching ministry will enrich your pastoral ministry. But having said all that, you are not called to be the sole agent of Christian service in your Parish. You are also called to be an enabler, an encourager; enabling and encouraging other people to discover their own gifts, their own ministries.\n\nAnd so you will be asked:\nWill you encourage God’s people to be good stewards of their gifts, that every member may be equipped for the work of ministering, and that the Body of Christ be built up in love?\nAnswer By the help of God, I will.\n\nAfter the taking of the vows, after the laying on of hands in ordination, Bishop Ferran, as he prepares to lead us in prayer for Linda, will remind us all:\nBecause none of us can bear the weight of this ministry in our own strength, but only by the grace and power of God,\n\n‘Only by the grace and power of God…’ How often, in the busy-ness, do we so often lose sight of that. Let me offer you two pictures – one general, one more personal – as we try to reflect on that. Have you ever found yourself on a car journey, the petrol tank is running low, edging towards the empty mark. ‘Sure, we’ll make it home – I’ll get petrol tomorrow.’ Then the orange light goes on, first flashing then constant – we realise we are running on empty, that if we don’t find a garage soon then we are stranded.\n\nThe other one as I say is more personal. I recall when I was in Mountmellick, 25, 30 years ago. I was at a diocesan conference and Bishop Walton Empey came across to me with a cheery, ‘Kevin, how are things in Mountmellick.’ For some reason I did not give the natural reply of the clergy when asked such questions by their bishop – ‘Wonderful, Bishop.’ Instead I said I wasn’t looking for a move but I was feeling very flat. He looked me straight in the eye and said, ‘Kevin, the prayer life has gone, hasn’t it?’ He’d hit the nail on the head. I realised I was running on empty.\n\nHe packed me off to Glenstall for a few days. It was just what I needed. I learned a fundamental truth at that time – ‘We can be so busy in the work of the Lord that we forget the Lord of the work.’ I wish I could say that that was the last time I found myself running on empty – but at least I now know what I have to do.\n\nSo Linda, your Bishop will ask you:\nWill you be diligent in prayer, in reading holy Scripture, and in all studies that will deepen your faith and fit you to uphold the truth of the Gospel?\nAnswer By the help of God, I will.\n\nWill you then, in the strength of the Holy Spirit, continually stir up the gift of God that is in you, to make Christ known to all people?\nAnswer By the help of God, I will.\n\nFor we can indeed be so busy in the work of the Lord that we forget the Lord of the work. Time is precious; there are so many calls on our time, meetings to attend, jobs to do, people to see – all of these are important in their own right – but so also is this time we give to study, to prayer, to reflection. We short-change ourselves, we actually short-change the people we are called to serve if we lose sight of this part of our ministry. For as the Bishop will remind us as he leads us in prayer:\nBecause none of us can bear the weight of this ministry in our own strength, but only by the grace and power of God ….\n\nSo we gather here this afternoon Linda on this day of your ordination and we stand alongside you as you prepare to take your vows. You come responding to God’s call on your life, that sense of compulsion we were thinking about at the beginning. The God who has called you has gifted you in so many ways, your gentleness, your wisdom, your sense of humour, your down to earth common sense. You bring to your calling your deep personal faith that has sustained you in so many ways, that you have shared with us in Howth, that you will share with your people.\n\nMay God sustain you in the faith that has brought you thus far. May God bless you in your ministry of word, of sacrament, of prayer, of service among the people of Mohill and where ever else God leads you in the years to come. May God bless the people among whom you serve. In your quiet times with the Lord, may you know his presence, his refreshment, his peace. May God bless you and Steve and your family. You have travelled this road together, you’ve laughed together, cried together, loved each other – may you be sustained in that love in all that lies ahead for you both.\n\nJust before Joshua prepared to lead the people of Israel across the Jordan into the Promised Land, he called them together in an act of dedication. I say to Linda, to the people of Mohill – the God who called you, the God who has brought you together has a purpose for you. We say to you, as Joshua said to the people of Israel as they stood on the banks of the Jordan; \"Sanctify yourselves; for tomorrow the LORD will do wonders among you.\"",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Linda_s Ordination - sermon.txt",
        "raw_ocr_content": "Page 1 of 5\nOrdination of Rev Linda Frost to the Priesthod\nSt John’s Cathedral, Sligo – 21st September 2014\n‘For Christ’s love compels us’\nFirst of all might I say what a privilege it is for me to be standing here on the\noccasion of the Ordination of Linda Frost as Priest and I would like to thank\nBishop Ferran for the invitation to preach on this occasion. It has been a pleasure\nto have worked with Linda as she served her time as Deacon Intern in Howth\nParish. Linda, it is a sign of the affection and esteem in which you are held that so\nmany have come here to be with you today. Linda, the Parish of Howth extend\ntheir love to you this day – many have joined you today and many more have asked\nme to express their best wishes on this day.\nAt the start of this service Bishop Ferran asked you:\n“Do you believe in your heart that God has called you to the office and\nwork of a priest in his Church?” And you replied: “I believe that God has\ncalled me.”\nThis isn’t something you realised today – this conviction has been part of your life,\nsomething you have wrestled with (supported by Steve along the way). Can you\nthink back to the time this gripped you and you felt that you had to have this call\ntested by the wider Church. It is not something that seemed to strike you as a good\nidea. It is not something that you thought, ‘Sure we’ll give it a go.’ Those of us in\nministry (and we are a strange and varied bunch) will all talk of a feeling of\ncompulsion.\nSo you can no doubt identify with Paul’s words to the Church at Corinth that Steve\nread for us earlier: ‘For Christ’s love compels us.’ The word that Paul has used\nhere for ‘compel’ has connotations of coercion, of seizing hold of you, laying siege.\nSo here you are Linda. You have survived selection. You have survived your\ntraining – in that you have had the love and support of your husband Steve and the\nfamily. And Steve, on behalf of the Church, I thank you for the love and support\nPage 2 of 5\nOrdination of Rev Linda Frost to the Priesthod\nSt John’s Cathedral, Sligo – 21st September 2014\nyou have given to Linda during this time. Linda, you survived your internship in\nHowth and even your dissertation.\nIn a short while, you will be asked to take your ordination vows that I always see as\nhelping to put a shape on our ministry. I invite you and your new parishioners to\nreflect on these promises and how they will impact on your life together.\n‘For Christ’s love compels us …because we are convinced that one died for all.’\nLinda, you will be asked to do many things, you will offer to do many things in the\ncourse of your ministry – chairing meetings of Vestry, of Boards of management\nalong with washing up, locking up, setting up tables, putting away tables, cutting\ngrass, weeding paths. It is right that we should share the load of these ordinary\ntasks with members of our Parishes. But we must never lose sight of why we are\nhere. And so Bishop Ferran will ask you:\nDo you believe and accept the Holy Scriptures as revealing all things\nnecessary for eternal salvation through faith in Jesus Christ?\nAnswer I do.\nDo you believe and accept the doctrine of the Christian faith as the Church\nof Ireland has received it?\nAnswer I do.\nIn your ministry will you expound the Scriptures and teach that doctrine?\nAnswer By the help of God, I will.\nOur ministry, our whole ministry, must be built on the bed rock of our commitment\nto the Gospel of our Lord Jesus Christ. That must come through in our ministry of\nteaching, our pastoral work and yes even in the stacking of chairs, the clearing of\nweeds. We live in a world of hierarchies and even in the life of the Church it is\neasy to slip into the mindset of hierarchies.\nIn Luke’s Gospel, we read of Jesus reminding his disciples\nPage 3 of 5\nOrdination of Rev Linda Frost to the Priesthod\nSt John’s Cathedral, Sligo – 21st September 2014\nBut he said to them, \"The kings of the Gentiles lord it over them; and those\nin authority over them are called benefactors. 26 But not so with you; rather\nthe greatest among you must become like the youngest, and the leader like\none who serves. 27 For who is greater, the one who is at the table or the one\nwho serves? Is it not the one at the table? But I am among you as one who\nserves. Luke 22:25-27\nSo Bishop Ferran will ask of you:\nWill you be faithful in visiting the sick, in caring for the poor and needy,\nand in helping the oppressed?\nAnswer By the help of God, I will.\nLinda, as you showed so wonderfully during your time with us in Howth, an\nintegral part of your ministry will be your service of the people of your Parish.\nYour pastoral ministry, your ministry of word and sacrament are not separate, they\nare two sides of the same coin. Your pastoral ministry will enrich your teaching\nministry and your teaching ministry will enrich your pastoral ministry. But having\nsaid all that, you are not called to be the sole agent of Christian service in your\nParish. You are also called to be an enabler, an encourager; enabling and\nencouraging other people to discover their own gifts, their own ministries.\nAnd so you will be asked:\nWill you encourage God’s people to be good stewards of their gifts, that\nevery member may be equipped for the work of ministering, and that the\nBody of Christ be built up in love?\nAnswer By the help of God, I will.\nAfter the taking of the vows, after the laying on of hands in ordination, Bishop\nFerran, as he prepares to lead us in prayer for Linda, will remind us all:\nBecause none of us can bear the weight of this ministry in our own strength,\nbut only by the grace and power of God,\n‘Only by the grace and power of God…...’ How often, in the busy-ness, do we so\noften lose sight of that. Let me offer you two pictures – one general, one more\npersonal – as we try to reflect on that. Have you ever found yourself on a car\nPage 4 of 5\nOrdination of Rev Linda Frost to the Priesthod\nSt John’s Cathedral, Sligo – 21st September 2014\njourney, the petrol tank is running low, edging towards the empty mark. ‘Sure,\nwe’ll make it home – I’ll get petrol tomorrow.’ Then the orange light goes on, first\nflashing then constant – we realise we are running on empty, that if we don’t find a\ngarage soon then we are stranded.\nThe other one as I say is more personal. I recall when I was in Mountmellick, 25,\n30 years ago. I was at a diocesan conference and Bishop Walton Empey came\nacross to me with a cheery, ‘Kevin, how are things in Mountmellick.’ For some\nreason I did not give the natural reply of the clergy when asked such questions by\ntheir bishop – ‘Wonderful, Bishop.’ Instead I said I wasn’t looking for a move but\nI was feeling very flat. He looked me straight in the eye and said, ‘Kevin, the\nprayer life has gone, hasn’t it?’ He’d hit the nail on the head. I realised I was\nrunning on empty.\nHe packed me off to Glenstall for a few days. It was just what I needed. I learned\na fundamental truth at that time – ‘We can be so busy in the work of the Lord that\nwe forget the Lord of the work.’ I wish I could say that that was the last time I\nfound myself running on empty – but at least I now know what I have to do.\nSo Linda, your Bishop will ask you:\nWill you be diligent in prayer, in reading holy Scripture, and in all studies\nthat will deepen your faith and fit you to uphold the truth of the Gospel?\nAnswer By the help of God, I will.\nWill you then, in the strength of the Holy Spirit, continually stir up the gift\nof God that is in you, to make Christ known to all people?\nAnswer By the help of God, I will.\nFor we can indeed be so busy in the work of the Lord that we forget the Lord of the\nwork. Time is precious; there are so many calls on our time, meetings to attend,\njobs to do, people to see – all of these are important in their own right – but so also\nis this time we give to study, to prayer, to reflection. We short-change ourselves,\nPage 5 of 5\nOrdination of Rev Linda Frost to the Priesthod\nSt John’s Cathedral, Sligo – 21st September 2014\nwe actually short-change the people we are called to serve if we lose sight of this\npart of our ministry. For as the Bishop will remind us as he leads us in prayer:\nBecause none of us can bear the weight of this ministry in our own strength,\nbut only by the grace and power of God ….\nSo we gather here this afternoon Linda on this day of your ordination and we stand\nalongside you as you prepare to take your vows. You come responding to God’s\ncall on your life, that sense of compulsion we were thinking about at the beginning.\nThe God who has called you has gifted you in so many ways, your gentleness, your\nwisdom, your sense of humour, your down to earth common sense. You bring to\nyour calling your deep personal faith that has sustained you in so many ways, that\nyou have shared with us in Howth, that you will share with your people.\nMay God sustain you in the faith that has brought you thus far. May God bless you\nin your ministry of word, of sacrament, of prayer, of service among the people of\nMohill and where ever else God leads you in the years to come. May God bless the\npeople among whom you serve. In your quiet times with the Lord, may you know\nhis presence, his refreshment, his peace. May God bless you and Steve and your\nfamily. You have travelled this road together, you’ve laughed together, cried\ntogether, loved each other – may you be sustained in that love in all that lies ahead\nfor you both.\nJust before Joshua prepared to lead the people of Israel across the Jordan into the\nPromised Land, he called them together in an act of dedication. I say to Linda, to\nthe people of Mohill – the God who called you, the God who has brought you\ntogether has a purpose for you. We say to you, as Joshua said to the people of Israel\nas they stood on the banks of the Jordan; \"Sanctify yourselves; for tomorrow the\nLORD will do wonders among you.\""
    }
}