{
    "title": "Servant Love",
    "date": "2015-04-02",
    "blurb": "This sermon, delivered on Maundy Thursday, 2015, explores the concept of 'Servant Love' as exemplified by Jesus washing the feet of his disciples. It emphasizes the importance of humility, service, and love in the Christian life. The sermon also underscores the importance of receiving God's love before being able to effectively show it to others.",
    "raw_text": "I remember one of my last Confirmation groups in Ahoghill was a group of adults. The Confirmation Service was held on Maundy Thursday in the context of a Holy Week series lead by the Bishop of Connor at the time, Alan Harper, later to become Archbishop of Armagh. In planning the service Bishop Alan and myself thought it would be lovely to incorporate the washing of feet into the service, in which Bishop Alan would wash the feet of the candidates.\n\nOne young lady objected: “I can see why you are suggesting this, it is in the Gospel, it is a lovely idea – but I just could not face the idea of someone washing my feet!” – so we didn’t go ahead.\n\nThere is something about feet isn’t there? My nearest and dearest tell me that my feet are probably best left covered. There is something distasteful, just not quite right, almost demeaning about washing feet – so Christians by and large have side stepped our Lord’s command to wash one another’s feet. We obey his command to share the bread and the wine – but feet – no, we’ll let that one go.\n\nOr else we sanitise it – like the tradition in the United Kingdom of the sovereign distributing Maundy money to a number of people on this day. In the early days the sovereign used to wash feet until one decided it was a bit beneath him.\n\nJesus washing his disciples’ feet goes right to the heart of the depth of servanthood he is modelling, as he stoops to perform this menial task. Kneels at the feet of his friends, silently washes their feet; master who acts a a slave to them.\n\n> 5 Let the same mind be in you that was in Christ Jesus,\n> 6 who, though he was in the form of God,\n> did not regard equality with God\n> as something to be exploited,\n> 7 but emptied himself,\n> taking the form of a slave, (Phil 2:5-7)\n\nTurning to the beginning of our Gospel reading, the account of Jesus washing his disciples’ feet. In the NIV we read:\n\nHaving loved his own who were in the world, he now showed them the full extent of his love.\n\nAs I read that, my mind went back to a time I was putting my older son to bed when he was small. He put his hands about six inches apart and said, ‘Daddy, do you love me this much?’ Then the hands went progressively wider and wider, at each stage asking ‘Daddy, do you love me this much?’\n\nLove at full stretch.\n\nThat is what we remember – love at full stretch, hands stretched out on a cross, nothing held back. Paul continues in those lovely words to the Philippians\n\n> And being found in human form,\n> 8 he humbled himself\n> and became obedient to the point of death--\n> even death on a cross. (Phil 2:7,8)\n\nThat is Servant Love. He goes on to tell his disciples:\n\n> 34 I give you a new commandment, that you love one another. Just as I\n> have loved you, you also should love one another. (John 13:34)\n\nBut if we are to show that love, we have to have some experience of it ourselves. So Peter, the bold impetuous Peter, appalled at the thought of his Lord washing his feet, has to learn that he must first allow Jesus to minister to him. He has to first learn how to receive. This is probably one of the hardest lessons to learn in the Christian life, how to graciously receive service. As we are reminded in the 1st Letter of John, our Christian life begins not with anything we do or we can offer.\n\n> 9 God's love was revealed among us in this way: God sent his only\n> Son into the world so that we might live through him. 10 In this is\n> love, not that we loved God but that he loved us and sent his Son to be\n> the atoning sacrifice for our sins.\n> 19 We love because he first loved us. (1 John 4:9,10, 19)\n\nIt is out of that experience of Servant Love, love at full stretch, nothing held back that we are empowered to show something of that love in the world of today. To live, as David was talking about last night, the prayer that Jesus taught us.\n\nYour Kingdom come\nYour will be done\non earth as it is in heaven.\n\nin lives that lift up the lowly, that turn the other cheek, that go the second mile. It is as we learn to receive that love that we are empowered to proclaim that love – in word, in deed, in life – that God’s Kingdom may be advanced and his name glorified.\n\nO Jesus, Master Carpenter of Nazareth,\nwho on the Cross with wood and nails hast wrought man’s full salvation,\nwield well thy tools in this thy workshop,\nthat we, who come to thee rough-hewn,\nmay by thy hand be fashioned to a truer beauty\nand a greater usefulness;\nfor the honour of thy holy name.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2015/maundaythursday2015.txt",
        "raw_ocr_content": "Page 1 of 3\nMaunday Thursday – 2015 – Sutton Methodist\nI remember one of my last Confirmation groups in Ahoghill was a group of\nadults. The Confirmation Service was held on Maunday Thursday in the\ncontext of a Holy Week series lead by the Bishop of Connor at the time, Alan\nHarper, later to become Archbishop of Armagh. In planning the service\nBishop Alan and myself thought it would be lovely to incorporate the washing\nof feet into the service, in which Bishop Alan would wash the feet of the\ncandidates.\nOne young lady objected: “I can see why you are suggesting this, it is in the\nGospel, it is a lovely idea – but I just could not face the idea of someone\nwashing my feet!” – so we didn’t go ahead.\nThere is something about feet isn’t there? My nearest and dearest tell me that\nmy feet are probably best left covered. There is something distasteful, just not\nquite right, almost demeaning about washing feet – so Christians by and large\nhave side stepped our Lord’s command to wash one anther’s feet. We obey his\ncommand to share the bread and the wine – but feet – no, we’ll let that one go.\nOr else we sanitise it – like the tradition in the United Kingdom of the\nsovereign distributing Maunday money to a number of people on this day. In\nthe early days the sovereign used to wash feet until one decided it was a bit\nbeneath him.\nJesus washing his disciples’ feet goes right to the heart of the depth of\nservanthood he is modelling, as he stoops to perform this menial task.\nKneels at the feet of his friends,\nsilently washes their feet;\nmaster who acts a a slave to them.\nor as we read in those lovely words of Paul to the Philippians\nPage 2 of 3\nMaunday Thursday – 2015 – Sutton Methodist\n5 Let the same mind be in you that was in Christ Jesus,\n6 who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7 but emptied himself,\ntaking the form of a slave, (Phil 2:5-7)\nTurning to the beginning of our Gospel reading, the account of Jesus washing\nhis disciples’ feet. In the NIV we read:\nHaving loved his own who were in the world, he now showed them the\nfull extent of his love.\nAs I read that, my mind went back to a time I was putting my older son to bed\nwhen he was small. He put his hands about six inches apart and said, ‘Daddy,\ndo you love me this much?’ Then the hands went progressively wider and\nwider, at each stage asking ‘Daddy, do you love me this much?’\nLove at full stretch.\nThat is what we remember – love at full stretch, hands stretched out on a cross,\nnothing held back. Paul continues in those lovely words to the Philippians\nAnd being found in human form,\n8 he humbled himself\nand became obedient to the point of death--\neven death on a cross. (Phil 2:7,8)\nThat is Servant Love. He goes on to tell his disciples:\n34 I give you a new commandment, that you love one another. Just as I\nhave loved you, you also should love one another. (John 13:34)\nBut if we are to show that love, we have to have some experience of it\nourselves. So Peter, the bold impetuous Peter, appalled at the thought of his\nLord washing his feet, has to learn that he must first allow Jesus to minister to\nhim. He has to first learn how to receive. This is probably one of the hardest\nPage 3 of 3\nMaunday Thursday – 2015 – Sutton Methodist\nlessons to learn in the Christian life, how to graciously receive service. As we\nare reminded in the 1st Letter of John, our Christian life begins not with\nanything we do or we can offer.\n9 God's love was revealed among us in this way: God sent his only\nSon into the world so that we might live through him. 10 In this is\nlove, not that we loved God but that he loved us and sent his Son to be\nthe atoning sacrifice for our sins.\n19 We love because he first loved us. (1 John 4:9,10, 19)\nIt is out of that experience of Servant Love, love at full stretch, nothing held\nback that we are empowered to show something of that love in the world of\ntoday. To live, as David was talking about last night, the prayer that Jesus\ntaught us.\nYour Kingdom come\nYour will be done\non earth as it is in heaven.\nin lives that lift up the lowly, that turn the other cheek, that go the second mile.\nIt is as we learn to receive that love that we are empowered to proclaim that\nlove – in word, in deed, in life – that God’s Kingdom may be advanced and his\nname glorified.\nO Jesus, Master Carpenter of Nazareth,\nwho on the Cross with wood and nails hast wrought man’s full salvation,\nwield well thy tools in this thy workshop,\nthat we, who come to thee rough-hewn,\nmay by thy hand be fashioned to a truer beauty\nand a greater usefulness;\nfor the honour of thy holy name."
    }
}