{
    "title": "Molly Wilson's Interment",
    "date": "2023-01-29",
    "blurb": "This sermon is a tribute to Molly Wilson, a woman of profound faith and a loving wife, mother, and grandmother. It reflects on her life, her deep faith, her delightful sense of humor, and her love for people. The sermon also highlights her supportive role in her husband Cecil's ministry and her impact on the community.",
    "raw_text": "Interment of ashes of Molly Wilson – All Saints’ Raheny – 29th January 2023\n\n“Abraham breathed his last and died in a good old age, an old man full of years, and was gathered to his people.’\n\nWe gather here in All Saints Church for the final stages of the funeral of Molly Wilson, wife of her best friend, Cecil, his rock, confidant, helper, ever patient with all the strains and limitations of Rectory life. It’s not surprising that Molly left instructions regarding this service. Hymns were picked, readings were chosen, but there was to be no fuss, indicating that she did not want an address. At the risk of being taken out by a bolt of lightning, I’ve agreed to offer some reflections, drawing also on the thoughts of Bruce, Ken, and Robert. Each of us very different in style and temperament, each of us look back on our time as curates here with Cecil and Molly with great affection. As Ken remarked to me a week or so back; ‘To understand Molly, you had to set her alongside Cecil – and vice versa.’ Cecil the more extravert; Molly the more serious – dare we say sensible! Molly gave Cecil the space to be Cecil and supported him in all he did. So Molly, forgive the presumption of ‘the curates’ as we share these thoughts with love and affection.\n\nCecil would often pick an unusual text for his sermons, so I will return to mine. “Abraham breathed his last and died in a good old age, an old man full of years, and was gathered to his people.’\n\nFull of years and years that were full of life. The first thing that I would say of Molly was that she was a woman of deep and profound faith. She would have said that she had a simple faith; simple but not simplistic. This was a faith that sustained her through many challenges and tragedies. The different problems faced by both Geoff and Margaret, the love and support offered through both their journeys as well as having to experience the grief of their premature deaths. We sometimes say of people; ‘So-and-so doesn’t wear their faith on their sleeve.’ Molly Wilson wore her faith on her life, a lovely example of the dictum of St Francis, ‘Preach the Gospel at all times, and, if necessary, use words.’ A wonderful example and inspiration to us all.\n\nShe also had a delightful, sometimes wicked, sense of humour. Molly would have sometimes said that in the Power family, she was seen by her siblings as the ‘runt of the litter’; the youngest, more sickly. The Powers all lived until they were 89 or 90. Sam recalls that when she was 83, she started wondering how much longer she had. 89 came and went; 90 came and went. When she was 92, the family said, ‘You know Molly, as the ‘runt of the litter’, you’ve lasted longer than them all.’ This was followed by a glint in the eye, a fist raised high, and a delighted ‘Yes!’, followed by that lovely laugh.\n\nMolly loved people. Trained as a teacher, she was teacher to her fingertips, finishing her career in the Primary section of Sutton Park School where she is remembered with great affection. Whenever you went to see Molly, she was always interested in you. So, before you could get her news, she would be asking what is your news of family, of Parish or whatever. Whenever you went to go, thank you for coming to see me. I hope I haven’t talked too much about myself. Of course, the love of her life was Cecil. While she would have not put herself forward, she was always a great advocate for Cecil. Curates can be impulsive, impatient beings; anxious to see things moving. I recall one time, as I was leaving the Rectory, Molly saying to me; ‘Kevin, I know you want to see things happening. But please remember, it is Cecil who carries the can.’ Words of wisdom, spoken quietly and gently – and all the more effective for that quietness and gentleness. I remember another time, in the midst of a cold spell, the Rectory, which had no central heating at the time, was cold and Cecil was in bed with recurrent chest trouble. One Sunday, after evening service, Cecil upstairs in bed, Molly asked a couple of the Vestry into the Rectory. Once the door was closed, she quietly explained that the conditions in the Rectory were having an adverse effect on Cecil’s health. Again, words spoken quietly but all the more effective for their quietness and central heating was installed.\n\nShe loved that time of retirement with Cecil as they retired and moved up to Belfast to be near Sam and Margaret and their children. I recall at that time, Cecil and Molly coming to see us in Ahoghill. A new Cecil Wilson got out of the car. Gone was the grey shirt, replaced by a very smart blue shirt and tie; Molly had definitely smartened him up.\n\nThen of course came Cecil’s final illness. They faced it, as they faced everything else in their life together, together. I recall Molly and Margaret at his side, her calm presence, loving him on his way. Of course she missed him, but there was life ahead of her, time to be spent with grandchildren North and South, proud of all their various achievements, ever thankful for the support they offered her.\n\nTo return to my text: “Abraham breathed his last and died in a good old age, an old man full of years, and was gathered to his people.’\n\nWe give thanks to God for the life and witness of Molly Wilson, wife, mother, grandmother, friend, listener, source of wisdom, dying full of years, years that were full of life, now gathered to her people. As we prepare to inter her ashes alongside those of her beloved Cecil, we commend her to the care of the God she served so faithfully here in Raheny & Coolock and in churches across this land.\n\nWell done, thou good and faithful servant; receive the Kingdom prepared for you from the beginning of the age.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Molly Wilson.txt",
        "raw_ocr_content": "Page 1 of 4\nInterment of ashes of Molly Wilson – All Saints’ Raheny – 29th January 2023\n“Abraham breathed his last and died in a good old age, an old man full of\nyears, and was gathered to his people.’\nWe gather here in All Saints Church for the final stages of the funeral of Molly\nWilson, wife of her best friend, Cecil, his rock, confidant, helper, ever patient\nwith all the strains and limitations of Rectory life. It’s not surprising that Molly\nleft instructions regarding this service. Hymns were picked, readings were\nchosen, but there was to be no fuss, indicating that she did not want an address.\nAt the risk of being taken out by a bolt of lightning, I’ve agreed to offer some\nreflections, drawing also on the thoughts of Bruce, Ken, and Robert. Each of\nus very different in style and temperament, each of us look back on our time as\ncurates here with Cecil and Molly with great affection. As Ken remarked to me\na week or so back; ‘To understand Molly, you had to set her alongside Cecil –\nand vice versa.’ Cecil the more extravert; Molly the more serious – dare we\nsay sensible!’ Molly gave Cecil the space to be Cecil and supported him in all\nhe did. So Molly, forgive the presumption of ‘the curates’ as we share these\nthoughts with love and affection.\nCecil would often pick an unusual text for his sermons, so I will return to mine.\n“Abraham breathed his last and died in a good old age, an old man full\nof years, and was gathered to his people.’\nFull of years and years that were full of life. The first thing that I would say of\nMolly was that she was a woman of deep and profound faith. She would have\nsaid that she had a simple faith; simple but not simplistic. This was a faith that\nsustained her through many challenges and tragedies. The different problems\nfaced by both Geoff and Margaret, the love and support offered through both\nPage 2 of 4\nInterment of ashes of Molly Wilson – All Saints’ Raheny – 29th January 2023\ntheir journeys as well as having to experience the grief of their premature\ndeaths. We sometimes say of people; ‘So-and-so doesn’t wear their faith on\ntheir sleeve.’ Molly Wilson wore her faith on her life, a lovely example of the\ndictum of St Francis, ‘Preach the Gospel at all times, and, if necessary, use\nwords.’ A wonderful example and inspiration to us all.\nShe also had a delightful, sometimes wicked, sense of humour. Molly would\nhave sometimes said that in the Power family, she was seen by her siblings as\nthe ‘runt of the litter’; the youngest, more sickly. The Powers all lived until\nthey were 89 or 90. Sam recalls that when she was 83, she started wondering\nhow much longer she had. 89 came and went; 90 came and went. When she\nwas 92, the family said, ‘You know Molly, as the ‘runt of the litter’, you’ve\nlasted longer than them all.’ This was followed by a glint in the eye, a fist\nraised high, and a delighted ‘Yes!’, followed by that lovely laugh.\nMolly loved people. Trained as a teacher, she was teacher to her fingertips,\nfinishing her career in the Primary section of Sutton Park School where she is\nremembered with great affection. Whenever you went to see Molly, she was\nalways interested in you. So, before you could get her news, she would be\nasking what is your news of family, of Parish or whatever. Whenever you went\nto go, thank you for coming to see me. I hope I haven’t talked too much about\nmyself. Of course, the love of her life was Cecil. While she would have not put\nherself forward, she was always a great advocate for Cecil. Curates can be\nimpulsive, impatient beings; anxious to see things moving. I recall one time, as\nI was leaving the Rectory, Molly saying to me; ‘Kevin, I know you want to see\nthings happening. But please remember, it is Cecil who carries the can.’ Words\nPage 3 of 4\nInterment of ashes of Molly Wilson – All Saints’ Raheny – 29th January 2023\nof wisdom, spoken quietly and gently – and all the more effective for that\nquietness and gentleness. I remember another time, in the midst of a cold spell,\nthe Rectory, which had no central heating at the time, was cold and Cecil was\nin bed with recurrent chest trouble. One Sunday, after evening service, Cecil\nupstairs in bed, Molly asked a couple of the Vestry into the Rectory. Once the\ndoor was closed, she quietly explained that the conditions in the Rectory were\nhaving an adverse effect on Cecil’s health. Again, words spoken quietly but all\nthe more effective for their quietness and central heating was installed.\nShe loved that time of retirement with Cecil as they retired and moved up to\nBelfast to be near Sam and Margaret and their children. I recall at that time,\nCecil and Molly coming to see us in Ahoghill. A new Cecil Wilson got out of\nthe car. Gone was the grey shirt, replaced by a very smart blue shirt and tie;\nMolly had definitely smartened him up.\nThen of course came Cecil’s final illness. They faced it, as they faced\neverything else in their life together, together. I recall Molly and Margaret at\nhis side, her calm presence, loving him on his way. Of course she missed him,\nbut there was life ahead of her, time to be spent with grandchildren North and\nSouth, proud of all their various achievements, ever thankful for the support\nthey offered her.\nTo return to my text:\n“Abraham breathed his last and died in a good old age, an old man full\nof years, and was gathered to his people.’\nPage 4 of 4\nInterment of ashes of Molly Wilson – All Saints’ Raheny – 29th January 2023\nWe give thanks to God for the life and witness of Molly Wilson, wife, mother,\ngrandmother, friend, listener, source of wisdom, dying full of years, years that\nwere full of life, now gathered to her people. As we prepare to inter her ashes\nalongside those of her beloved Cecil, we commend her to the care of the God\nshe served so faithfully here in Raheny & Coolock and in churches across this\nland.\nWell done, thou good and faithful servant; receive the Kingdom prepared for\nyou from the beginning of the age."
    }
}