{
    "title": "Fools for Christ's Sake",
    "date": "2012-04-01",
    "blurb": "This sermon reflects on the Beatitudes, particularly focusing on the phrase 'Blessed are the poor in spirit'. It discusses the contrast between God's foolishness and human wisdom, and the radical nature of the Beatitudes' message. The sermon also explores the concept of grace, and the joy and peace that comes from recognizing our total dependence on God.",
    "raw_text": "HOLY WEEK 2012 – Fools for Christ’s sake\n\nReflecting on the Beatitudes – Blessed are the poor in spirit\n\n23 but we proclaim Christ crucified, a stumbling block to Jews and foolishness to Gentiles, 24 but to those who are the called, both Jews and Greeks, Christ the power of God and the wisdom of God. 25 For God's foolishness is wiser than human wisdom, and God's weakness is stronger than human strength. 1 Cor 1:23ff\n\nAs Sonia and I were thinking about Holy Week this year, we first realized that Palm Sunday was April 1st, April Fool’s Day and we immediately thought of this passage from Paul’s 1st Letter to the Church at Corinth. Corinth was probably one of Paul’s more troublesome congregations. There was a wonderful enthusiasm, a searching after spiritual gifts. It was also a very secular city and almost inevitably Church members will have retained a measure of that in their new found Christian life. As we read through this portion of this letter to the Corinthians, with the contrast between God’s foolishness and human wisdom, we turned to the Beatitudes, the opening section of Matthew’s account of the Sermon on the Mount.\n\nAs I remarked yesterday in St Mary’s, I thought of an episode of the political comedy ‘Yes Minister’. James Hacker was discussing some aspect of civil service thought with Sir Humphrey and he asked how did that square with the Sermon on the Mount and the injunction ‘Blessed are the meek.’ Sir Humphrey rather testily observed that the Sermon on the Mount would not have survived a first draft in a Civil Service policy committee.\n\nThe Beatitudes are one of those well known passages that are so familiar, so well known that the words can lose some of their edge. As is the case of the Magnificat, the very familiarity can shield us from the radical nature of its message. ‘God has filled the hungry with good things and the rich he has sent empty away.’ Has he, does he – do we even want him to?\n\nThe very words we use in translating the original text can sometimes have the effect of taming it, taking the edge off it. Take the Beatitudes, a series of statements, all beginning with Blessed – Blessed are the poor in spirit, Blessed are the meek, Blessed are the merciful. What comes into your mind as you hear the word blessed? I don’t know about you, but for me there is an air of sanctity, solemnity or even a sort of ‘churchyness’. It is not the sort of word you will hear in the bar in the Yacht Club or the Rugby Club. If you go back to the Greek in which this passage was written, the word we translate as blessed is the word makavrioi, which is also translated as ‘happy’, joyful.\n\nSo let us run that through again, replacing ‘blessed’ with ‘happy’\n\n\"Happy are the poor in spirit, for theirs is the kingdom of heaven.\n\n\"Happy are those who mourn, for they will be comforted.\n\n\"Happy are the meek, for they will inherit the earth.\n\n\"Happy are those who hunger and thirst for righteousness, for they will be filled.\n\n\"Happy are the merciful, for they will receive mercy.\n\nWhen I read things this way I begin to get a sense of peace, of calm, of acceptance that comes to those who are in tune with God in their lives, who get a sense of God’s presence with them in all the ups and downs of life. With that there should come a sense of joy, of contentment.\n\nSo now let us look briefly at the first of the Beatitudes. ‘Blessed are the poor in spirit, for theirs is the kingdom of heaven.’ Again I ask, what are we thinking of when we say someone is ‘poor’? Is it just that they are hard up? We would often talk of relative poverty. Someone is poor compared to most in their society but not necessarily in comparison to those in the third world. The word used in the Greek of St Matthew’s Gospel is much stronger that this. It has the connotation of poor as in the status of a beggar, one who has nothing, who is at rock bottom. So how can our Lord talk of someone in that position as being happy or joyful? Then I thought, maybe to be poor in spirit is to recognize one’s total dependence on God. That brought to my mind the words of the hymn ‘Rock of ages’\n\nNot the labours of my hands\ncan fulfil thy law’s demands;\ncould my zeal no respite know,\ncould my tears for ever flow,\nall for sin could not atone:\nthou must save, and thou alone.\n\nWhich brings us into the whole area of grace; the realization that it does not all depend on me, my virtue, my strength, my discipline but on God. Grace, God living and present in my life; God strengthening me in my weakness; God forgiving me in my waywardness; God sustaining me, inspiring me, guiding me in my daily life.\n\nThat is indeed to be blessed; that is to find real joy in the presence of God; that is to enter into the kingdom prepared for us from the beginning of the world. I will just close with the words of a hymn based on a portion of St Patrick’s breastplate:\n\n1 Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part.\n\n2 Christ on my right hand,\nChrist on my left hand,\nChrist all around me,\nshield in the strife.\nChrist in my sleeping,\nChrist in my sitting,\nChrist in my rising,\nnever to part.\n\nHymn 611",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2012/mondy2012.txt",
        "raw_ocr_content": "Page 1 of 3\nHOLY WEEK 2012 – Fools for Christ’s sake\nReflecting on the Beatitudes – Blessed are the poor in spirit\n23 but we proclaim Christ crucified, a stumbling block to Jews and foolishness to Gentiles,\n24 but to those who are the called, both Jews and Greeks, Christ the power of God and the\nwisdom of God. 25 For God's foolishness is wiser than human wisdom, and God's\nweakness is stronger than human strength. 1 Cor 1:23ff\nAs Sonia and I were thinking about Holy Week this year, we first realized that\nPalm Sunday was April 1st, April Fool’s Day and we immediately thought of\nthis passage from Paul’s 1st Letter to the Church at Corinth. Corinth was\nprobably one of Paul’s more troublesome congregations. There was a\nwonderful enthusiasm, a searching after spiritual gifts. It was also a very\nsecular city and almost inevitably Church members will have retained a\nmeasure of that in their new found Christian life. As we read through this\nportion of this letter to the Corinthians, with the contrast between God’s\nfoolishness and human wisdom, we turned to the Beatitudes, the opening\nsection of Matthew’s account of the Sermon on the Mount.\nAs I remarked yesterday in St Mary’s, I thought of an episode of the political\ncomedy ‘Yes Minister’. James Hacker was discussing some aspect of civil\nservice thought with Sir Humphrey and he asked how did that square with the\nSermon on the Mount and the injunction ‘Blessed are the meek.’ Sir\nHumphrey rather testily observed that the Sermon on the Mount would not\nhave survived a first draft in a Civil Service policy committee.\nThe Beatitudes are one of those well known passages that are so familiar, so\nwell known that the words can lose some of their edge. As is the case of the\nMagnificat, the very familiarity can shield us from the radical nature of its\nmessage. ‘God has filled the hungry with good things and the rich he has sent\nempty away.’ Has he, does he – do we even want him to?\nPage 2 of 3\nHOLY WEEK 2012 – Fools for Christ’s sake\nReflecting on the Beatitudes – Blessed are the poor in spirit\nThe very words we use in translating the original text can sometimes have the\neffect of taming it, taking the edge off it. Take the Beatitudes, a series of\nstatements, all beginning with Blessed – Blessed are the poor in spirit, Blessed\nare the meek, Blessed are the merciful. What comes into your mind as you\nhear the word blessed? I don’t know about you, but for me there is an air of\nsanctity, solemnity or even a sort of ‘churchyness’. It is not the sort of word\nyou will hear in the bar in the Yacht Club or the Rugby Club. If you go back to\nthe Greek in which this passage was written, the word we translate as blessed is\nthe word makavrioi, which is also translated as ‘happy’, joyful.\nSo let us run that through again, replacing ‘blessed’ with ‘happy’\n\"Happy are the poor in spirit, for theirs is the kingdom of heaven.\n\"Happy are those who mourn, for they will be comforted.\n\"Happy are the meek, for they will inherit the earth.\n\"Happy are those who hunger and thirst for righteousness, for they will be filled.\n\"Happy are the merciful, for they will receive mercy.\nWhen I read things this way I begin to get a sense of peace, of calm, of\nacceptance that comes to those who are in tune with God in their lives, who get\na sense of God’s presence with them in all the ups and downs of life. With that\nthere should come a sense of joy, of contentment.\nSo now let us look briefly at the first of the Beatitudes. ‘Blessed are the poor\nin spirit, for theirs is the kingdom of heaven.’ Again I ask, what are we\nthinking of when we say someone is ‘poor’? Is it just that they are hard up?\nWe would often talk of relative poverty. Someone is poor compared to most in\ntheir society but not necessarily in comparison to those in the third world. The\nword used in the Greek of St Matthew’s Gospel is much stronger that this. It\nhas the connotation of poor as in the status of a beggar, one who has nothing,\nwho is at rock bottom. So how can our Lord talk of someone in that position as\nbeing happy or joyful? Then I thought, maybe to be poor in spirit is to\nPage 3 of 3\nHOLY WEEK 2012 – Fools for Christ’s sake\nReflecting on the Beatitudes – Blessed are the poor in spirit\nrecognize one’s total dependence on God. That brought to my mind the words\nof the hymn ‘Rock of ages’\nNot the labours of my hands\ncan fulfil thy law’s demands;\ncould my zeal no respite know,\ncould my tears for ever flow,\nall for sin could not atone:\nthou must save, and thou alone.\nWhich brings us into the whole area of grace; the realization that it does not all\ndepend on me, my virtue, my strength, my discipline but on God. Grace, God\nliving and present in my life; God strengthening me in my weakness; God\nforgiving me in my waywardness; God sustaining me, inspiring me, guiding\nme in my daily life.\nThat is indeed to be blessed; that is to find real joy in the presence of God; that\nis to enter into the kingdom prepared for us from the beginning of the world. I\nwill just close with the words of a hymn based on a portion of St Patrick’s\nbreastplate:\n1 Christ be beside me,\nChrist be before me,\nChrist be behind me,\nKing of my heart.\nChrist be within me,\nChrist be below me,\nChrist be above me,\nnever to part.\n2 Christ on my right hand,\nChrist on my left hand,\nChrist all around me,\nshield in the strife.\nChrist in my sleeping,\nChrist in my sitting,\nChrist in my rising,\nnever to part.\nHymn 611"
    }
}