{
    "title": "Funeral of Mr Paul Smeed",
    "date": "2021-01-19",
    "blurb": "This sermon is a touching tribute to Mr Paul Smeed, a man remembered for his love for life, his family, and his community. Despite his illness, he faced life with courage and determination. The sermon offers comfort and hope, reminding us of the Christian belief in life after death and the promise of peace in the presence of God.",
    "raw_text": "This morning we have gathered in St Mary’s for the funeral of Mr Paul Smeed. His family remember a family man, a man with a love and zest for life. A native of England, he had made his home here in Howth and had fully entered into the life of this community, very proud of this place. They remember a father and a grandfather, a loving husband to his wife Aileen. They remember a man who faced illness with a dogged defiance. The deterioration over the last few years has been hard for the family to watch, hard for Paul. As David has said, 'he was told over two years ago that he had been dealt this ‘bad hand’ but being the true professional and character that he was, he played that bad hand so well.’\n\nI think of words from the 2nd Letter to Timothy as Paul proclaims, ‘I have fought the good fight, I have finished the race, I have kept the faith.’ Today is a day for you to come before God with your own particular memories of Paul and give thanks to God for all that he has meant to you as husband, as father, as grandfather and friend, to thank God for all that was good and true in his life, his courage in the face of adversity, his love and friendship.\n\nIn the ordinary course of event, this Church would have been full for this service as Paul’s many friends as well as those of his family would have gathered here to give thanks to God for the life of Paul Smeed and to support you his family in this your time of loss. Many will be watching this online and they will be supporting you now with their love and prayers and will support you in the days that lie ahead.\n\nThis morning we have read as our lesson those lovely words from Revelation. Coming at the end of a tumultuous book of visions of conflict in the end times this passage speaks of peace in the presence of God:\n\n\"See, the home of God is among mortals.\nHe will dwell with them as their God;\nthey will be his peoples,\nand God himself will be with them;\n4 he will wipe every tear from their eyes.\nDeath will be no more;\nmourning and crying and pain will be no more,\nfor the first things have passed away.\"\n\nThat is our hope for Paul, our hope for ourselves. The last two years have been very tough, tough on Paul, tough on Aileen, tough on his family as they watched him battle it out, a battle in which no quarter was given, throughout which he sought to live life to the full. Now his struggle is past and our hope and prayer for Paul is peace in the closer presence of God.\n\nWe come to set the mystery of death in the context of our Christian faith. I often find myself turning to those lovely words from the Gospel of John that we read on Christmas Day:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nDarkness has not had the last word in the life of Paul Smeed. Sickness, weakness has not had the final say. In fellowship with the Apostle John, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nSituated as we are, on this beautiful hill of Howth, where we can stand and watch ferries come and go, I will just leave you with this piece.\n\nA Parable of Immortality.\n\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\nShe is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\n\nShe is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says, ‘There she goes!’,\nthere are other eyes watching her coming, and other voices ready to take up the glad shout :\n‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mr Paul Smeed.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mr Paul Smeed – 19th January 2021\nThis morning we have gathered in St Mary’s for the funeral of Mr Paul Smeed. His family\nremember a family man, a man with a love and zest for life. A native of England, he had\nmade his home here in Howth and had fully entered into the life of this community, very\nproud of this place. They remember a father and a grandfather, a loving husband to his\nwife Aileen. They remember a man who faced illness with a dogged defiance. The\ndeterioration over the last few years has been hard for the family to watch, hard for Paul.\nAs David has said, ‘he was told over two years ago that he had been dealt this ‘bad hand’\nbut being the true professional and character that he was, he played that bad hand so well.’\nI think of words from the 2nd Letter to Timothy as Paul proclaims, ‘I have fought the good\nfight, I have finished the race, I have kept the faith.’ Today is a day for you to come\nbefore God with your own particular memories of Paul and give thanks to God for all that\nhe has meant to you as husband, as father, as grandfather and friend, to thank God for all\nthat was good and true in his life, his courage in the face of adversity, his love and\nfriendship.\nIn the ordinary course of event, this Church would have been full for this service as Paul’s\nmany friends as well as those of his family would have gathered here to give thanks to\nGod for the life of Paul Smeed and to support you his family in this your time of loss.\nMany will be watching this online and they will be supporting you now with their love and\nprayers and will support you in the days that lie ahead.\nThis morning we have read as our lesson those lovely words from Revelation. Coming at\nthe end of a tumultuous book of visions of conflict in the end times this passage speaks of\npeace in the presence of God:\n\"See, the home of God is among mortals.\nHe will dwell with them as their God;\nthey will be his peoples,\nand God himself will be with them;\n4 he will wipe every tear from their eyes.\nDeath will be no more;\nmourning and crying and pain will be no more,\nfor the first things have passed away.\"\nThat is our hope for Paul, our hope for ourselves. The last two years have been very\ntough, tough on Paul, tough on Aileen, tough on his family as they watched him battle it\nPage 2 of 3\nFuneral of Mr Paul Smeed – 19th January 2021\nout, a battle in which no quarter was given, throughout which he sought to live life to the\nfull. Now his struggle is past and our hope and prayer for Paul is peace in the closer\npresence of God.\nWe come to set the mystery of death in the context of our Christian faith. I often find\nmyself turning to those lovely words from the Gospel of John that we read on Christmas\nDay:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nDarkness has not had the last word in the life of Paul Smeed. Sickness, weakness has not\nhad the final say. In fellowship with the Apostle John, we follow a Lord who knows what\ndeath, what suffering, what loss is all about; one who knew what it was like to weep at the\ngrave of his friend Lazarus. Not only that, he is the one who was raised triumphant over\ndeath, breaking the power of death itself. Knowing in his own person what it was all\nabout, I find in him one to whom I cam come in my own time of suffering and find real\ncomfort, real strength and real hope.\nSituated as we are, on this beautiful hill of Howth, where we can stand and watch ferries\ncome and go, I will just leave you with this piece.\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nPage 3 of 3\nFuneral of Mr Paul Smeed – 19th January 2021\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}