{
    "title": "Remembering Mr. Pat Curley",
    "date": "2017-11-22",
    "blurb": "This sermon is a tribute to Mr. Pat Curley, who passed away suddenly. It reflects on his life, his faith, and the impact he had on those around him. The sermon also offers comfort and support to those mourning his loss, reminding them of the enduring presence of God in times of sorrow.",
    "raw_text": "Funeral of Mr Pat Curley – 22nd November 2017\n\nA sense of unbelief, of shock went around the Parish last Friday as the news broke that Pat Curley had died suddenly in his home. So we can only imagine the shock experienced by his son David and wife Mary, who was away on a trade mission in the Far East.\n\nPeople are still saying, ‘Sure I was only talking to him a few days ago in the Marine, the coffee shop or wherever.’ So we find ourselves here today in St Mary’s, a church where Pat and the family have worshipped for many years, to give thanks to God for the life and witness of Pat Curley, as husband, as father, as brother, colleague and friend.\n\nWe come also to pray for those who will miss him most, to assure Mary, David and Amanda, Eamon and Mary and all who loved him of our love and support not just for today, but for the days that lie ahead for you all.\n\nWe come to set the mystery of life and death, of loss in the context of faith; that if we cannot understand the searing pain of loss, we may know that we do not face it alone, that God hears our pain, understands our pain, indeed feels our pain.\n\nWhat are our memories of Pat? Mary remembers a young civil servant chatting her up at a bus stop; the date of that first encounter celebrated year by year. A love match; that love remained for all to see, shared in the home they built, as they reared their son, and just enjoyed their time together. David remembers a father fiercely proud of his son and all that he has achieved and the partner he has found in Amanda.\n\nPat had a distinctive sense of humour. In seemingly off hand comments he would say something quite profound. Mary recalls an occasion when they were chatting about life when Pat remarked; ‘When I’m up in St Mary’s in my wooden suit, I hope there will be people there whose lives I have touched.’\n\nWell, sadly and unexpectedly, Pat is now here in his wooden suit and I would suspect that there are indeed many here whose lives have been touched by Pat Curley. Speaking with a friend of Pat’s a couple of days ago, he summed up his memories of Pat in two words – proud and time. Proud in the best sense of the word; proud of Mary, of David, of the life and home they had built together, of his professional life. Time, in that Pat gave something that is more and more precious – his time. Time to listen, to help, to encourage. There are many more here who have their own stories to tell of, in the words of his death notice, a listening ear and a mindful guide.\n\nWe remember a man of compassion. We also remember a determined man, a man with a strong sense of right and wrong, of justice and fairness. It is with this in mind that the family chose as our first reading that lovely passage from Micah 6 \"With what shall I come before the LORD, and bow myself before God on high? …… He has told you, O mortal, what is good; and what does the LORD require of you but to do justice, and to love kindness, and to walk humbly with your God? Micah 6:6,8\n\nI remember a man of faith. Always one of the first to arrive at Church for a service – though I never managed to get him out of the back seat. He held a sincere but not a simplistic faith. I recall, when he was supporting a cousin who had a long and a difficult battle with MS, saying to me one evening in the house; ‘Kevin I sometimes think the Almighty has gone AWOL on this one.’ God can take our questions, our pain – and Pat understood that. That faith expressed itself in a deep appreciation and love of the Church of Ireland\n\nHe served this Parish on the Select Vestry, as Church Warden and as Parish Reader. On Vestry his contributions would have been well considered, well argued and given with the very best interests of the Parish at heart.\n\nYou will have come with your own memories of Pat Curley – I invite you to hold them before God and give thanks to God for the ways in which he has touched an enriched your own life.\n\nWe come to set the mystery of death in the context of our Christian faith. As I said, Pat had a deeply held, sincere Christian faith, expressed in regular worship, in living that faith in his work and leisure, in his family life.\n\nWe will soon be celebrating Christmas and Pat would have been here, enjoying the carols, the midnight communion, the fellowship. He would have known well those lovely words from St John’s Gospel at this time of year:-\n\n4What has come into being in him was life, and the life was the light of all people. 5The light shines in the darkness, and the darkness did not overcome it.\n\n12But to all who received him, who believed in his name, he gave power to become children of God, 13who were born, not of blood or of the will of the flesh or of the will of man, but of God.\n\nDarkness has not had the last word in the life of Pat Curley. Ill health has taken it’s toll but it has not had the final say. A light has gone out in our lives. But the light shines on, the light of Christ, risen, ascended, glorified. Our hope and prayer this day is life and peace for Pat in the closer presence of the God he served and worshipped, free from all the weakness and frailty of our mortal body as he completes that journey, begun in Baptism, into the fullness of God’s love.\n\nWell done, thou good and faithful servant. Receive the kingdom prepared for you from the beginning of the world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mr Pat Curley.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mr Pat Curley – 22nd November 2017\nA sense of unbelief, of shock went around the Parish last Friday as the news\nbroke that Pat Curley had died suddenly in his home. So we can only imagine\nthe shock experienced by his son David and wife Mary, who was away on a\ntrade mission in the Far East,.\nPeople are still saying, ‘Sure I was only talking to him a few days ago in the\nMarine, the coffee shop or wherever.’\nSo we find ourselves here today in St Mary’s, a church where Pat and the\nfamily have worshipped for many years, to give thanks to God for the life and\nwitness of Pat Curley, as husband, as father, as brother, colleague and friend.\nWe come also to pray for those who will miss him most, to assure Mary, David\nand Amanda, Eamon and Mary and all who loved him of our love and support\nnot just for today, but for the days that lie ahead for you all,.\nWe come to set the mystery of life and death, of loss in the context of faith;\nthat if we cannot understand the searing pain of loss, we may know that we do\nnot face it alone, that God hears our pain, understands our pain, indeed feels\nour pain.\nWhat are our memories of Pat? Mary remembers a young civil servant\nchatting her up at a bus stop; the date of that first encounter celebrated year by\nyear. A love match; that love remained for all to see, shared in the home they\nbuilt, as they reared their son, and just enjoyed their time together. David\nPage 2 of 4\nFuneral of Mr Pat Curley – 22nd November 2017\nremembers a father fiercely proud of his son and all that he has achieved and\nthe partner he has found in Amanda.\nPat had a distinctive sense of humour. In seemingly off hand comments he\nwould say something quite profound. Mary recalls an occasion when they\nwere chatting about life when Pat remarked; ‘When I’m up in St Mary’s in my\nwooden suit, I hope there will be people there whose lives I have touched.’\nWell, sadly and unexpectedly, Pat is now here in his wooden suit and I would\nsuspect that there are indeed many here whose lives have been touched by Pat\nCurley. Speaking with a friend of Pat’s a couple of days ago, he summed up\nhis memories of Pat in two words – proud and time. Proud in the best sense of\nthe word; proud of Mary, of David, of the life and home they had built\ntogether, of his professional life. Time, in that Pat gave something that is more\nand more precious – his time. Time to listen, to help, to encourage. There are\nmany more here who have their own stories to tell of, in the words of his death\nnotice, a listening ear and a mindful guide.\nWe remember a man of compassion. We also remember a determined man, a\nman with a strong sense of right and wrong, of justice and fairness. It is with\nthis in mind that the family chose as our first reading that lovely passage from\nMicah\n6 \"With what shall I come before the LORD,\nand bow myself before God on high?\n…………………………………………..\n8 He has told you, O mortal, what is good;\nand what does the LORD require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God? Micah 6:6,8\nPage 3 of 4\nFuneral of Mr Pat Curley – 22nd November 2017\nI remember a man of faith. Always one of the first to arrive at Church for a\nservice – though I never managed to get him out of the back seat. He held a\nsincere but not a simplistic faith. I recall, when he was supporting a cousin\nwho had a long and a difficult battle with MS, saying to me one evening in the\nhouse; ‘Kevin I sometimes think the Almighty has gone AWOL on this one.’\nGod can take our questions, our pain – and Pat understood that. That faith\nexpressed itself in a deep appreciation and love of the Church of Ireland\nHe served this Parish on the Select Vestry, as Church Warden and as Parish\nReader. On Vestry his contributions would have been well considered, well\nargued and given with the very best interests of the Parish at heart.\nYou will have come with your own memories of Pat Curley – I invite you to\nhold them before God and give thanks to God for the ways in which he has\ntouched an enriched your own life.\nWe come to set the mystery of death in the context of our Christian faith. As I\nsaid, Pat had a deeply held, sincere Christian faith, expressed in regular\nworship, in living that faith in his work and leisure, in his family life.\nWe will soon be celebrating Christmas and Pat would have been here, enjoying\nthe carols, the midnight communion, the fellowship. He would have known\nwell those lovely words from St John’s Gospel at this time of year:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\nPage 4 of 4\nFuneral of Mr Pat Curley – 22nd November 2017\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nDarkness has not had the last word in the life of Pat Curley. Ill health has\ntaken it’s toll but it has not had the final say. A light has gone out in our lives.\nBut the light shines on, the light of Christ, risen, ascended, glorified. Our hope\nand prayer this day is life and peace for Pat in the closer presence of the God\nhe served and worshipped, free from all the weakness and frailty of our mortal\nbody as he completes that journey, begun in Baptism, into the fullness of God’s\nlove.\nWell done, thou good and faithful servant. Receive the kingdom prepared for\nyou from the beginning of the world."
    }
}