{
    "title": "Eleanor Whiting's Funeral",
    "date": "2011-01-14",
    "blurb": "This sermon is a tribute to the life of Mrs. Eleanor Whiting, a woman of quiet sincere faith, who was a regular at the 9:30 service. She was a nurse, a wife, a mother, and a grandmother. Despite her health challenges in her later years, she maintained her independence and interest in life. The sermon also reflects on the Christian understanding of death and the hope of resurrection.",
    "raw_text": "When I first came here as Rector in 2005 I quickly came to recognise the different atmosphere of our two morning services. The quieter atmosphere of the 9:30 with its smaller numbers; the 11:00 with its larger numbers and greater sense of movement. One of the regulars at the 9:30 in those early days until relatively recently would have been Mrs Eleanor Whiting. Smartly dressed, cheerful, quietly spoken, a lady with a quiet sincere faith. When I went to visit her in her home in Corr Castel she spoke with obvious pride of her late husband Sydney and their children, Gerald, John, Robert, Elizabeth and Peter.\n\nShe had spoken of her Canadian origins. She had been brought up, one of five children, in a remote fishing and seal hunting community in Newfoundland. Her maritime roots are reflected in the choice of one of the hymns for her funeral ‘Eternal Father, strong to save.’ She trained as a nurse and she ended up nursing a South African pilot in the Royal Canadian Air Force who had been badly injured in a crash. That young man, Sydney Whiting was to become her husband. After leaving the Air Force, flying took Sydney and Eleanor to a number of places until finally a job in Aer Lingus brought the family to Dublin and their home in Offington Park. Here the family settled into the community here with the children attending the Burrow School and the old Mountjoy School and St Andrews. They also settled into the life of the Parish here, teaching in the Sunday School, singing in the choir.\n\nEleanor was always very much a family person and even when the family emigrated they were very much to the forefront of her thoughts. There were the trips to Australia to visit them, the regular weekend phone calls. Photos in the house recorded the progress of the various grandchildren. She will be remembered with great affection by a number of good friends who enjoyed her company as she enjoyed theirs. She will be remembered with great affection by the people of St Mary’s. Her participation in the worship in this place, the God she encountered and trusted were important to her, often mentioned in phone calls to the family and we will miss her presence.\n\nIn recent times her health had not been good and she was more and more confined to her home. In times past she had maintained her health and fitness and something of that came out in her determination to keep going, maintaining her own independence. And so throughout all this she maintained an interest in all that was going on, getting out whenever she could.\n\nThose of us outside the immediate family circle have come to support with our presence and our prayers those who will miss Eleanor most. We think of her children, Gerald, John, Robert, Elizabeth and Peter; her brothers Weldon and Wilfred and her grandchildren. The loss of a loved one is always difficult. Loss at a distance has an added edge. We travel back in a rush, our minds and emotions in something of a turmoil. May you find in this place something of the peace that Eleanor found here. May you know that you are among friends who understand and who feel for you, who as part of their honouring of their memories of Eleanor will remember you in their hearts as you travel home.\n\nWe come to set the mystery of death in the context of our Christian faith. We have just celebrated the festival of Christmas, the feast of the Incarnation, Emmanuel, God among us in the person of Jesus Christ. Over Christmas we heard those lovely words from St John’s Gospel:-\n\n'What has come into being in him was life, and the life was the light of all people. The light shines in the darkness, and the darkness did not overcome it. But to all who received him, who believed in his name, he gave power to become children of God, who were born, not of blood or of the will of the flesh or of the will of man, but of God.'\n\nDarkness has not had the last word in the life of Eleanor Whiting. Sickness, weakness has not had the final say. In fellowship with the Apostle John, we follow a Lord who knows what death, what suffering, what loss is all about; one who knew what it was like to weep at the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant over death, breaking the power of death itself. Knowing in his own person what it was all about, I find in him one to whom I cam come in my own time of suffering and find real comfort, real strength and real hope.\n\nHaving grown up in a fishing village, it is appropriate that she was to spend her final days in a fishing village, albeit in one with a milder and gentler climate than Newfoundland.\n\nThe following is a poem that sets our hope for Eleanor Whiting and for ourselves in the context of the sailing traditions of the different places in which she spent so much of her life:\n\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\nShe is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says, ‘There she goes!’,\nthere are other eyes watching her coming, and other voices ready to take up the glad shout :\n‘Here she comes!’",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Eleanor Whiting.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Mrs Eleanor Whiting – 14th January2011\nWhen I first came here as Rector in 2005 I quickly came to recognise the different\natmosphere of our two morning services. The quieter atmosphere of the 9:30 with its\nsmaller numbers; the 11:00 with its larger numbers and greater sense of movement. One\nof the regulars at the 9:30 in those early days until relatively recently would have been Mrs\nEleanor Whiting. Smartly dressed, cheerful, quietly spoken, a lady with a quiet sincere\nfaith. When I went to visit her in her home in Corr Castel she spoke with obvious pride of\nher late husband Sydney and their children, Gerald, John, Robert, Elizabeth and Peter.\nShe had spoken of her Canadian origins. She had been brought up, one of five children, in\na remote fishing and seal hunting community in Newfoundland. Her maritime roots are\nreflected in the choice of one of the hymns for her funeral ‘Eternal Father, strong to save.’\nShe trained as a nurse and she ended up nursing a South African pilot in the Royal\nCanadian Air Force who had been badly injured in a crash. That young man, Sydney\nWhiting was to become her husband. After leaving the Air Force, flying took Sydney and\nEleanor to a number of places until finally a job in Aer Lingus brought the family to\nDublin and their home in Offington Park. Here the family settled into the community here\nwith the children attending the Burrow School and the old Mountjoy School and St\nAndrews. They also settled into the life of the Parish here, teaching in the Sunday School,\nsinging in the choir.\nEleanor was always very much a family person and even when the family emigrated they\nwere very much to the forefront of her thoughts. There were the trips to Australia to visit\nthem, the regular weekend phone calls. Photos in the house recorded the progress of the\nvarious grandchildren. She will be remembered with great affection by a number of good\nfriends who enjoyed her company as she enjoyed theirs. She will be remembered with\ngreat affection by the people of St Mary’s. Her participation in the worship in this place,\nthe God she encountered and trusted were important to her, often mentioned in phone calls\nto the family and we will miss her presence.\nPage 2 of 3\nFuneral of Mrs Eleanor Whiting – 14th January2011\nIn recent times her health had not been good and she was more and more confined to her\nhome. In times past she had maintained her health and fitness and something of that came\nout in her determination to keep going, maintaining her own independence. And so\nthroughout all this she maintained an interest in all that was going on, getting out\nwhenever she could.\nThose of us outside the immediate family circle have come to support with our presence\nand our prayers those who will miss Eleanor most. We think of her children, Gerald, John,\nRobert, Elizabeth and Peter; her brothers Weldon and Wilfred and her grandchildren. The\nloss of a loved one is always difficult. Loss at a distance has an added edge. We travel\nback in a rush, our minds and emotions in something of a turmoil. May you find in this\nplace something of the peace that Eleanor found here. May you know that you are among\nfriends who understand and who feel for you, who as part of their honouring of their\nmemories of Eleanor will remember you in their hearts as you travel home.\nWe come to set the mystery of death in the context of our Christian faith. We have just\ncelebrated the festival of Christmas, the feast of the Incarnation, Emmanuel, God among\nus in the person of Jesus Christ. Over Christmas we heard those lovely words from St\nJohn’s Gospel:-\n4What has come into being in him was life, and the life was the light of\nall people. 5The light shines in the darkness, and the darkness did not\novercome it.\n12But to all who received him, who believed in his name, he gave\npower to become children of God, 13who were born, not of blood or of\nthe will of the flesh or of the will of man, but of God.\nDarkness has not had the last word in the life of Eleanor Whiting. Sickness, weakness has\nnot had the final say. In fellowship with the Apostle John, we follow a Lord who knows\nwhat death, what suffering, what loss is all about; one who knew what it was like to weep\nat the grave of his friend Lazarus. Not only that, he is the one who was raised triumphant\nover death, breaking the power of death itself. Knowing in his own person what it was all\nPage 3 of 3\nFuneral of Mrs Eleanor Whiting – 14th January2011\nabout, I find in him one to whom I cam come in my own time of suffering and find real\ncomfort, real strength and real hope.\nHaving grown up in a fishing village, it is appropriate that she was to spend her final days\nin a fishing village, albeit in one with a milder and gentler climate than Newfoundland.\nThe following is a poem that sets our hope for Eleanor Whiting and for ourselves in the\ncontext of the sailing traditions of the different places in which she spent so much of her\nlife:\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}