{
    "title": "Remembering Audrey Jermyn",
    "date": "2019-05-29",
    "blurb": "This sermon is a tribute to Audrey Dickson (Jermyn), who lived a life full of vitality and faith. Audrey was a beloved member of the Howth Presbyterian Church, who served her community with compassion and practicality. Her sudden passing left a deep void, but her life and faith serve as an inspiration for all. The sermon also reflects on the rhythm of life and our own mortality, encouraging us to live in service of others and God.",
    "raw_text": "Last Thursday morning Audrey Dickson was at her exercise class. It was the last of the season and at the end Audrey got up to thank the teacher on behalf of the class for keeping them all well. From there she went to join friends on Sutton beach for a swim. It is there that she was suddenly taken ill and she died in the early hours of Friday morning in Beaumont Hospital. As the family said in the death notice Audrey died 'doing what she did best, living life to the full, with friends and family.'\n\nHer death, and the sudden and unexpected nature of her death, has left her family and her friends and the wider community shocked and shattered. This is a measure of how widely loved and cherished this gentle and generous woman was esteemed.\n\nThe daughter of a Naval Architect, she had lived in Scotland and England before coming to Ireland on marriage. Here she reared her four sons, David, Alan, Gary and Ian. Life was not always easy for her and in those times she found a spiritual home for herself and her family here in Howth Presbyterian Church. On marriage to her beloved Cecil, she joined the Parish of Howth. With St Mary’s Church closed for renovations, it is fitting that her funeral is held here and the family are grateful to the congregation of Howth Presbyterian Church for making this place available.\n\nWe all come here with our own particular memories of Audrey. The family have already shared their own particular memories. We remember a lady who threw herself into the life of her family, her Church and her community. She brought a down to earth, practical, common sense approach to things which meant she was very effective on committees and several people have remarked how effective she was in the chair at meetings. She brought not just her practicality, she brought her humanity. In my early days here she was on Select Vestry. I remember at one stage, there had been some difficulties, I picked up the phone in the office and it was Audrey. 'How are you? I just sense this is a difficult time for you.' We chatted for a while and I put down the phone feeling more at peace. And I would suspect that many of you can recall similar experiences.\n\nI spoke of her humanity that was expressed in a care and concern for others that was an outworking of her profound and well thought through Christian faith, living out the command of Christ: \"All things, therefore, that you want men to do to you, you also must do to them\".\n\nWe saw that humanity beautifully expressed in her love and care of Cecil. In the early days of their marriage they relished the opportunities of travel, of doing things together, of just being together. As Cecil’s health declined Audrey did everything to help Cecil retain his independence, his dignity, his humanity, bringing him to Church, to meetings, to family celebrations; and when care was beyond even Audrey’s capacity, visiting and cherishing him in the nursing home.\n\nWe come here today to thank God for this wonderful, warm human being. We come also to support with our presence, our prayers and our love, those who will miss her most. We think of her sons, David, Alan, Gary and Ian as well as Cecil’s sons David and Gary to whom she became a loving mother as well as grandchildren and close friends. You will be very much in our thoughts and prayers not only today but in the days and weeks to come and you come to terms with life without Audrey.\n\nWe come also to set our loss of Audrey and our own life and death in the context of our Christian faith. I spoke earlier of a profound Christian faith that was lived out in daily life, in love and service of others. The books that the family came across on her bookshelves speak of a heart and mind still searching, seeking deeper understanding. Out of that faith, I sense someone who was comfortable with her mortality. I think it fitting that one of the lessons chosen by the family for this service is that lovely passage from Ecclesiastes, that speaks of the rhythm of life:\n\na time to be born, and a time to die;\n\na time to weep, and a time to laugh;\n\na time to mourn, and a time to dance;\n\na time to seek, and a time to lose;\n\na time to keep, and a time to throw away;\n\na time to keep silence, and a time to speak;\n\nI sense someone who picked up that rhythm in her own life, who found a peace and contentment in her own faith in the God and Father of our Lord Jesus Christ. In life and in death she stands as a wonderful example of life lived in the service of others and the God she met in worship in this place and in St Mary’s.\n\nA time such as this is a time to reflect on our own mortality. In the hustle and bustle of life it is easy to push such things into the background. May Audrey’s example of life lived in faith inspire each one of us to reflect on God’s love for us in Christ.\n\nShe wrote a poem back in the year 2000 which some of her grandchildren are going to read, 'The Pleasures of Growing Older' in which something of that faith, that comfort with her mortality shines through, ending with a simple prayer of trust:\n\nGod be kind to me in my fading years,\n\nWhen mind and body decay.\n\nLet me go quickly and peacefully\n\nSurrounded by love.\n\nEven in their pain, the family are thankful that her prayer was answered.\n\nIn earlier days, Audrey got great pleasure form sailing. From the window in 'Avalon' Audrey and Cecil must have spent many happy hours looking out over Howth Harbour. The following is a poem that sets our hope for Audrey and for ourselves in the sailing tradition of this lovely place:\n\nA Parable of Immortality.\n\nI am standing by the seashore.\n\nA ship at my side spreads her white sails to the morning breeze and starts for the blue ocean.\n\nShe is an object of beauty and strength, and I stand and watch until at last she hangs like a speck of white cloud just where the sun and sky come down to mingle with each other.\n\nThen someone at my side says, 'There she goes! '\n\nGone where? Gone from my sight - that is all.\n\nShe is just as large in mast and hull and spar as she was when she left my side and just as able to bear her load of living freight to the places of destination.\n\nHer diminished size is in me, not in her.\n\nAnd just at the moment when someone at my side says, 'There she goes!', there are other eyes watching her coming, and other voices ready to take up the glad shout :\n\n'Here she comes!'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Audrey Jermyn.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Audrey Dickson (Jermyn) – 29th May 2019 – Howth Presbyterian Church\nLast Thursday morning Audrey Dickson was at her exercise class. It was the\nlast of the season and at the end Audrey got up to thank the teacher on behalf\nof the class for keeping them all well. From there she went to join friends on\nSutton beach for a swim. It is there that she was suddenly taken ill and she\ndied in the early hours of Friday morning in Beaumont Hospital. As the family\nsaid in the death notice Audrey died ‘doing what she did best, living life to the\nfull, with friends and family.’\nHer death, and the sudden and unexpected nature of her death, has left her\nfamily and her friends and the wider community shocked and shattered. This is\na measure of how widely loved and cherished this gentle and generous woman\nwas esteemed.\nThe daughter of a Naval Architect, she had lived in Scotland and England\nbefore coming to Ireland on marriage. Here she reared her four sons, David,\nAlan, Gary and Ian. Life was not always easy for her and in those times she\nfound a spiritual home for herself and her family here in Howth Presbyterian\nChurch. On marriage to her beloved Cecil, she joined the Parish of Howth.\nWith St Mary’s Church closed for renovations, it is fitting that her funeral is\nheld here and the family are grateful to the congregation of Howth Presbyterian\nChurch for making this place available.\nWe all come here with our own particular memories of Audrey. The family\nhave already shared their own particular memories. We remember a lady who\nthrew herself into the life of her family, her Church and her community. She\nbrought a down to earth, practical, common sense approach to things which\nmeant she was very effective on committees and several people have remarked\nhow effective she was in the chair at meetings. She brought not just her\npracticality, she brought her humanity. In my early days here she was on\nSelect Vestry. I remember at one stage, there had been some difficulties, I\nPage 2 of 4\nFuneral of Audrey Dickson (Jermyn) – 29th May 2019 – Howth Presbyterian Church\npicked up the phone in the office and it was Audrey. ‘How are you? I just\nsense this is a difficult time for you.’ We chatted for a while and I put down\nthe phone feeling more at peace. And I would suspect that many of you can\nrecall similar experiences.\nI spoke of her humanity that was expressed in a care and concern for others\nthat was an outworking of her profound and well thought through Christian\nfaith, living out the command of Christ: \"All things, therefore, that you want\nmen to do to you, you also must do to them\".\nWe saw that humanity beautifully expressed in her love and care of Cecil. In\nthe early days of their marriage they relished the opportunities of travel, of\ndoing things together, of just being together. As Cecil’s health declined\nAudrey did everything to help Cecil retain his independence, his dignity, his\nhumanity, bringing him to Church, to meetings, to family celebrations; and\nwhen care was beyond even Audrey’s capacity, visiting and cherishing him in\nthe nursing home.\nWe come here today to thank God for this wonderful, warm human being. We\ncome also to support with our presence, our prayers and our love, those who\nwill miss her most. We think of her sons, David, Alan, Gary and Ian as well as\nCecil’s sons David and Gary to whom she became a loving mother as well as\ngrandchildren and close friends. You will be very much in our thoughts and\nprayers not only today but in the days and weeks to come and you come to\nterms with life without Audrey.\nWe come also to set our loss of Audrey and our own life and death in the\ncontext of our Christian faith. I spoke earlier of a profound Christian faith that\nwas lived out in daily life, in love and service of others. The books that the\nfamily came across on her bookshelves speak of a heart and mind still\nPage 3 of 4\nFuneral of Audrey Dickson (Jermyn) – 29th May 2019 – Howth Presbyterian Church\nsearching, seeking deeper understanding. Out of that faith, I sense someone\nwho was comfortable with her mortality. I think it fitting that one of the\nlessons chosen by the family for this service is that lovely passage from\nEcclesiastes, that speaks of the rhythm of life:\na time to be born, and a time to die;\n…………………………\na time to weep, and a time to laugh;\na time to mourn, and a time to dance;\n………………………………….\na time to seek, and a time to lose;\na time to keep, and a time to throw away;\n…………………………….\na time to keep silence, and a time to speak;\nI sense someone who picked up that rhythm in her own life, who found a peace\nand contentment in her own faith in the God and Father of our Lord Jesus\nChrist. In life and in death she stands as a wonderful example of life lived in\nthe service of others and the God she met in worship in this place and in St\nMary’s.\nA time such as this is a time to reflect on our own mortality. In the hustle and\nbustle of life it is easy to push such things into the background. May Audrey’s\nexample of life lived in faith inspire each one of us to reflect on God’s love for\nus in Christ.\nShe wrote a poem back in the year 2000 which some of her grandchildren are\ngoing to read, ‘The Pleasures of Growing Older’ in which something of that\nfaith, that comfort with her mortality shines through, ending with a simple\nprayer of trust:\nGod be kind to me in my fading years,\nWhen mind and body decay.\nLet me go quickly and peacefully\nSurrounded by love.\nPage 4 of 4\nFuneral of Audrey Dickson (Jermyn) – 29th May 2019 – Howth Presbyterian Church\nEven in their pain, the family are thankful that her prayer was answered.\nIn earlier days, Audrey got great pleasure form sailing. From the window in\n‘Avalon’ Audrey and Cecil must have spent many happy hours looking out\nover Howth Harbour. The following is a poem that sets our hope for Audrey\nand for ourselves in the sailing tradition of this lovely place:\nA Parable of Immortality.\nI am standing by the seashore.\nA ship at my side spreads her white sails to the morning breeze\nand starts for the blue ocean.\nShe is an object of beauty and strength,\nand I stand and watch\nuntil at last she hangs like a speck of white cloud\njust where the sun and sky come down to mingle with each other.\nThen someone at my side says, ‘There she goes! ‘\nGone where? Gone from my sight - that is all.\nShe is just as large in mast and hull and spar\nas she was when she left my side\nand just as able to bear her load of living freight\nto the places of destination.\nHer diminished size is in me, not in her.\nAnd just at the moment when someone at my side says,\n‘There she goes!’,\nthere are other eyes watching her coming,\nand other voices ready to take up the glad shout :\n‘Here she comes!’"
    }
}