{
    "title": "Celebrating Joan Pickard",
    "date": "2011-08-12",
    "blurb": "This sermon is a tribute to Mrs. Joan Pickard, a beloved member of the Parish of Howth. It highlights her unwavering faith, her commitment to the church, and her love for the community. Joan's life is celebrated as an example of a faith that is expressed through acts of concern for others. Her sense of humor, love for the young people of the church, and her dedication to prayer are remembered fondly.",
    "raw_text": "Funeral of Mrs Joan Pickard – 12th August 2011\n\nWe have come here today to celebrate the life and faith of Joan Pickard, a beloved and valued member of this Parish for many years. I only came to know Joan over the last six years. Joan and her husband Ron along with their two daughters Gillian and Diane had first come to this area from their native Newcastle upon Tyne when Ron’s work as an engineer brought him here. Active members of their Church in England, they were to quickly settle into the life of the Parish of Howth. Ron sang in the choir and was to feature in musical items with the late Peter Holmes. Joan took on the leadership of the local cub pack and the whole family were to commit themselves to the worship and community life of this place.\n\nFor a while Ron’s work was to take the family down to Roscrea but when Ron retired they moved back to Clontarf and resumed their association with St Mary’s. Ron died some 11 years ago leaving a huge gap in Joan’s life. There was clearly a life-long devotion and she was very proud of the window she placed in this Church in his memory.\n\nUnlike today, when she arrived in Church after the rest of us, Joan was always one of the first to arrive whether it be for a Sunday or midweek service. As she came in she was always smiling, always positive. I would go up to her and she would often say, ‘I love this Church’. For her it was more than just the building, it was the community that worshipped here and the God she met in worship and served in life. For Joan prayer, participation in worship and the fellowship was central to her life. Only in recent months did she finally decide to stay in her pew to receive Holy Communion. Until then she made her way up the steps and I will always remember the smile as I gave her the bread and the wine, ‘the Body of Christ, the Blood of Christ keep you in eternal life.’\n\nAnother service she loved was the Service of Wholeness and Healing and she would always come forward for prayer and laying on of hands – though looking back on it she would have only rarely sought prayer for herself – more often she would have come seeking prayer for a friend or for some member of her extended family. Joan was a real prayer warrior, with a commitment to regular disciplined prayer that would put the rest of us to shame. She will always be remembered with great affection not only by this parish but by the ecumenical prayer fellowship she belonged to.\n\nShe was a great encourager and she had a real interest in the young people of the Church. She loved the Family Service – the noise that we sometimes get did not worry her, she was just delighted to see them. Sunday School Teachers and Youth Workers could always depend on Joan for words of encouragement, with assurances that she prayed for them in their work.\n\nThe Apostle James warns us that faith without works is dead, that a lively faith must express itself in acts of concern for others. Joan would often phone, the last time was after the news of the East African Famine situation hit the news, and ask ‘What can we do? Are we having a collection?’ She would ask did I know of any family who could do with some help. There was a very genuine warmth and care to her faith that influenced the whole of her life.\n\nJoan had a most delightful, sometimes outrageous, sense of humour. I recall one occasion when I went to sit beside her in her pew before service. She grinned and said, ‘Do you know something? I shouldn’t be here – I should be dead. It’s not a new knee I need, it’s a new body.’, followed by that giggle that we will always associate with her.\n\nThis is where the words of our first lesson, from the book Revelation, strike a particular chord with me as I think of Joan.\n\nand God himself will be with them;\nRev 21:4 he will wipe every tear from their eyes.\nDeath will be no more;\nmourning and crying and pain will be no more,\nfor the first things have passed away.\"\nRev 21:5 And the one who was seated on the throne said, \"See, I am making all things new.\" Also he said, \"Write this, for these words are trustworthy and true.\" 6 Then he said to me, \"It is done! I am the Alpha and the Omega, the beginning and the end. To the thirsty I will give water as a gift from the spring of the water of life. 7 Those who conquer will inherit these things, and I will be their God and they will be my children.\n\nI am making all things new. This is our hope for Joan this day. All the limitations of her old worn out body a thing of the past; freed for worship in the closer presence of the God she served so faithfully in her earthly pilgrimage.\n\nOf course however strong our faith, however much we know that death is a release for our loved ones, there is still a very proper sadness on an occasion such as this as we say farewell to someone who has been so much of our lives, with whom we have shared so many memories, so much love and in this regard we think particularly of Gillian and Diane on this day. Those of us outside the immediate family circle have come today to assure you of our love and prayers not just for today but for the weeks and months to come as you come to terms to life without Joan.\n\nToday we commend Joan to the loving care of the God and Father of our Lord Jesus Christ in whose service she spent so much of her life and energy. Inspired by her example and her faith let us this day dedicate ourselves afresh to the worship and service of Almighty God looking forward to that day when we shall be reunited with those who have gone before us in the faith.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Joan Pickard.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mrs Joan Pickard – 12th August 2011\nHowth\nWe have come here today to celebrate the life and faith of Joan Pickard, a\nbeloved and valued member of this Parish for many years. I only came to\nknow Joan over the last six years. Joan and her husband Ron along with their\ntwo daughters Gillian and Diane had first come to this area from their native\nNewcastle upon Tyne when Ron’s work as an engineer brought him here.\nActive members of their Church in England, they were to quickly settle into the\nlife of the Parish of Howth. Ron sang in the choir and was to feature in\nmusical items with the late Peter Holmes. Joan took on the leadership of the\nlocal cub pack and the whole family were to commit themselves to the worship\nand community life of this place.\nFor a while Ron’s work was to take the family down to Roscrea but when Ron\nretired they moved back to Clontarf and resumed their association with St\nMary’s. Ron died some 11 years ago leaving a huge gap in Joan’s life. There\nwas clearly a life-long devotion and she was very proud of the window she\nplaced in this Church in his memory.\nUnlike today, when she arrived in Church after the rest of us, Joan was always\none of the first to arrive whether it be for a Sunday or midweek service. As she\ncame in she was always smiling, always positive. I would go up to her and she\nwould often say, ‘I love this Church’. For her it was more than just the\nbuilding, it was the community that worshipped here and the God she met in\nworship and served in life. For Joan prayer, participation in worship and the\nfellowship was central to her life. Only in recent months did she finally decide\nto stay in her pew to receive Holy Communion. Until then she made her way\nPage 2 of 4\nFuneral of Mrs Joan Pickard – 12th August 2011\nHowth\nup the steps and I will always remember the smile as I gave her the bread and\nthe wine, ‘the Body of Christ, the Blood of Christ keep you in eternal life.’\nAnother service she loved was the Service of Wholeness and Healing and she\nwould always come forward for prayer and laying on of hands – though\nlooking back on it she would have only rarely sought prayer for herself – more\noften she would have come seeking prayer for a friend or for some member of\nher extended family. Joan was a real prayer warrior, with a commitment to\nregular disciplined prayer that would put the rest of us to shame. She will\nalways be remembered with great affection not only by this parish but by the\necumenical prayer fellowship she belonged to.\nShe was a great encourager and she had a real interest in the young people of\nthe Church. She loved the Family Service – the noise that we sometimes get\ndid not worry her, she was just delighted to see them. Sunday School Teachers\nand Youth Workers could always depend on Joan for words of encouragement,\nwith assurances that she prayed for them in their work.\nThe Apostle James warns us that faith without works is dead, that a lively faith\nmust express itself in acts of concern for others. Joan would often phone, the\nlast time was after the news of the East African Famine situation hit the news,\nand ask ‘What can we do? Are we having a collection?’ She would ask did I\nknow of any family who could do with some help. There was a very genuine\nwarmth and care to her faith that influenced the whole of her life.\nPage 3 of 4\nFuneral of Mrs Joan Pickard – 12th August 2011\nHowth\nJoan had a most delightful, sometimes outrageous, sense of humour. I recall\none occasion when I went to sit beside her in her pew before service. She\ngrinned and said, ‘Do you know something? I shouldn’t be here – I should be\ndead. It’s not a new knee I need, it’s a new body.’, followed by that giggle that\nwe will always associate with her.\nThis is where the words of our first lesson, from the book Revelation, strike a\nparticular chord with me as I think of Joan.\nand God himself will be with them;\nRev 21:4 he will wipe every tear from their eyes.\nDeath will be no more;\nmourning and crying and pain will be no more,\nfor the first things have passed away.\"\nRev 21:5 And the one who was seated on the throne said, \"See, I am making\nall things new.\" Also he said, \"Write this, for these words are trustworthy\nand true.\" 6 Then he said to me, \"It is done! I am the Alpha and the\nOmega, the beginning and the end. To the thirsty I will give water as a gift\nfrom the spring of the water of life. 7 Those who conquer will inherit\nthese things, and I will be their God and they will be my children.\nI am making all things new. This is our hope for Joan this day. All the\nlimitations of her old worn out body a thing of the past; freed for worship in the\ncloser presence of the God she served so faithfully in her earthly pilgrimage.\nOf course however strong our faith, however much we know that death is a\nrelease for our loved ones, there is still a very proper sadness on an occasion\nsuch as this as we say farewell to someone who has been so much of our lives,\nwith whom we have shared so many memories, so much love and in this regard\nwe think particularly of Gillian and Diane on this day. Those of us outside the\nimmediate family circle have come today to assure you of our love and prayers\nPage 4 of 4\nFuneral of Mrs Joan Pickard – 12th August 2011\nHowth\nnot just for today but for the weeks and months to come as you come to terms\nto life without Joan.\nToday we commend Joan to the loving care of the God and Father of our Lord\nJesus Christ in whose service she spent so much of her life and energy.\nInspired by her example and her faith let us this day dedicate ourselves afresh\nto the worship and service of Almighty God looking forward to that day when\nwe shall be reunited with those who have gone before us in the faith.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be\nfor evermore."
    }
}