{
    "title": "Remembering Shelagh Wilkinson",
    "date": "2005-01-01",
    "blurb": "This sermon was given at the funeral of Mrs Shelagh Wilkinson, a woman remembered for her free thinking, ground-breaking work in social sciences, and her commitment to justice and ecological issues. Despite her physical decline in later years, she maintained a positive outlook and continued to inspire those around her. Her life serves as a reminder of the importance of love, courage, and the power of an enquiring mind.",
    "raw_text": "I will always remember my first visit to the Orchard on Claremont Road not long after I arrived here in 2005. I was invited in with great courtesy and questions about where I was from, my wife and family and their interests, what Parishes I had served in. She spoke of her own life, her late husband and family and her own convictions. Then she looked at me and asked, 'This business of Church ordaining gay people – what is your line on it?' I began to gather my thoughts and she continued, 'For the life of me I cannot understand the problem.' The hair might have been white, ill health may have limited her physical energies, but I realised I was in the presence of a free thinker. I must admit I always enjoyed a visit to Shelagh Wilkinson.\n\nShelagh was something of a ground breaker in her day. She was among the first of a new breed of social workers, studying social sciences in Trinity. In the early years she worked in the slums in the centre of Dublin City. In the aftermath of the War she worked among Jewish refugees and maintained a contact with one particular Jewish family in Summerhill. She maintained a lifelong interest and concern for the underdog. In the early years of marriage she looked after an uncle and aunt who had been freed from a Japanese Wartime Internment Camp. She had a passionate interest in issues of justice and would have had no time for racialism, sectarianism, homophobia and the like. She was involved in the early days of Samaritans and would have given freely of her time. There was always a very practical outworking of her commitments.\n\nIn recent times her interest in ecological issues lead her to install a geothermal heating system in her house. She knew she would never live to see the economic return but it was for her a statement of her conviction that we all have a responsibility to make a difference.\n\nShelagh was very much a family person. She married her husband Norman when she was 21 and they shared over 50 years together. They reared their four sons, Steve, Shane, Jamie and Hugh in the house on Claremont Road and she would often talk with great affection of her sons and their families. Being a voracious reader (even in latter years there were never the same books on the table whenever I went to visit her) and enquiring mind, she encouraged her sons to do the same, to develop their own interests, their own personalities. Her son Steve died unexpectedly in 1985 and she and Norman took on the role of love and support of Steve’s widow and their children and a special bond has been maintained ever since.\n\nFor the last number of years there has been a progressive decline in her physical health, placing severe limitations on her mobility and independence. But there was no self pity in Shelagh. She demonstrated considerable courage and maintained a positive outlook. A couple of years ago – after a spell in hospital that everyone thought indicated that Shelagh’s time was short, I recall calling with her and she announced; 'I think I am dead from the neck down but alive from the neck up – which is the way I would prefer it to be.' She was grateful to those who enabled her to maintain her independence, her sons, with Hugh living in the coach house and the team of carers. She was immensely grateful for the care she received from the out patient team of St Francis’ Hospice. Their loving and professional care gave her a quality of life than enabled her to continue in her own home, to welcome and entertain friends and to die, as she would have wished, in a quiet dignity in her own home.\n\nThere is much here to be thankful for in the life and example of Shelagh Wilkinson. On this day, we not only give thanks for Shelagh, we offer our love and support to those who will miss her most, her sons and grandchildren who meant so much to her and to whom she meant so much. However much we may anticipate the death of a loved one; however much we may know in our hearts that for them death is a release, there is still that sense of loss and sadness that one we loved and cherished is with us no more. It is our hope and prayer for you all that you may know something of God’s peace this day.\n\nShelagh was not one for abstract and obscure theology but I feel she could identify with the very practical words of Paul to the Church at Corinth in his second letter. He talks very plainly of mortality, of the physical body wearing out. Shelagh would have spoken of the body being a vehicle. Paul uses an expression that has always appealed to me: 'So that what is mortal may be swallowed up by life.' Shelagh did not allow weakness and sickness to be the determining feature of her life. The body may have died but her love lives on, the inspiration she has given over the years lives on. I appreciate that Shelagh cannot question or contradict me on this occasion, but more than all this, I am convinced that the vitality that was hers lives on and so it is with a thankful heart that I commend this lady this day to the loving care of Almighty God.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Shelagh Wilkinson.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mrs Shelagh Wilkinson\nI will always remember my first visit to the Orchard on Claremont Road not\nlong after I arrived here in 2005. I was invited it with great courtesy and\nquestions about where I was from, my wife and family and their interests, what\nParishes I had served in. She spoke of her own life, her late husband and family\nand her own convictions. Then she looked at me and asked, ‘This business of\nChurch ordaining gay people – what is your line on it?’ I began to gather my\nthoughts and she continued, ‘For the life of me I cannot understand the\nproblem.’ The hair might have been white, ill health may have limited her\nphysical energies, but I realised I was in the presence of a free thinker. I must\nadmit I always enjoyed a visit to Shelagh Wilkinson.\nShelagh was something of a ground breaker in her day. She was among the\nfirst of a new breed of social workers, studying social sciences in Trinity. In\nthe early years she worked in the slums in the centre of Dublin City. In the\naftermath of the War she worked among Jewish refugees and maintained a\ncontact with one particular Jewish family in Summerhill. She maintained a life\nlong interest and concern for the under dog. In the early years of marriage she\nlooked after an uncle and aunt who had been freed from a Japanese Wartime\nInternment Camp. She had a passionate interest in issues of justice and would\nhave had no time for racialism, sectarianism, homophobia and the like. She\nwas involved in the early days of Samaritans and would have given freely of\nher time. There was always a very practical outworking of her commitments.\nIn recent times her interest in ecological issues lead her to install geothermal\nheating system in her house. She knew she would never live to see the\neconomic return but it was for her a statement of her conviction that we all\nhave a responsibility to make a difference.\nPage 2 of 4\nFuneral of Mrs Shelagh Wilkinson\nShelagh was very much a family person. She married her husband Norman\nwhen she was 21 and they shared over 50 years together. They reared their\nfour sons, Steve, Shane, Jamie and Hugh in the house on Claremont Road and\nshe would often talk with great affection of her sons and their families. Being\na voracious reader (even in latter years there were never the same books on the\ntable whenever I went to visit her) and enquiring mind, she encouraged her\nsons to do the same, to develop their own interests, their own personalities.\nHer son Steve died unexpectedly in 1985 and she and Norman took on the role\nof love and support of Steve’s widow and their children and a special bond has\nbeen maintained ever since.\nFor the last number of years there has been a progressive decline in her\nphysical health, placing severe limitations on her mobility and independence.\nBut there was no self pity in Shelagh. She demonstrated considerable courage\nand maintained a positive outlook. A couple of years ago – after a spell in\nhospital that everyone thought indicated that Shelagh’s time was short, I recall\ncalling with her and she announced;’ I think I am dead from the neck down but\nalive from the neck up – which is the way I would prefer it to be.’ She was\ngrateful to those who enabled her to maintain her independence, her sons, with\nHugh living in the coach house and the team of carers. She was immensely\ngrateful for the care she received from the out patient team of St Francis’\nHospice. Their loving and professional care gave her a quality of life than\nenabled her to continue in her own home, to welcome and entertain friends and\nto die, as she would have wished, in a quiet dignity in her own home.\nPage 3 of 4\nFuneral of Mrs Shelagh Wilkinson\nThere is much here to be thankful for in the life and example of Shelagh\nWilkinson. On this day, we not only give thanks for Shelagh, we offer our love\nand support to those who will miss her most, her sons and grandchildren who\nmeant so much to her and to whom she meant so much. However much we\nmay anticipate the death of a loved one; however much we may know in our\nhearts that for them death is a release, there is still that sense of loss and\nsadness that one we loved and cherished is with us no more. It is our hope and\nprayer for you all that you may know something of God’s peace this day.\nShelagh was not one for abstract and obscure theology but I feel she could\nidentify with the very practical words of Paul to the Church at Corinth in his\nsecond letter. He talks very plainly of mortality, of the physical body wearing\nout. Shelagh would have spoken of the body being a vehicle. Paul uses an\nexpression that has always appealed to me: ‘So that what is mortal may be\nswallowed up by life.’ Shelagh did not allow weakness and sickness to be the\ndetermining feature of her life. The body may have died but her love lives on,\nthe inspiration she has given over the years lives on. I appreciate that Shelagh\ncannot question or contradict me on this occasion, but more than all this, I am\nconvinced that the vitality that was hers lives on and so it is with a thankful\nheart that I commend this lady this day to the loving care of Almighty God.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou\ndidst not lose them in giving, so we have not lost them by their return. What\nthou gavest thou takest not away, O Lover of souls; for what is thine is ours\nalso if we are thine. And life is eternal and love is immortal, and death is only\nPage 4 of 4\nFuneral of Mrs Shelagh Wilkinson\nan horizon, and an horizon is nothing save the limit of our sight. Lift us up,\nstrong Son of God, that we may see further; cleanse our eyes that we may see\nmore clearly; and draw us closer to thyself that we may know ourselves to be\nnearer to our loved ones who are with thee. And while thou dost prepare for\nus, prepare us also for that happy place, that where they are and thou art, we\ntoo may be for evermore."
    }
}