{
    "title": "Remembering Joan Kerr",
    "date": "2016-05-07",
    "blurb": "This sermon is a tribute to Joan Kerr, a cherished member of the Parish of Howth, who passed away on 7th May 2016. The sermon reflects on Joan's life, her contributions to the community, and her unwavering faith. It also addresses the challenges she faced in her later years with profound deafness and dementia, and the strength and commitment shown by her husband, Eddie.",
    "raw_text": "Funeral of Joan Kerr – 7th May 2016\n\nOne of my early memories after I arrived in the Parish of Howth is that of meeting with Joan Kerr in the Parish Centre. Joan at that time was administrator of the Parish Centre. She showed me around the Centre, explaining the various groups using the Parish Centre. I was struck by her quiet methodical approach, accompanied by her cheerful welcoming manner. I soon came across her again in the Burrow Players, where her apparently reserved manner gave way to her gentle understated humour that apparently gave great pleasure to many an audience down through the years. Then in the much needed refreshments after the rehearsals (Norman MacCann could be a very severe producer), we would be joined by Eddie. They were very much a team and the love and warmth between them was clear for all to see.\n\nThis was a team that went back a long way – to 1964. Joan had grown up in Clontarf but those these Northsiders met at a dance in Palmerston Rugby Club. They were to marry in 1967 and they set up home in Sutton Park, a new estate with plenty of young families, providing a great environment in which to bring up their children Tracy, Laura, Sharon and Ross. Many of Joan’s longstanding friendships date back to this time as well as her membership of the newly formed 3rd Day Chorale. Then in 1982 the family moved into Offington and here Joan found ample scope for her love of gardening – with Eddie providing a very effective ‘go for’.\n\nJoan was actively involved in the life of St Mary’s, a regular and committed worshipper in this place. As a youngster in Clontarf she was an active member of the Girls Brigade and a member of the Parish Tennis club. Here in St Mary’s she was active in the Mothers Union and supported Ron and Maud Bass in the Lamplighters, a junior branch of the Leprosy Mission.\n\nShe was first and foremost a family person. She and Eddie were very much a team and she took delight in her children, their various achievements, welcoming their partners into the home and delighting in the arrival of the eight grandchildren..\n\nIn recent years Joan’s health began to deteriorate. First she fell victim to profound deafness and then more recently to dementia, both very isolating conditions. Supported by her family, nonetheless a loneliness crept into her life, as the chat and easy conversation we would all take for granted became more and more an effort. In all of this Eddie was at her side. They would still go out, enjoying each others company, there was still the garden. Texting became an art form. Back in 1967 Eddie and Joan pledged themselves to each other ‘for better, for worse; for richer for poorer, in sickness and in health; till death us do part.’ Eddie and Joan have left us a wonderful example of the commitment to each other in Christian marriage. Then 9 months ago, her dementia began to rapidly deteriorate until not even Eddie could manage, and Joan went into hospital for the first time in her life. Then in the early hours of Thursday morning, in the wonderful care of St Francis Hospice and surrounded by the love of her family, Joan died peacefully with Eddie at her side.\n\nThis morning we gather to thank God for Joan, for her love, for her faithfulness, for her courage in the face of all she had to face. We those of us outside the immediate family come to offer our love and support to those who will miss her most. We think of Eddie, of their children Tracy, Laura, Sharon and Ross and their families, of Joan’s brother Norman and all who loved her. Here, in this Church in which she worshipped for so many years, we come to set our loss, our sadness, our mortality in the context of our faith. We are in the season of Easter, that great festival of life in the face of death in which we celebrate Christ’s victory over the powers of sin and death. On the wall just beside the door of the Church here in Howth you will see a climbing rose. Even in the midst of winter, there always seems to be signs of life on that bush, a few leaves and buds and even the odd flower. The darkness and cold of the winter can never suppress the life of that rose. Then as spring comes the life within it will burst forth. We are in the season of Easter. But before that comes Good Friday and Calvary – a seemingly pointless, savage death of goodness – but love, life triumphs over darkness, over death. It is in that cycle of death and resurrection that I begin my own search for meaning, for hope.\n\nOur first lesson, the writer of the book Ecclesiastes talks of this rhythm of life, the place of life and death, sorrow and joy all set in the context of our faith in God. In our Gospel reading, Jesus, shortly to endure the loneliness and pain of the cross, talks of his abiding presence, his promise of peace.\n\nAnother passage I find myself turning to again and again in situations such as this, when prolonged weakness has robbed our loved ones of their former strength and vitality, is a portion of Paul’s 2nd Letter to the Corinthians. In this he talks very plainly of our mortality, very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks, in language reminiscent of our Gospel reading, of our new heavenly home. But the words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Joan Kerr, that all the limitations of these latter years, the deafness, the loss of her mental capacity, along with all the limitations that go with being human are \"swallowed up by life\". This is more than release from her suffering, this is redemption, this is our inheritance in Christ in the closer presence of our heavenly Father.\n\nOur hope for Joan this day is peace in the closer presence of the God she worshipped in this place and in her life. Inspired by her example and her faith let us this day dedicate ourselves afresh to the worship and service of Almighty God looking forward to that day when we shall be reunited with those who have gone before us in the faith.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Joan Kerr.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Joan Kerr – 7th May 2016\nOne of my early memories after I arrived in the Parish of Howth is that of\nmeeting with Joan Kerr in the Parish Centre. Joan at that time was\nadministrator of the Parish Centre. She showed me around the Centre,\nexplaining the various groups using the Parish Centre. I was struck by her\nquiet methodical approach, accompanied by her cheerful welcoming manner. I\nsoon came across her again in the Burrow Players, where her apparently\nreserved manner gave way to her gentle understated humour that apparently\ngave great pleasure to many an audience down through the years. Then in the\nmuch needed refreshments after the rehearsals (Norman MacCann could be a\nvery severe producer), we would be joined by Eddie. They were very much a\nteam and the love and warmth between them was clear for all to see.\nThis was a team that went back a long way – to 1964. Joan had grown up in\nClontarf but those these Northsiders met at a dance in Palmerston Rugby Club.\nThey were to marry in 1967 and they set up home in Sutton Park, a new estate\nwith plenty of young families, providing a great environment in which to bring\nup their children Tracy, Laura, Sharon and Ross. Many of Joan’s longstanding\nfriendships date back to this time as well as her membership of the newly\nformed 3rd Day Chorale. Then in 1982 the family moved into Offington and\nhere Joan found ample scope for her love of gardening – with Eddie providing\na very effective ‘go for’.\nJoan was actively involved in the life of St Mary’s, a regular and committed\nworshipper in this place. As a youngster in Clontarf she was an active member\nof the Girls Brigade and a member of the Parish Tennis club. Here in St\nPage 2 of 4\nFuneral of Joan Kerr – 7th May 2016\nMary’s she was active in the Mothers Union and supported Ron and Maud\nBass in the Lamplighters, a junior branch of the Leprosy Mission.\nShe was first and foremost a family person. She and Eddie were very much a\nteam and she took delight in her children, their various achievements,\nwelcoming their partners into the home and delighting in the arrival of the\neight grandchildren..\nIn recent years Joan’s health began to deteriorate. First she fell victim to\nprofound deafness and then more recently to dementia, both very isolating\nconditions. Supported by her family, nonetheless a loneliness crept into her\nlife, as the chat and easy conversation we would all take for granted became\nmore and more an effort. In all of this Eddie was at her side. They would still\ngo out, enjoying each others company, there was still the garden. Texting\nbecame an art form. Back in 1967 Eddie and Joan pledged themselves to each\nother ‘for better, for worse; for richer for poorer, in sickness and in health; till\ndeath us do part.’ Eddie and Joan have left us a wonderful example of the\ncommitment to each other in Christian marriage. Then 9 months ago, her\ndementia began to rapidly deteriorate until not even Eddie could manage, and\nJoan went into hospital for the first time in her life. Then in the early hours of\nThursday morning, in the wonderful care of St Francis Hospice and surrounded\nby the love of her family, Joan died peacefully with Eddie at her side.\nThis morning we gather to thank God for Joan, for her love, for her\nfaithfulness, for her courage in the face of all she had to face. We those of us\noutside the immediate family come to offer our love and support to those who\nPage 3 of 4\nFuneral of Joan Kerr – 7th May 2016\nwill miss her most. We think of Eddie, of their children Tracy, Laura, Sharon\nand Ross and their families, of Joan’s brother Norman and all who loved her.\nHere, in this Church in which she worshipped for so many years, we come to\nset our loss, our sadness, our mortality in the context of our faith. We are in\nthe season of Easter, that great festival of life in the face of death in which we\ncelebrate Christ’s victory over the powers of sin and death. On the wall just\nbeside the door of the Church here in Howth you will see a climbing rose.\nEven in the midst of winter, there always seems to be signs of life on that bush,\na few leaves and buds and even the odd flower. The darkness and cold of the\nwinter can never suppress the life of that rose. Then as spring comes the life\nwithin it will burst forth. We are in the season of Easter. But before that\ncomes Good Friday and Calvary – a seemingly pointless, savage death of\ngoodness – but love, life triumphs over darkness, over death. It is in that cycle\nof death and resurrection that I begin my own search for meaning, for hope.\nOur first lesson, the writer of the book Ecclesiastes talks of this rhythm of life,\nthe place of life and death, sorrow and joy all set in the context of our faith in\nGod. In our Gospel reading, Jesus, shortly to endure the loneliness and pain of\nthe cross, talks of his abiding presence, his promise of peace.\nAnother passage I find myself turning to again and again in situations such as\nthis, when prolonged weakness has robbed our loved ones of their former\nstrength and vitality, is a portion of Paul’s 2nd Letter to the Corinthians. In this\nhe talks very plainly of our mortality, very plainly of the body wearing out.\nBut just as he talks of the reality of physical decline and death, Paul talks, in\nlanguage reminiscent of our Gospel reading, of our new heavenly home. But\nthe words that really stand out for me are ; \"So that what is mortal may be\nswallowed up by life.\" This is our hope for Joan Kerr, that all the limitations\nof these latter years, the deafness, the loss of her mental capacity, along with\nPage 4 of 4\nFuneral of Joan Kerr – 7th May 2016\nall the limitations that go with being human are \"swallowed up by life\". This is\nmore than release from her suffering, this is redemption, this is our inheritance\nin Christ in the closer presence of our heavenly Father.\nOur hope for Joan this day is peace in the closer presence of the God she\nworshipped in this place and in her life. Inspired by her example and her faith\nlet us this day dedicate ourselves afresh to the worship and service of Almighty\nGod looking forward to that day when we shall be reunited with those who\nhave gone before us in the faith.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may be\nfor evermore."
    }
}