{
    "title": "Remembering Mrs. Peggy Lamb",
    "date": "2014-06-05",
    "blurb": "This sermon is a tribute to Mrs. Peggy Lamb, a faithful servant of the Church and a loving mother and wife. It recounts her love for music, her quiet resolute courage in the face of illness, and her enduring faith. The sermon encourages the congregation to remember Mrs. Lamb's life and death in the context of the life, death, and resurrection of Jesus Christ.",
    "raw_text": "I remember back in 1978. I had just been ordained and I was sitting with Rev Cecil Wilson in the kitchen in the Rectory in Raheny and Cecil was starting to organise my Parish visiting. 'Who will we start you with? We’ll give you an easy start – head up to the Lamb’s on the Tonlegee Road. And so it came to pass that my pastoral ministry began with a knock on the door and a cheery welcome from Peggy Lamb. I have always remembered that visit with great affection – children coming and going, the dog, the cup of tea placed in my hand, the easy relaxed chat, that lovely smile that never seemed far away.\n\nOver the next two years I came to get an insight into her other gifts, her love of music, supporting Zoe Davidson without intruding on Zoe’s place as organist here in St John’s.\n\nWe come here today to remember, to give thanks to God for a loving mother and wife, she cared for her beloved Joe until he had to go into care; a grandmother, friend – a faithful servant of the Church, organist for many years here and in Raheny, even as recently as Christmas hoping to get back, even just a play a couple of hymns. In the face of her illness she showed a quiet resolute courage – that battle was fought with no quarter given. I thought of Paul writing to the young Timothy,\n\nBut as for you, man of God, pursue righteousness, godliness, faith, love, endurance, gentleness. 12 Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Tim 6:11 ff\n\n'pursue righteousness, godliness, faith, love, endurance, gentleness.’ Those words seem to me to resonate with my own impressions and memories of Peggy Lamb. Joyce will be talking of the particular memories of the family.\n\nWe have recently celebrated the Festival of Easter and next Sunday we celebrate the coming of the Holy Spirit at Pentecost. So on this day as we lay Peggy to rest, we place her life and death in the context of the life, death and resurrection of our Lord and Saviour Jesus Christ. Paul writes to his beloved Philippians.\n\n10 I want to know Christ and the power of his resurrection and the sharing of his sufferings by becoming like him in his death, 11 if somehow I may attain the resurrection from the dead.\n\nPhil 3:12 Not that I have already obtained this or have already reached the goal; but I press on to make it my own, because Christ Jesus has made me his own. Philippians 3:10-12\n\nAs Christ has known the reality of death, so we may know the reality of his resurrection. Faith was something that was very much part of Peggy’s make-up. As the family went through her papers they found books of prayers, cuttings, directions she left for her funeral service. They are incorporating many of these prayers in this service.\n\nPeggy has left a wonderful example of faith, an inspiration to her family and those who have known her. The family have some wonderful memories of love, of service, of faith.\n\nBut they have still lost their Mum. So those of us outside the immediate family have come here today to offer you our love and support not only for today, but also in the days that lie ahead as you begin to build a new life with out the closer presence of your Mum. Norman, your Rector, who is away at the minute has asked me to express his sympathy to you on this day and assure you of his prayers.\n\nA passage I often find myself turning to at a time of a funeral is from St Paul's second letter to the Church at Corinth. the end of chapter 4 and the beginning of chapter 5. In this Paul presents us with the reality of our own mortality and death, he talks very plainly of the body wearing out. But just as he talks of the reality of physical decline and death, Paul talks of our new heavenly home.\n\nThe words that really stand out for me are ; \"So that what is mortal may be swallowed up by life.\" This is our hope for Peggy Lamb, that all the limitations of these last two years, the physical weakness as her illness progressed, along with all the limitations that go with being human are \"swallowed up by life\", that is our inheritance in Christ in the closer presence of our heavenly Father – that is our hope for Peggy and for ourselves this day.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.\n\nWell done, thou good and faithful servant. Receive the kingdom prepared for you from the beginning of the world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Mrs Peggy Lamb.txt",
        "raw_ocr_content": "Page 1 of 4\nFuneral of Mrs Peggy Lamb – St John’s, Coolock – 5th June 2014\nI remember back in 1978. I had just been ordained and I was sitting with Rev\nCecil Wilson in the kitchen in the Rectory in Raheny and Cecil was starting to\norganise my Parish visiting. ‘Who will we start you with? We’ll give you an\neasy start – head up to the Lamb’s on the Tonlegee Road. And so it came to\npass that my pastoral ministry began with a knock on the door and a cheery\nwelcome from Peggy Lamb. I have always remembered that visit with great\naffection – children coming and going, the dog, the cup of tea placed in my\nhand, the easy relaxed chat, that lovely smile that never seemed far away.\nOver the next two years I came to get an insight into her other gifts, her love of\nmusic, supporting Zoe Davidson without intruding on Zoe’s place as organist\nhere in St John’s.\nWe come here today to remember, to give thanks to God for a loving mother\nand wife, she cared for her beloved Joe until he had to go into care; a\ngrandmother, friend – a faithful servant of the Church, organist for many years\nhere and in Raheny, even as recently as Christmas hoping to get back, even just\na play a couple of hymns. In the face of her illness she showed a quiet resolute\ncourage – that battle was fought with no quarter given. I thought of Paul\nwriting to the young Timothy,\nBut as for you, man of God, pursue righteousness, godliness, faith, love,\nendurance, gentleness. 12 Fight the good fight of the faith; take hold of\nthe eternal life, to which you were called and for which you made the\ngood confession in the presence of many witnesses. 1 Tim 6:11 ff\n‘pursue righteousness, godliness, faith, love, endurance, gentleness.’ Those\nwords seem to me to resonate with my own impressions and memories of\nPeggy Lamb. Joyce will be talking of the particular memories of the family.\nPage 2 of 4\nFuneral of Mrs Peggy Lamb – St John’s, Coolock – 5th June 2014\nWe have recently celebrated the Festival of Easter and next Sunday we\ncelebrate the coming of the Holy Spirit at Pentecost. So on this day as we lay\nPeggy to rest, we place her life and death in the context of the life, death and\nresurrection of our Lord and Saviour Jesus Christ. Paul writes to his beloved\nPhilippians.\n10 I want to know Christ and the power of his resurrection and the\nsharing of his sufferings by becoming like him in his death, 11 if\nsomehow I may attain the resurrection from the dead.\nPhil 3:12 Not that I have already obtained this or have already reached the\ngoal; but I press on to make it my own, because Christ Jesus has made\nme his own. Philippians 3:10-12\nAs Christ has known the reality of death, so we may know the reality of his\nresurrection. Faith was something that was very much part of Peggy’s make-\nup. As the family went through her papers they found books of prayers,\ncuttings, directions she left for her funeral service. They are incorporating\nmany of these prayers in this service.\nPeggy has left a wonderful example of faith, an inspiration to her family and\nthose who have known her. The family have some wonderful memories of\nlove, of service, of faith.\nBut they have still lost their Mum. So those of us outside the immediate family\nhave come here today to offer you our love and support not only for today, but\nalso in the days that lie ahead as you begin to build a new life with out the\ncloser presence of your Mum. Norman, your Rector, who is away at the\nminute has asked me to express his sympathy to you on this day and assure you\nof his prayers.\nPage 3 of 4\nFuneral of Mrs Peggy Lamb – St John’s, Coolock – 5th June 2014\nA passage I often find myself turning to at a time of a funeral is from St Paul's\nsecond letter to the Church at Corinth. the end of chapter 4 and the beginning\nof chapter 5. In this Paul presents us with the reality of our own mortality and\ndeath, he talks very plainly of the body wearing out. But just as he talks of the\nreality of physical decline and death, Paul talks of our new heavenly home.\nThe words that really stand out for me are ; \"So that what is mortal may be\nswallowed up by life.\" This is our hope for Peggy Lamb, that all the\nlimitations of these last two years, the physical weakness as her illness\nprogressed, along with all the limitations that go with being human are\n\"swallowed up by life\", that is our inheritance in Christ in the closer presence\nof our heavenly Father – that is our hope for Peggy and for ourselves this day.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may\nbe for evermore.\nWell done, thou good and faithful servant. Receive the kingdom prepared for\nyou from the beginning of the world.\nPage 4 of 4\nFuneral of Mrs Peggy Lamb – St John’s, Coolock – 5th June 2014"
    }
}