{
    "title": "Naming of Jesus",
    "date": "2023-01-01",
    "blurb": "In this sermon, the importance of understanding God's journey with us through all our celebrations and tragedies is highlighted. The prayer emphasizes the need for love, forgiveness, and peace in our relationships, societies, and the world at large. It also acknowledges the suffering of refugees and those mourning the loss of loved ones.",
    "raw_text": "Sunday 1st January 2023\n\n**Naming of Jesus**\n\nLet us pray to the God who travels with us in all our celebrations and tragedies, and understands what it is like to be human. As we continue in our celebrations of Christmas, as we embark upon another New Year, we pray for the Church, the Body of Christ; the Church in our own land, for this Diocese and George our Bishop; for this Parish and for Nigel and Brendan. May we be so filled with God’s loving life that our actions touch the world with hope which lasts even when the Christmas decorations are put away.\n\n> Lord in your mercy: Hear our prayer.\n\nAs the world is reminded of love and peace in the words of the carols, may the reality of a God who loves us so much transform our social and political thinking and energise our plans and negotiations. We continue to remember the suffering of the people of Ukraine; we pray for peace, peace on the battlefields, peace in the hearts and minds of those in power. We pray our country, for George our Kings and all in authority under him. We pray for our Province and for all who are elected to leadership, that our present difficulties and uncertainties may be resolved.\n\n> Lord in your mercy: Hear our prayer.\n\nAs Christmas brings together family members and friends, and we make contact with those we seldom meet, may all our relationships be nourished with love and forgiveness, and may we value one another more.\n\n> Lord in your mercy: Hear our prayer.\n\nWe remember all who are forced to escape from their homes and are forced to live without security; we think of refugees on the road and those welcomed into homes in our own Province; we think particularly of those with young children who are homeless or in danger.\n\n> Lord in your mercy: Hear our prayer.\n\nWe remember with thanksgiving those who have gone before us in the faith and those who mourn their passing. We think particularly of those mourning the passing of Roderick O’Dowd.\n\n> Lord in your mercy: Hear our prayer.\n\nMerciful Father accept these prayers for the sake of your Son, our Saviour Jesus Christ. Amen",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Christmas/year A/Naming of Jesus - prayers.txt",
        "raw_ocr_content": "Sunday 1st January 2023\nNaming of Jesus\nLet us pray to the God who travels with us\nIn all our celebrations and tragedies,\nAnd understands what it is like to be human.\nAs we continue in our celebrations of Christmas, as we embark upon another New Year,\nwe pray for the Church, the Body of Christ;\nthe Church in our own land, for this Diocese and George our Bishop;\nfor this Parish and for Nigel and Brendan.\nMay we be so filled with God’s loving life\nthat our actions touch the world with hope\nwhich lasts even when the Christmas decorations are put away.\nLord in your mercy:\nHear our prayer.\nAs the world is reminded of love and peace in the words of the carols,\nmay the reality of a God who loves us so much\ntransform our social and political thinking and energise our plans and negotiations.\nWe continue to remember the suffering of the people of Ukraine; we pray for peace, peace\non the battlefields, peace in the hearts and minds of those in power.\nWe pray our country, for George our Kings and all in authority under him. We pray for\nour Province and for all who are elected to leadership, that our present difficulties and\nuncertainties may be resolved.\nLord in your mercy:\nHear our prayer.\nAs Christmas brings together family members and friends,\nand we make contact with those we seldom meet,\nmay all our relationships be nourished with love and forgiveness,\nand may we value one another more.\nLord in your mercy:\nHear our prayer.\nWe remember all who are forced to escape from their homes and are forced to live without\nsecurity; we think of refugees on the road and those welcomed into homes in our own\nProvince;\nwe think particularly of those with young children who are homeless or in danger.\nLord in your mercy:\nHear our prayer.\nWe remember with thanksgiving those who have gone before us in the faith and those who\nmourn their passing. We think particularly of those mourning the passing of Roderick\nO’Dowd.\nLord in your mercy:\nHear our prayer.\nMerciful Father\naccept these prayers\nfor the sake of your Son,\nour Saviour Jesus Christ. Amen"
    }
}