{
    "title": "Naming of Jesus",
    "date": "2023-01-01",
    "blurb": "In this sermon, Kevin reflects on the transition from the old year to the new one, acknowledging the mixture of emotions that come with it. He emphasizes the constant presence of God in our lives, regardless of our circumstances. The sermon also highlights the significance of the Feast of the Naming and Circumcision of Jesus, and how it underscores God's care and concern for humanity.",
    "raw_text": "Well here we are – 2022 is behind us and 2023 opens up before us. Around this time of year there are a host of ‘End of Year Specials on our radio and TV channels – looking back over the events of the year that is past, looking forward to try and predict what lies in store for us in the year to come. Of course we don’t need the radio or the TV to do that for us – each of us is probably conducting our own review of the year that is past, our own peep into the year that lies ahead.\n\nWe look back, I would suspect with a mixture of thanks and regrets. Some of you may be saying, ‘Boy, am I glad to see the back of 2022’ – it may have been a year of crisis, anxiety over the health or well-being of a loved one, or yourself, maybe a year of bereavement – or just a year when things have just gone wrong in your life. For some of us though this will have been a good year, one we will recall with a smile. Perhaps romance has been in the air in your family – maybe a wedding or engagement, the arrival of a child. Or maybe, and more probably, there’s been a bit of both – there have been moments of dark and light in the year that is past.\n\nWe look forward to the coming year with a mixture of hope and fear. There are events that are planned that we anticipate with excitement. Maybe there is a wedding, a birth. Maybe someone we know is going to college, leave college, start a job. Maybe a long-awaited retirement is in the air this year. Those feelings of thanks and regret, hope and fear – while at one level we may share them with others, they are still very personal. In the case of regret or fear, there can be a loneliness. Does anyone notice, does anyone care? Even our enthusiasm, our hopes – we long to share them with someone who really understands.\n\nWe enter into this combination of nostalgia and anticipation, regret and optimism in the context of this Festival of Christmas with its themes of celebration of the birth of Jesus, Emmanuel, God coming among us in the person of Jesus. A great deal of theological hair has flown, theological careers have been made, and for that matter broken over what we are to understand about this whole concept of Incarnation. In the past Councils of the Church have been called to decide upon the minutiae of precise definitions. It is out of these councils that we have received the Nicene and Apostles’ Creed that we use in public worship. I find it more productive to step back and ask myself what fundamental truth, what experience of God are people trying to express here; a truth and experience I can take out to try and make sense of my own personal pilgrimage of faith, my own hopes and fears, my own joys and regrets.\n\nThis year the first day of the year falls on a Sunday and we use the Lessons appointed for the Feast of the Naming and Circumcision of Jesus. For each Sunday of the year there are three passages of Scripture and a Psalm. The Old Testament, Psalm and Epistle all carry overtones of intimacy in the initiative and concern of Almighty God for humanity.\n\nThe passage appointed for the Old Testament Lesson is from the Book of Numbers. It tells of the giving of the Aaronic blessing: invoking a God, who the people had experienced in the power and events of the Exodus, as a God of gentleness, a God who has a care and concern for the individual.\n\n24 The LORD bless you and keep you;\n25 the LORD make his face to shine upon you, and be gracious to you;\n26 the LORD lift up his countenance upon you, and give you peace.\n27 So they shall put my name on the Israelites, and I will bless them.\nNumbers6:24-27\n\nWe have as our Psalm, Psalm 8, a psalm that celebrates the majesty and power of the God who the heavens, the earth and all that is in it. Even as he relishes the splendour of it all, the psalmist is lost in wonder:\n\n4 When I consider your heavens, the work of your fingers, ♦︎\nthe moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; ♦︎\nthe son of man, that you should seek him out? Ps 8:4,5\n\nThe God I encounter in the person of Jesus, is the God who accompanied his people in their journey from slavery to freedom in the land he had promised their forefathers, who had stayed with them in their times of faithfulness and their times of failure; even as they brought suffering upon themselves in the trauma and seeming abandonment of the events of the Exile in Babylon, God stayed with his people.\n\nThe God I encounter in the person of Jesus is a God of the huge and the small – the God who truly is the source of all that is, has a care and concern for humanity, for each man and woman made in his image. This is the God to whom I can bring my hopes and fears for the year that lies before me; the one to I can bring my thanks and my regrets or the year that is past.\n\nI find myself turning to the words of a hymn by Timothy Dudley-Smith, one of the great hymn writers of our own age; hymn 103 in our Hymn Book.\n\n3 O Christ the same, secure within whose keeping\nour lives and loves, our days and years remain,\nour work and rest, our waking and our sleeping,\nour calm and storm, our pleasure and our pain –\nO Lord of love, for all our joys and sorrows,\nfor all our hopes, when earth shall fade and flee,\nO Christ the same, beyond our brief tomorrows,\nwe bring our thanks to you for all that is to be.\n\nAs we journey from one year into another, from our past into our future, may we do so in the company of him with whom we may share our joys, knowing he understands our weaknesses and failings, one in whom we can find forgiveness and healing; one in whose presence we can face our future.\n\nEven Jesus Christ our Lord.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Christmas/year A/Naming of Jesus.txt",
        "raw_ocr_content": "Page 1 of 4\nSunday after Christmas – Naming of Jesus – Year A – 2023\nWell here we are – 2022 is behind us and 2023 opens up before us. Around\nthis time of year there are a host of ‘End of Year Specials on our radio and TV\nchannels – looking back over the events of the yea that is past, looking forward\nto try and predict what lies in store for us in the year to come. Of course we\ndon’t need the radio or the TV to do that for us – each of us is probably\nconducting our own review of the year that is past, our own peep into the year\nthat lies ahead.\nWe look back, I would suspect with a mixture of thanks and regrets. Some of\nyou may be saying, ‘Boy, am I glad to see the back of 2022’ – it may have\nbeen a year of crisis, anxiety over the health or well-being of a loved one, or\nyourself, maybe a year of bereavement – or just a year when things have just\ngone wrong in your life. For some of us though this will have been a good\nyear, one we will recall with a smile. Perhaps romance has been in the air in\nyour family – maybe a wedding or engagement, the arrival of a child. Or\nmaybe, and more probably, there’s been a bit of both – there have been\nmoments of dark and light in the year that is past.\nWe look forward to the coming year with a mixture of hope and fear. There\nare events that are planned that we anticipate with excitement. Maybe there is\na wedding, a birth. Maybe someone we know is going to college, leave\ncollege, start a job. Maybe a long-awaited retirement is in the air this year.\nThose feelings of thanks and regret, hope and fear – while at one level we may\nshare them with others, they are still very personal. In the case of regret or\nfear, there can be a loneliness. Does anyone notice, does anyone care? Even\nPage 2 of 4\nSunday after Christmas – Naming of Jesus – Year A – 2023\nour enthusiasm, our hopes – we long to share them with someone who really\nunderstands.\nWe enter into this combination of nostalgia and anticipation, regret and\noptimism in the context of this Festival of Christmas with its themes of\ncelebration of the birth of Jesus, Emmanuel, God coming among us in the\nperson of Jesus. A great deal of theological hair has flown, theological careers\nhave been made, and for that matter broken over what we are to understand\nabout this whole concept of Incarnation. In the past Councils of the Church\nhave been called to decide upon the minutiae of precise definitions. It is out of\nthese councils that we have received the Nicene and Apostles’ Creed that we\nuse in public worship. I find it more productive to step back and ask myself\nwhat fundamental truth, what experience of God are people trying to express\nhere; a truth and experience I can take out to try and make sense of my own\npersonal pilgrimage of faith, my own hopes and fears, my own joys and\nregrets.\nThis year the first day of the year falls on a Sunday and we use the Lessons\nappointed for the Feast of the Naming and Circumcision of Jesus. For each\nSunday of the year there are three passages of Scripture and a Psalm. The Old\nTestament, Psalm and Epistle all carry overtones of intimacy in the initiative\nand concern of Almighty God for humanity.\nThe passage appointed for the Old Testament Lesson is from the Book of\nNumbers. It tells of the giving of the Aaronic blessing: invoking a God, who\nPage 3 of 4\nSunday after Christmas – Naming of Jesus – Year A – 2023\nthe people had experienced in the power and events of the Exodus, as a God of\ngentleness, a God who has a care and concern for the individual.\n24 The LORD bless you and keep you;\n25 the LORD make his face to shine upon you, and be gracious to you;\n26 the LORD lift up his countenance upon you, and give you peace.\n27 So they shall put my name on the Israelites, and I will bless them.\nNumbers6:24-27\nWe have as our Psalm, Psalm 8, a psalm that celebrates the majesty\nand power of the God who the heavens, the earth and all that is in it.\nEven as he relishes the splendour of it all, the psalmist is lost in\nwonder:\n4 When I consider your heavens, the work of your fingers, ♦︎\nthe moon and the stars that you have ordained,\n5 What is man, that you should be mindful of him; ♦︎\nthe son of man, that you should seek him out? Ps 8:4,5\nThe God I encounter in the person of Jesus, is the God who accompanied his\npeople in their journey from slavery to freedom in the land he had promised\ntheir forefathers, who had stayed with them in their times of faithfulness and\ntheir times of failure; even as they brought suffering upon themselves in the\ntrauma and seeming abandonment of the events of the Exile in Babylon, God\nstayed with his people.\nThe God I encounter in the person of Jesus is a God of the huge and the small –\nthe God who truly is the source of all that is, has a care and concern for\nhumanity, for each man and woman made in his image. This is the God to\nPage 4 of 4\nSunday after Christmas – Naming of Jesus – Year A – 2023\nwhom I can bring my hopes and fears for the year that lies before me; the one\nto I can bring my thanks and my regrets or the year that is past.\nI find myself turning to the words of a hymn by Timothy Dudley-Smith, one of\nthe great hymn writers of our own age; hymn 103 in our Hymn Book.\n3 O Christ the same, secure within whose keeping\nour lives and loves, our days and years remain,\nour work and rest, our waking and our sleeping,\nour calm and storm, our pleasure and our pain –\nO Lord of love, for all our joys and sorrows,\nfor all our hopes, when earth shall fade and flee,\nO Christ the same, beyond our brief tomorrows,\nwe bring our thanks to you for all that is to be.\nAs we journey from one year into another, from our past into our future, may\nwe do so in the company of him with whom we may share our joys, knowing\nhe understands our weaknesses and failings, one in whom we can find\nforgiveness and healing; one in whose presence we can face our future.\nEven Jesus Christ our Lord."
    }
}