{
    "title": "Palm Sunday - Family Service 2016",
    "date": "2016-03-20",
    "blurb": "This sermon reflects on the events of Palm Sunday and Holy Week, drawing parallels between the historical events and our modern lives. It emphasizes the importance of selflessness and love, as exemplified by Jesus. The sermon also discusses the power of the word 'I' and how it can be used both positively and negatively, urging us to 'cross out' the 'I' in our lives, symbolizing selflessness and humility.",
    "raw_text": "Last Tuesday morning I called down for a special event in the Burrow School. It was Proclamation Day – in common with Schools across the country they had a simple ceremony of raising the flag, singing the National Anthem and a reading of the 1916 Proclamation. Then members of 6th Class read out their 2016 Proclamation, their own vision of the Ireland they will live and work in – there were wonderful themes of inclusion, of respect, of pride in their country. So it was a time of remembering events that lie at the core of the foundation of the State and a vision of the Ireland they would like to see.\n\nThis coming week is Holy Week. It is a week in which we remember events at the very core of our faith – the death and resurrection of Jesus. Jerusalem at the time of Jesus was firmly under Roman rule. People looking for a leader, a Messiah, a liberator. When Jesus was cheered as he entered Jerusalem, he was welcomed as a hero – could this be the Messiah, could this be the liberator? Less than a week later he was jeered as he was lead out of the city to be crucified.\n\nWhy did the cheers turn to jeers? What was it about Jesus that people found so threatening, so upsetting?\n\nI’m going to start by thinking of the letter ‘I’ We use this letter a lot. We use to express opinions – ‘I think Howth is great’ We use it to express our affection – we say ‘I love you’ We use it to encourage other people – ‘I think you are looking great today’; ‘I think you are really good at doing that’. But ‘I’ is not always so pleasant. We can use it to express prejudice – ‘I think foreigners are lazy, or stupid, or dishonest.’ We can use it to express hatred – ‘I hate you.’; ‘I despise you.’ We can use it to undermine people – ‘I think you are stupid.’; ‘I think you are ugly.’\n\nSo the letter ‘I’ needs to be controlled a bit. In fact sometimes I need to cross the letter ‘I’ out. (Put cross bar in place and hold up) Now what do I get? That’s right a cross – the cross is, if you like, the letter ‘I’ crossed out. ‘I’ crossed out in many ways describes not just the death of Jesus but the whole of his life. That is summed beautifully in those words Paul wrote to the Church at Philippi. I am going to read it from the translation, ‘The Message’.\n\n> Phil2:5-8 Think of yourselves the way Christ Jesus thought of himself. He had equal status with God but didn’t think so much of himself that he had to cling to the advantages of that status no matter what. Not at all. When the time came, he set aside the privileges of deity and took on the status of a slave, became human! Having become human, he stayed human. It was an incredibly humbling process. He didn’t claim special privileges. Instead, he lived a selfless, obedient life and then died a selfless, obedient death—and the worst kind of death at that—a crucifixion.\n\nOn one occasion Jesus told his followers, “If any want to become my followers, let them deny themselves and take up their cross daily and follow me.” What does that mean - taking up our cross daily?\n\nWe find our example in the life of Jesus, life lived with the ‘I’ crossed out. People found that threatening, because it meant they had to change the way they looked at themselves, at God, at other people. The cross, God’s amazing love for us in Jesus, happened in the past - but it is not just about the past, it is about life now. A life in which I encourage people rather than undermine them; in which I express love and not hatred, in which we turn our back on prejudice and instead honour one another.\n\nI will just close with the prayer of St Ignatius which I think gives us a lovely pattern for living in the footsteps of Jesus.\n\n> Teach us, good Lord, to serve thee as thou deservest;\n> To give, and not to count the cost,\n> to fight, and not to heed the wounds,\n> to toil, and not to seek for rest,\n> to labor, and not to ask for any reward,\n> save that of knowing that we do thy will.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/year C/palmsunday2016familyservice.txt",
        "raw_ocr_content": "Page 1 of 4\nPALM SUNDAY – 2016 – Family Service\nLast Tuesday morning I called down for a special event in the Burrow\nSchool. It was Proclamation Day – in common with Schools across\nthe country they had a simple ceremony of raising the flag, singing the\nNational Anthem and a reading of the 1916 Proclamation. Then\nmembers of 6th Class read out their 2016 Proclamation, their own\nvision of the Ireland they will live and work in – there were wonderful\nthemes of inclusion, of respect, of pride in their country. So it was a\ntime of remembering events that lie at the core of the foundation of\nthe State and a vision of the Ireland they would like to see.\nThis coming week is Holy Week. It is a week in which we remember\nevents at the very core of our faith – the death and resurrection of\nJesus.\nJerusalem at the time of Jesus was firmly under Roman rule.\nPeople looking for a leader, a Messiah, a liberator.\nWhen Jesus was cheered as he entered Jerusalem, he was welcomed as\na hero – could this be the Messiah, could this be the liberator?\nLess than a week later he was jeered as he was lead out of the city to\nbe crucified.\nPage 2 of 4\nPALM SUNDAY – 2016 – Family Service\nWhy did the cheers turn to jeers? What was it about Jesus that people\nfound so threatening, so upsetting?\nI’m going to start by thinking of the letter ‘I’\nWe use this letter a lot.\nWe use to express opinions – ‘I think Howth is great’\nWe use it to express our affection – we say ‘I love you’\nWe use it to encourage other people – ‘I think you are looking great\ntoday’; ‘I think you are really good at doing that’.\nBut ‘I’ is not always so pleasant.\nWe can use it to express prejudice – ‘I think foreigners are lazy, or\nstupid, or dishonest.’\nWe can use it to express hatred – ‘I hate you.’; ‘I despise you.’\nWe can use it to undermine people – ‘I think you are stupid.’; ‘I think\nyou are ugly.’\nPage 3 of 4\nPALM SUNDAY – 2016 – Family Service\nSo the letter ‘I’ needs to be controlled a bit. In fact sometimes I need\nto cross the letter ‘I’ out. (Put cross bar in place and hold up)\nNow what do I get?\nThat’s right a cross – the cross is, if you like, the letter ‘I’ crossed out.\n‘I’ crossed out in many ways describes not just the death of Jesus but\nthe whole of his life. That is summed beautifully in those words Paul\nwrote to the Church at Philippi. I am going to read it from the\ntranslation, ‘The Message’.\nPhil2:5-8 Think of yourselves the way Christ Jesus thought of\nhimself. He had equal status with God but didn’t think so much\nof himself that he had to cling to the advantages of that status\nno matter what. Not at all. When the time came, he set aside the\nprivileges of deity and took on the status of a slave, became\nhuman! Having become human, he stayed human. It was an\nincredibly humbling process. He didn’t claim special privileges.\nInstead, he lived a selfless, obedient life and then died a\nselfless, obedient death—and the worst kind of death at that—a\ncrucifixion.\nOn one occasion Jesus told his followers, “If any want to become my\nfollowers, let them deny themselves and take up their cross daily and\nfollow me.” What does that mean - taking up our cross daily?\nPage 4 of 4\nPALM SUNDAY – 2016 – Family Service\nWe find our example in the life of Jesus, life lived with the ‘I’ crossed\nout. People found that threatening, because it meant they had to\nchange the way they looked at themselves, at God, at other people.\nThe cross, God’s amazing love for us in Jesus, happened in the past -\nbut it is not just about the past, it is about life now. A life in which I\nencourage people rather than undermine them; in which I express love\nand not hatred, in which we turn our back on prejudice and instead\nhonour one another.\nI will just close with the prayer of St Ignatius which I think gives us a\nlovely pattern for living in the footsteps of Jesus.\nTeach us, good Lord, to serve thee as thou deservest;\nTo give, and not to count the cost,\nto fight, and not to heed the wounds,\nto toil, and not to seek for rest,\nto labor, and not to ask for any reward,\nsave that of knowing that we do thy will."
    }
}