{
    "title": "Power of Pentecost",
    "date": "2020-05-31",
    "blurb": "This sermon, delivered on Pentecost Sunday, explores the concept of power in the context of the Holy Spirit. It contrasts power as control and coercion with power as enabling and healing. The sermon emphasizes the role of forgiveness and reconciliation in the Christian community, facilitated by the Holy Spirit. It ends with a story about a tribal custom in Kenya that symbolizes reconciliation.",
    "raw_text": "PENTECOST – Year A – 2020\n\nAlmighty God, who on the day of Pentecost sent your Holy Spirit to the apostles with the wind from heaven and in tongues of flame, filling them with joy and boldness to preach the gospel: By the power of the same Spirit strengthen us to witness to your truth and to draw everyone to the fire of your love.\n\nSo runs the collect of this day of Pentecost, the day on which we remember the coming of the Holy Spirit on the disciples. The collect speaks of ‘the power of the same Spirit’.\n\nPower. That word set me thinking about how we use that word. What comes into your mind as you hear that?\n\nThere is power as enabling, the power that comes through the sun that warms, that illuminates, enabling growth of plants in our gardens. There is also a darker side to the word power, power as control, as coercion, as manipulation.\n\nAt this time of year, on the Feast of Pentecost, one of the lessons that would be read would be from the Acts of the Apostles, describing the coming of the Holy Spirit on the disciples as they assembled in the Upper Room. It is a passage full of vivid images; the rushing winds, the tongues of flame, the power to speak in other languages. This is a power that enables, that enables people to hear the Good News, the wonderful works of God in their own languages.\n\nThe passage set as our Gospel reading for today is very different. It has nothing of the sound and drama of the reading from Acts. It is part of the passage we read on the Sunday after Easter, as we read of the Risen Lord breathing on the disciples:\n\n> 21Jesus said to them again, ‘Peace be with you. As the Father has sent me, so I send you.’ 22When he had said this, he breathed on them and said to them, ‘Receive the Holy Spirit. 23If you forgive the sins of any, they are forgiven them; if you retain the sins of any, they are retained.’ John 20:21ff\n\nThis passage has in the past all too easily been associated with power; power not as enabling but rather as controlling, coercing; words associated with excommunication, disciplining dissident members.\n\nLet us try to look at it form a different angle, the context of the petition of the Lord’s Prayer: ‘forgive us our sins as we forgive those who sin against us’\n\nIn a situation of conflict, in a situation where one person has a grievance against another, that results in a barrier that can only dismantled through a process of reconciliation. As long as I hang on to a grievance that barrier remains. If I am prepared to let go of that grievance, then this opens up a path to potential reconciliation. So let us go back again to those words in our Gospel reading:\n\n> 23If you forgive the sins of any, they are forgiven them; if you retain the sins of any, they are retained.’\n\nThey become not a statement of power exerted over a difficult or dissident member of the Church, rather they become a simple statement of fact about relationships within families, within the community, within the Church. If I forgive, if I let go of a grievance, barriers to reconciliation begin to fall. If I don’t forgive, if I hang on to a grievance, if its not forgiven, those barriers remain.\n\nNow, you don’t need me to tell you, this can be very difficult, very painful. The other party may not want to co-operate; but it can be an occasion of healing, of new beginnings. But in this context, viewed from this perspective, the words of Jesus as he breathed on the disciples, ‘Receive the Holy Spirit’ become not words of power and authority to be exercised over another. Rather they become words of enabling, words of healing.\n\nWhich brings me back to the definition of the work of the Holy Spirit that we find in the Revised Catechism of the Church of Ireland, ‘The Holy Spirit enables me to become more like Jesus’. Reconciliation becomes not a burden placed upon me. It is in fact a work, a gift of the Holy Spirit enabling growth, enabling healing in the Church and in the community.\n\nAs I thought about that, my mind went back to a story told by a returned CMS missionary of his experiences working among the Masai people in Kenya. They had incorporated a tribal custom into the passing of the peace in the Communion Service. If there was a conflict in the community a sign of reconciliation was the passing of a piece of grass between the two parties. So, when the clergyman arrived in the village to celebrate communion he would pick up a piece of grass on the way in and pass it to a member of the community. In the course of assembling for the service and in the course of the service itself, the grass would pass from member to member and then when the collection was brought up the grass would be brought up with it – unless that is, the grass had not been passed between two individuals. If the grass did not appear, the celebrant went down to people who felt they could not pass the grass – maybe there had been a dispute over grazing or something – the service did not proceed until that dispute was resolved, until there was reconciliation and the community was as one.\n\nMay we, as individuals, as a community be open to the prompting of the Holy Spirit to bring something of the reconciling and healing love of Jesus into the world in which we live.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Easter/Year A/pentecost2020.txt",
        "raw_ocr_content": "Page 1 of 4\nPENTECOST – Year A – 2020\nLink to video of an act of worship https://youtu.be/tqYCQxq7cNw\n23If you forgive the sins of any, they are forgiven them; if you retain the sins of any, they\nare retained.’ John 20:23\nAlmighty God,\nwho on the day of Pentecost sent your Holy Spirit to the apostles\nwith the wind from heaven and in tongues of flame,\nfilling them with joy and boldness to preach the gospel:\nBy the power of the same Spirit\nstrengthen us to witness to your truth\nand to draw everyone to the fire of your love.\nSo runs the collect of this day of Pentecost, the day on which we remember the\ncoming of the Holy Spirit on the disciples. The collect speaks of ‘the power of\nthe same Spirit’.\nPower. That word set me thinking about how we use that word. What comes\ninto your mind as you hear that?\nThere is power as enabling, the power that comes through the sun that warms,\nthat illuminates, enabling growth of plants in our gardens. There is also a\ndarker side to the word power, power as control, as coercion, as manipulation.\nAt this time of year, on the Feast of Pentecost, one of the lessons that would be\nread would be from the Acts of the Apostles, describing the coming of the\nHoly Spirit on the disciples as they assembled in the Upper Room. It is a\npassage full of vivid images; the rushing winds, the tongues of flame, the\npower to speak in other languages. This is a power that enables, that enables\npeople to hear the Good News, the wonderful works of God in their own\nlanguages.\nPage 2 of 4\nPENTECOST – Year A – 2020\nThe passage set as our Gospel reading for today is very different. It has\nnothing of the sound and drama of the reading from Acts. It is part of the\npassage we read on the Sunday after Easter, as we read of the Risen Lord\nbreathing on the disciples:\n21Jesus said to them again, ‘Peace be with you. As the Father has sent\nme, so I send you.’ 22When he had said this, he breathed on them and\nsaid to them, ‘Receive the Holy Spirit. 23If you forgive the sins of any,\nthey are forgiven them; if you retain the sins of any, they are retained.’\nJohn 20:21ff\nThis passage has in the past all too easily been associated with power; power\nnot as enabling but rather as controlling, coercing; words associated with\nexcommunication, disciplining dissident members.\nLet us try to look at it form a different angle, the context of the petition of the\nLord’s Prayer: ‘forgive us our sins as we forgive those who sin against us’\nIn a situation of conflict, in a situation where one person has a grievance\nagainst another, that results in a barrier that can only dismantled through a\nprocess of reconciliation. As long as I hang on to a grievance that barrier\nremains. If I am prepared to let go of that grievance, then this opens up a path\nto potential reconciliation. So let us go back again to those words in our\nGospel reading:\n23If you forgive the sins of any, they are forgiven them; if you retain\nthe sins of any, they are retained.’\nThey become not a statement of power exerted over a difficult or dissident\nmember of the Church, rather they become a simple statement of fact about\nPage 3 of 4\nPENTECOST – Year A – 2020\nrelationships within families, within the community, within the Church. If I\nforgive, if I let go of a grievance, barriers to reconciliation begin to fall. If I\ndon’t forgive, if I hang on to a grievance, if its not forgiven, those barriers\nremain.\nNow, you don’t need me to tell you, this can be very difficult, very painful.\nThe other party may not want to co-operate; but it can be an occasion of\nhealing, of new beginnings. But in this context, viewed from this perspective,\nthe words of Jesus as he breathed on the disciples, ‘Receive the Holy Spirit’\nbecome not words of power and authority to be exercised over another. Rather\nthey become words of enabling, words of healing.\nWhich brings me back to the definition of the work of the Holy Spirit that we\nfind in the Revised Catechism of the Church of Ireland, ‘The Holy Spirit\nenables me to become more like Jesus’. Reconciliation becomes not a burden\nplaced upon me. It is in fact a work, a gift of the Holy Spirit enabling growth,\nenabling healing in the Church and in the community.\nAs I thought about that, my mind went back to a story told by a returned CMS\nmissionary of his experiences working among the Masai people in Kenya.\nThey had incorporated a tribal custom into the passing of the peace in the\nCommunion Service. If there was a conflict in the community a sign of\nreconciliation was the passing of a piece of grass between the two parties. So,\nwhen the clergyman arrived in the village to celebrate communion he would\npick up a piece of grass on the way in and pass it to a member of the\ncommunity. In the course of assembling for the service and in the course of the\nPage 4 of 4\nPENTECOST – Year A – 2020\nservice itself, the grass would pass from member to member and then when the\ncollection was brought up the grass would be brought up with it – unless that\nis, the grass had not been passed between two individuals. If the grass did not\nappear, the celebrant went down to people who felt they could not pass the\ngrass – maybe there had been a dispute over grazing or something – the service\ndid not proceed until that dispute was resolved, until there was reconciliation\nand the community was as one.\nMay we, as individuals, as a community be open to the prompting of the Holy\nSpirit to bring something of the reconciling and healing love of Jesus into the\nworld in which we live."
    }
}