{
    "title": "Divine Reflection",
    "date": "2016-02-07",
    "blurb": "This sermon discusses the teachings of St Gregory Nazianzen, emphasizing the importance of introspection and connection with God. It highlights the belief in the Trinity and the full humanity of Christ. The sermon encourages us to strive to be like Christ, as he became like us.",
    "raw_text": "St Gregory Nazianzen wrote:\n\n> Nothing seems to me greater than this: to silence one's senses, to emerge from the flesh of the world, to withdraw into oneself, no longer to be concerned with human things other than what is strictly necessary;\n\n> to converse with oneself and with God, to lead a life that transcends the visible; to bear in one's soul divine images, ever pure, not mingled with earthly or erroneous forms;\n\n> truly to be a perfect mirror of God and of divine things, and to become so more and more, taking light from light…;\n\n> to enjoy, in the present hope, the future good, and to converse with angels; to have already left the earth even while continuing to dwell on it, borne aloft by the spirit.\n\nNazianzen felt deeply the yearning to draw close to God, to be united with him. He expressed it in one of his poems in which he writes:\n\n> Among the great billows of the sea of life, here and there whipped up by wild winds… one thing alone is dear to me, my only treasure, comfort and oblivion in my struggle, the light of the Blessed Trinity.\n\nThus, Gregory made the light of the Trinity shine forth, defending the faith proclaimed at the Council of Nicea: one God in three persons, equal and distinct – Father, Son and Holy Spirit – a triple light gathered into one splendour.\n\nTherefore, Gregory says further, in line with St Paul (1 Cor 8: 6): \n\n> For us there is one God, the Father, from whom is all; and one Lord, Jesus Christ, through whom is all; and one Holy Spirit, in whom is all.\n\nGregory gave great prominence to Christ's full humanity: to redeem man in the totality of his body, soul and spirit, Christ assumed all the elements of human nature, otherwise man would not have been saved.\n\nDisputing the heresy of Apollinaris, who held that Jesus Christ had not assumed a rational mind, Gregory tackled the problem in the light of the mystery of salvation:\n\n> What has not been assumed has not been healed, and if Christ had not been endowed with a rational mind, how could he have been a man?\n\nIt was precisely our mind and our reason that needed and needs the relationship, the encounter with God in Christ.\n\nHaving become a man, Christ gave us the possibility of becoming, in turn, like him.\n\nNazianzus exhorted people:\n\n> Let us seek to be like Christ, because Christ also became like us: to become gods through him since he himself, through us, became a man. He took the worst upon himself to make us a gift of the best.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/presentationofchrist2016 - notes.txt",
        "raw_ocr_content": "St Gregory Nazianzen…wrote: “Nothing seems to me greater than this: to silence one’s\nsenses, to emerge from the flesh of the world, to withdraw into oneself, no longer to be\nconcerned with human things other than what is strictly necessary;\n“to converse with oneself and with God, to lead a life that transcends the visible; to bear in\none’s soul divine images, ever pure, not mingled with earthly or erroneous forms;\n“truly to be a perfect mirror of God and of divine things, and to become so more and more,\ntaking light from light…;\n“to enjoy, in the present hope, the future good, and to converse with angels; to have already\nleft the earth even while continuing to dwell on it, borne aloft by the spirit”.\n[…] Nazianzen…felt deeply the yearning to draw close to God, to be united with him. He\nexpressed it in one of his poems in which he writes:\n“Among the great billows of the sea of life, here and there whipped up by wild winds… one\nthing alone is dear to me, my only treasure, comfort and oblivion in my struggle, the light of\nthe Blessed Trinity”.\nThus, Gregory made the light of the Trinity shine forth, defending the faith proclaimed at the\nCouncil of Nicea: one God in three persons, equal and distinct – Father, Son and Holy Spirit –\n“a triple light gathered into one splendour”.\nTherefore, Gregory says further, in line with St Paul (1 Cor 8: 6): “For us there is one God,\nthe Father, from whom is all; and one Lord, Jesus Christ, through whom is all; and one Holy\nSpirit, in whom is all”.\nGregory gave great prominence to Christ’s full humanity: to redeem man in the totality of his\nbody, soul and spirit, Christ assumed all the elements of human nature, otherwise man would\nnot have been saved.\nDisputing the heresy of Apollinaris, who held that Jesus Christ had not assumed a rational\nmind, Gregory tackled the problem in the light of the mystery of salvation:\n“What has not been assumed has not been healed”, and if Christ had not been “endowed with\na rational mind, how could he have been a man?”\nIt was precisely our mind and our reason that needed and needs the relationship, the encounter\nwith God in Christ.\nHaving become a man, Christ gave us the possibility of becoming, in turn, like him.\nNazianzus exhorted people:\n“Let us seek to be like Christ, because Christ also became like us: to become gods through\nhim since he himself, through us, became a man. He took the worst upon himself to make us a\ngift of the best”."
    }
}