{
    "title": "Facing Temptation",
    "date": "2016-02-07",
    "blurb": "In this sermon, Kevin explores the concept of temptation and testing, drawing from the Lord's Prayer and the Letter to the Hebrews. He emphasizes the humanity of Jesus, who experienced the same trials and temptations as we do, and is therefore able to help us in our times of need. Kevin encourages us to hold fast to our faith, even in times of doubt and despair, knowing that we are not alone.",
    "raw_text": "Oh Rector! Why do they keep on changing the words? It may be the words of a hymn, or a prayer – or just the whole book. On occasions I would sympathise – particularly when it seems to be for no particularly good reason other than being PC. Others however I would want to stick up for. On a personal basis I’ve developed a great affection for the modern wording of the Lord’s Prayer and it would be the one I would have used for many years in my own private prayer – I much prefer the petition ‘ forgive us our sins as we forgive those who sin against us. It names sin for what it is whereas ‘trespassing’ is something you don’t do on a building site.\n\nDifferent translations, different ways of putting things can help us explore the meaning of those texts, originally written in Greek and dating back to the earliest days of the Church, that are so much part of our faith, of our worship. I want this morning to look at the petition in the Lord’s Prayer ‘Lead us not into temptation’ and the closing verses of the portion we read from the Letter to the Hebrews:\n\n> For this reason he had to be made like his brothers in every way, in order that he might become a merciful and faithful high priest in service to God, and that he might make atonement for the sins of the people. Because he himself suffered when he was tempted, he is able to help those who are being tempted. Hebrews 2:17-18\n\nFirst, to the Lord’s Prayer, ‘Lead us not into temptation’. In the Gospel texts on which the Lord’s Prayer is based temptation is our translation of the Greek word peirasmon which carries the meaning of test, time of trial. Do not bring us to the test, do not bring us to the time of trial. This covers a lot more than just the simple temptations we face in life. One commentary I read puts it like this, ‘Don’t bring us to the test, don’t bring us to the point where my faith snaps.’ The Message, a translation I would sometimes use in our Family Services, which is part translation, part commentary, puts it like this:\n\n> Keep us safe from ourselves and the Devil\n\nThat brings us to those situations where life seems so difficult – our weakness in the face of familiar temptation; times when life seems so unfair, so difficult – the suffering of loved ones, those situations when we’re driven to near despair and God seems so far away – we fell alone, utterly alone; we’re literally hanging on to our faith by our fingertips.\n\nLord don’t bring me to the test, don’t leave me alone in the darkness of my doubt and despair.\n\nWith that in mind, let us turn to the passage we read from Hebrews:\n\n> For this reason he had to be made like his brothers in every way, in order that he might become a merciful and faithful high priest in service to God, and that he might make atonement for the sins of the people. Because he himself suffered when he was tempted, he is able to help those who are being tempted. Hebrews 2:17-18\n\nAgain the word we have translated as ‘tempted’ is the Greek verb peirazein has the same sense of being tested.\n\n> Because he was tempted, because he was tested …\n\n> he is able to help those who are being tempted, being tested ……\n\nHe became like us in every respect. He knew what it was like to hunger, to thirst; what it was to feel alone, to laugh, to know friendship and love; he knew what it was to weep, to know the betrayal and abandonment of friends and in the darkness of the Cross to know what it was to feel alone, utterly alone, that not even God seemed to be there.\n\n> Because he was tempted, because he was tested …\n\n> he is able to help those who are being tempted, being tested ……\n\nThis is where Incarnation, God among us in the person of Jesus, really rings true to me. I can say the words of the Creed\n\n> We believe in one Lord, Jesus Christ,\n\n> the only Son of God,\n\n> eternally begotten of the Father,\n\n> God from God, Light from Light,\n\n> true God from true God,\n\n> begotten, not made,\n\n> of one Being with the Father.\n\n> ………………………………\n\n> he came down from heaven,\n\n> was incarnate by the Holy Spirit of the Virgin Mary,\n\n> and was made man.\n\nThese are important statements, honed in passionate debate as the early Church developed its understanding of who was this Jesus of Nazareth who was born, who was crucified, who died …..\n\nBut it is not the words of the Creed I turn to as I struggle with the complexities of life, with the issues of sickness, of life, of death, with my own experiences of doubt, of frustration, of confusion. Rather it is a person I turn to. One who knows, really knows what it is to be human, who knows me as I am, in my strengths and weaknesses, one who has accepted me, one who has loved me, who has redeemed me. that is why the words from this Letter to the Hebrews ring so true to me as well as this lovely passage that comes a little later in this Letter to the Hebrews:\n\n> Since, then, we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast to our confession. 15 For we do not have a high priest who is unable to sympathize with our weaknesses, but we have one who in every respect has been tested as we are, yet without sin. 16 Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Hebrews 4:14-16\n\nLead us not into temptation. Lord, do not bring me to the test, to the time of trial, to the point of breaking. In the darkness let me sense your presence and know that you are with me, even to the very end of time.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Epiphany/year C/presentationofchrist2016.txt",
        "raw_ocr_content": "Page 1 of 4\nPresentation of Christ – 2016 – Year C\nOh Rector! Why do they keep on changing the words? It may be the words of\na hymn, or a prayer – or just the whole book.\nOn occasions I would sympathise – particularly when its seems to be for no\nparticularly good reason other than being PC. Others however I would want to\nstick up for. On a personal basis I’ve develop a great affection for the modern\nwording of the Lord’s Prayer and it would be the one I would have used for\nmany years in my own private prayer – I much prefer the petition ‘ forgive us\nour sins as we forgive those who sin against us. It names sin for what it is\nwhereas ‘trespassing’ is something you don’t do on a building site.\nDifferent translations, different ways of putting things can help us explore the\nmeaning of those texts, originally written in Greek and dating back to the\nearliest days of the Church, that are so much part of our faith, of our worship.\nI want this morning to look at the petition in the Lord’s Prayer ‘Lead us not\ninto temptation’ and the closing verses of the portion we read from the Letter to\nthe Hebrews:\nFor this reason he had to be made like his brothers in every way, in\norder that he might become a merciful and faithful high priest in\nservice to God, and that he might make atonement for the sins of the\npeople. Because he himself suffered when he was tempted, he is able\nto help those who are being tempted. Hebrews 2:17-18\nFirst, to the Lord’s Prayer, ‘Lead us not into temptation’. In the Gospel texts\non which the Lord’s Prayer is based temptation is our translation of the Greek\nword peirasmon which carries the meaning of test, time of trial. Do not bring\nus to the test, do not bring us to the time of trial. This covers a lot more than\nPage 2 of 4\nPresentation of Christ – 2016 – Year C\njust the simple temptations we face in life. One commentary I read puts it like\nthis, ‘Don’t bring us to the test, don’t bring us to the point where my faith\nsnaps.’ The Message, a translation I would sometimes use in our Family\nServices, which is part translation, part commentary, puts it like this:\nKeep us safe from ourselves and the Devil\nThat brings us to those situations where life seems so difficult – our weakness\nin the face of familiar temptation; times when life seems so unfair, so difficult\n– the suffering of loved ones, those situations when we’re driven to near\ndespair and God seems so far away – we fell alone, utterly alone; we’re\nliterally hanging on to our faith by our fingertips.\nLord don’t bring me to the test, don’t leave me alone in the darkness of my\ndoubt and despair.\nWith that in mind, let us turn to the passage we read from Hebrews:\nFor this reason he had to be made like his brothers in every way, in\norder that he might become a merciful and faithful high priest in\nservice to God, and that he might make atonement for the sins of the\npeople. Because he himself suffered when he was tempted, he is able\nto help those who are being tempted. Hebrews 2:17-18\nAgain the word we have translated as ‘tempted’ is the Greek verb peirazein\nhas the same sense of being tested.\nBecause he was tempted, because he was tested …..\nhe is able to help those who are being tempted, being tested ……\nPage 3 of 4\nPresentation of Christ – 2016 – Year C\nHe became like us in every respect. He knew what it was like to hunger, to\nthirst; what it was to feel alone, to laugh, to know friendship and love; he knew\nwhat it was to weep, to know the betrayal and abandonment of friends and in\nthe darkness of the Cross to know what it was to feel alone, utterly alone, that\nnot even God seemed to be there.\nBecause he was tempted, because he was tested …..\nhe is able to help those who are being tempted, being tested ……\nThis is where Incarnation, God among us in the person of Jesus, really rings\ntrue to me. I can say the words of the Creed\nWe believe in one Lord, Jesus Christ,\nthe only Son of God,\neternally begotten of the Father,\nGod from God, Light from Light,\ntrue God from true God,\nbegotten, not made,\nof one Being with the Father.\n………………………………..\nhe came down from heaven,\nwas incarnate by the Holy Spirit of the Virgin Mary,\nand was made man.\nThese are important statements, honed in passionate debate as the early Church\ndeveloped its understanding of who was this Jesus of Nazareth who was born,\nwho was crucified, who died …..\nBut it is not the words of the Creed I turn to as I struggle with the complexities\nof life, with the issues of sickness, of life, of death, with my own experiences\nof doubt, of frustration, of confusion. Rather it is a person I turn to. One who\nknows, really knows what it is to be human, who knows me as I am, in my\nPage 4 of 4\nPresentation of Christ – 2016 – Year C\nstrengths and weaknesses, one who has accepted me, one who has loved me,\nwho has redeemed me. that is why the words from this Letter to the Hebrews\nring so true to me as well as this lovely passage that comes a little later in this\nLetter to the Hebrews:\nSince, then, we have a great high priest who has passed through the\nheavens, Jesus, the Son of God, let us hold fast to our confession. 15\nFor we do not have a high priest who is unable to sympathize with our\nweaknesses, but we have one who in every respect has been tested as\nwe are, yet without sin. 16 Let us therefore approach the throne of grace\nwith boldness, so that we may receive mercy and find grace to help in\ntime of need. Hebrews 4:14-16\nLead us not into temptation. Lord, do not bring me to the test, to the time of\ntrial, to the point of breaking. In the darkness let me sense your presence and\nknow that you are with me, even to the very end of time."
    }
}