{
    "title": "Mount of Olives Teachings",
    "date": "2015-11-15",
    "blurb": "Kevin's sermon reflects on the significance of the Mount of Olives in the life and teachings of Jesus. It explores various biblical passages where the Mount of Olives serves as a backdrop for key events and parables, emphasizing its role in prophecy and as a place of teaching and reflection.",
    "raw_text": "2 Samuel 15:29-30 describes a poignant scene of David ascending the Mount of Olives in mourning, setting a precedent for this location's significance. Similarly, in Matthew 26:29, Jesus speaks of a future communion in the Father's kingdom, a promise reiterated in Mark 14:25 about not drinking the fruit of the vine until in God's kingdom.\n\nEzekiel 11:23 and Zechariah 14:3-4 prophesy the glory of the LORD and the Lord's battle, respectively, with the Mount of Olives as a focal point. The Gospels of Matthew and Mark recount Jesus' approach to Jerusalem, his instructions to his disciples regarding a colt, and the events leading to his betrayal and Peter's denial, all within the vicinity of the Mount of Olives.\n\nLuke's account in chapters 19 and 21 highlights Jesus' entry into Jerusalem and his teachings at the temple, with nights spent on the Mount of Olives. Finally, Luke 22:39 captures Jesus' prayer on the Mount of Olives, urging his disciples to pray against temptation.\n\n> \"Blessed is the king who comes in the name of the Lord! Peace in heaven, and glory in the highest heaven!\" - Luke 19:37-38\n\nEvery day, Jesus taught in the temple and retreated to the Mount of Olives at night, as described in Luke 21:37-38. This rhythm of teaching and reflection underscores the Mount's role as a place of spiritual significance.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper282015 - sermon notes - not used.txt",
        "raw_ocr_content": "2Sa 15:29. When he was sitting on the Mount of Olives, the disciples came to\nAbiathar carried the ark of God back to Jerusalem, and they him privately, saying, \"Tell us, when will this be, and what will be the\nremained there. sign of your coming and of the end of the age?\" 4 Jesus answered\nthem, \"Beware that no one leads you astray.\n2Sa 15:30 But David went up the ascent of the Mount of Olives,\nweeping as he went, with his head covered and walking barefoot;\nand all the people who were with him covered their heads and went Mt 26:29.\nup, weeping as they went. I tell you, I will never again drink of this fruit of the vine until that day\nwhen I drink it new with you in my Father's kingdom.\"\nEze 11:23. Mt 26:30 When they had sung the hymn, they went out to the Mount\n23 And the glory of the LORD ascended from the middle of the city, of Olives.\nand stopped on the mountain east of the city.\nMk 11:1.\nZec 14:3. When they were approaching Jerusalem, at Bethphage and\nBethany, near the Mount of Olives, he sent two of his disciples 2\nThen the LORD will go forth and fight against those nations as when\nand said to them, \"Go into the village ahead of you, and immediately\nhe fights on a day of battle. 4 On that day his feet shall stand on the\nas you enter it, you will find tied there a colt that has never been\nMount of Olives, which lies before Jerusalem on the east; and the\nridden; untie it and bring it.\nMount of Olives shall be split in two from east to west by a very wide\nvalley;\nMk 13:3.\nMk 13:3 When he was sitting on the Mount of Olives opposite the\ntemple, Peter, James, John, and Andrew asked him privately, 4 \"Tell\nMt 21:1. us, when will this be, and what will be the sign that all these things\nare about to be accomplished?\"\nWhen they had come near Jerusalem and had reached Bethphage,\nat the Mount of Olives, Jesus sent two disciples, 2 saying to them,\nMk 14:25.\n\"Go into the village ahead of you, and immediately you will find a\ndonkey tied, and a colt with her; untie them and bring them to me. Truly I tell you, I will never again drink of the fruit of the vine until that\nday when I drink it new in the kingdom of God.\"\nMt 24:2.\nMk 14:26 Peter's Denial Foretold\nThen he asked them, \"You see all these, do you not? Truly I tell you,\nnot one stone will be left here upon another; all will be thrown\nWhen they had sung the hymn, they went out to the Mount of\ndown.\"\nOlives. 27 And Jesus said to them, \"You will all become deserters;\nfor it is written,\nMt 24:3 Signs of the End of the Age\nLk 19:28. Jn 7:53.\nAfter he had said this, he went on ahead, going up to Jerusalem. 53 [Then each of them went home, 1 while Jesus went to the Mount\nof Olives. 2 Early in the morning he came again to the temple. All\nLk 19:29 When he had come near Bethphage and Bethany, at the the people came to him and he sat down and began to teach them.\nplace called the Mount of Olives, he sent two of the disciples, 30 3 The scribes and the Pharisees brought a woman who had been\nsaying, \"Go into the village ahead of you, and as you enter it you will caught in adultery\nfind tied there a colt that has never been ridden\nLk 19:37.\n37 As he was now approaching the path down from the Mount of\nOlives, the whole multitude of the disciples began to praise God\njoyfully with a loud voice for all the deeds of power that they had\nseen, 38 saying,\n\"Blessed is the king\nwho comes in the name of the Lord!\nPeace in heaven,\nand glory in the highest heaven!\"\nLk 21:37.\nLk 21:37 Every day he was teaching in the temple, and at night he\nwould go out and spend the night on the Mount of Olives, as it was\ncalled. 38 And all the people would get up early in the morning to\nlisten to him in the temple.\nLk 22:39\nLk 22:39 Jesus Prays on the Mount of Olives\nHe came out and went, as was his custom, to the Mount of Olives;\nand the disciples followed him. 40 When he reached the place, he\nsaid to them, \"Pray that you may not come into the time of trial.\""
    }
}