{
    "title": "Grace in Weakness",
    "date": "2015-07-05",
    "blurb": "Kevin reflects on the concept of 'thorn in the flesh' as a metaphor for life's challenges, drawing from Paul's words in 2 Corinthians and the journey of Rev David Watson with cancer. He emphasizes the sufficiency of God's grace in our weakness and the transformative power of God's love and healing, encouraging a life of discipleship and faithfulness.",
    "raw_text": "During the week I turned up a book I had read many years ago, 'Fear no Evil' by the late Rev David Watson. I was prompted to return to this book by the second half of our Second Lesson this morning, from the 2nd Letter to the Corinthians, in which Paul, having spoken of the heights of his spiritual experiences, talks in very human terms of his 'thorn in the flesh':\n\n> Therefore, to keep me from being too elated, a thorn was given me in the flesh, a messenger of Satan to torment me, to keep me from being too elated. Three times I appealed to the Lord about this, that it would leave me, but he said to me, 'My grace is sufficient for you, for power is made perfect in weakness.' 2 Cor 12:7-9\n\nThis book by David Watson is his reflection on his journey with cancer from the date of his diagnosis to his death some 11 months later. Until that diagnosis David Watson, from the beginnings of his ministry in York, had been in great demand as a preacher throughout the British Isles and further afield. In the course of the book he takes us through the highs and lows of that period, the diagnosis, the operation and recovery.\n\nWe find ourselves struggling with the problems of unanswered prayer, of mortality. I find myself, as I so often do, going back to the service of Baptism, that sacrament that marks the beginning of my spiritual life. There is a lovely Pastoral Introduction to the service of Baptism in the Prayer book that begins:\n\n> Baptism marks the beginning of a journey with God which continues for the rest of our lives, the first step in response to God's love.\n\nAs the child is signed with the sign of the cross:\n\n> Christ claims you for his own.\n> Receive the sign of the cross.\n> Live as a disciple of Christ,\n> fight the good fight,\n> finish the race, keep the faith.\n> Confess Christ crucified,\n> proclaim his resurrection,\n> look for his coming in glory.\n\nWe live in a broken and hurting world. Our lifelong journey to God and into God is a journey of healing, of restoration. Healing and salvation are closely linked in the New Testament, being translations of a single Greek word in the original text.\n\nThen I remember Jesus in Gethsemane, as he contemplates the suffering that lies ahead, 'Father, let this cup pass from me. Yet not my will but yours be done.'\n\nI realise he is with me, travelling the road with me, listening to me, sharing my joys and my sorrows, speaking into my hopes and fear. I realise he is with me in other people, in loved ones, in friends and colleagues, in the stranger who listens and understands.\n\nReturning to our reading from this 2nd letter to the Corinthians, I sense Paul looking back to a similar fundamental healing in his own life, as he recalls:\n\n> Three times I appealed to the Lord about this, that it would leave me, but he said to me, 'My grace is sufficient for you, for power is made perfect in weakness.' 2 Cor 12:8,9\n\nIt all comes down to that lovely word grace, God acting in Jesus Christ to forgive, inspire, and strengthen me by his Holy Spirit - as I let go of past regrets, as I respond to his guiding hand and go forward trusting not in my strength, my talents, my abilities but in the strength that God supplies.\n\nAt the end of his lifelong journey with God and into God, we find a man at peace with God, at peace with others, at peace with himself. This transformational occurrence is what God does: he transforms. Sometimes that transformation may include physical healing and sometimes it might include bringing someone home.\n\nThe peace of God, which passeth all understanding, that keep our hearts and minds in the knowledge and love of God, and of his Son Jesus Christ our Lord:\n\n> Christ on my right hand,\n> Christ on my left hand,\n> Christ all around me,\n> shield in the strife.\n> Christ in my sleeping,\n> Christ in my sitting,\n> Christ in my rising,\n> never to part. Hymn 611",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper92015.txt",
        "raw_ocr_content": "Page 1 of 4\nTrinity 5 – PROPER 9 - 2015 – Year B\nDuring the week I turned up a book I had read many years ago, ‘Fear no Evil’\nby the late Rev David Watson. I was prompted to return to this book by the\nsecond half of our Second Lesson this morning, from the 2nd Letter to the\nCorinthians, in which Paul, having spoken of the heights of his spiritual\nexperiences, talks in very human terms of his ‘thorn in the flesh’:\nTherefore, to keep me from being too elated, a thorn was given me in\nthe flesh, a messenger of Satan to torment me, to keep me from being\ntoo elated. 8Three times I appealed to the Lord about this, that it would\nleave me, 9but he said to me, ‘My grace is sufficient for you, for\npower is made perfect in weakness.’ 2 Cor 12:7-9\nThis book by David Watson is his reflection on his journey with cancer from\nthe date of his diagnosis to his death some 11 months later. Until that\ndiagnosis David Watson, from the beginnings of his ministry in York, had been\nin great demand as a preacher throughout the British Isles and further afield.\nIn the course of the book he takes us through the highs and lows of that period,\nthe diagnosis, the operation and recovery. The diagnosis came just four days\nbefore he was due to depart on a month long lecturing and preaching tour of\nthe USA and he had to pull out. He spoke of the strange experience for him of\nfinding himself as the one being ministered to and prayed for instead of being\nthe one who was doing the ministry, doing the praying. He, churches in Britain\nand America prayed that this thorn, this cancer would be removed – so that he\ncould get on with the work that he was doing for God.\nAnd Paul says: ‘8Three times I appealed to the Lord about this, that it would\nleave me, 9but he said to me, ‘My grace is sufficient for you, for power is made\nperfect in weakness.’’\nPage 2 of 4\nTrinity 5 – PROPER 9 - 2015 – Year B\nWe find ourselves struggling with the problems of unanswered prayer, of\nmortality. I find myself, as I so often do, going back to the service of Baptism,\nthat sacrament that marks the beginning of my spiritual life. There is a lovely\nPastoral Introduction to the service of Baptism in the Prayer book that begins:\nBaptism marks the beginning of a journey with God which continues\nfor the rest of our lives, the first step in response to God's love.\nThe beginning of a journey with God, a journey into God, back to God that\ncontinues for the rest of our life. As the child is signed with the sign of the\ncross:\nChrist claims you for his own.\nReceive the sign of the cross.\nLive as a disciple of Christ,\nfight the good fight,\nfinish the race, keep the faith.\nConfess Christ crucified,\nproclaim his resurrection,\nlook for his coming in glory.\nMay almighty God deliver you from the powers of darkness, restore in\nyou the image of his glory, and lead you in the light and obedience of\nChrist. Amen.\nAn injunction to faithfulness; Live as a disciple of Christ, fight the good fight,\nkeep the faith\na prayer for healing, ‘May almighty God …. restore in you the image of his\nglory.’\nWe live in a broken and hurting world. Our lifelong journey to God and into\nGod is a journey of healing, of restoration. As I mentioned a few Sundays\nPage 3 of 4\nTrinity 5 – PROPER 9 - 2015 – Year B\nback, healing and salvation are closely linked in the New Testament, being\ntranslations of a single Greek word in the original text. In this lifelong journey\nwe are talking about we travel all sorts of terrain. There are times when the\nroad is easy, times when the path is rough and hard to follow; times of great\njoy, times of anxiety and disappointment – times when our hopes and most\nearnest prayers seem to meet a brick wall. Then I remember Jesus in\nGethsemene, as he contemplates the suffering that lies ahead, ‘Father, let this\ncup pass from me. Yet not my will but yours be done.’\nI realise he is with me, travelling the road with me, listening to me, sharing my\njoys and my sorrows, speaking into my hopes and fear. I realise he is with me\nin other people, in loved ones, in friends and colleagues, in the stranger who\nlistens and understands.\nI am with you always, to the very end of time. There is fundamental healing,\nwhen I fully embrace that promise.\nReturning to our reading from this 2nd letter to the Corinthinians, I sense Paul\nlooking back to a similar fundamental healing in his own life, as he recalls:\n8Three times I appealed to the Lord about this, that it would leave me,\n9but he said to me, ‘My grace is sufficient for you, for power is made\nperfect in weakness.’ 2 Cor 12:8,9\nIt all comes down to that lovely word grace, God acting in Jesus Christ to\nforgive, inspire, and strengthen me by his Holy Spirit - as I let go of past\nregrets, as I respond to his guiding hand and go forward trusting not in my\nstrength, my talents, my abilities but in the strength that God supplies.\nPage 4 of 4\nTrinity 5 – PROPER 9 - 2015 – Year B\nI go back to David Watson’s book, that journal of his final illness. At the end\nof his lifelong journey with God and into God, we find a man at peace with\nGod, at peace with others, at peace with himself. There is a lovely review of\nthis book on the Amazon website which includes the following:\nSomething transformational occurred in Watson's life. This is what\nGod does: he transforms. Sometimes that transformation may include\nphysical healing and sometimes it might include bringing someone\nhome.\nThis something that is transformational is healing, this is grace, this is:\nThe peace of God, which passeth all understanding, that keep our hearts and\nminds in the knowledge and love of God, and of his Son Jesus Christ our\nLord:\n2 Christ on my right hand,\nChrist on my left hand,\nChrist all around me,\nshield in the strife.\nChrist in my sleeping,\nChrist in my sitting,\nChrist in my rising,\nnever to part. Hymn 611"
    }
}