{
    "title": "Love and Service",
    "date": "2020-10-25",
    "blurb": "In this sermon, Kevin draws parallels between political campaigns and the challenges Jesus faced from authorities. He emphasizes the greatest commandments: to love God and love our neighbor, as reflected in Jesus' teachings and actions. The sermon concludes with a call to embody these commandments through loving, self-giving service, inspired by Jesus washing the disciples' feet.",
    "raw_text": "PROPER 25 – Year A – 2020 – 5th Sunday before Advent\n\nEarlier this week, we witnessed the final debate between President Donald Trump and former Vice President Joe Biden before the United States goes to the polls to elect a President for the next four years. It has not been a particularly edifying campaign – our own political campaigns look remarkably sedate in comparison. At this stage in the campaign, people are on the lookout for something said in haste, some action that is inappropriate that will knock the candidate off balance, put him on the back foot, discredit him in front of the electorate.\n\nOver the last few weeks in our readings from Matthew’s Gospel, we are seeing something along the same lines. It is the lead up to Passover. Jesus is now in Jerusalem, having received a rapturous reception from the crowds. In the eyes of the authorities, this Galilean preacher is not going to go away. He is gaining support and he will have to be dealt with. We find Jesus in the Temple precincts, the Jewish authorities questioning him, trying to tie him down, trying to discredit him in front of the crowds. The Sadducees have tried and given up. Now another group, the Pharisees, step forward. They ask a question that appears in a number of settings in the Gospels. It is about the Law, what is the most important requirement of the Law and it elicits a response that is familiar to us all:\n\n> 'Teacher, which commandment in the law is the greatest?' He said to him, 'You shall love the Lord your God with all your heart, and with all your soul, and with all your mind. This is the greatest and first commandment. And a second is like it: 'You shall love your neighbour as yourself.' On these two commandments hang all the law and the prophets.' Matt 22:36-40\n\nAs I read that, my mind turns to the Shorter Catechism of the Presbyterian Church. 'What is man’s chief end?' 'Man’s chief end is to glorify God and to enjoy him forever.' How am I to glorify God? I go back to the words of Jesus:\n\n> 'On these two commandments hang all the law and the prophets.'\n\nLove of God is the greatest commandment – but love of neighbour is inseparable from it. In the course of Matthew’s account of the Sermon on the Mount, Jesus teaches:\n\n> 'Not everyone who says to me, 'Lord, Lord,' will enter the kingdom of heaven, but only the one who does the will of my Father in heaven. Matthew 7:21\n\nThis brings to mind words of the Prophet Micah that are reflected in words used for our confession in this service:\n\n> 'Will the Lord be pleased with thousands of rams, with ten thousands of rivers of oil? Shall I give my firstborn for my transgression, the fruit of my body for the sin of my soul?' He has told you, O mortal, what is good; and what does the Lord require of you but to do justice, and to love kindness, and to walk humbly with your God? Micah 6:7,8\n\nWithin a few short days of the encounter related here, Jesus is with his disciples in the Upper Room sharing the Last Supper. We remember, in the bread and wine of the Jewish Passover meal, Jesus speaks of his coming death. We remember that every time we celebrate the Holy Communion. The writer of the 4th Gospel tells us of another action that night, as Jesus fulfilling the role of a household servant, washes the feet of his disciples, inviting them to similar service to each other. We celebrate with bread and wine to this day, but the washing of the feet has never really caught on.\n\nThere is something very profound in this action. Jesus, totally committed to the Father’s will in loving obedience, shows his love to his disciples in an act of loving, self-giving service, that foreshadows the Cross.\n\nThe writer of the 4th Gospel, introduces the account of the foot washing with these words:\n\n> 'Having loved his own who were in the world, he loved them to the end. John 13:1\n\nJesus embodies in his life and in his death the core of the commandments expressed in our Gospel reading\n\n> 'You shall love the Lord your God with all your heart, and with all your soul, and with all your mind. This is the greatest and first commandment. And a second is like it: 'You shall love your neighbour as yourself.'\n\nLove of God and love of neighbour. I recall talking to a lovely Christian gentleman with a deep personal faith. He confessed that he came to a point in his life when he realised that he loved the Lord, but he had not always loved people. Which of us cannot identify with those very honest sentiments? Christ comes to us where we are, in all our strengths and weaknesses, in all our humanity and leads us further on.\n\nI find the image of Jesus washing my feet incredibly powerful. I imagine my awkwardness, I imagine the gentleness of the hands, the gentleness of the look, the gentleness with which he says, 'I’ve washed your feet, now go and wash your neighbour’s.' We won’t always get it right, but Jesus remains there, reminding me, encouraging me, strengthening me.\n\nI’ll just close with the final verse of the hymn we sang at the start of this service:\n\n> 'Loving puts us on our knees, serving as though we were slaves, this is the way we should live with you. Jesu, Jesu, fill us with you love, show us how to serve the neighbours we have from you.'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper252020.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 25 – Year A – 2020 – 5th Sunday before Advent\nEarlier this week, we witnessed the final debate between President Donald\nTrump and former Vice President Joe Biden before the United States goes to\nthe polls to elect a President for the next four years. It has not been a\nparticularly edifying campaign – our own political campaigns look remarkably\nsedate in comparison. At this stage in the campaign, people are on the lookout\nfor something said in haste, some action that is inappropriate that will knock\nthe candidate off balance, put him on the back foot, discredit him in front of the\nelectorate,\nOver the last few weeks in our readings from Matthew’s Gospel, we are seeing\nsomething along the same lines. It is the lead up to Passover. Jesus is now in\nJerusalem, having received a rapturous reception from the crowds. In the eyes\nof the authorities, this Galilean preacher is not going to go away. He is gaining\nsupport and he will have to be dealt with. We find Jesus in the Temple\nprecincts, the Jewish authorities questioning him, trying to tie him down, trying\nto discredit him in front of the crowds. The Sadducees have tried and given up.\nNow another group, the Pharisees, step forward. They ask a question that\nappears in a number of settings in the Gospels. It is about the Law, what is the\nmost important requirement of the Law and it elicits a response that is familiar\nto us all:\n36‘Teacher, which commandment in the law is the greatest?’ 37He said\nto him, ‘“You shall love the Lord your God with all your heart, and\nwith all your soul, and with all your mind.” 38This is the greatest and\nfirst commandment. 39And a second is like it: “You shall love your\nneighbour as yourself.” 40On these two commandments hang all the\nlaw and the prophets.’ Matt 22:36-40\nAs I read that, my mind turns to the Shorter Catechism of the Presbyterian\nChurch. ‘What is man’s chief end?’ ‘Man’s chief end is to glorify God and to\nenjoy him for ever.’ How am I to glorify God? I go back to the words of\nJesus:\n‘40On these two commandments hang all the law and the prophets.’\nPage 2 of 3\nPROPER 25 – Year A – 2020 – 5th Sunday before Advent\nLove of God is the greatest commandment – but love of neighbour is\ninseparable from it. In the course of Matthew’s account of the Sermon on the\nMount, Jesus teaches:\n“Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom\nof heaven, but only the one who does the will of my Father in heaven.\nMatthew 7:21\nThis brings to mind words of the Prophet Micah that are reflected in words\nused for our confession in this service:\nWill the Lord be pleased with thousands of rams,\nwith ten thousands of rivers of oil?\nShall I give my firstborn for my transgression,\nthe fruit of my body for the sin of my soul?”\nHe has told you, O mortal, what is good;\nand what does the Lord require of you\nbut to do justice, and to love kindness,\nand to walk humbly with your God? Micah 6:7,8\nWithin a few short days of the encounter related here, Jesus is with his\ndisciples in the Upper Room sharing the Last Supper. We remember, in the\nbread and wine of the Jewish Passover meal, Jesus speaks of his coming death.\nWe remember that every time we celebrate the Holy Communion. The writer\nof the 4th Gospel tells us of another action that night, as Jesus fulfilling the role\nof a household servant, washes the feet of his disciples, inviting them to similar\nservice to each other. We celebrate with bread and wine to this day, but the\nwashing of the feet has never really caught on.\nThere is something very profound in this action. Jesus, totally committed to\nthe Father’s will in loving obedience, shows his love to his disciples in an act\nof loving, self-giving service, that foreshadows the Cross.\nThe writer of the 4th Gospel, introduces the account of the foot washing with\nthese words:\nHaving loved his own who were in the world, he loved them to the\nend.\nJohn 13:1\nPage 3 of 3\nPROPER 25 – Year A – 2020 – 5th Sunday before Advent\nJesus embodies in his life and in his death the core of the commandments\nexpressed in our Gospel reading\nYou shall love the Lord your God with all your heart, and with all\nyour soul, and with all your mind.” 38This is the greatest and first\ncommandment. 39And a second is like it: “You shall love your\nneighbour as yourself.”\nLove of God and love of neighbour. I recall talking to a lovely Christian\ngentleman with a deep personal faith. He confessed that he came to a point in\nhis life when he realised that he loved the Lord, but he had not always loved\npeople. Which of us cannot identify with those very honest sentiments? Christ\ncomes to us where we are, in all our strengths and weaknesses, in all our\nhumanity and leads us further on.\nI find the image of Jesus washing my feet incredibly powerful. I imagine my\nawkwardness, I imagine the gentleness of the hands, the gentleness of the look,\nthe gentleness with which he says, ‘I’ve washed your feet, now go and wash\nyour neighbour’s.’ We won’t always get it right, but Jesus remains there,\nreminding me, encouraging me, strengthening me.\nI’ll just close with the final verse of the hymn we sang at the start of this\nservice:\n4 Loving puts us on our knees,\nserving as though we were slaves,\nthis is the way we should live with you.\nJesu, Jesu,\nfill us with you love,\nshow us how to serve\nthe neighbours we have from you."
    }
}