{
    "title": "Treasures of Faith",
    "date": "2014-11-16",
    "blurb": "Kevin reflects on the true treasures of the Church, drawing inspiration from the story of St. Lawrence and the parable of the Talents. He challenges us to consider what we treasure and how we utilize the gifts entrusted to us. The sermon emphasizes the importance of nurturing children in faith and recognizing each other as treasures within the parish community.",
    "raw_text": "2nd Sunday before Advent – Year A – 2014\n\nOn the Sunday closest to All Saints you may recall that I drew your attention to the East Window here in St Mary’s, given in memory of the last Earl of Howth. This morning I want to begin by returning to that window, and in particular the figure of St Lawrence. For me there is a rather nice personal connection in that my home Parish Church in Northfield Birmingham is dedicated to St Lawrence.\n\nLawrence, a deacon in the Church in Rome, died during the persecution of the Emperor Valerian in 258. Tradition has it, when asked by the Prefect of Rome to produce the treasures of the Church, Lawrence appeared the following day with a group of children and the poor, saying, 'These are the treasures of the Church.' For his insolence, the Prefect ordered that he be roasted alive on a grid-iron. This is why in images and statues, Lawrence is always depicted, as he is on our window, holding a grid iron.\n\nThe story of Lawrence came to my mind as I read over the Gospel reading appointed for today, Matthew’s account of the parable of the Talents. This is one of a series of Parables told by Jesus that we find in St Matthew’s Gospel that speak of people in waiting, waiting for the bridegroom last week, waiting for the master to return this week. In the run up to Christmas, as we are about to enter upon the season of Advent, we are reminded that we stand in an in-between time, between the coming of Jesus as a child in Bethlehem and his coming at the end of time. So these parables of waiting are about the priorities of a community in waiting.\n\nAs I read our Parable, as I reflect on the story of Lawrence, the questions that come to my mind are, 'What are our treasures? What do we do with the treasures entrusted to us?'\n\nThis morning at 11:00 we are welcoming two young children into the family of the Church in Baptism. So the question of 'What do we do with the treasures entrusted to us?' has a particular relevance. To be entrusted with the parenting of a child is one of the greatest gifts, one of the greatest responsibilities, one of the greatest privileges we will receive; at the same time it is one of the greatest risks any of us will undertake.\n\nThe parents of these children undertake providing a context within which these children will grow from babies, to infants, to children, to teenagers, to young adults. To them will fall the responsibility of providing for their healthy physical development (the medical background of these parents will come in handy here). They will be entrusted with helping these children achieve their potential in education, in developing skills that will benefit them in work and leisure (sailing could well come into play here.). In the home these children will get their first experience, their first lessons in love, in commitment, in understanding, in service of others, what it means to forgive and to be forgiven. In bringing their children for Baptism they are recognising another dimension as they are asked:\n\n> By your own prayers and example, by your teaching and love, will you encourage them in the life and faith of the Christian community?\n> With the help of God, we will.\n\nTo enable them to become fully rounded individuals, we not only ensure their physical and educational development but also an understanding of what it is to be human, fully human, ones made in the image of God, made for fellowship with God. In the course of the service a number of Promises are made. As we were reflecting the other night these are promises not of people who have arrived but of people who are on a journey. You, your children are invited to join us all on a journey, a journey of discovery of what it means to be ones made in the image of God. What does it mean in daily living as I promise to repent of the sins that separate us from God and neighbour?\n\nWe have thought of these children as treasures entrusted to their parents. I want to look beyond them and ask of ourselves, as members of the Body of Christ in this place: 'What do we do with the treasures entrusted to us?'\n\nMaybe we should first ask, 'What do we see as our treasures?' There is of course this building in which we worship, that we have inherited from previous generations, that we will entrust to future generations. But even as I say that I think of words of the late Bishop Noel Willoughby to the General Synod as he reminded his hearers, 'The Church is what is left when the buildings have fallen down.' Do we see each other, do we see ourselves, as the treasures of this Parish, ones made in God’s image, ones redeemed by Christ, members of the Body of Christ in this place. We have a ministry to each other of encouragement, of building each other up. Each one of us is a vital part of the Body of Christ in this place. Your presence at worship enhances our worship; your absence diminishes our worship. The encouraging word, the encouraging presence with someone in difficulty brings something of the love and presence of Christ into the life of another.\n\nThe Prefect of Rome demanded of Lawrence, bring me the treasures of the Church. We bring these children, we bring ourselves, we bring one another as we offer you our souls and bodies to be a living sacrifice. Send us out in the power of your Spirit to live and work to your praise and glory. Amen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper282014.txt",
        "raw_ocr_content": "Page 1 of 3\n2nd Sunday before Advent – Year A – 2014\nOn the Sunday closest to All Saints you may recall that I drew your attention to\nthe East Window here in St Mary’s, given in memory of the last Earl of Howth.\nThis morning I want to begin by returning to that window, and in particular the\nfigure of St Lawrence. For me there is a rather nice personal connection in that\nmy home Parish Church in Northfield Birmingham is dedicated to St\nLawrence.\nLawrence, a deacon in the Church in Rome, died during the persecution of the\nEmperor Valerian in 258. Tradition has it, when asked by the Prefect of Rome\nto produce the treasures of the Church, Lawrence appeared the following day\nwith a group of children and the poor, saying, ‘These are the treasures of the\nChurch.’ For his insolence, the Prefect ordered that he be roasted alive on a\ngrid-iron. This is why in images and statues, Lawrence is always depicted, as\nhe is on our window, holding a grid iron.\nThe story of Lawrence came to my mind as I read over the Gospel reading\nappointed for today, Matthew’s account of the parable of the Talents. This is\none of a series of Parables told by Jesus that we find in St Matthew’s Gospel\nthat speak of people in waiting, waiting for the bridegroom last week, waiting\nfor the master to return this week. In the run up to Christmas, as we are about\nto enter upon the season of Advent, we are reminded that we stand in an in-\nbetween time, between the coming of Jesus as a child in Bethlehem and his\ncoming at the end of time. So these parables of waiting are about the priorities\nof a community in waiting.\nAs I read our Parable, as I reflect on the story of Lawrence, the questions that\ncome to my mind are, ‘What are our treasures? What do we do with the\ntreasures entrusted to us?’\nPage 2 of 3\n2nd Sunday before Advent – Year A – 2014\nThis morning at 11:00 we are welcoming two young children into the family of\nthe Church in Baptism. So the question of ‘What do we do with the treasures\nentrusted to us?’ has a particular relevance. To be entrusted with the parenting\nof a child is one of the greatest gifts, one of the greatest responsibilities, one of\nthe greatest privileges we will receive; at the same time it is on of the greatest\nrisks any of us will undertake.\nThe parents of these children undertake providing a context within which these\nchildren will grow from babies, to infants, to children, to teenagers, to young\nadults. To them will fall the responsibility of providing for their healthy\nphysical development (the medical background of these parents will come in\nhandy here). They will be entrusted with helping these children achieve their\npotential in education, in developing skills that will benefit them in work and\nleisure (sailing could well come into play here.). In the home these children\nwill get their first experience, their first lessons in love, in commitment, in\nunderstanding, in service of others, what it means to forgive and to be forgiven.\nIn bringing their children for Baptism they are recognising another dimension\nas they are asked:\nBy your own prayers and example, by your teaching and love, will you encourage\nthem in the life and faith of the Christian community?\nWith the help of God, we will.\nTo enable them to become fully rounded individuals, we not only ensure their\nphysical and educational development but also an understanding of what it is to\nbe human, fully human, ones made in the image of God, made for fellowship\nwith God. In the course of the service a number of Promises are made. As we\nwere reflecting the other night these are promises not of people who have\narrived but of people who are on a journey. You, your children are invited to\njoin us all on a journey, a journey of discovery of what it means to be ones\nmade in the image of God. What does it mean in daily living as I promise to\nrepent of the sins that separate us from God and neighbour?\nPage 3 of 3\n2nd Sunday before Advent – Year A – 2014\nwhat it means to\nsubmit to Christ as Lord?\nThat is the journey of a lifetime.\nWe have thought of these children as treasures entrusted to their parents. I\nwant to look beyond them and ask of ourselves, as members of the Body of\nChrist in this place: ‘What do we do with the treasures entrusted to us?’\nMaybe we should first ask, ‘What do we see as our treasures?’ There is of\ncourse this building in which we worship, that we have inherited from previous\ngenerations, that we will entrust to future generations. But even as I say that I\nthink of words of the late Bishop Noel Willoughby to the General Synod as he\nreminded his hearers, ‘The Church is what is left when the buildings have\nfallen down.’ Do we see each other, do we see ourselves, as the treasures of\nthis Parish, ones made in God’s image, ones redeemed by Christ, members of\nthe Body of Christ in this place. We have a ministry to each other of\nencouragement, of building each other up. Each one of us is a vital part of the\nBody of Christ in this place. Your presence at worship enhances our worship;\nyour absence diminishes our worship. The encouraging word, the encouraging\npresence with someone in difficulty brings something of the love and presence\nof Christ into the life of another.\nThe Prefect of Rome demanded of Lawrence, bring me the treasures of the\nChurch. We bring these children, we bring ourselves, we bring one another as:\nwe offer you our souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen."
    }
}