{
    "title": "Moving On from Disappointment",
    "date": "2003-09-28",
    "blurb": "Kevin reflects on the challenges and teachings of marriage within the church, drawing from the lectionary and personal experiences. He emphasizes the importance of facing disappointments and failures, and the role of the church in helping individuals to move on and make fresh starts, underpinned by the doctrine of forgiveness and the redemptive power of the Cross.",
    "raw_text": "Proper 21 – Year B\n\nI have often remarked that one of the strengths of our tradition lies in our lectionary, our ordered reading of scripture; so that Sunday by Sunday, month by month, we engage in a structured reading of the Bible. This means that the preacher is restrained from sticking to just his own pet topics and indeed is required on occasion to address passages he might otherwise avoid. It ensures, as St Paul said as he prepared to take his leave of the leaders of the Church at Ephesus, that we preach the whole counsel of God.\n\nThen every so often I open my Bible at the lessons set for the following Sunday and think that maybe this is not such a good idea. This week was one such week - our Gospel passage gives very stark teaching on the whole issue of marriage. This is an issue that causes great pain and heartache to many within the Church. To be frank, I did seriously think of quietly choosing a different passage altogether.\n\nAs I read and re-read the passage during this week, my mind went back to the day I was moving house from Finglas to Mountmellick. As the removal men were loading the last of our belongings into the lorry, a young mother called at my door. Her husband had just walked out to go and live with another woman, leaving her to fend for herself and their three young children, the youngest less than three months old. I can still see the pain in her face as she said, \"What future is there for me and the kids? Paul won't give us anything - I can't even get married again in this country.\" Then she looked me straight in the eye and asked, \"Does the Church and the State expect me to grow into a frustrated and bitter old woman?\" What could I say? There was no divorce at that stage in the South and the Church did not re-marry divorcees.\n\nThe more I thought about that over the years, the more I have seen that what lay at the heart of her anguish that day was the fundamental question, \"How do I move on in my life from here?\"\n\nAgain as I read that Gospel lesson I thought of another story of Jesus. I refer to that occasion when a woman taken in adultery was hauled before him. The lawyers in the crowd declared, \"Moses said that we should stone such women. What do you say?\" We know the story well. Jesus turned to the crowd and said \"Let him without sin cast the first stone.\" And they all slipped away. Turning to the woman he asked where were those who had accused her. She said they had gone and he said, \"Neither do I condemn you. Go and sin no more.\" The lawyers were focused on stigma and condemnation. Jesus spoke about moving on, about making a new beginning. He did not say that what had happened did not matter. He said, \"Go and sin no more.\"\n\nYes, Jesus did set high standards and called us to follow. But Jesus set high standards in all sorts of areas of life. He says for example that if we do not forgive someone who has wronged us then neither will our heavenly Father forgive us - and which of us has not had a problem with that one from time to time? - the burden, the pain of a resentment that will not go away.\n\nSo I want to look at this in the broader context of how do we move on from a situation of disappointment, of failure. Not only that, how do we as a community enable others to move on from their situations of disappointment and failure?\n\nAny moving on must involve a facing up to and dealing with what has happened and then starting afresh. As we are reminded in the communion service:\n\n> God so loved the world that he gave his only Son Jesus Christ\nto save us from our sins,\nto intercede for us in heaven\nand to bring us to eternal life.\n\nAt the heart of the Gospel is a proclamation of the Cross, the declaration that there is no sin, no failure, no setback that is not covered by the Cross of Christ. The Cross stands as a challenge to repent and an invitation to make a fresh start, trusting not in ourselves but in the Christ who redeemed us.\n\nThe Cross must lie at the heart of how we see ourselves as a community. Do we see ourselves as a community of the perfect, erecting barriers to protect ourselves from the imperfect? Or do we see ourselves as a school for sinners, recognizing that we all fail at times, we are all in need of Christ's forgiving love.\n\nA few years ago, a Presbyterian minister and myself were discussing this whole issue over a cup of coffee and he said, \"I find that I am reviewing my doctrine of marriage in the light of my doctrine of forgiveness.\"\n\nThis is what we as a Church have been doing in recent years as we have reviewed our whole approach to the remarriage of divorced people in Church. As a Church we continue to uphold the life long nature of marriage but we recognize that are situations where it does not work for a whole number of reasons. The question we are left with is one of asking how do we enable people to move on, to make a fresh start within the life of the Church. Yes of course there are tensions, there are inconsistencies but in a fallen and hurting world even our best solutions are going to bear the mark of the imperfect.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/PROP22B.txt",
        "raw_ocr_content": "Page 1 of 8\nProper 21 – year B - ???\nI have often remarked that one of the strengths of our tradition lies in our\nlectionary, our ordered reading of scripture; so that Sunday by Sunday, month\nby month, we engage in a structured reading of the Bible. This means that the\npreacher is restrained from sticking to just his own pet topics and indeed is\nrequired on occasion to address passages he might otherwise avoid. It ensures,\nas St Paul said as he prepared to take his leave of the leaders of the Church at\nEphesus, that we preach the whole counsel of God.\nThen every so often I open my Bible at the lessons set for the following Sunday\nand think that maybe this is not such a good idea. This week was one such week\n- our Gospel passage gives very stark teaching on the whole issue of marriage.\nThis is an issue that causes great pain and heart ache to many within the\nChurch. To be frank I did seriously think of quietly choosing a different\npassage altogether.\nAs I read and re-read the passage during this week, my mind went back top the\nday I was moving house from Finglas to Mountmellick. As the removal men were\nloading the last of our belongings into the lorry a young mother called at my\ndoor. Her husband had just walked out to go and live with another woman,\nleaving her to fend for herself and their three young children, the youngest\nless than three months old. I can still see the pain in her face as she said,\n\"What future is there for me and the kids? Paul won't give us anything - I\ncan't even get married again in this country.\" Then she looked me straight in\nthe eye and asked, \"Does the Church and the State expect me to grow into a\nfrustrated and bitter old women?\" What could I say? There was no divorce at\nthat stage in the South and the Church did not re-marry divorcees.\nThe more I thought about that over the years, the more I have seen that what lay\nat the heart of her anguish that day was the fundamental question, \"How do I\nmove on in my life from here?\"\nAgain as I read that Gospel lesson I thought of another story of Jesus. I refer\nto that occasion when a women taken in adultery was hauled before him. The\nlawyers in the crowd declared, \"Moses said that we should stone such women.\nWhat do you say?\" We know the story well. Jesus turned to the crowd and said\n\"Let him without sin cast the first stone.\" And they all slipped away. Turning\nto the woman he asked where were those who had accused her. She said they had\ngone and he said, \"Neither do I condemn you. Go and sin no more.\" The lawyers\nwere focussed on stigma and condemnation. Jesus spoke about moving on, about\nmaking a new beginning. He did not say that what had happened did not matter.\nHe said, \"Go and sin no more.\"\nYes, Jesus did set high standards and called us to follow. But Jesus set high\nstandards in all sorts of areas of life. He says for example that if we do not\nforgive someone who has wronged us then neither will our heavenly Father forgive\nus - and which of us has not had a problem with that one from time to time? -\nthe burden, the pain of a resentment that will not go away.\nSo I want to look at this in the broader context of how do we move on from a\nsituation of disappointment, of failure. Not only that, how do we as a\ncommunity enable others to move on from their situations of disappointment and\nfailure?\nAny moving on must involve a facing up to and dealing with what has happened and\nthen startin afresh. As we are reminded in the communion service:\nGod so loved the world that he gave his only Son Jesus Christ\nto save us from our sins,\nto intercede for us in heaven\nand to bring us to eternal life.\nAt the heart of the Gospel is a proclamation of the Cross, the declaration that\nthere is no sin, no failure, no set back that is not covered by the Cross of\nPage 2 of 8\nProper 21 – year B - ???\nChrist. The Cross stands as a challenge to repent and an invitation to make a\nfresh start, trusting not in oursleves but in the Christ who redeemed us.\nThe Cross must lie at the heart of how we see oursleves as a community. Do we\nsee ourselves as a community of the perfect, erecting barriers to protect\nourselves from the imperfect? Or do we see ourselves as a school for sinners,\nrecognising that we all fail at times, we are all in need of Christ's forgiving\nlove.\nA few years ago, a Presbyterian minister and myself were discussing this whole\nissue over a cup of coffee and he said, \"I find that I am reviewing my doctrine\nof marriage in the light of my doctrine of forgiveness.\"\nThis is what we as a Church have been doing in recent years as we have reviewed\nour whole approach to the remarriage of divorced people in Church. As a Church\nwe continue to uphold the life long nature of marriage but we recognise that are\nsituations where it does not work for a whole number of reasons. The question\nwe are left with is one of asking how do we enable people to move on, to make a\nfresh start within the life of the Church. Yes of course there are tensions,\nthere are inconsistencies but in a fallen and hurting world even our best\nsolutions are going to bear the mark of the imperfect.\nPage 3 of 8\nProper 21 – year B - ???\n33\nPage 4 of 8\nProper 21 – year B - ???\nPage 5 of 8\nProper 21 – year B - ???\n55¡\nPage 6 of 8\nProper 21 – year B - ???\n66à\nPage 7 of 8\nProper 21 – year B - ???\n77û\nPage 8 of 8\nProper 21 – year B - ???\n88¤88<¤88>¤88u88w88vvvvvvvvvvvvvvvvvvvvvv8888888§à\nw88¶88¸88‘88“88óµ88vvvvv\n88888888888888888888888888888888888888888888888888888888888888888888888888888888\n888888888888§à 8 88óµ88*88 88w88óµ88+8,8Page &pTrinity 16 (2003) - year B -\nProper 22 - morning service¤Times New Roman"
    }
}