{
    "title": "Grace in Small Offerings",
    "date": "2020-08-02",
    "blurb": "Kevin reflects on the transformative power of small, seemingly inconsequential acts of faith, using the story of a New York parish revitalized by a simple offer of tasty, affordable lunches. He draws parallels to the biblical feeding of the five thousand, emphasizing that Jesus used what little resources were available to meet the needs of many. The sermon encourages us to offer our own small acts of service and love, trusting in God's grace to magnify their impact.",
    "raw_text": "PROPER 13 – Year A – 2020 – Trinity 8\n\nKevin recalls his early ministry days and a story from a New York Rector who revitalized a dwindling parish near Wall Street through a weekday ministry offering affordable lunches. This small act of service breathed new life into the church.\n\nReflecting on the Gospel reading, Kevin focuses on the feeding of the five thousand and the disciples' initial hesitation to address the crowd's hunger. He highlights the importance of using available resources, no matter how small, to serve others.\n\n> Matt 14:15-17\n> 'We have nothing here but five loaves and two fish.'\n\nThe sermon continues to explore biblical examples of God working through the weak and insignificant, culminating in the Incarnation. Kevin speaks of God's love and grace, asking for our own love and service in return, no matter how tentative or imperfect.\n\nIn conclusion, Kevin invites us to find the meaning of grace and to trust that our small offerings can be used by God to create significant change, echoing his adoration for Jesus and the call to love more deeply.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper132020.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 13 – Year A – 2020 – Trinity 8\nLink to short act of worship on YouTube https://youtu.be/9zPLniyk9i8\nI recall early on in the days of my ministry attending a Diocesan clergy\nconference in Dundrum. The speaker that year was a Rector from a Parish in\nNew York. He told of how he had been appointed to a dwindling parish not far\nfrom Wall Street, the home of the American Stock Market. He had been given\nthe job of nursing the Parish through the painful process of closure. Before\nembarking on that, conscious of the Church’s proximity to Wall Street, he\ndecided to explore possibilities of development of a weekday ministry to the\npeople working in the offices in that part of New York.\nSo, one Sunday morning he shared his thoughts with members of his Parish\nand asked people to come forward with offers of gifts of service. At the end of\nthe service one lady nervously approached him saying that she didn’t think she\ncould be of much use, but she did have a talent for producing tasty food\ncheaply. Initially they both laughed and then the Rector stopped. Here they\nwere on the edge of Wall Street full of people working in offices who could be\ninterested in lunches produced at an attractive price.\nAnd that is what they started to do. They produced lunches at an attractive\nprice and people started coming to the Parish Hall for lunch. And then people\nstarted taking an interest in what the Church was doing. Up to then it had just\nbeen a closed-up building that they had walked past on their way to and from\nwork. A ministry started that grew and the church gained new life both during\nthe week and at the weekend.\nPage 2 of 4\nPROPER 13 – Year A – 2020 – Trinity 8\nA small, apparently inconsequential gift, offered in faith in the service of the\nChurch producing results, the re-energising of a Parish that was set for closure.\nI leave that thought with you as we go on to reflect on our Gospel reading for\ntoday. As Matthew puts together his Gospel, this account of the feeding of the\nfive thousand is set in a wider context of teaching, of the stilling of the storm,\nof healing in which Jesus is presented to his readers as one having authority\nover sickness, over the powers of nature, one who teaches with authority.\nToday I just want to focus on this particular story of the feeding of the five\nthousand, and in particular the disciples’ reaction to Jesus telling them to give\nthe crowd something to eat.\n15When it was evening, the disciples came to him and said, ‘This is a\ndeserted place, and the hour is now late; send the crowds away so that\nthey may go into the villages and buy food for themselves.’ 16Jesus\nsaid to them, ‘They need not go away; you give them something to\neat.’ 17They replied, ‘We have nothing here but five loaves and two\nfish.’\nMatt 14:15-17\nWe have nothing here.\nWe have nothing here ….but.\nThe mind set is fixed on the enormity of the problem and not on the resources\nto hand. Also, as you read and reread the story, the Gospel writers have not\nleft us a story of Jesus producing food out of thin air. It is a story of Jesus\ntaking the resources to hand and working in and through them to meet the\nneeds of the crowd; ‘and all eat and were filled’. This is not just food to fill a\ngap, this is a meal that satisfies.\nAs we look through the Bible, we see time and time again, stories of God\ntaking the weak and insignificant and working in and through them. We hear\nPage 3 of 4\nPROPER 13 – Year A – 2020 – Trinity 8\nof an old man Abram and his wife Sarai, both too old to have children, being\nuprooted from their homeland and settled in a small insignificant place with a\npromise of children. A story unfolds of Patriarchs, of Judges and of Kings in\nall their strengths and weaknesses, their faithfulness, and their failure – God\nworks in and through them.\nIn the Incarnation, we experience God coming to us in a child born in a stable,\nwho comes not as a long anticipated military Messiah but one preaching a\nmessage of reconciliation, of turning the other cheek, going the second mile;\nreaching out to leper, to tax collector, to sinner, to those in deep emotional\nturmoil. One who dies a humiliating and seemingly pointless death; a death\nthat has spoken to men and women across all cultures, times and places of\nGod’s amazing, God’s incomprehensible love.\nAll he asks in return is our love, our tentative, imperfect love, faith,\ncommitment. I will often refer to the late Brother Roger of Taize as he spoke\nof mustard seed faith, God taking the littleness of our understanding, our\nservice and love and working through them.\nJust as he took the littleness of loaves and fishes to feed a crowd, just as he\ntook the littleness of the offering of that lady in New York to set in train a\nwhole ministry, so he will take the likes of even you and me, the littleness, the\ninadequacy of our love and service. We discover the meaning of that little\nword ‘grace’; we discover that it doesn’t in fact all depend on me, simply my\nresponse to God’s amazing, empowering love.\nPage 4 of 4\nPROPER 13 – Year A – 2020 – Trinity 8\nJesu, Jesu, I thee adore; help me love thee more and more."
    }
}