{
    "title": "Crucial Questions of Faith",
    "date": "2012-09-16",
    "blurb": "Kevin delves into the pivotal moment in St Mark's Gospel where Jesus asks his disciples, 'Who do people say that I am?' and 'Who do you say that I am?' This sermon explores the journey of faith, from acceptance of teachings to personal conviction. It emphasizes the evolving nature of faith, the importance of personal relationship with Jesus, and the paradox of finding freedom through accepting His authority.",
    "raw_text": "Proper 19 – year B – 2012 – Trinity 15\n\n“Who do people say that I am?\nBut who do you say that I am?”\n\nWe have come to a crucial point in our reading of St Mark’s Gospel. We have read of the ministry of John the Baptist, the call of the disciples, the early stages of the ministry of Jesus, his teaching and healing. The disciples have for the most part been simply witnesses of what is happening. Here at Caesarea Philippi, we arrive at the point where Jesus begins to turn towards Jerusalem, there is talk of coming suffering and death. In the context of this, Mark tells of Jesus asking the disciples these crucial questions. “Who do people say that I am? Who do you say that I am?”\n\nOver the next few weeks, I will be inviting people to think about confirmation. Fairly early on in the classes, I will be thinking through with the youngsters about where they are on the journey of life. In the early years of life, what Mum and Dad said, their opinions on most things, was generally accepted. As they approach their teenage years, as they begin the move into adolescence, as they move from dependence towards independence, they will begin to develop their own thoughts, their own ideas. This can be challenging, exciting, frightening for teenager and adult alike and parental love can be stretched to the limit.\n\nIn the area of faith, it has been a matter of accepting, with very little question, what parents, teachers, clergy have said. But the time comes when faith has to become their faith. Because it is only when faith becomes their faith, and not a second hand version of yours or mine, will it become a faith that will take them through life. I point out that at Baptism, the questions were asked of their parents and godparents. At confirmation the Archbishop will ask them the questions. 'Do you turn to Christ? Do you submit to Christ? Do you come to Christ?' Mum, Dad, godparents, friends will be there to watch – but it will be they who speak.\n\nFaith, my faith, your faith is a living evolving thing. Sometimes it is strong – at other times it is tested almost to breaking point. In the context of the lessons appointed for use during the week, over the last week or ten days I have found myself reading from the Book Job. It is the story of a man of faith who loses everything, his family, his wealth, his family, his health. Friends urge him to look into his life to identify some grievous sin that would explain all this; Job must have done something wrong. The story, as it unfolds, is more than Job protesting his innocence, it is Job seeking meaning - if only he can meet with God and argue his case. It is part of our nature to ask 'Why?' Questions 'Why?' are addressed beyond ourselves – we seek meaning beyond ourselves.\n\nFaith involves what I believe so I suppose when I talk of faith, we think of statements of faith, such as the Nicene and Apostles’ Creed that we recite Sunday by Sunday. But we don’t ask 'Why?' of Creeds, of statements of doctrine. We ask it of a person. So faith involves not only belief but also relationship. The central content of a specifically Christian faith is the event of Jesus Christ, his incarnation, life, death and resurrection. My faith evolves as I relate to that. This is where the questions of Jesus to his disciples strike a chord with me. “Who do people say that I am? Who do you say that I am?”\n\nWho do you say that I am? Is it Jesus the teacher, the healer, the one who stilled the storm, the one who identified with the poor and the marginalised of his own society, Jesus the crucified, the Redeemer of my sins, Jesus the risen and ascended one, the Messiah, the Son of the living God? I would suspect at different stages in life, different aspects have a different significance. Our faith journey is a journey of exploring all of these. But whatever stage of that journey we are on, there is something compelling about this figure of Jesus that speaks across barriers of time and culture that calls us to follow.\n\nSo faith involves belief, it involves relationship, acceptance that this figure has a claim on my life and with that an authority in my life. To our contemporary society, authority speaks, particularly to younger ears, of restriction, of limitation, of control. But he is the one who says 'I came that they may have life and have it abundantly' (John 10:10). Turning to our Gospel reading:\n\n'If any want to become my followers, let them deny themselves and take up their cross and follow me. For those who want to save their life will lose it, and those who lose their life for my sake, and for the sake of the gospel, will save it.' (Mark 8:34,35)\n\nThose who want to save their life will lose it, those who lose it will save it. In a strange way it is as we lose our freedom, that we find a new and more fulfilling freedom. It is as we accept the authority of this figure Jesus in our lives, as we follow in his footsteps, we discover an inner freedom that he alone can bring.\n\nI have spoken this morning of faith as a living and evolving thing in the face of that question of Jesus to his disciples, 'Who do you say that I am?'. I would sometimes say that I feel I know God now – but I would be awfully disappointed if in ten years time I did not know him better. It would be as if he were saying, 'Sorry Kev, that is all there is – just hang on in there until you snuff it.' For if faith is to live, if faith is to evolve there always has to be more ahead of me. I have spoken of an invitation to those seeking Confirmation to embark with us on a journey of faith. Faith as belief – but more than that. Faith as a relationship with the God who made me and calls me.\n\nAt the heart of that is a reflection on the life and person of Jesus Christ, his life, his death, his resurrection. So whether life is going well, or whether, like Job, life is throwing up all sorts of questions, may we accompany one another on the journey of faith until we come to that point that we may know, even as we are fully known.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper192012.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 19 – year B – 2012 –Trinity 15\n“Who do people say that I am?\nBut who do you say that I am?”\nWe have come to a crucial point in our reading of St Mark’s Gospel. We have\nread of the ministry of John the Baptist, the call of the disciples, the early\nstages of the ministry of Jesus, his teaching and healing. The disciples have for\nthe most part been simply witnesses of what is happening. Here at Caesarea\nPhilippi, we arrive at the point where Jesus begins to turn towards Jerusalem,\nthere is talk of coming suffering and death. In the context of this, Mark tells of\nJesus asking the disciples these crucial questions. “Who do people say that I\nam? Who do you say that I am?”\nOver the next few weeks, I will be inviting people to think about confirmation.\nFairly early on in the classes, I will be thinking through with the youngsters\nabout where they are on the journey of life. In the early years of life, what\nMum and Dad said, their opinions on most things, was generally accepted. As\nthey approach their teenage years, as they begin the move into adolescence, as\nthey move from dependence towards independence, they will begin to develop\ntheir own thoughts, their own ideas. This can be challenging, exciting,\nfrightening for teenager and adult alike and parental love can be stretched to\nthe limit.\nIn the area of faith, it has been a matter of accepting, with very little question,\nwhat parents, teachers, clergy have said. But the time comes when faith has to\nbecome their faith. Because it is only when faith becomes their faith, and not a\nsecond hand version of yours or mine, will it become a faith that will take them\nPage 2 of 4\nProper 19 – year B – 2012 –Trinity 15\nthrough life. I point out that at Baptism, the questions were asked of their\nparents and godparents. At confirmation the Archbishop will ask them the\nquestions. ‘Do you turn to Christ? Do you submit to Christ? Do you come to\nChrist? Mum, Dad, godparents, friends will be there to watch – but it will be\nthey who speak.\nFaith, my faith, your faith is a living evolving thing. Sometimes it is strong –\nat other times it is tested almost to breaking point. In the context of the lessons\nappointed for use during the week, over the last week or ten days I have found\nmyself reading from the Book Job. It is the story of a man of faith who loses\neverything, his family, his wealth, his family, his health. Friends urge him to\nlook into his life to identify some grievous sin that would explain all this; Job\nmust have done something wrong. The story, as it unfolds, is more than Job\nprotesting his innocence, it is Job seeking meaning - if only he can meet with\nGod and argue his case. It is part of our nature to ask ‘Why?’ Questions\n‘Why?’ are addressed beyond ourselves – we seek meaning beyond ourselves.\nFaith involves what I believe so I suppose when I talk of faith, we think of\nstatements of faith, such as the Nicene and Apostles’ Creed that we recite\nSunday by Sunday. But we don’t ask ‘Why?’ of Creeds, of statements of\ndoctrine. We ask it of a person. So faith involves not only belief but also\nrelationship. The central content of a specifically Christian faith is the event of\nJesus Christ, his incarnation, life, death and resurrection. My faith evolves as I\nrelate to that. This is where the questions of Jesus to his disciples strike a\nchord with me. “Who do people say that I am? Who do you say that I am?”\nWho do you say that I am? Is it Jesus the teacher, the healer, the one who\nPage 3 of 4\nProper 19 – year B – 2012 –Trinity 15\nstilled the storm, the one who identified with the poor and the marginalised of\nhis own society, Jesus the crucified, the Redeemer of my sins, Jesus the risen\nand ascended one, the Messiah, the Son of the living God? I would suspect at\ndifferent stages in life, different aspects have a different significance. Our faith\njourney is a journey of exploring all of these. But whatever stage of that\njourney we are on, there is something compelling about this figure of Jesus that\nspeaks across barriers of time and culture that calls us to follow.\nSo faith involves belief, it involves relationship, acceptance that this figure has\na claim on my life and with that an authority in my life. To our contemporary\nsociety, authority speaks, particularly to younger ears, of restriction, of\nlimitation, of control. But he is the one who says ‘I came that they may have\nlife and have it abundantly’ (John 10:10). Turning to our Gospel reading:\n34He called the crowd with his disciples, and said to them, ‘If any want\nto become my followers, let them deny themselves and take up their\ncross and follow me. 35For those who want to save their life will lose\nit, and those who lose their life for my sake, and for the sake of the\ngospel, will save it. (Mark 8:34,35)\nThose who want to save their life will lose it, those who lose it will save it. In\na strange way it is as we lose our freedom, that we find a new and more\nfulfilling freedom. It is as we accept the authority of this figure Jesus in our\nlives, as we follow in his footsteps, we discover an inner freedom that he alone\ncan bring.\nI have spoken this morning of faith as a living and evolving thing in the face of\nthat question of Jesus to his disciples, ‘Who do you say that I am?’. I would\nsometimes say that I feel I know God now – but I would be awefully\ndisappointed if in ten years time I did not know him better. It would be as if he\nPage 4 of 4\nProper 19 – year B – 2012 –Trinity 15\nwere saying, ‘Sorry Kev, that is all there is – just hang on in there until you\nsnuff it.’ For if faith is to live, if faith is to evolve there always has to be more\nahead of me. I have spoken of an invitation to those seeking Confirmation to\nembark with us on a journey of faith. Faith as belief – but more than that.\nFaith as a relationship with the God who made me and calls me.\nAt the heart of that is a reflection on the life and person of Jesus Christ, his life,\nhis death, his resurrection. So whether life is going well, or whether, like Job,\nlife is throwing up all sorts of questions, may we accompany one another on\nthe journey of faith until we come to that point that we may know, even as we\nare fully known."
    }
}