{
    "title": "Wealth, Power and Responsibility",
    "date": "2019-09-29",
    "blurb": "This sermon reflects on the parable of 'The Rich Man and Lazarus', exploring the themes of wealth, power, and responsibility. It challenges listeners to consider their attitudes towards wealth and power, and their responsibilities towards others. The sermon also emphasizes the importance of service over domination in leadership, and encourages individuals and society to raise a voice for inclusion, hospitality, and hope.",
    "raw_text": "I began last week with the Chinese Curse, purported to come from China, 'May you live in interesting times'. As we look back over this last week, we can certainly say that we live in interesting, very interesting times.\n\nOur Gospel reading is that well known parable told by Jesus of 'The Rich Man and Lazarus'. It is one of a series of reading in Luke’s Gospel that touches on the issue of how we handle wealth. We’ve had the 'Dishonest Manager' last week and earlier in the chapter we had the Parable of the Prodigal Son.\n\nThe criticism is not of wealth itself. Rather we are encouraged to reflect on our attitude to wealth and what it does to us. Take the parable. We are not told that the Rich Man was bad or vindictive. The problem was he simply did not see the poor man at his gate. I came across a lovely observation on this Parable as I was reflecting on it. 'The tale', he writes, 'is spun around the curtains that wealth has drawn on the windows of the rich man so that he is unable to see the beggar at his gate.'\n\nAs one brought up in the U.K., I watched, with a mixture of despair and deep sadness, the proceedings of Westminster on Wednesday night. As I’ve reflected on that, as I read, and re-read, our Gospel reading for today I’ve found myself asking 'What does wealth, what does power do to people?'\n\nIn our own political system, if one particular party has been in power for an extended period of time, we would often speak of the arrogance of power, of the perception that that party has a sense of entitlement to their position.\n\nThe Parable of the Rich Man and Lazarus is one of those that only appears in the Gospel according to Luke. Incidentally, it is only in Luke’s Gospel that we read of the Song of Mary (the Magnificat), when expecting her child, she visits the house of her cousin Elizabeth and is greeted as 'the mother of my Lord'.\n\nHis mercy is for those who fear him\nfrom generation to generation.\nHe has shown strength with his arm;\nhe has scattered the proud in the thoughts of their hearts.\nHe has brought down the powerful from their thrones,\nand lifted up the lowly;\nhe has filled the hungry with good things,\nand sent the rich away empty. Luke 1:50-53\n\nThe rich man, by virtue of his wealth, is powerful. Lazarus, by virtue of his poverty, is powerless. I return to my question; what does wealth do to people? What does power do to people? In both the Parable and in the Magnificat we see something of the same reversal of values that we encounter in the ministry of Jesus. On an occasion when the disciples were arguing among themselves as to who was the greatest, Luke tells us of Jesus reminding them:\n\nBut he said to them, “The kings of the Gentiles lord it over them; and those in authority over them are called benefactors. But not so with you; rather the greatest among you must become like the youngest, and the leader like one who serves. For who is greater, the one who is at the table or the one who serves? Is it not the one at the table? But I am among you as one who serves. Luke 22:25ff\n\nLeadership, in the eyes of Jesus, carries with it connotations of service rather than domination. As is so clearly visible at this time, that is a model of leadership that the world finds difficult to understand.\n\nTo return to our Parable; I would go on to ask are there particular figures in the story whom we could identify with. None of us have the wealth and power characterised by the Rich Man. On the other hand, however hard done by we may feel, none of us suffer the destitution of Lazarus. So, both are figures whom we may view safely from a distance. Who is left? What about the rich man’s five brothers?\n\nThe rich man, even in his torment, still felt he had some influence. So he asks that Lazarus, whom in his time of luxury had escaped his notice, be sent to warn his brothers. The reply comes back –'They have the Moses and the Prophets; they should listen to them'. In other words, they must take responsibility for themselves.\n\nThis is where this passage spoke to me this week. We can all look aghast at scenes in Westminster this week, at statements by politicians in Oughterard that border on racist; we can say that this has nothing to do with me. But we, like the five brothers on the edge of the story, do have responsibilities.\n\nLast week I remarked that over the last three or four years we have seen a rise in populism, the influence of far right groups who are very skilled in the use of social media in getting their particular message across more effectively. We are hearing louder voices that speak of prejudice, a distrust of those who are different, those of a different culture, different lifestyle.\n\nThe philosopher Edmund Burke is reputed to have said: 'The only thing necessary for the triumph of evil is for good men to do nothing.' We can see what is going on. We can see people of colour being racially abused on our public transport. We heard a candidate for our own Presidency in the last election openly playing on people’s fears and insecurities.\n\nThere comes a point when we, as individuals and as a society, must be prepared to raise a voice for inclusion, for hospitality, for hope. To show that there is a better way; a better way than stoking up fires of suspicion, of fear, of distrust; that Gospel values of welcome, of reconciliation, of justice, far from being pie in the sky, offer hope for a society in turmoil.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/proper212019.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 21 – 2019 – Year C - Trinity 15\nI began last week with the Chinese Curse, purported to come from China, ‘May\nyou live in interesting times’. As we look back over this last week, we can\ncertainly say that we live in interesting, very interesting times.\nOur Gospel reading is that well known parable told by Jesus of ‘The Rich Man\nand Lazarus’. It is one of a series of reading in Luke’s Gospel that touches on\nthe issue of how we handle wealth. We’ve had the ‘Dishonest Manager’ last\nweek and earlier in the chapter we had the Parable of the Prodigal Son.\nThe criticism is not of wealth itself. Rather we are encouraged to reflect on our\nattitude to wealth and what it does to us.\nTake the parable. We are not told that the Rich Man was bad or vindictive.\nThe problem was he simply did not see the poor man at his gate. I came across\na lovely observation on this Parable as I was reflecting on it. ‘The tale’, he\nwrites, ‘is spun around the curtains that wealth has drawn on the windows of\nthe rich man so that he is unable to see the beggar at his gate.’\nAs one brought up in the U.K., I watched, with a mixture of despair and deep\nsadness, the proceedings of Westminster on Wednesday night. As I’ve\nreflected on that, as I read, and re-read, our Gospel reading for today I’ve\nfound myself asking ‘What does wealth, what does power do to people?’\nIn our own political system, if one particular party has been in power for an\nextended period of time, we would often speak of the arrogance of power, of\nthe perception that that party has a sense of entitlement to their position.\nPage 2 of 4\nPROPER 21 – 2019 – Year C - Trinity 15\nThe Parable of the Rich Man and Lazarus is one of those that only appears in\nthe Gospel according to Luke. Incidentally, it is only in Luke’s Gospel that we\nread of the Song of Mary (the Magnificat), when expecting her child, she visits\nthe house of her cousin Elizabeth and is greeted as ‘the mother of my Lord’.\nHis mercy is for those who fear him\nfrom generation to generation.\nHe has shown strength with his arm;\nhe has scattered the proud in the thoughts of their hearts.\nHe has brought down the powerful from their thrones,\nand lifted up the lowly;\nhe has filled the hungry with good things,\nand sent the rich away empty. Luke 1:50-53\nThe rich man, by virtue of his wealth, is powerful. Lazarus, by virtue of his\npoverty, is powerless. I return to my question; what does wealth do to people?\nWhat does power do to people? In both the Parable and in the Magnificat we\nsee something of the same reversal of values that we encounter in the ministry\nof Jesus. On an occasion when the disciples were arguing among themselves\nas to who was the greatest, Luke tells us of Jesus reminding them:\nBut he said to them, “The kings of the Gentiles lord it over them; and\nthose in authority over them are called benefactors. But not so with\nyou; rather the greatest among you must become like the youngest,\nand the leader like one who serves. For who is greater, the one who is\nat the table or the one who serves? Is it not the one at the table? But I\nam among you as one who serves. Luke 22:25ff\nLeadership, in the eyes of Jesus, carries with it connotations of service rather\nthan domination. As is so clearly visible at this time, that is a model of\nleadership that the world finds difficult to understand.\nPage 3 of 4\nPROPER 21 – 2019 – Year C - Trinity 15\nTo return to our Parable; I would go on to ask are there particular figures in\nthe story whom we could identify with. None of us have the wealth and power\ncharacterised by the Rich Man. On the other hand, however hard done by we\nmay feel, none of us suffer the destitution of Lazarus. So, both are figures\nwhom we may view safely from a distance. Who is left? What about the rich\nman’s five brothers?\nThe rich man, even in his torment, still felt he had some influence. So he asks\nthat Lazarus, whom in his time of luxury had escaped his notice, be sent to\nwarn his brothers. The reply comes back –‘They have the Moses and the\nProphets; they should listen to them’. In other words, they must take\nresponsibility for themselves.\nThis is where this passage spoke to me this week. We can all look aghast at\nscenes in Westminster this week, at statements by politicians in Oughterard\nthat border on racist; we can say that this has nothing to do with me. But we,\nlike the five brothers on the edge of the story, do have responsibilities.\nLast week I remarked that over the last three or four years we have seen a rise\nin populism, the influence of far right groups who are very skilled in the use of\nsocial media in getting their particular message across more effectively. We\nare hearing louder voices that speak of prejudice, a distrust of those who are\ndifferent, those of a different culture, different lifestyle.\nThe philosopher Edmund Burke is reputed to have said: ‘The only thing\nnecessary for the triumph of evil is for good men to do nothing.’ We can see\nwhat is going on. We can see people of colour being racially abused on our\nPage 4 of 4\nPROPER 21 – 2019 – Year C - Trinity 15\npublic transport. We heard a candidate for our own Presidency in the last\nelection openly playing on people’s fears and insecurities.\nThere comes a point when we, as individuals and as a society, must be\nprepared to raise a voice for inclusion, for hospitality, for hope. To show that\nthere is a better way; a better way than stoking up fires of suspicion, of fear, of\ndistrust; that Gospel values of welcome, of reconciliation, of justice, far from\nbeing pie in the sky, offer hope for a society in turmoil."
    }
}