{
    "title": "Render to God and Caesar",
    "date": "2014-10-19",
    "blurb": "In this sermon, Kevin discusses the teaching of Jesus about the dual responsibilities to secular and divine authorities. Using the metaphor of Roman coins, he explains that while we must fulfill our civic duties, our true image and allegiance belong to God. We are called to love and serve God and others, reflecting Jesus' love and sacrifice.",
    "raw_text": "### Family Service - PROPER 24\n\n**Matthew 22:15-22**\n_Give to Caesar that which is Caesar’s and to God that which is God’s._\n\nSometimes I find pictures help me think about what verses like this mean.\n\nCaesar gets the money due to him in taxes. So what does God get?\n\nWe are made in God’s image – God wants us – wants us to love him, to serve him, to serve other people. God wants us so much that he sent his son Jesus into the world.\n\n**God so loved the world that he gave his only Son Jesus Christ,**\n_to save us from our sins, to intercede for us in heaven, and to bring us to eternal life._\n\nHaving been loved, he wants us to show love. Story of John the Apostle: _'Little children love one another.'_ We love because he first loved us.\n\nSo what does God get, or what does God want to get? He wants us, you and me, to love him, for what he is, our God, for what he has done for us in the life and death and resurrection of Jesus. Part of that love is loving others in his name.\n\nThe town chose not to repair a statue of Christ with no hands but put these words at the base:\n\n_Christ has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,_\n\nAnd so at the end of every communion service we say a prayer that ends with the words:\n\n_Send us out in the power of your Spirit\nto live and work to your praise and glory. Amen._",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper242014famserv.txt",
        "raw_ocr_content": "Page 1 of 3\nFamily Service - PROPER 24\nNeed powerpoint ‘Family Service – Oct 2014\nRefer to coins being made by the youngsters - how some\nexamples.\nWhy do you think Elke had you making those? - draw out\nGospel story\nSlide 1 (picture of the roman coins)\nMatthew 22:15-22\nGive to Caesar that which is Caesar’s and to God that which is\nGod’s.\nSometimes I find pictures help me think about what verses like\nthis mean.\nSlide 2 – cartoon (1)\nCaesar gets the money due to him in taxes\nSo what does God get?\nSlide 3 – cartoon (2)\nPage 2 of 3\nFamily Service - PROPER 24\nNeed powerpoint ‘Family Service – Oct 2014\nWe are made in God’s image – God wants us – wants us to\nlove him, to serve him, to serve other people.\nGod wants us so much that he sent his son Jesus into the world\nSlide 4\nGod so loved the world that he gave his only Son Jesus Christ,\nto save us from our sins, to intercede for us in heaven, and to\nbring us to eternal life.\nHaving been loved, he wants us to show love.\nStory of John the Apostle ‘ Little children love one another.’\nSlide 5 - we love because he first loved us\nSo what does God get, or what does God want to get?\nHe wants us, you and me, to love him, for what he is, our God,\nfor what he has done for us in the life and death and\nresurrection of Jesus. Part of that love is loving others in his\nname.\nSlide 6 – Statue of Christ with no hands\nPage 3 of 3\nFamily Service - PROPER 24\nNeed powerpoint ‘Family Service – Oct 2014\nTown chose not to repair but put these words at the base:\nSlide 7\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nAnd so at the end of every communion service we say a prayer\nthat ends with the words.\nSlide 8 – Send us out\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen.\nSlide 9 – ‘So what does God get?"
    }
}