{
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/proper122010.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 12 – Year C – 2010 – Trinity 8\nI remember many years ago going to see a film one night. I have long forgotten the title of\nthe film, but the story was of an aristocratic young man who was convinced he was God.\nAs the film progressed his understanding of who he was swung from what he perceived as\nthe New Testament God of love and forgiveness and more towards the sterner, Old\nTestament God of judgement and punishment. During a stay in an upmarket, private clinic\nhe was asked by his doctor why he thought he was God. To which he replied, ‘I find that\nwhen I pray, I realise I am simply talking to myself.’\nOur Gospel lesson has raised this whole topic of prayer and with it the question in our own\nminds, ‘What are we doing when we pray?’. Is it really more than just a matter of simply\ntalking to ourselves? What are our expectations? What are our feelings when we perceive\nthat our prayers have not worked, have gone unanswered, have been ignored? We can get\nannoyed with God. Or, if we feel that we cannot do that, we then feel that there must be\nsomething wrong with us – my faith is not strong enough, I am not worthy. We get\nconfused and, in truth, we often just give up on prayer altogether.\nI often find myself going back to a conversation I had with the late Canon Billy Wynne.\nHe said he had come more and more to the conclusion that for him a big bit of prayer was\na matter of ‘thinking things through before God’. Today I just want to explore the concept\nof prayer in terms of thinking things through before God.\nA lot of our thinking in this technical age is analytical – but there is a whole area of\nthinking that engages at a different level – a thinking that looks at things as they are and\nhow they might have been; that reflects not just on facts but also on values and ideals; a\ntype of thinking that has been called passionate thinking. At times there is a sense of\nwonder and thankfulness in the face of some great achievement or possibility – at others a\nsense of disappointment or regret at what could have been, perhaps tinged with a sense of\nshame at our own shortcomings. In the context of prayer this passionate thinking\nmanifests itself in thanksgiving and penitence.\nPage 2 of 3\nPROPER 12 – Year C – 2010 – Trinity 8\nBut prayer goes further than this – it extends into what has been called compassionate\nthinking. In this we go out from ourselves to stand alongside the other in their feelings of\naspiration and need. In Christian prayer this involves the whole business of intercessory\nprayer, a compassionate confrontation with the needs of the other in the presence of God.\nThere is no doubt such prayer opens our hearts and minds to the needs of others – but\nwhat about the person for whom we pray? Are we just trying to manipulate God, to get\nhim to see things our way?\nWhat am I doing when I pray for someone? I suppose fundamentally, in intercessory\nprayer, I bring those people and concerns for whom I pray into the context of the creative\nand healing power of God. I came across a lovely expression; ‘Prayer, as petition and\nintercession, helps to make human reality porous to the divine reality.’ Now in many\nways that sort of activity is a dangerous activity. Intercessory prayer, compassionate\nthinking, expressing real concern for the other, is not for those who are wrapped up in\nthemselves; it opens me up to claims upon myself to follow through on my prayer in\nterms of action – action in terms of changed attitudes, in terms of personal commitment.\nPrayer then moves from passionate thinking, through to compassionate thinking, through\nto responsible thinking. I need to be prepared to be one through whom prayer is\nanswered, one through whom God acts in a particular situation or set of circumstances.\nWe are getting here a picture of prayer that takes us out of ourselves – if I am serious in\nprayer, I am going to be looking beyond myself, beyond my immediate interests, beyond\nmy immediate concerns (though these will form a proper part of my prayer) towards the\nneeds of others and the claim of God upon my life. Prayer then, as passionate thinking, as\ncompassionate thinking, as responsible thinking is thinking big. It is setting my life, my\nhopes and my fears, the things that happen, the big and small tragedies that I really do not\nunderstand, the people and situations for whom I pray within the overall context of the\npurposes of God.\nPage 3 of 3\nPROPER 12 – Year C – 2010 – Trinity 8\nThis morning we are baptising this child. In the context of this service we are praying for\nbaby Olwen. What is our ‘prayer as thinking’ as we pray for Olwen this morning?\nIn our prayer as passionate thinking I suppose I think of all the wonderful possibilities\nthat lie ahead for this young child as well as all the issues that will face her and her\ngeneration both in society and in the wider world. Michael and Rhona, as any other\nparents, share those feelings of hope as well as wondering how they will cope with what\nlies ahead.\nIn our prayer as compassionate thinking, we as a community hold up Michael and Rhona\nand baby Olwen in our prayers this morning. We pray for them as they grow as a family;\nasking for Michael and Rhona special gifts of wisdom, of patience, of love; asking for\nbaby Olwen gifts of strength, of health, of vitality, that she may come to know something\nof God’s love, God’s presence and purpose in her life, that she may find her place in the\nlife of this place.\nIn our prayer as responsible thinking, we all have to think how in our lives we can follow\nthrough on our prayers. For Michael and Rhona there are all the responsibilities of\nparenthood, of following through on the things that have been said today. We as a\ncommunity pray that she will find her place in the life of this place. In what ways are we\nprepared to follow through on those prayers in terms of acceptance, in terms of inclusion,\nin terms of welcome.\nAnd in all this, in our prayer we are encouraged to think big; to see ourselves, our\nconcerns for ourselves and for one another and this world in which we live within the\noverall setting of the God who created us, in whom we live and move and have our being,\nthe God whom we worship and whom we seek to serve."
    },
    "base": "{\n    \"title\": \"Thinking Through Prayer\",\n    \"date\": \"2010-07-25\",\n    \"blurb\": \"In this sermon, Kevin explores the concept of prayer as a form of 'thinking things through before God'. He discusses different aspects of prayer, including passionate thinking, compassionate thinking, and responsible thinking. He emphasizes that prayer is not just about asking for things, but also about reflecting on our own attitudes and actions, and being open to God's influence in our lives.\",\n    \"raw_text\": \"I remember many years ago going to see a film one night. I have long forgotten the title of the film, but the story was of an aristocratic young man who was convinced he was God. As the film progressed his understanding of who he was swung from what he perceived as the New Testament God of love and forgiveness and more towards the sterner, Old Testament God of judgement and punishment. During a stay in an upmarket, private clinic he was asked by his doctor why he thought he was God. To which he replied, 'I find that when I pray, I realise I am simply talking to myself.'\n\nOur Gospel lesson has raised this whole topic of prayer and with it the question in our own minds, 'What are we doing when we pray?'. Is it really more than just a matter of simply talking to ourselves? What are our expectations? What are our feelings when we perceive that our prayers have not worked, have gone unanswered, have been ignored? We can get annoyed with God. Or, if we feel that we cannot do that, we then feel that there must be something wrong with us – my faith is not strong enough, I am not worthy. We get confused and, in truth, we often just give up on prayer altogether.\n\nI often find myself going back to a conversation I had with the late Canon Billy Wynne. He said he had come more and more to the conclusion that for him a big bit of prayer was a matter of 'thinking things through before God'. Today I just want to explore the concept of prayer in terms of thinking things through before God.\n\nA lot of our thinking in this technical age is analytical – but there is a whole area of thinking that engages at a different level – a thinking that looks at things as they are and how they might have been; that reflects not just on facts but also on values and ideals; a type of thinking that has been called passionate thinking. At times there is a sense of wonder and thankfulness in the face of some great achievement or possibility – at others a sense of disappointment or regret at what could have been, perhaps tinged with a sense of shame at our own shortcomings. In the context of prayer this passionate thinking manifests itself in thanksgiving and penitence.\n\nBut prayer goes further than this – it extends into what has been called compassionate thinking. In this we go out from ourselves to stand alongside the other in their feelings of aspiration and need. In Christian prayer this involves the whole business of intercessory prayer, a compassionate confrontation with the needs of the other in the presence of God. There is no doubt such prayer opens our hearts and minds to the needs of others – but what about the person for whom we pray? Are we just trying to manipulate God, to get him to see things our way?\n\nWhat am I doing when I pray for someone? I suppose fundamentally, in intercessory prayer, I bring those people and concerns for whom I pray into the context of the creative and healing power of God. I came across a lovely expression; 'Prayer, as petition and intercession, helps to make human reality porous to the divine reality.' Now in many ways that sort of activity is a dangerous activity. Intercessory prayer, compassionate thinking, expressing real concern for the other, is not for those who are wrapped up in themselves; it opens me up to claims upon myself to follow through on my prayer in terms of action – action in terms of changed attitudes, in terms of personal commitment.\n\nPrayer then moves from passionate thinking, through to compassionate thinking, through to responsible thinking. I need to be prepared to be one through whom prayer is answered, one through whom God acts in a particular situation or set of circumstances. We are getting here a picture of prayer that takes us out of ourselves – if I am serious in prayer, I am going to be looking beyond myself, beyond my immediate interests, beyond my immediate concerns (though these will form a proper part of my prayer) towards the needs of others and the claim of God upon my life. Prayer then, as passionate thinking, as compassionate thinking, as responsible thinking is thinking big. It is setting my life, my hopes and my fears, the things that happen, the big and small tragedies that I really do not understand, the people and situations for whom I pray within the overall context of the purposes of God.\n\nThis morning we are baptising this child. In the context of this service we are praying for baby Olwen. What is our 'prayer as thinking' as we pray for Olwen this morning? In our prayer as passionate thinking I suppose I think of all the wonderful possibilities that lie ahead for this young child as well as all the issues that will face her and her generation both in society and in the wider world. Michael and Rhona, as any other parents, share those feelings of hope as well as wondering how they will cope with what lies ahead.\n\nIn our prayer as compassionate thinking, we as a community hold up Michael and Rhona and baby Olwen in our prayers this morning. We pray for them as they grow as a family; asking for Michael and Rhona special gifts of wisdom, of patience, of love; asking for baby Olwen gifts of strength, of health, of vitality, that she may come to know something of God’s love, God’s presence and purpose in her life, that she may find her place in the life of this place.\n\nIn our prayer as responsible thinking, we all have to think how in our lives we can follow through on our prayers. For Michael and Rhona there are all the responsibilities of parenthood, of following through on the things that have been said today. We as a community pray that she will find her place in the life of this place. In what ways are we prepared to follow through on those prayers in terms of acceptance, in terms of inclusion, in terms of welcome.\n\nAnd in all this, in our prayer we are encouraged to think big; to see ourselves, our concerns for ourselves and for one another and this world in which we live within the overall setting of the God who created us, in whom we live and move and have our being, the God whom we worship and whom we seek to serve.\"\n}"
}