{
    "title": "The Exodus and Modern Refugees",
    "date": "2017-09-24",
    "blurb": "Kevin draws parallels between the biblical story of the Exodus and the plight of modern refugees. He reflects on the recurring theme of a people on the move, facing hardships and seeking hope. The sermon encourages us to find God's presence in those who support us during our vulnerable times and to be that presence for others.",
    "raw_text": "PROPER 21 – (2017) Year A – Trinity 16\n\nThe people quarrelled with Moses, 'Why did you bring us out of Egypt, to kill us and our children and livestock with thirst?' Ex 17:2ff\n\nHow often have we heard that said, how often have we said that ourselves? Maybe we have been on a journey and there is a choice about which route to take. After maybe a heated discussion, we head off down the narrower roads. After sitting behind a tractor hauling bales of hay for a couple of miles, one will turn to the other and say, 'I told you that this would happen!' 'Didn’t I tell you that I knew this wouldn’t work?'\n\nI thought of that as I read our Old Testament Lesson this morning, and in particular the words; 'The people quarrelled with Moses ... and said, 'Why did you bring us out of Egypt, to kill us and our children and livestock with thirst?' Ex 17:2ff\n\nAs I reflected on our reading for today and our previous readings from Exodus that we have read over the last few weeks, I began to see a different story. This is a story of a refugee people that is repeated in every generation down through the years. It is a story of a people on the move; a people facing harassment as they leave their place of suffering; a people who do not know where the next meal is to come from; a people not even sure of where they are going and what faces them when they arrive.\n\nTwo years ago we watched as thousands, fleeing from persecution in Iraq and Syria faced perilous journeys in flimsy boats. We saw the image of the body of a young child washed up on a Mediterranean beach. These people knew what it was like to face harassment as they left their homelands. They knew what it was like, as they moved out of Greece and across Europe, to find themselves confronted by barbed wire fences with little shelter, uncertain as to where they were going to get food and water. Unsure of what welcome awaited them.\n\nIn 2015 Germany gave a remarkable lead in opening up its borders to nearly a million refugees. The integration of these refugees has not been without its problems and Angela Merkel certainly paid a price at the recent polls. But what has struck me this week is her insistence that this was the right thing to do, that a Germany that did not welcome the stranger was not her country.\n\nThe refugee on the open sea, on the road knows what it is to be vulnerable; the refugee knows what it is to be frightened. 'Is the LORD among us or not?' Does God even know, does God even care about what we are facing?\n\nMercifully we know nothing of what it is physically to be a refugee. But at different stages in our life, we do all know what it is to be vulnerable, what it is to be frightened; what it means, even in the midst of crowds, to feel lonely. And the world goes on around us. And which of us hasn’t found ourselves saying, 'Does anyone know, does anyone care?' And of course there are people who do know, people who do care.\n\n'Is the Lord among us or not?' He is among us in the people he has placed alongside us; the family member, the friend and sometimes the complete stranger who sits alongside, listening, encouraging, or just being there. He is there – and we can be that presence for others. He is there, even when he doesn’t seem to be there bearing our pain, sharing our fears. He is there, breaking through in signs of hope in even the darkest of times. He is there on the road with the persecuted, the despairing. He is there, even in us, in simple acts of kindness and understanding.\n\nGo, and know that the Lord goes with you: let him lead you each day into the quiet place of your heart, where he will speak with you; know that he watches over you – that he listens to you in gentle understanding, that he is with you always, wherever you are and however you may feel.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper212017.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 21 – (2017) Year A – Trinity 16\n2The people quarrelled with Moses, ……..‘Why did you bring us out of Egypt,\nto kill us and our children and livestock with thirst?’ Ex 17:2ff\n‘I told you that this would happen!’ ‘Didn’t I tell you that I knew this wouldn’t\nwork?’\nHow often have we heard that said, how often have we said that ourselves?\nMaybe we have been on a journey and there is a choice about which route to\ntake. There is a short route following narrower roads or there is a longer route\nmay involving motorways. After maybe a heated discussion, we head off\ndown the narrower roads. After sitting behind a tractor hauling bales of hay for\na couple of miles, one will turn to the other and say, ‘I told you that this would\nhappen!’ ‘Didn’t I tell you that I knew this wouldn’t work?’\nI thought of that as I read our Old Testament Lesson this morning, and in\nparticular the words;\n2The people quarrelled with Moses ………… and said, ‘Why did you\nbring us out of Egypt, to kill us and our children and livestock with\nthirst?’ Ex 17:2ff\nAs I read that again, I thought this is a recurring theme in the story of the\nExodus.\nAs the people on the run from Egypt realised that they were trapped between\nthe Red Sea and the approaching Egyptian army, we read:\n10 As Pharaoh drew near, the Israelites looked back, and there were the\nEgyptians advancing on them…….. 11 They said to Moses, \"Was it\nbecause there were no graves in Egypt that you have taken us away to die\nin the wilderness?......... 12 Is this not the very thing we told you in Egypt,\n'Let us alone and let us serve the Egyptians'?\nExodus 14:10\nPage 2 of 4\nPROPER 21 – (2017) Year A – Trinity 16\nLast week, we read of the story of the giving of manna in response to their cries of hunger\nin the desert\nThe whole congregation of the Israelites complained against Moses and\nAaron in the wilderness. 3The Israelites said to them, ‘If only we had died\nby the hand of the LORD in the land of Egypt, when we sat by the\nfleshpots and ate our fill of bread; for you have brought us out into this\nwilderness to kill this whole assembly with hunger.’ Exodus 16.2ff\nWe read this extended story as one of the problems of leadership confronted\nwith difficult followers. Poor Moses, he was never appreciated.\nAs I reflected on our reading for today and our previous readings from Exodus\nthat we have read over the last few weeks, I began to see a different story. This\nis a story of a refugee people that is repeated in every generation down through\nthe years. It is a story of a people on the move; a people facing harassment as\nthey leave their place of suffering; a people who do not know where the next\nmeal is to come from; a people not even sure of where they are going and what\nfaces them when they arrive.\nTwo years ago we watched as thousands, fleeing from persecution in Iraq and\nSyria faced perilous journeys in flimsy boats. We saw the image of the body of\na young child washed up on a Mediterranean beach. These people knew what\nit was like to face harassment as they left their homelands. They knew what it\nwas like, as they moved out of Greece and across Europe, to find themselves\nconfronted by barbed wire fences with little shelter, uncertain as to where they\nwere going to get food and water. Unsure of what welcome awaited them.\nPage 3 of 4\nPROPER 21 – (2017) Year A – Trinity 16\nIn 2015 Germany gave a remarkable lead in opening up its borders to nearly a\nmillion refugees. The integration of these refugees has not been without its\nproblems and Angela Merkel certainly paid a price at the recent polls. But\nwhat has struck me this week is her insistence that this was the right thing to\ndo, that a Germany that did not welcome the stranger was not her country.\nThis is in sharp contrast to politicians, on both sides of the Atlantic, who have\nadvanced their cause by heightening peoples’ fear, trading on their anxieties\nrather than opening up a vision of a more open, more humane society. In this\nshe has laid down a challenge not only to her own people but to all societies to\nrespond with justice and compassion.\nThe refugee on the open sea, on the road knows what it is to be vulnerable; the\nrefugee knows what it is to be frightened. We are told at the end of our Old\nTestament Lesson:\n(Moses) called the place Massah and Meribah, because the Israelites\nquarrelled and tested the LORD, saying, ‘Is the LORD among us or not?’\nIs the Lord among us or not. Does God even know, does God even care about\nwhat we are facing?\nMercifully we know nothing of what it is physically to be a refugee. But at\ndifferent stages in our life, we do all know what it is to be vulnerable, what it is\nto be frightened; what it means, even in the midst of crowds, to feel lonely. It\nmay be for a wide range of reasons – loss of employment and with that our\nfinancial security, breakdown of a relationship which may lead to loss of home,\nanxiety over our health or that of a loved one. And the world goes on around\nus. And which of us hasn’t found ourselves saying, ‘Does anyone know, does\nPage 4 of 4\nPROPER 21 – (2017) Year A – Trinity 16\nanyone care?’ And of course there are people who do know, people who do\ncare.\nIs the Lord among us or not?\nHe is among us in the people he has placed alongside us; the family member,\nthe friend and sometimes the complete stranger who sits alongside, listening,\nencouraging, or just being there. He is there – and we can be that presence for\nothers. He is there, even when he doesn’t seem to be there bearing our pain,\nsharing our fears. He is there, breaking through in signs of hope in even the\ndarkest of times. He is there on the road with the persecuted, the despairing.\nHe is there, even in us, in simple acts of kindness and understanding.\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:"
    }
}