{
    "title": "Reflections on Divine Courtship",
    "date": "2015-08-30",
    "blurb": "Kevin explores the theme of divine love and courtship as presented in the Song of Solomon and the Book of Proverbs. He emphasizes the tenderness, faithfulness, and loyalty that characterize a maturing love, drawing parallels between human relationships and the relationship between God and His people. The sermon encourages a response to God's love that allows for transformation and a new way of life reflecting God's love.",
    "raw_text": "Proper 17 – 2015 – year B – Trinity 12 – morning\n\nThe Bible is a remarkably varied book. I recall one of my lecturers, as he began a course of lectures, remarking on the range of material, history, poetry, law, judgement, exultant praise, agonising lament, that it could be said that 'All human life is there' – unfortunately the now defunct News of the World had grabbed that slogan for itself. For all human life is indeed found within its pages. As we followed the story of David over recent weeks we saw David in all his many strengths, in all his weaknesses and failings.\n\nOver the next few weeks, our Old Testament Lessons are drawn from the Song of Solomon and the Book of Proverbs, part of what is known as the Wisdom Literature. Today's Lesson is from the Song of Solomon, a work that takes the form of a love song and is unique in the Biblical literature. Commentators have recognised in this an analogy of the love between God and his people expressed in the language of courtship, of ardent, almost sensual love.\n\nI want this morning just to reflect on this whole theme of courtship, of love in the context of faith, in the context of life. We talk of falling in love, of being smitten, of love being blind. You may recall times when your love for another was almost all consuming, when it coloured our priorities. What is it that we look for, what is it that we offer in love?\n\nFirst of all there is something of the tenderness we find in the passage we read today, in the repeated refrain, 'Arise my darling, my beautiful one, come with me.' Then, of course, as love develops and matures, as the relationship deepens, so other characteristics come into play.\n\nAlongside the tenderness, there is faithfulness, loyalty. As we draw closer, as we come to depend on the other, so the other becomes a source of strength. But of course the longer you know someone, the longer we are known by the other, so we come to recognise the weakness, the frailty of the other and with that comes forgiveness and understanding.\n\nOur lesson arouses, as I say, a picture of courtship, of wooing. There is a sense in our own experience of God in Christ as the one who will not go away, who stands at the door and knocks – we may ignore the knock but he does not give up.\n\nF.E. Thompson, in that lovely poem, 'The Hound of Heaven' speaks of the hopeless attempt to elude the God who seeks us:\n\n'I fled Him, down the nights and down the days;\nI fled Him, down the arches of the years;\nI fled Him, down the labyrinthine ways\nOf my own mind; and in the mist of tears\nI hid from Him, and under running laughter.'\n\nThat presence, in the past avoided, becomes in time a source of strength as we learn to depend on him whose advances we had previously spurned. We recognize in him our life, our strength, our hope. In the words of hymn 611, based on Patrick's Breastplate:\n\nChrist be beside me, Christ be before me,\nChrist be behind me, King of my heart.\nChrist be within me, Christ be below me,\nChrist be above me, never to part.\n\nIn the early days of courtship, we are on our best behaviour; the one we love sees our best side; sees nothing, or chooses to see nothing of our darker, more fallible side. Of course eventually, maybe sooner than later, the mask slips – there is a truth in that old saying – you have to live with someone before you really know them. That is where the forgiveness and understanding I spoke of earlier comes in to play.\n\nChrist in the words of the song is one 'who knows me better than I know myself', one to whom I can bring myself in all my strengths and failings. For he knows what it is to be human, he knows what it is to be me. As the writer of the letter to the Hebrews reminds us,\n\n'For we do not have a High Priest who is unable to sympathise with our weaknesses, but we have one who has been tempted in every way, just as we are – yet was without sin. Let us then approach the throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need.' (Heb 4:15,16)\n\none who, in the words of our Communion Service,\n\n'opened wide his arms upon the cross and, with love stronger than death, he made the perfect sacrifice for sin.' (Eucharistic Prayer 3, BCP 2004)\n\nSo what is to be our response to God's advances, God's self giving, self emptying initiatives in love and forgiveness. Love must be allowed to change us if we are to make our own response of love. That change must happen at all levels. Jesus, in our Gospel reading, talks of change that goes beyond mere outward observance:\n\n'There is nothing outside a person that by going in can defile, but the things that come out are what defile.'\n\nThose self centred, self serving but ultimately self destructive attitudes such as adultery, envy, deceit, envy, pride – we must allow the God who loves us to come to us, to gently prise these from the fabric of our lives.\n\nThere is the story of a man who was charged with stealing a chicken belonging to his neighbour. In court his lawyer argued his case so effectively that the jury found him not guilty. The judge assured him that he left the court without a stain on his character. The man began to leave the dock but then turned to the judge and said, 'Does that mean I can keep the chicken?' The man wanted all the benefits of his acquittal but also wanted to retain the fruits of his misdemeanours. There is something in us all that wants \"to keep the chicken\".\n\nThe teachings of Jesus, his parables and his healings, remind me that in his call to respond to his love, he is calling me into a new way of life, a new style of life, a life that bears witness to, that reflects something of the love of God himself.\n\nMay God enable each one of us to respond to that love for us in Christ and show something of that same love in lives committed to his service.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper172015.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 17 – 2015 – year B – Trinity 12 – morning\nThe Bible is a remarkably varied book. I recall one of my lecturers, as he\nbegan a course of lectures, remarking on the range of material, history, poetry,\nlaw, judgement, exultant praise, agonising lament, that it could be said that ‘All\nhuman life is there’ – unfortunately the now defunct News of the World had\ngrabbed that slogan for itself. For all human life is indeed found within its\npages. As we followed the story of David over recent weeks we saw David in\nall his many strengths, in all his weaknesses and failings.\nOver the next few weeks, our Old Testament Lessons are drawn from the Song\nof Solomon and the Book of Proverbs, part of what is known as the Wisdom\nLiterature. Today’s Lesson is from the Song of Solomon, a work that takes the\nform of a love song and is unique in the Biblical literature. Commentators\nhave recognised in this an analogy of the love between God and his people\nexpressed in the language of courtship, of ardent, almost sensual love.\nI want this morning just to reflect on this whole theme of courtship, of love in\nthe context of faith, in the context of life. We talk of falling in love, of being\nsmitten, of love being blind. You may recall times when your love for another\nwas almost all consuming, when it coloured our priorities. What is it that we\nlook for, what is it that we offer in love?\nFirst of all there is something of the tenderness we find in the passage we read\ntoday, in the repeated refrain, ‘Arise my darling, my beautiful one, come with\nme.’ Then, of course, as love develops and matures, as the relationship\ndeepens, so other characteristics come into play.\nPage 2 of 4\nProper 17 – 2015 – year B – Trinity 12 – morning\nAlongside the tenderness, there is faithfulness, loyalty. As we draw closer, as\nwe come to depend on the other, so the other becomes a source of strength.\nBut of course the longer you know someone, the longer we are known by the\nother, so we come to recognise the weakness, the frailty of the other and with\nthat comes forgiveness and understanding.\nOur lesson arouses, as I say, a picture of courtship, of wooing. There is a sense\nin our own experience of God in Christ as the one who will not go away, who\nstands at the door and knocks – we may ignore the knock but he does not give\nup.\nF.E. Thompson, in that lovely poem, “The Hound of Heaven” speaks of the\nhopeless attempt to elude the God who seeks us:\n‘I fled Him, down the nights and down the days;\nI fled Him, down the arches of the years;\nI fled Him, down the labyrinthine ways\nOf my own mind; and in the mist of tears\nI hid from Him, and under running laughter.’\nThat presence, in the past avoided, becomes in time a source of strength as we\nlearn to depend on him whose advances we had previously spurned. We\nrecognize in him our life, our strength, our hope. In the words of hymn 611,\nbased on Patrick’s Breastplate:\nChrist be beside me, Christ be before me,\nChrist be behind me, King of my heart.\nChrist be within me, Christ be below me,\nChrist be above me, never to part.\nPage 3 of 4\nProper 17 – 2015 – year B – Trinity 12 – morning\nIn the early days of courtship, we are on our best behaviour; the one we love\nsees our best side; sees nothing, or chooses to see nothing of our darker, more\nfallible side. Of course eventually, maybe sooner than later, the mask slips –\nthere is a truth in that old saying – you have to live with someone before you\nreally know them. That is where the forgiveness and understanding I spoke of\nearlier comes in to play.\nChrist in the words of the song is one ‘who knows me better than I know\nmyself’, one to whom I can bring myself in all my strengths and failings. For\nhe knows what it is to be human, he knows what it is to be me. As the writer of\nthe letter to the Hebrews reminds us,\n‘For we do not have a High Priest who is unable to sympathise with our\nweaknesses, but we have one who has been tempted in every way, just as we\nare – yet was without sin. Let us then approach the throne of grace with\nconfidence, so that we may receive mercy and find grace to help us in our time\nof need.’ (Heb 4:15,16) ;\none who, in the words of our Communion Service,\n‘opened wide his arms upon the cross and, with love stronger than death, he\nmade the perfect sacrifice for sin.’ Eucharistic Prayer 3, BCP 2004)\nSo what is to be our response to God’s advances, God’s self giving, self\nemptying initiatives in love and forgiveness. Love must be allowed to change\nus if we are to make our own response of love. That change must happen at all\nlevels. Jesus, in our Gospel reading, talks of change that goes beyond mere\noutward observance:\nPage 4 of 4\nProper 17 – 2015 – year B – Trinity 12 – morning\n‘There is nothing outside a person that by going in can defile, but the things\nthat come out are what defile.’\nThose self centred, self serving but ultimately self destructive attitudes such as\nadultery, envy, deceit, envy, pride – we must allow the God who loves us to\ncome to us, to gently prise these from the fabric of our lives.\nThere is the story of a man who was charged with stealing a chicken belonging\nto his neighbour. In court his lawyer argued his case so effectively that the jury\nfound him not guilty. The judge assured him that he left the court without a\nstain on his character. The man began to leave the dock but then turned to the\njudge and said, ‘Does that mean I can keep the chicken?’ The man wanted all\nthe benefits of his acquittal but also wanted to retain the fruits of his\nmisdemeanours. There is something in us all that wants \"to keep the chicken\".\nThe teachings of Jesus, his parables and his healings, remind me that in his call\nto respond to his love, he is calling me into a new way of life, a new style of\nlife, a life that bears witness to, that reflects something of the love of God\nhimself.\nMay God enable each one of us to respond to that love for us in Christ and\nshow something of that same love in lives committed to his service."
    }
}