{
    "title": "Christian Citizenship",
    "date": "2020-10-18",
    "blurb": "The sermon discusses the balance between Christian citizenship and secular authority, referencing Jesus' teaching on paying taxes to Caesar and the apostle Paul's guidance on respecting governing authorities. It emphasizes the Christian's duty to contribute to societal wellbeing while maintaining allegiance to God's kingdom, and the unique identity as God's image bearers.",
    "raw_text": "Our Gospel reading today contains the question to Jesus about whether it was lawful to pay taxes to Caesar or not. At one level it was a trick question designed to trip Jesus up in front of the crowds which Jesus seemed to adroitly sidestep. But in fact it is a question that goes to the heart of Christian citizenship and one that Jesus in fact meets head on. It is one of a number of passages in the New Testament that touch on this whole issue of the authority of rulers. Paul, in his letter to the Romans gives clear direction on the position of the citizen before the lawful authorities.\n\n> Let every person be subject to the governing authorities; for there is no authority except from God, and those authorities that exist have been instituted by God. Rom 13:1\n\nFor the same reason you also pay taxes, for the authorities are God's servants, busy with this very thing. Pay to all what is due them—taxes to whom taxes are due, revenue to whom revenue is due, respect to whom respect is due, honour to whom honour is due. Rom 13:6,7\n\nThe writer of the First Letter to Timothy directs that prayer be offered for those in authority\n\n> First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings should be made for everyone, for kings and all who are in high positions, so that we may lead a quiet and peaceable life in all godliness and dignity. 1 Timothy 2:1,2\n\nWe live in the world and we, as Christian citizens, are to contribute to the wellbeing of the society in which we live. Part of that is working through the implications of all this and balancing our different loyalties, to society, to family, to God.\n\nGovernment is having a much bigger impact on our lives in the current crisis that we are experiencing with Covid 19. They are providing a much more restrictive framework for us as we seek to work our way through things; in setting a framework for living safely, in making provision for health, for education, in supporting businesses. There is the requirement to wear masks in shops and on public transport, to socially distance, to limit contacts. Those involved in the hospitality sector, who were beginning to get back to some sort of normal, have now been hit again. In the life of the Church, we are currently in our second period of having to worship outside our Church buildings. There are groups who feel that the State has overreached itself in the limitations it has placed up on us; but overall there is the recognition that our political system has served us well over these last few months.\n\nBut of course, as we look at our news bulletins we see examples of situations where governments have overreached themselves in the way they have dealt with dissent, where societies are marked by racial and social injustice.\n\nSo how do we strike the balance, how do we work through our loyalties? To return to our Gospel reading, the question posed to Jesus about the payment of taxes and Jesus' response do in fact take us to the heart of the issue. I came across the following, written by Julie McKinley of the National Bible Society of Ireland, on the online blog Revolectionary, written by young Irish adults exploring the lessons set for each Sunday.\n\nIn the ancient world, a king engraved on his coins showed he owned that land. Julius Caesar was the first Roman ruler to have his own image stamped on the coins used wherever Roman dominion was enforced. These possibly newly minted coins flashed during the encounter we read above, shows Caesar as ruler of Judea, and therefore ruler of the people of Israel, which is why it is so controversial. According to some, paying tax to Caesar using these coins not only sustained the Roman economy but also was a way of venerating his image.\n\nIf we are speaking about images being imprinted, where are we? To go back to the very start of the story, to the second of the creation narratives we find in Genesis, God took the dust of the earth and moulded it in his image, and filled that dust with his breath. Dust and Breath fused to bring forth life. Life that is made in God's image. This God-breathed dust is stamped with his image, in the same way coins are stamped in the image of the Emperor.\n\n> \"So give back to Caesar what is Caesar's, and to God what is God's.\" Jesus teaches - give to Caesar what is his - coins made of metal bearing his own likeness. But give to God what is his - you. The handiwork of God stamped in his image and filled with His breath. We bear the image of the Creator - it is to his kingdom we belong and not Caesar, no matter the might of the Roman army. We are God's image, stamped in dust and each unique.\n\nThe writer, Lois Tverberg, says,\n\n> 'Humans are God's coins, meant to be spent on His world, proclaiming God's Kingdom wherever we circulate.' (See, Walking in the Dust of Rabbi Jesus, Lois Tverberg, Zondervan 2012).\n\nAs citizens we play our part in all aspects of the life and well being of our society. As Christians we offer ourselves, our souls and bodies to be a living sacrifice. Send us out in the power of your Spirit to live and work to your praise and glory.\n\nIn the words of the Methodist Covenant Prayer:\n\n> I am no longer my own but yours. Put me to what you will, rank me with whom you will; put me to doing, put me to suffering; let me be employed for you or laid aside for you, exalted for you or brought low for you. Let me be full, let me be empty; let me have all things, let me have nothing. I freely and wholeheartedly yield all things to your pleasure and disposal.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper242020.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 24 – Year A – 2020 – Trinity 19\nLink to a simple act of worship - https://youtu.be/hPWmVTZL00Q\nOur Gospel reading today contains the question to Jesus about whether it was\nlawful to pay taxes to Caesar or not. At one level it was a trick question\ndesigned to trip Jesus up in front of the crowds which Jesus seemed to\nadroitly sidestep. But in fact it is a question that goes to the heart of\nChristian citizenship and one that Jesus in fact meets head on. It is one of a\nnumber of passages in the New Testament that touch on this whole issue of\nthe authority of rulers. Paul, in his letter to the Romans gives clear direction\non the position of the citizen before the lawful authorities.\nLet every person be subject to the governing authorities; for there is\nno authority except from God, and those authorities that exist have\nbeen instituted by God. Rom 13:1\n…………………………………………………………\nFor the same reason you also pay taxes, for the authorities are God’s\nservants, busy with this very thing. Pay to all what is due them—taxes\nto whom taxes are due, revenue to whom revenue is due, respect to\nwhom respect is due, honour to whom honour is due. Rom 13:6,7\nThe writer of the First Letter to Timothy directs that prayer be offered for those\nin authority\n2 First of all, then, I urge that supplications, prayers, intercessions, and\nthanksgivings should be made for everyone, 2for kings and all who are\nin high positions, so that we may lead a quiet and peaceable life in all\ngodliness and dignity. 1 Timothy 2:1,2\nWe live in the world and we, as Christian citizens, are to contribute to the\nwellbeing of the society in which we live. Part of that is working through the\nimplications of all this and balancing our different loyalties, to society, to\nfamily, to God.\nPage 2 of 4\nPROPER 24 – Year A – 2020 – Trinity 19\nGovernment is having a much bigger impact on our lives in the current crisis\nthat we are experiencing with Covid 19. They are providing a much more\nrestrictive framework for us as we seek to work our way through things; in\nsetting a framework for living safely, in making provision for health, for\neducation, in supporting businesses. There is the requirement to wear masks\nin shops and on public transport, to socially distance, to limit contacts. Those\ninvolved in the hospitality sector, who were beginning to get back to some\nsort of normal, have now been hit again. In the life of the Church, we are\ncurrently in our second period of having to worship outside our Church\nbuildings. There are groups who feel that the State has overreached itself in\nthe limitations it has placed up on us; but overall there is the recognition that\nour political system has served us well over these last few months.\nBut of course, as we look at our news bulletins we see examples of situations\nwhere governments have overreached themselves in the way they have dealt\nwith dissent, where societies are marked by racial and social injustice.\nSo how do we strike the balance, how do we work through our loyalties? To\nreturn to our Gospel reading, the question posed to Jesus about the payment\nof taxes and Jesus’ response do in fact take us to the heart of the issue. I\ncame across the following, written by Julie McKinley of the National Bible\nSociety of Ireland, on the online blog Revolectionary, written by young Irish\nadults exploring the lessons set for each Sunday.\nIn the ancient world, a king engraved on his coins showed he owned that\nland. Julius Caesar was the first Roman ruler to have his own image\nPage 3 of 4\nPROPER 24 – Year A – 2020 – Trinity 19\nstamped on the coins used wherever Roman dominion was enforced.\nThese possibly newly minted coins flashed during the encounter we read\nabove, shows Caesar as ruler of Judea, and therefore ruler of the people\nof Israel, which is why it is so controversial. According to some, paying\ntax to Caesar using these coins not only sustained the Roman economy\nbut also was a way of venerating his image.\nIf we are speaking about images being imprinted, where are we? To go back\nto the very start of the story, to the second of the creation narratives we find\nin Genesis, God took the dust of the earth and moulded it in his image, and\nfilled that dust with his breath. Dust and Breath fused to bring forth life. Life\nthat is made in God’s image. This God-breathed dust is stamped with his\nimage, in the same way coins are stamped in the image of the Emperor.\n“So give back to Caesar what is Caesar’s, and to God what is God’s.” Jesus\nteaches - give to Caesar what is his - coins made of metal bearing his own\nlikeness. But give to God what is his - you. The handiwork of God stamped\nin his image and filled with His breath. We bear the image of the Creator - it\nis to his kingdom we belong and not Caesar, no matter the might of the\nRoman army. We are God’s image, stamped in dust and each unique.\nThe writer, Lois Tverberg, says,\n‘Humans are God’s coins, meant to be spent on His world,\nproclaiming God’s Kingdom wherever we circulate’. (See, Walking\nin the Dust of Rabbi Jesus, Lois Tverberg, Zondervan 2012).\nAs citizens we play our part in all aspects of the life and well being of our\nsociety. As Christians we offer ourselves,\nour souls and bodies to be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory.\nPage 4 of 4\nPROPER 24 – Year A – 2020 – Trinity 19\nIn the words of the Methodist Covenant Prayer:\nI am no longer my own but yours.\nPut me to what you will,\nrank me with whom you will;\nput me to doing, put me to suffering;\nlet me be employed for you or laid aside for you,\nexalted for you or brought low for you.\nLet me be full, let me be empty,\nlet me have all things, let me have nothing.\nI freely and wholeheartedly yield all things\nto your pleasure and disposal."
    }
}