{
    "title": "Journey of Faith",
    "date": "2009-07-05",
    "blurb": "Kevin reflects on the significance of Baptism as more than a family event, emphasizing its importance to the parish community. He draws from anecdotes and scripture to illustrate the Christian life as a journey of response to God's love, marked by both successes and failures. The sermon encourages us to embrace our roles as disciples, carrying the love and presence of Christ into the world, reassured by His constant presence.",
    "raw_text": "For the first two years of my ministry I worked alongside a wonderful priest and pastor of the Church of Ireland, the late Canon Cecil Wilson. He was a fund of anecdotes, rooted in his own experiences of life and ministry in the Parishes he served in rural Ireland as well as the city. One of his many stories came to mind as I was reflecting on this morning's service. In the course of this month we are going to have a number of Baptisms and I just want to think a bit about what we are doing in Baptism.\n\nThis is where Cecil Wilson's particular anecdote came to my mind. He was recalling his time in the Parish of Templeharry. The Bishop was visiting one Sunday and in the Vestry expressed some disappointment that there has been no marriages in the Parish for a number of years. The Sexton grabbed Cecil's sleeve and said in a stage whisper; 'Mr Wilson, Mr Wilson, tell him about all the Baptisms!'\n\nThe Baptisms that had happened were clearly events worthy of as much mention to a Bishop as the weddings that hadn't.\n\nThat little anecdote reminds me that a Baptism is much more than a family event – though of course there will be celebrations in the Dummer family home as friends and family join with Mum and Dad to share this wonderful day, the baptism of their son Ruari. It is an event of significance for the whole Parish. So, while in times past Baptisms were celebrated privately with just family and invited guests in attendance, we have in recent times reverted to the practice of Cranmer himself in setting the service in the context of public worship.\n\nIt is an occasion for us as a Parish community to encourage the families with our presence and our prayers. An occasion also, as we hear the promises being made, to reflect on our own ongoing response to the promises of our own Baptism and Confirmation.\n\nThe pastoral introduction to the Service of Baptism in the Book of Common Prayer begins: 'Baptism marks the beginning of a journey, which continues for the rest of our lives, our first step in our response to God's love.'\n\nOur Christian life is indeed a journey of response to God's love. It is a journey of a lifetime and the questions that are asked are questions asked of people on a journey, not of people who have arrived, not of people who have got it all sorted.\n\nIt is with this idea of our Baptism as the beginning of a journey at the back of our minds, that I want to go on and reflect on the Old Testament and Gospel passage set for today, along with the Collect of this 4th Sunday after Trinity.\n\nIn the Old Testament passage, the leaders of the nation have come to David to ask him to assume the mantle of Kingship, following the death of Saul. This is the beginning of a long reign, something of a golden age for the people of Israel. It was to be a reign marked by successes and failures; times of great faithfulness, times of abject weakness and failure. But all lived out in response to the call that God had placed upon him.\n\nOur Gospel reading tells of Jesus sending out his disciples in pairs. And so at the very beginning of their discipleship (certainly not benefitting from any programme of training), they embark upon a journey of witness and service. Sometimes they will get it right, sometimes they will get it wrong; sometimes they will understand what Jesus is about; sometimes it will be clear they have lost the plot.\n\nSo whatever the fallible frailty of humanity; be it that of David or that of the disciples, God works in and through people. But by the same token, while God does work in and through people his purposes are not ultimately frustrated by the weaknesses and failings, the idiosyncrasies of men and women like you and me. God works in and through us, sometimes despite us in the advancement of his Kingdom.\n\nSo today and on other occasions over these next few weeks we will be welcoming in baptism new companions on the journey of faith.\n\nMatthew tells us of the final commission of the Risen Christ to his disciples, 'Go into all the world ....' And with that commission is the promise, 'I am with you always ....'.\n\nIn Baptism and in Confirmation we follow in the steps of those first disciples as we hear and respond to that great commission, 'Go into all the world ...' - into the shops and schools, into the homes and streets where we live, into our places of work and recreation – Go in the name of Christ, bearing something of the love and the presence of Christ. And with it comes that same promise, to us and to the children we Baptise; 'I am with you always – to the very end of time.' He is with us, always, everywhere. He is with us in our successes and our failures; with us when we get it right, strengthening and affirming. He is with us when we get it wrong, speaking to our hearts and minds words of words of correction and challenge, words of forgiveness and encouragement. He is with us leading us further on into a deeper understanding of God's love for us and his purpose in our lives.\n\nAnd so with confidence we can pray the Collect of this 4th Sunday after Trinity:\n\nO God, the protector of all who trust in you,\nwithout whom nothing is strong, nothing is holy:\nIncrease and multiply upon us your mercy;\nthat with you as our ruler and guide,\nwe may so pass through things temporal\nthat we finally lose not the things eternal:\nGrant this, heavenly Father,\nfor Jesus Christ's sake, our Lord.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Proper 9 - 2009.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 9 – 2009 – year B – Trinity 4\nFor the first two years of my ministry I worked alongside a wonderful priest and pastor of\nthe Church of Ireland, the late Canon Cecil Wilson. He was a fund of anecdotes, rooted in\nhis own experiences of life and ministry in the Parishes he served in rural Ireland as well\nas the city. One of his many stories came to mind as I was reflecting on this morning’s\nservice. In the course of this month we are going to have a number of Baptisms and I just\nwant to think a bit about what we are doing in Baptism.\nThis is where Cecil Wilson’s particular anecdote came to my mind. He was recalling his\ntime in the Parish of Templeharry. The Bishop was visiting one Sunday and in the Vestry\nexpressed some disappointment that there has been no marriages in the Parish for a\nnumber of years. The Sexton grabbed Cecil’s sleeve and said in a stage whisper; ‘Mr\nWilson, Mr Wilson, tell him about all the Baptisms!’\nThe Baptisms that had happened were clearly events worthy of as much mention to a\nBishop as the weddings that hadn’t.\nThat little anecdote reminds me that a Baptism is much more than a family event – though\nof course there will be celebrations in the Dummer family home as friends and family join\nwith Mum and Dad to share this wonderful day, the baptism of their son Ruari. It is an\nevent of significance for the whole Parish. So, while in times past Baptisms were\ncelebrated privately with just family and invited guests in attendance, we have in recent\ntimes reverted to the practice of Cranmer himself in setting the service in the context of\npublic worship.\nIt is an occasion for us as a Parish community to encourage the families with our presence\nand our prayers. An occasion also, as we hear the promises being made, to reflect on our\nown ongoing response to the promises of our own Baptism and Confirmation.\nPage 2 of 3\nProper 9 – 2009 – year B – Trinity 4\nThe pastoral introduction to the Service of Baptism in the Book of Common Prayer\nbegins: ‘Baptism marks the beginning of a journey, which continues for the rest of our\nlives, our first step in our response to God’s love.’\nOur Christian life is indeed a journey of response to God’s love. It is a journey of a\nlifetime and the questions that are asked are questions asked of people on a journey, not of\npeople who have arrived, not of people who have got it all sorted.\nIt is with this idea of our Baptism as the beginning of a journey at the back of our minds,\nthat I want to go on and reflect on the Old Testament and Gospel passage set for today,\nalong with the Collect of this 4th Sunday after Trinity.\nIn the Old Testament passage, the leaders of the nation have come to David to ask him to\nassume the mantle of Kingship, following the death of Saul. This is the beginning of a\nlong reign, something of a golden age for the people of Israel. It was to be a reign marked\nby successes and failures; times of great faithfulness, times of abject weakness and\nfailure. But all lived out in response to the call that God had placed upon him.\nOur Gospel reading tells of Jesus sending out his disciples in pairs. And so at the very\nbeginning of their discipleship (certainly not benefitting from any programme of training),\nthey embark upon a journey of witness and service. Sometimes they will get it right,\nsometimes they will get it wrong; sometimes they will understand what Jesus is about;\nsometimes it will be clear they have lost the plot.\nSo whatever the fallible frailty of humanity; be it that of David or that of the disciples,\nGod works in and through people. But by the same token, while God does work in and\nthrough people his purposes are not ultimately frustrated by the weaknesses and failings,\nthe idiosyncrasies of men and women like you and me. God works in and through us,\nsometimes despite us in the advancement of his Kingdom.\nPage 3 of 3\nProper 9 – 2009 – year B – Trinity 4\nSo today and on other occasions over these next few weeks we will be welcoming in\nbaptism new companions on the journey of faith.\nMatthew tells us of the final commission of the Risen Christ to his disciples, ‘Go into all\nthe world …….’ And with that commission is the promise, ‘I am with you always ….’.\nIn Baptism and in Confirmation we follow in the steps of those first disciples as we hear\nand respond to that great commission, ‘Go into all the world …’ - into the shops and\nschools, into the homes and streets where we live, into our places of work and recreation –\nGo in the name of Christ, bearing something of the love and the presence of Christ. And\nwith it comes that same promise, to us and to the children we Baptise; ‘I am with you\nalways – to the very end of time.’ He is with us, always, everywhere. He is with us in our\nsuccesses and our failures; with us when we get it right, strengthening and affirming. He\nis with us when we get it wrong, speaking to our hearts and minds words of words of\ncorrection and challenge, words of forgiveness and encouragement. He is with us leading\nus further on into a deeper understanding of God’s love for us and his purpose in our lives.\nAnd so with confidence we can pray the Collect of this 4th Sunday after Trinity:\nO God, the protector of all who trust in you,\nwithout whom nothing is strong, nothing is holy:\nIncrease and multiply upon us your mercy;\nthat with you as our ruler and guide,\nwe may so pass through things temporal\nthat we finally lose not the things eternal:\nGrant this, heavenly Father,\nfor Jesus Christ’s sake, our Lord."
    }
}