{
    "title": "Embracing Openness in Faith",
    "date": "2021-06-06",
    "blurb": "Kevin discusses the joy and significance of baptism, using the occasion to explore the theme of radical openness in faith. He reflects on Jesus' teaching that receiving the kingdom of God requires a child-like trust and openness. Kevin shares a personal anecdote from his own journey of faith, highlighting the impact of a welcoming church community on spiritual growth and evangelism.",
    "raw_text": "PROPER 5 – 2021 – Year B – Trinity 1\n\nBaptism – Using Mark 10:13-16 instead of Gospel appointed\n\nThis morning in St Mary’s we are celebrating a Baptism as we welcome baby Zola into the fellowship of the Church. Baptism is an occasion of joy on a number of levels. There is the joy of the parents as they come to celebrate the birth of their new child.\n\nThis is an occasion for us as a Parish as in the context of our morning service, we welcome her into the family of the Church. I often say that Baptism is a sign of future, of hope in the life of a Parish. The sound of a child in a church is the sound of a Church with a future. On occasions we may find it distracting, but I’ve known of many Churches over the years that would love to have that problem.\n\nA Baptism is also a celebration of God’s grace. It is a recognition that my Christian life begins not with anything I can offer, but in what God has already done for me in Christ – to which I can only respond.\n\nThis morning we read that portion from St Mark’s Gospel that speaks of Jesus’ unconditional welcome, a welcome that we in our turn are called to extend in his name.\n\n> The context of the story is well known. A crowd has gathered around Jesus. Parents had turned up with their children; the children were possibly making a bit of a noise. You sense that there is a bit of frustration on the part of some of the gathering. 'Could you keep them quiet. We want to hear what he is saying?'\n\nJesus, as he talks, is aware of what is going on. He rebukes the disciples who are edging the children away, saying:\n\n> Truly I tell you, whoever does not receive the kingdom of God as a little child will never enter it.\n\nJesus is not talking here of a 'childish faith', rather a 'child-like faith', one that is characterised by trust, by openness. As I thought over that, my mind moved to the conclusion, that what we are being called to is a radical open-ness, an open-ness to God and an open-ness to one another.\n\nI’ve previously spoken of my first tentative steps as a teenager into my local Parish Church of St Lawrence in Birmingham as a complete outsider, with little knowledge of the Christian faith and scant experience of Christian worship - and certainly not the high Church tradition that I found there. I recall finding myself in a pew with a prayer book and hymn book that may as well have been written in Chinese, next to a delightful old couple. Seeing that I was lost, the wife passed me her Prayer Book, opened at the right page and took mine. We exchanged books over the course of the service as I got lost at different points. At the end of the service, we exchanged a few words and she then said she looked forward to seeing me in the same pew next week. I went home with a deep feeling of having been accepted. That openness to me as a person, encouraged an openness in me to the teachings and traditions of Parish Church. I have often said that Mr & Mrs Bennett probably never realised the impact their openness to me had on me. That was evangelism (they wouldn’t have used that word), an evangelism that has me where I am today.\n\nI was delighted when Ronan and Adele came to ask for Baptism of Zola in the context of one of our first main morning services after the lifting of lockdown. The extended lockdowns we have endured have presented huge challenges but also opportunities. People who have not engaged with us in the past, have engaged with us in different ways on our social media platforms and we must reflect on the opportunities that we are presented with. I go back to this radical open-ness to God and to one another that I have been talking about. It is about a lot more than just the style of worship or churchmanship, it is about a spirit of welcome that is part of the very fabric of the place. I have been to lively services and felt frozen out; I have been to very traditional services, such as my home Parish, and felt welcome and included.\n\nTo go back to our Gospel reading, there were those who were so focussed on listening to Jesus and yet were not open to those who were also there to listen to Jesus and put up barriers of impatience. He who broke down the barrier between God and man in his own person is impatient of barriers that we may try to set up in his name. Later on in this service we will all say to Zola:\n\n> We therefore receive and welcome you as a member with us of the body of Christ, as a child of the one heavenly Father, and as an inheritor of the kingdom of God.\n\nHow we follow through on these words will have a bearing not only on the spiritual development of this child but also on the future health and wellbeing of this place.\n\nI often think back on that first Sunday I stepped into St Lawrence’s and the openness of that lovely couple, that in turn encouraged an openness on my part to what that Parish had to offer in terms of simple witness to the faith.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper52021.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 5 – 2021 – Year B – Trinity 1\nBaptism – Using Mark 10:13-16 instead of Gospel appointed\nThis morning in St Mary’s we are celebrating a Baptism as we welcome baby\nZola into the fellowship of the Church. Baptism is an occasion of joy on a\nnumber of levels. There is the joy of the parents as they come to celebrate the\nbirth of their new child.\nThis is an occasion for us as a Parish as in the context of our morning service,\nwe welcome her into the family of the Church. I often say that Baptism is a\nsign of future, of hope in the life of a Parish. The sound of a child in a church\nis the sound of a Church with a future. On occasions we may find it\ndistracting, but I’ve known of many Churches over the years that would love to\nhave that problem.\nA Baptism is also a celebration of God’s grace. It is a recognition that my\nChristian life begins not with anything I can offer, but in what God has already\ndone for me in Christ – to which I can only respond.\nThis morning we read that portion from St Mark’s Gospel that speaks of Jesus’\nunconditional welcome, a welcome that we in our turn are called to extend in\nhis name.\nThe context of the story is well known. A crowd has gathered around Jesus.\nParents had turned up with their children; the children were possibly making a\nbit of a noise. You sense that there is a bit of frustration on the part of some of\nthe gathering. ‘Could you keep them quiet. We want to hear what he is\nsaying?’\nPage 2 of 4\nPROPER 5 – 2021 – Year B – Trinity 1\nBaptism – Using Mark 10:13-16 instead of Gospel appointed\nJesus, as he talks, is aware of what is going on. He rebukes the disciples who\nare edging the children away, saying:\nTruly I tell you, whoever does not receive the kingdom of God as a\nlittle child will never enter it.\nJesus is not talking here of a ‘childish faith’, rather a ‘child-like faith’, one that\nis characterised by trust, by openness. As I thought over that, my mind moved\nto the conclusion, that what we are being called to is a radical open-ness, an\nopen-ness to God and an open-ness to one another.\nI’ve previously spoken of my first tentative steps as a teenager into my local\nParish Church of St Lawrence in Birmingham as a complete outsider, with\nlittle knowledge of the Christian faith and scant experience of Christian\nworship - and certainly not the high Church tradition that I found there. I recall\nfinding myself in a pew with a prayer book and hymn book that may as well\nhave been written in Chinese, next to a delightful old couple. Seeing that I was\nlost, the wife passed me her Prayer Book, opened at the right page and took\nmine. We exchanged books over the course of the service as I got lost at\ndifferent points. At the end of the service, we exchanged a few words and she\nthen said she looked forward to seeing me in the same pew next week. I went\nhome with a deep feeling of having been accepted. That openness to me as a\nperson, encouraged an openness in me to the teachings and traditions of Parish\nChurch. I have often said that Mr & Mrs Bennett probably never realised the\nimpact their openness to me had on me. That was evangelism (they wouldn’t\nhave used that word), an evangelism that has me where I am today.\nPage 3 of 4\nPROPER 5 – 2021 – Year B – Trinity 1\nBaptism – Using Mark 10:13-16 instead of Gospel appointed\nI was delighted when Ronan and Adele came to ask for Baptism of Zola in the\ncontext of one of our first main morning services after the lifting of lockdown.\nThe extended lockdowns we have endured have presented huge challenges but\nalso opportunities. People who have not engaged with us in the past, have\nengaged with us in different ways on our social media platforms and we must\nreflect on the opportunities that we are presented with. I go back to this radical\nopen-ness to God and to one another that I have been talking about. It is about\na lot more than just the style of worship or churchmanship, it is about a spirit of\nwelcome that is part of the very fabric of the place. I have been to lively\nservices and felt frozen out; I have been to very traditional services, such as\nmy home Parish, and felt welcome and included.\nTo go back to our Gospel reading, there were those who were so focussed on\nlistening to Jesus and yet were not open to those who were also there to listen\nto Jesus and put up barriers of impatience. He who broke down the barrier\nbetween God and man in his own person is impatient of barriers that we may\ntry to set up in his name. Later on in this service we will all say to Zola:\nWe therefore receive and welcome you\nas a member with us of the body of Christ,\nas a child of the one heavenly Father,\nand as an inheritor of the kingdom of God.\nHow we follow through on these words will have a bearing not only on the\nspiritual development of this child but also on the future health and wellbeing\nof this place.\nPage 4 of 4\nPROPER 5 – 2021 – Year B – Trinity 1\nBaptism – Using Mark 10:13-16 instead of Gospel appointed\nI often think back on that first Sunday I stepped into St Lawrence’s and the\nopenness of that lovely couple, that in turn encouraged an openness on my part\nto what that Parish had to offer in terms of simple witness to the faith."
    }
}