{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper142018.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 14 – Year B – 2018 – Trinity 11\nOver these last few weeks we have been reading of the story of David, from his\nanointment as King by Samuel as the youngest of his family, to his rise to\npower as King over all Israel, the establishment of Jerusalem as his capital. It\nhas been a very human story as we have witnessed the highs and the lows; the\nstrengths and the weaknesses, the faithfulness and the failures of this unique\nfigure; the founder of what was intended to be an eternal dynasty.\nIn the figure of David we have seen played out all the temptations of human\npower. It has been well said that ‘all power corrupts, and absolute power\ncorrupts absolutely’. We saw that in his seduction of Bathsheba, in his almost\ncasual disposal of her husband, Uriah the Hittite, to certain death on the\nbattlefield. We saw last week a man who faced up to what he had done when\nconfronted by the prophet Nathan.\nToday in excerpts from 2nd Samuel we have seen the outworking within\nDavid’s family of the violent tensions Nathan spoke about: as sons of various\nwives position themselves to seize the throne when the old man dies. His son\nAbsalom has decided to strike first and has driven his father out of Jerusalem.\nIn the course of a vicious battle, against all the wishes of David, Absalom is\nkilled. Our passage closes with a picture of raw pain as David grieves the\ndeath of his son.\nI want to stay with that raw pain of loss. David at that point is inconsolable,\nthere is no mention of God – he doesn’t seem to be there. As he stands\nweeping on his balcony, in his status as king, in all his military power, he was\npowerless to protect his son. He is inconsolable.\nPage 2 of 4\nPROPER 14 – Year B – 2018 – Trinity 11\nOver these last couple of weeks we have also seen the place of the Psalms in\nour worship, as aids to reflection, to developing thinking on themes raised in\nour Old Testament Lessons.\nOur Psalm this morning, Psalm 130, almost begins where David leaves off:\n1 Out of the depths have I cried to you, O Lord;\nLord, hear my voice; ♦\nlet your ears consider well the voice of my supplication.\nThis is where I find myself connecting. Many of you have known times of\ndarkness, of sadness, when the world just seems to collapse around you. And\nyou feel very alone. We find ourselves crying out into the darkness, wondering\nis anyone listening, is anyone caring. In friends, in perfect strangers, in their\nwords or simple acts of kindness, or simply their presence, we find that we are\nnot alone. Looking back over life, that is how I have experienced the presence,\nthe love of God.\nThis set me thinking of what we are called to be as Church, as a community.\nWe are to be a community within which we can find light and hope in the\nmidst of darkness and despair. But it is not to be an inward looking\ncommunity, it is to be a community that is to be a sign of light and hope to the\nworld at large.\nOur Psalm continues:\n3 But there is forgiveness with you, ♦\nso that you shall be feared.\nPage 3 of 4\nPROPER 14 – Year B – 2018 – Trinity 11\n4 I wait for the Lord; my soul waits for him; ♦\nin his word is my hope.\nWithin the community of faith, we come to understand the meaning of\nforgiveness, we come to understand the importance of forgiveness. This\ncommunity of faith is called to be a community of forgiveness, a community of\nhealing and reconciliation; a community that models healing and reconciliation\nin a broken and hurting world.\nI find myself turning, as I often do, to the Prayer of St Francis:\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen\nWe don’t always get it right. It is sometimes hard to let go of the hurts, it is\nsometimes hard to see the light in the darkness. That is where the community\nof faith is so important as we support and understand one another.\nIt is also important to keep our eyes on the world outside our doors. And so\nover the next few months I am going to be inviting a number of speakers to our\nFamily Communion Services who will speak of the work of the Church out\nPage 4 of 4\nPROPER 14 – Year B – 2018 – Trinity 11\nthere beyond our doors, beyond our Parish boundaries. We will be hearing\nfrom a representative of Tear Fund. Bishops Appeal is currently supporting\none of their projects working with Syrian Refugees in the Lebanon. We will\nalso hear a representative of ‘Release’ a charity working with ex-prisoners as\nwell as from Scott Evans, the Church of Ireland Chaplain in UCD.\nAs we have followed the story of the very human figure of David, in all his\nstrengths and weaknesses, I have been strangely affirmed that God can and\ndoes work in and through, and even despite, our imperfections as individuals,\nas a community, as a Church.\nWe can but offer …\nour souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory."
    },
    "base": "{\n  \"title\": \"The Human Story of David\",\n  \"date\": \"2018-08-12\",\n  \"blurb\": \"Kevin reflects on the biblical story of King David, emphasizing the human aspects of his journey, including his highs and lows, strengths and weaknesses. The sermon explores themes of power, corruption, loss, and forgiveness, drawing connections to the Psalms and the role of the Church as a community of healing and reconciliation. It concludes with a call to be instruments of peace and to engage with the world beyond the church's doors.\",\n  \"raw_text\": \"## PROPER 14 – Year B – 2018 – Trinity 11\\n\\nOver these last few weeks we have been reading of the story of David, from his anointment as King by Samuel as the youngest of his family, to his rise to power as King over all Israel, the establishment of Jerusalem as his capital. It has been a very human story as we have witnessed the highs and the lows; the strengths and the weaknesses, the faithfulness and the failures of this unique figure; the founder of what was intended to be an eternal dynasty.\\n\\nIn the figure of David we have seen played out all the temptations of human power. It has been well said that 'all power corrupts, and absolute power corrupts absolutely'. We saw that in his seduction of Bathsheba, in his almost casual disposal of her husband, Uriah the Hittite, to certain death on the battlefield. We saw last week a man who faced up to what he had done when confronted by the prophet Nathan.\\n\\nToday in excerpts from 2nd Samuel we have seen the outworking within David’s family of the violent tensions Nathan spoke about: as sons of various wives position themselves to seize the throne when the old man dies. His son Absalom has decided to strike first and has driven his father out of Jerusalem. In the course of a vicious battle, against all the wishes of David, Absalom is killed. Our passage closes with a picture of raw pain as David grieves the death of his son.\\n\\nI want to stay with that raw pain of loss. David at that point is inconsolable, there is no mention of God – he doesn’t seem to be there. As he stands weeping on his balcony, in his status as king, in all his military power, he was powerless to protect his son. He is inconsolable.\\n\\nOver these last couple of weeks we have also seen the place of the Psalms in our worship, as aids to reflection, to developing thinking on themes raised in our Old Testament Lessons.\\n\\nOur Psalm this morning, Psalm 130, almost begins where David leaves off:\\n\\n> Out of the depths have I cried to you, O Lord;\\n> Lord, hear my voice;\\n> let your ears consider well the voice of my supplication.\\n\\nThis is where I find myself connecting. Many of you have known times of darkness, of sadness, when the world just seems to collapse around you. And you feel very alone. We find ourselves crying out into the darkness, wondering is anyone listening, is anyone caring. In friends, in perfect strangers, in their words or simple acts of kindness, or simply their presence, we find that we are not alone. Looking back over life, that is how I have experienced the presence, the love of God.\\n\\nThis set me thinking of what we are called to be as Church, as a community. We are to be a community within which we can find light and hope in the midst of darkness and despair. But it is not to be an inward looking community, it is to be a community that is to be a sign of light and hope to the world at large.\\n\\nOur Psalm continues:\\n\\n> But there is forgiveness with you,\\n> so that you shall be feared.\\n\\nWithin the community of faith, we come to understand the meaning of forgiveness, we come to understand the importance of forgiveness. This community of faith is called to be a community of forgiveness, a community of healing and reconciliation; a community that models healing and reconciliation in a broken and hurting world.\\n\\nI find myself turning, as I often do, to the Prayer of St Francis:\\n\\n> Lord, make me an instrument of your peace.\\n> Where there is hatred, let me sow love;\\n> where there is injury, pardon;\\n> where there is doubt, faith;\\n> where"
}