{
    "title": "Balance in Life",
    "date": "2013-07-21",
    "blurb": "This sermon, delivered on the 8th Sunday of Trinity in 2013, discusses the importance of balance in life, using the biblical story of Martha and Mary. The speaker emphasizes the need for both action and contemplation, warning against letting the urgent crowd out the important. The sermon also touches on the concept of Sabbath and its relevance in finding space in our busy lives.",
    "raw_text": "Looking back over the years from my childhood on there have been houses I have loved to go to visit, my grandparents, houses of friends and, after Rachel and I were married, the house of her Auntie 'E'. It was a house of welcome, a cheery welcome whenever I arrived at the door – I soon came to expect the very best of homemade bread, cakes, Ulster fries, Uncle Hugh sitting by the fire with his dry understated humour. 'E' was a bundle of energy, on the go from the moment we arrived until we left making sure your tea cup was always full and your plate never empty. She was, certainly in my book, my favourite among all of Rachel’s aunts and uncles. But sometimes as we drove away we would wish that 'E' would have just sat down and chatted.\n\nAuntie 'E' came to my mind as I read over our Gospel reading for today. 'E' was certainly one of the Martha’s of this world – they both demonstrated a generosity of spirit in the welcome they gave to anyone coming into their home. But as we read the text of the Gospel closely, we begin to detect an irritation and an impatience in poor Martha as she rushes around the place getting everything ready while Mary just sits around listening to Jesus.\n\nI also sense a gentleness in Jesus’ gentle rebuke of Martha. 'Martha, Martha, you are worried and distracted by many things …' The word in the original text that we have translated as 'distracted' speaks of distraction to the point of agitation and distress. Martha is so taken up with the busyness of entertaining her guest, she cannot enjoy the presence of her guest. Then as my thoughts continued, two things came to my mind. One was a remark by John Paul 2 in the course of his visit to Ireland as he spoke to students in Maynooth. Incidentally it was my Presbyterian father in law who spotted this one in his Manse in Seskinore. 'Do not be so busy in the work of the Lord that you forget the Lord of the work.' The other would be a comment we might make of someone that 'they are so heavenly minded that they are of no earthly use.'\n\nIt is very easy as we read this passage to see things in black and white – but in truth the world, the Church needs the both the Martha’s and the Mary’s. Over the years I have seen the truth of this in so many aspects of Church life. The Select Vestries that work best are those with a range of age and temperaments. We need the activists who will say, 'Let’s get this done!' but we will also need those who will say, 'Hang on a minute, let’s not rush into this.' As we each learn to listen and learn from each other, so the quality of decisions is enhanced.\n\nThe Gospel passage also serves as a reminder of not letting the urgent crowd out the important in life. I would take as an example the way the telephone can intrude into life. How often have we found ourselves in a conversation with someone, or reading or working on something – and the phone rings. That phone ring is basically saying, 'Put whatever you are doing, whoever you are talking to on hold – and attend to me NOW.' The urgency of the telephone ringing crowds out the importance of whatever we may be doing.\n\nThis is very much to the point as we seek to find a balance in the many pressures that impinge upon us in life. There is the work life/balance. The work place is demanding and becoming increasingly so. The advent of smartphones and tablets and with it constant access to emails means that we are more and more accessible to work colleagues and employers all hours of the day.\n\nThere was a rather telling survey a few months back showing a significant number of people checked their business emails at the weekend and on their holidays, a significant proportion admitting to checking them while their partner was asleep beside them.\n\nEmployers have a proper demand on our time but we do need to establish boundaries so that we can honour other responsibilities to ourselves and to our loved ones. As someone said' no-one says at the end of their lives, 'I wish I had spent more time with my family.'\n\nThis is where the Jewish concept of Sabbath has a timeless relevance that I would want to distinguish from the rather sterile observance that became a feature of church life – a day when swings were tied up in playgrounds. I have always liked the definition in the old Shorter Catechism of the Presbyterian Church in which it is described as a day of rest and gladness. Sabbath is a day of finding space in busy lives:\n\nRemember that thou keep holy the Sabbath day. Six days shalt thou labour, and do all that thou hast to do; but the seventh day is the Sabbath of the Lord thy God. In it thou shalt do no manner of work, thou, and thy son, and thy daughter, thy man-servant, and thy maid-servant, thy cattle, and the stranger that is within thy gates. For in six days the Lord made heaven and earth, the sea, and all that in them is, and rested the seventh day: wherefore the Lord blessed the seventh day, and hallowed it.\n\nSabbath is a day of finding balance the urgent and the important. It is a time to step back from activity, from busyness and in the space find God, find one another, find myself.\n\nChrist comes to us in the frantic activity of our busyness and says to us as he said to Martha:\n\n'…….., you are worried and distracted by many things; 42there is need of only one thing. Mary has chosen the better part, which will not be taken away from her.'",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper112013.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 11 – 2013 – Year C – Trinity 8\nLooking back over the years from my child hood on there have been houses I\nhave loved to go to visit, my grandparents, houses of friends and, after Rachel\nand I were married, the house of her Auntie ‘E’. It was a house of welcome, a\ncheery welcome whenever I arrived at the door – I soon came to expect the\nvery best of home made bread, cakes, Ulster fries, Uncle Hugh sitting by the\nfire with his dry understated humour. ‘E’ was a bundle of energy, on the go\nfrom the moment we arrived until we left making sure your tea cup was always\nfull and your plate never empty. She was, certainly in my book, my favourite\namong all of Rachel’s aunts and uncles. But sometimes as we drove away we\nwould wish that ‘E’ would have just sat down and chatted.\nAuntie ‘E’ came to my mind as I read over our Gospel reading for today. ‘E’\nwas certainly one of the Martha’s of this world – they both demonstrated a\ngenerosity of spirit in the welcome they gave to anyone coming into their\nhome. But as we read the text of the Gospel closely, we begin to detect an\nirritation and an impatience in poor Martha as she rushes around the place\ngetting everything ready while Mary just sits around listening to Jesus.\nI also sense a gentleness in Jesus’ gentle rebuke of Martha. ‘Martha, Martha,\nyou are worried and distracted by many things …..’ The word in the original\ntext that we have translated as ‘distracted’ speaks of distraction to the point of\nagitation and distress. Martha is so taken up with the busy-ness of entertaining\nher guest, she cannot enjoy the presence of her guest. Then as my thoughts\ncontinued, two things came to my mind. One was a remark by John Paul 2 in\nthe course of his visit to Ireland as he spoke to students in Maynooth.\nIncidentally it was my Presbyterian father in law who spotted this one in his\nManse in Seskinore. ‘Do not be so busy in the work of the Lord that you forget\nthe Lord of the work.’ The other would be a comment we might make of\nsomeone that ‘they are so heavenly minded that they are of no earthly use.’\nPage 2 of 3\nPROPER 11 – 2013 – Year C – Trinity 8\nIt is very easy as we read this passage to see things in black and white – but in\ntruth the world, the Church needs the both the Martha’s and the Mary’s. Over\nthe years I have seen the truth of this in so many aspects of Church life. The\nSelect Vestries that work best are those with a range of age and temperaments.\nWe need the activists who will say, ‘Let’s get this done!’ but we will also need\nthose who will say, ‘Hang on a minute, let’s not rush into this.’ As we each\nlearn to listen and learn from each other, so the quality of decisions is\nenhanced.\nThe Gospel passage also serves as a reminder of not letting the urgent crowd\nout the important in life. I would take as an example the way the telephone can\nintrude into life. How often have we found ourselves in a conversation with\nsomeone, or reading or working on something – and the phone rings. That\nphone ring is basically saying, ‘Put whatever you are doing, whoever you are\ntalking to on hold – and attend to me NOW.’. The urgency of the telephone\nringing crowds out the importance of whatever we may be doing.\nThis is very much to the point as we seek to find a balance in the many\npressures that impinge upon us in life. There is the work life/balance. The\nwork place is demanding and becoming increasingly so. The advent of smart\nphones and tablets and with it constant access to emails means that we are\nmore and more accessible to work colleagues and employers all hours of the\nday.\nThere was a rather telling survey a few months back showing a significant\nnumber of people checked their business emails at the weekend and on their\nholidays, a significant proportion admitting to checking them while their\npartner was asleep beside them.\nPage 3 of 3\nPROPER 11 – 2013 – Year C – Trinity 8\nEmployers have a proper demand on our time but we do need to establish\nboundaries so that we can honour other responsibilities to ourselves and to our\nloved ones. As someone said’ no-one says at the end of their lives, ‘I wish I\nhad spent more time with my family.’\nThis is where the Jewish concept of Sabbath has a timeless relevance that I\nwould want to distinguish from the rather sterile observance that became a\nfeature of church life – a day when swings were tied up in playgrounds. I have\nalways liked the definition in the old Shorter Catechism of the Presbyterian\nChurch in which it is described as a day of rest and gladness. Sabbath is a day\nof finding space in busy lives:\nRemember that thou keep holy the Sabbath day. Six days shalt thou labour, and do all\nthat thou hast to do; but the seventh day is the Sabbath of the Lord thy God. In it thou\nshalt do no manner of work, thou, and thy son, and thy daughter, thy man-servant,\nand thy maid-servant, thy cattle, and the stranger that is within thy gates. For in six\ndays the Lord made heaven and earth, the sea, and all that in them is, and rested the\nseventh day: wherefore the Lord blessed the seventh day, and hallowed it.\nSabbath is a day of finding balance the urgent and the important. It is a time to\nstep back from activity, from busyness and in the space find God, find one\nanother, find myself.\nChrist comes to us in the frantic activity of our busyness and says to us as he\nsaid to Martha:\n‘………, you are worried and distracted by many things; 42there is need of only one\nthing. Mary has chosen the better part, which will not be taken away from her.’"
    }
}