{
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper212013.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 21 – 2013 – Year C – Trinity 18\nLast week I reflected on the place of the Collect of the Day in our order of\nworship and focussed on the Collect of last Sunday, based on the words of\nAugustine:\nAlmighty God,\nyou have made us for yourself,\nand our hearts are restless till they find their rest in you:\nTeach us to offer ourselves to your service,\nthat here we may have your peace,\nand in the world to come may see you face to face;\nthrough Jesus Christ our Lord.\nToday I just want to reflect on another part of our weekly worship, the Psalms.\nEach Sunday the Lectionary specifies 3 Bible readings and a Psalm.\nSometimes people will ask me, ‘Do we have to have a Psalm?’ Those of you\nbrought up on the old Prayer Book will recall that in the old communion\nservice there was indeed no psalm, it was just used in Morning and Evening\nPrayer. I suppose the Psalms, and our use of the Psalms, sometimes gets a bad\npress. I recall a scene in one of the ‘Monty Python’ films, ‘the Search for the\nHoly Grail’. In a rather zany encounter between the Knights of the Round\nTable and God, the subject of the Psalms came up and God complains, ‘Oh the\nPsalms – they go on and on and on.’.\nWhy are the Psalms so important? They are of course an integral part of the\nBible. They date back to the Jerusalem Temple and have a central place in\nJewish piety. The more I reflect on them, the more I have come to appreciate\ntheir breadth in content and in style. There are passages that speak of\nunbridled joy and the psalmist encourages us to praise God with everything\nthat is available, harps, drums, cymbals, tambourines, trumpets. There are\npsalms where he steps back in sheer wonder at the glory of creation – when I\nconsider the moon and the stars that you have ordained, what is man that you\nare mindful of him? There are those psalms where the psalmist comes before\nGod with his feelings of guilt and total unworthiness, such as in Psalm 51,\nwhich is traditionally associated with David’s adultery with Bathsheba and\nPage 2 of 4\nPROPER 21 – 2013 – Year C – Trinity 18\nconsigning her husband Uriah to certain death in the battlefield. In Psalm 22,\nbeginning ‘My God, My God, why have you abandoned me?’, the psalmist\ncomes before God with his feelings of being abandoned by God, but works\nthrough his pain to recognise God’s faithfulness. And then there are some\nwhere the gloom does not lift, such as Psalm 88, which I heard recently\ndescribed as a Psalm without a happy ending. But then life does not always\nhave happy endings.\nIn short, there is a wonderful honesty in the Psalms. In fact some passages are\nso honest in the pain and the anger they express that they are not considered\nsuitable for use in public worship. So instead of the Monty Python clip I want\nto offer you another image, not directly related to the Psalms but illustrative of\nthat sense of honesty before God that I have been talking about. You may\nremember the film ‘Fiddler on the Roof’. The central character is a small\nJewish farmer in late 19th century Russia. Life is hard as he tries to bring up his\nfamily, as they face persecution and are forced to move on. Running through\nthe story are a series of occasions as he argues his case with God; as he tries to\nunderstand his poverty, as he comes to grips with the fact his son does not want\nto stay on the land, his daughter wants to marry a Gentile. There is that lovely\npoint where he demands of God, ‘Would it spoil some vast eternal plan if I\nwere a wealthy man?’\nAs I read and re-read the Psalms I have this sense of engagement with God, in\nwhich hopes and hurts, regrets and confusion, praise and despair are expressed.\nI remember a lecturer saying that all too often we feel that we have to be so\npolite with God, whereas the Psalms remind us we can be totally open and\nhonest with God. You get the sense that the Psalmist is not talking into thin\nair, that he is confident that the God to whom he addresses his praise and his\npain, his hurts and his regrets is listening, not just hearing but listening. The\nGod who listens is also a God who responds.\nPage 3 of 4\nPROPER 21 – 2013 – Year C – Trinity 18\nSo it is with that sense of engagement with God, God listening, God\nresponding, that I want to reflect on our Psalm for today, a portion of Psalm 91\nin the context of prayers for wholeness and healing in the 11:00 service.\nWhen things are going smoothly, when health is good, relationships are on an\neven keel, we can take life, take God for granted. Illness, serious illness in\nourselves or a loved one can shake our confidence, can leave us vulnerable.\nWe can feel the whole range of emotions – there can be hurt and fear, feelings\nof guilt, loneliness, even anger with God or with others. Sometimes in those\nsituations God can feel close, at other times God can seem very far away.\nOver the years it is the very honesty of the psalms that has spoken to me, to my\ndoubts and my fears, my joy, my hopes, my light and my darkness. The\nopening section of the Psalm speaks into that whole gamut of emotions. It is\nan invitation to trust in all circumstances. The opening section brings together\na range of images; that of the stronghold, the castle holding out against attack;\nthe bird sheltering chicks under its wings; nothing is going to be allowed to\nultimately harm. Then towards the end the assurances become personal as the\npsalmist voices God’s concern for the one in trouble:\n14 Because they have set their love upon me,\ntherefore will | I de|liver them; @\nI will lift them up, be|cause they | know my | name.\n15 They will call upon me and | I will | answer them; @\nI am with them in trouble,\nI will de|liver them and | bring them to | honour.\nI come back to this sense of engagement. That Psalm has started with the voice\nof the worshipper and ends with the voice of God. There is a very real sense in\nwhich God works in and through the community that reaches out to him in\nprayer. When I pray, I must be prepared to be used as part of the answer to my\nprayer, in word and deed bringing something of God’s presence into the lives\nPage 4 of 4\nPROPER 21 – 2013 – Year C – Trinity 18\nof those for whom I pray. The Psalms are a reminder that we worship a God\nwho gets involved in the joys and sorrows, the hurts, the pain, the hopes and\nfears of this world – and he calls us who say and sing these psalms to do the\nsame, as we pray for the sick, the poor, the marginalised, for the peace of the\nworld.\nPrayer of Saint Francis of Assisi\nLord, make me an instrument of your peace.\nWhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not so much seek\nto be consoled as to console;\nto be understood as to understand;\nto be loved as to love.\nFor it is in giving that we receive;\nit is in pardoning that we are pardoned;\nand it is in dying that we are born to eternal life. Amen"
    },
    "base": "{\n  \"title\": \"The Psalms in Worship\",\n  \"date\": \"2013-09-29\",\n  \"blurb\": \"Kevin reflects on the significance of the Psalms in weekly worship, emphasizing their honesty and breadth. He discusses their role in expressing the full spectrum of human emotions before God, from joy to despair. The sermon encourages openness with God and illustrates how the Psalms facilitate a dialogue where God listens and responds.\",\n  \"raw_text\": \"### PROPER 21 – 2013 – Year C – Trinity 18\\n\\nLast week I reflected on the place of the Collect of the Day in our order of worship and focused on the Collect of last Sunday, based on the words of Augustine:\\n\\n> Almighty God,\\n> you have made us for yourself,\\n> and our hearts are restless till they find their rest in you:\\n> Teach us to offer ourselves to your service,\\n> that here we may have your peace,\\n> and in the world to come may see you face to face;\\n> through Jesus Christ our Lord.\\n\\nToday I just want to reflect on another part of our weekly worship, the Psalms. Each Sunday the Lectionary specifies 3 Bible readings and a Psalm. Sometimes people will ask me, 'Do we have to have a Psalm?' Those of you brought up on the old Prayer Book will recall that in the old communion service there was indeed no psalm, it was just used in Morning and Evening Prayer. I suppose the Psalms, and our use of the Psalms, sometimes gets a bad press. I recall a scene in one of the 'Monty Python' films, 'the Search for the Holy Grail'. In a rather zany encounter between the Knights of the Round Table and God, the subject of the Psalms came up and God complains, 'Oh the Psalms – they go on and on and on.'\\n\\nWhy are the Psalms so important? They are of course an integral part of the Bible. They date back to the Jerusalem Temple and have a central place in Jewish piety. The more I reflect on them, the more I have come to appreciate their breadth in content and in style. There are passages that speak of unbridled joy and the psalmist encourages us to praise God with everything that is available, harps, drums, cymbals, tambourines, trumpets. There are psalms where he steps back in sheer wonder at the glory of creation – when I consider the moon and the stars that you have ordained, what is man that you are mindful of him? There are those psalms where the psalmist comes before God with his feelings of guilt and total unworthiness, such as in Psalm 51, which is traditionally associated with David’s adultery with Bathsheba and consigning her husband Uriah to certain death in the battlefield. In Psalm 22, beginning 'My God, My God, why have you abandoned me?', the psalmist comes before God with his feelings of being abandoned by God, but works through his pain to recognize God’s faithfulness. And then there are some where the gloom does not lift, such as Psalm 88, which I heard recently described as a Psalm without a happy ending. But then life does not always have happy endings.\\n\\nIn short, there is a wonderful honesty in the Psalms. In fact some passages are so honest in the pain and the anger they express that they are not considered suitable for use in public worship. So instead of the Monty Python clip I want to offer you another image, not directly related to the Psalms but illustrative of that sense of honesty before God that I have been talking about. You may remember the film 'Fiddler on the Roof'. The central character is a small Jewish farmer in late 19th century Russia. Life is hard as he tries to bring up his family, as they face persecution and are forced to move on. Running through the story are a series of occasions as he argues his case with God; as he tries to understand his poverty, as he comes to grips with the fact his son does not want to stay on the land, his daughter wants to marry a Gentile. There is that lovely point where he demands of God, 'Would it spoil some vast eternal plan if I were a wealthy man?'\\n\\nAs I read and re-read the Psalms I have this sense of engagement with God, in which hopes and hurts, regrets and confusion, praise and despair are expressed. I remember a lecturer saying that all too often we feel that we have to be so polite with God, whereas the Psalms remind us we can be totally open and honest with God. You get the sense that the Psalmist is not talking into thin air, that he is confident that the God to whom he addresses his praise and his pain, his hurts and his regrets is listening, not just hearing but listening. The God who listens is also a God who responds.\\n\\nSo it is with that sense of engagement with God, God listening, God responding, that I want to reflect on our Psalm for today, a portion of Psalm 91 in the context of prayers for wholeness and healing in the 11:00 service. When things are going smoothly, when health is good, relationships are on an even keel, we can take life, take God for granted. Illness, serious illness in ourselves or a loved one can shake our confidence, can leave us vulnerable. We can feel the whole range of emotions – there can be hurt and fear, feelings of guilt, loneliness, even anger with God or with others. Sometimes in those situations God can feel close, at other times God can seem very far away.\\n\\nOver the years it is the very honesty of the psalms that has spoken to me, to my doubts and my fears, my joy, my hopes, my light and my darkness. The opening section of the Psalm speaks into that whole gamut of emotions. It is an invitation to trust in all circumstances. The opening section brings together a range of images; that of the stronghold, the castle holding out against attack; the bird sheltering chicks under its wings; nothing is going to be allowed to ultimately harm. Then towards the end the assurances become personal as the psalmist voices God’s concern for the one in trouble:\\n\\n> 14 Because they have set their love upon me,\\n> therefore will I deliver them;\\n> I will lift them up, because they know my name.\\n> 15 They will call upon me and I will answer them;\\n> I am with them in trouble,\\n> I will deliver them and bring them to honor.\\n\\nI come back to this sense of engagement. That Psalm has started with the voice of the worshipper and ends with the voice of God. There is a very real sense in which God works in and through the community that reaches out to him in prayer. When I pray, I must be prepared to be used as part of the answer to my prayer, in word and deed bringing something of God’s presence into the lives of those for whom I pray. The Psalms are a reminder that we worship a God who gets involved in the joys and sorrows, the hurts, the pain, the hopes and fears of this world – and he calls us who say and sing these psalms to do the same, as we pray for the sick, the poor, the marginalized, for the peace of the world.\\n\\n> Prayer of Saint Francis of Assisi\\n> Lord, make me an instrument of your peace.\\n> Where there is hatred, let me sow love;\\n> where there is injury, pardon;\\n> where there is doubt, faith;\\n> where"
}