{
    "title": "Radical Loyalty to Jesus",
    "date": "2020-06-21",
    "blurb": "Kevin's sermon explores the radical loyalty to Jesus that should inform and underline our other commitments. He discusses the challenges of living in accordance with Jesus' teachings, especially when they conflict with familial and societal expectations. The sermon emphasizes the support and companionship Jesus offers on our spiritual journey, encouraging us to approach the throne of grace with boldness.",
    "raw_text": "PROPER 7 – Year A – 2020 Trinity 2\n\nLord, you have taught us that all our doings without love are nothing worth: send your Holy Spirit and pour into our hearts that most excellent gift of love, the true bond of peace and of all virtues, without which whoever lives is counted dead before you. Grant this for your only Son Jesus Christ’s sake.\n\nGospel Matthew 10.24-39\n\nJesus summoned the twelve and sent them out with the following instruction: 'A disciple is not above the teacher, nor a slave above the master; it is enough for the disciple to be like the teacher, and the slave like the master. If they have called the master of the house Beelzebul, how much more will they malign those of his household!'\n\n> 'So have no fear of them; for nothing is covered up that will not be uncovered, and nothing secret that will not become known. What I say to you in the dark, tell in the light; and what you hear whispered, proclaim from the housetops. Do not fear those who kill the body but cannot kill the soul; rather fear him who can destroy both soul and body in hell. Are not two sparrows sold for a penny? Yet not one of them will fall to the ground unperceived by your Father. And even the hairs of your head are all counted. So do not be afraid; you are of more value than many sparrows.'\n\nEveryone therefore who acknowledges me before others, I also will acknowledge before my Father in heaven; but whoever denies me before others, I also will deny before my Father in heaven.\n\n'Do not think that I have come to bring peace to the earth; I have not come to bring peace, but a sword. For I have come to set a man against his father, and a daughter against her mother, and a daughter-in-law against her mother-in-law; and one’s foes will be members of one’s own household. Whoever loves father or mother more than me is not worthy of me; and whoever loves son or daughter more than me is not worthy of me; and whoever does not take up the cross and follow me is not worthy of me. Those who find their life will lose it, and those who lose their life for my sake will find it.'\n\nKevin reflects on the Revised Common Lectionary and its role in unifying worship across different traditions. He addresses the difficult teachings of Jesus, such as the expectation to prioritize loyalty to Him over familial ties. The sermon includes a dramatic presentation of the Lord’s Prayer, which emphasizes the practical application of Jesus' teachings in daily life and the importance of forgiveness and reliance on God’s support.\n\nThe sermon concludes with a reminder that Jesus, who asks for our loyalty, is also the companion who understands our struggles and offers mercy and grace in times of need.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper72020.txt",
        "raw_ocr_content": "Page 1 of 7\nPROPER 7 – Year A – 2020 Trinity 2\nYouTube link to order of service https://youtu.be/sGo1Y9gnxg0\nCollect of the Second Sunday after Trinity\nLord, you have taught us\nthat all our doings without love are nothing worth:\nsend your Holy Spirit\nand pour into our hearts that most excellent gift of love,\nthe true bond of peace and of all virtues,\nwithout which whoever lives is counted dead before you.\nGrant this for your only Son Jesus Christ’s sake.\nGospel Matthew 10.24-39\nJesus summoned the twelve and sent them out with the following instruction: 24‘A disciple is not above\nthe teacher, nor a slave above the master; 25it is enough for the disciple to be like the teacher, and the\nslave like the master. If they have called the master of the house Beelzebul, how much more will they\nmalign those of his household!\n26So have no fear of them; for nothing is covered up that will not be uncovered, and nothing secret that\nwill not become known. 27What I say to you in the dark, tell in the light; and what you hear whispered,\nproclaim from the housetops. 28Do not fear those who kill the body but cannot kill the soul; rather fear\nhim who can destroy both soul and body in hell. 29Are not two sparrows sold for a penny? Yet not one of\nthem will fall to the ground unperceived by your Father. 30And even the hairs of your head are all\ncounted. 31So do not be afraid; you are of more value than many sparrows.\n32Everyone therefore who acknowledges me before others, I also will acknowledge before my Father in\nheaven; 33but whoever denies me before others, I also will deny before my Father in heaven.\n34Do not think that I have come to bring peace to the earth; I have not come to bring peace, but a sword.\n35For I have come to set a man against his father,\nand a daughter against her mother,\nand a daughter-in-law against her mother-in-law;\n36and one’s foes will be members of one’s own household.\n37Whoever loves father or mother more than me is not worthy of me; and whoever loves son or daughter\nmore than me is not worthy of me; 38and whoever does not take up the cross and follow me is not worthy\nof me. 39Those who find their life will lose it, and those who lose their life for my sake will find it.’\nAt various times I have spoken of the system of readings we use in Church\neach Sunday, the Revised Common Lectionary, a system we share with\nChristians of a wide range of traditions. I have spoken of its advantages,\nemphasising a unity of worship and reflection right across barriers of language,\nof culture, of tradition.\nBut there is a downside, on some occasions I will open up the passages for a\nparticular Sunday and say inwardly to myself, ‘O Lord, I really wish you had\nPage 2 of 7\nPROPER 7 – Year A – 2020 Trinity 2\nnot said that.’ It does mean though, that the preacher has to tackle and think\nthrough passages that, left to his own devices, he would gently pass over.\nSuch a passage is our Gospel passage for today. You could almost imagine the\n1st century tabloid newspaper headline ‘Renegade preacher tells kids to defy\nparents!’ ‘O dear Lord. I wish you had n’t said that.’ But it is there. Do we\njust put our fingers over that bit and wish it wasn’t there or do we try to get a\nhandle on what this has to say to us in our own generation? First of all we have\nto recognise that different idiom, different literary styles that suit one culture\ncan jar on another. I recall in the late 60’s English papers making fun of the\nChinese people saying ‘May Chairman Mao live for 10,000 years.’ When I\nasked a Chinese friend about this he said; ‘Don’t be stupid. No-one thinks\nChairman Mao is going to live for 10, 000 years – it is just the Chinese way of\nsaying ‘Long live Chairman Mao.’’\nSo let us step back from the passage and look at it as a whole. It is about\nloyalty, a radical loyalty to Jesus that underlines and informs our other loyalties\nto family and to friends and community.\nLet’s take this a stage further. A radical loyalty to Jesus that informs and\nunderlines our other loyalties. When I begin to look at it this way Jesus\nbecomes less of an adversary who demands to be appeased rather a companion\nalong the way, a demanding companion, a companion who expects high things\nof us but a companion none the less. To help us reflect on this let us just listen\nto this presentation of the Lord’s Prayer some of you may have heard before.\nPage 3 of 7\nPROPER 7 – Year A – 2020 Trinity 2\nDrama Script – Lord’s Prayer\nA Our Father, who art in heaven:\nB Yes\nA Our Father, who art in heaven:\nB I’m listening.\nA Will you stop interrupting – I’m busy praying!\nB I know and I’m listening – don’t you expect me to listen?\nCarry on.\nA hallowed be thy name,\nB How do you propose to do that?\nA Do what?\nB hallow my name.\nA Well I’ll ….. I’ll ….. what do you think I should do?\nB Hallowing is honouring. I think the best way you can honour my name is living your life the\nway I would like to see you do it.\nA How do I know that?\nB Well we could start with the commandments; my Son’s teaching in the Sermon on the Mount gives\nPage 4 of 7\nPROPER 7 – Year A – 2020 Trinity 2\nyou a pretty fair idea of what I am talking about.\nCarry on.\nA thy kingdom come,\nthy will be done,\non earth as it is in heaven.\nB Sounds good to me – what are you going to do about it?\nA What do you mean, ‘What am I going to do about it?’\nB Well, if you are not prepared to do my will, how do you think my will is going to be done on earth?\nA Do you mean it depends on me?\nB Not just you – but lots of people like you. If enough people started going by what I desired, what I\nwanted this world could be a very different place.\nA But it’s hard on our own Lord.\nB You won’t be on your own – I am here to help, to listen to your problems.\nWhat else is on your mind?\nA Give us this day our daily bread.\nB I do that.\nA But you don’t do you?\nB What do you mean?\nA There are so many people starving in this world, living in real hardship – but you don’t seem to\nPage 5 of 7\nPROPER 7 – Year A – 2020 Trinity 2\ndo anything.\nB But I have - I have given you all a wonderful world in which to live. There is in fact plenty\nof food to go around if only people would be prepared to share instead of just looking after themselves.\nA And forgive us our trespasses\nas we forgive those who trespass against us.\nB You cannot be serious?\nA What are you talking about?\nB That argument you had with your brother?\nA He started it!\nB You had nothing to do with it?\nNot even a little bit?\nA Lord – you have no idea how annoying he can be!!! I suppose I did wind him up a bit.\nThis forgiveness business is hard Lord –\nB I know.\nA What if he just throws it back in my face?\nB We’ll face that when it comes – you’ll probably find that he is feeling just as bad about this –\nthat he would like to make a fresh start as well and feels just as awkward as you do.\nA And lead us not into temptation,\nbut deliver us from evil.\nPage 6 of 7\nPROPER 7 – Year A – 2020 Trinity 2\nB You seem quite capable of finding temptation without any help from me don’t you?\nA Lord, I really do want to do what is right – and yet it still seems so difficult. I find myself doing\nthings, saying things, even thinking things I know I shouldn’t – I feel so helpless, I feel like giving up at\ntimes.\nB Believe me, I know it is hard at times – my Son knew what it was like to be tempted. But you\ndon’t have to do this all by yourself. I promised I will be with you always – and I will. When you need\nhelp just ask and I will be there. You will make mistakes but I do understand; I do love you and I do\nforgive. So let’s just tackle this problem together.\nA Thank you Lord\nFor thine is the kingdom, the power, and the glory Amen\n****************************************\nThe writer of the Letter to the Hebrews reminds us of this fundamental truth:\n15 For we do not have a high priest who is unable to sympathize with\nour weaknesses, but we have one who in every respect has been tested\nas we are, yet without sin. 16 Let us therefore approach the throne of\ngrace with boldness, so that we may receive mercy and find grace to\nhelp in time of need Heb 4:15\nThe Jesus who asks of us an uncompromising loyalty, a loyalty that informs\nand underlines all our other commitments, is the same Jesus who travels the\nroad with us; who, who knew the pain and the loneliness of Gethsemene and\nCalvary, who met frightened disciples on the Road to Emmaus, listened to\ntheir pain and confusion and making himself known in the breaking of bread\nsent them back to tell the good news. It is the same Jesus who came to Simon\nPage 7 of 7\nPROPER 7 – Year A – 2020 Trinity 2\nPeter by the Lake, lifting from him the pain of his memory of denial and\ncommissioned him afresh to service, ‘Feed my sheep’.\nThis same Jesus comes to us in our strengths and our weaknesses, our\nfaithfulness and our failure, in all the complexities of our relationships in work,\nin business, in the home and community and calls us to further service in his\nname.\nSo let us indeed ‘approach the throne of grace with boldness, so that we may\nreceive mercy and find grace to help in time of need.’"
    }
}