{
    "title": "Perspectives of Faith",
    "date": "2017-07-02",
    "blurb": "Kevin reflects on the well-known story of Abraham and Isaac from a fresh perspective, considering Isaac's experience and emotions. He connects this to personal struggles with faith and understanding God's purpose in times of pain. The sermon emphasizes the importance of honesty before God and finding comfort in the Psalms during hardship.",
    "raw_text": "### PROPER 8 – Year A - 2017 – Trinity 3\n\nThis year as we go through the season of Trinity, we are following the stories of the old Hebrew Patriarchs, Abraham, Isaac, and Jacob. These stories are challenging, involving real human beings with emotions, prejudices, and blind spots. Last week, we reflected on Sarah and her son Isaac. Sarah's fear and jealousy could not frustrate God's purposes for Isaac and Ishmael.\n\nWe often hear these stories without truly listening. Consider Abraham's call to sacrifice his son. The focus is usually on Abraham's pain, but what about Isaac's terror? This realization broadened my perspective, and now I reflect on this passage from Isaac's point of view. It reminds us of times when it's hard to see God in painful situations.\n\nSome time ago, I learned of my mother's inoperable cancer. I was devastated and angry, unable to recite the creed. Lectures on the Psalms taught me that it's okay to express all emotions to God. This helped me see my life in the context of God's purposes.\n\nIsaac grew up to play his part as a Patriarch. Life can be difficult to understand and seem unfair, but the Psalms remind us that we are not alone. God hears our pain and understands. I close with a reflection from the book 'Out of the Deep' on the Psalms, which emphasizes that it's alright to be angry and lonely, and that our feelings are heard by God.\n\n> Psalm 139\n> 6 Where can I go then from your spirit? Or where can I flee from your presence?\n> 7 If I climb up to heaven, you are there; if I make the grave my bed, you are there also.\n> 8 If I take the wings of the morning and dwell in the uttermost parts of the sea,\n> 9 Even there your hand shall lead me, your right hand hold me fast.\n> 10 If I say, 'Surely the darkness will cover me and the light around me turn to night,'\n> 11 Even darkness is no darkness with you; the night is as clear as the day; darkness and light to you are both alike.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper82017.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 8 – Year A - 2017 – Trinity 3\nThis year as we go through the season of Trinity we are following in our Old\nTestament readings the stories of the old Hebrew Patriarchs, Abraham, Isaac,\nJacob and we will move on to the story of slavery in Egypt, of Passover, of\nExodus, of entry into the Promised Land.\nThese are well known stories; we will have heard them in Sunday School. As\nwe reflected last week, these are often challenging stories, involving real\nhuman beings, with human emotions, prejudices and blind spots. As I said last\nweek we are not dealing with plaster caste saints but by the same token it is\ntheir very humanity that speaks powerfully to us.\nSo last week we reflected on the story of Sarah and her son Isaac that she\nthought she would never have. Sarah, fiercely protective of her son, insists that\nHagar and her son Ishmael, whom she bore to Abraham, be driven away. But\nultimately Sarah’s fear and jealousy could not frustrate God’s ultimate\npurposes for Isaac and Ishmael.\nThese stories are so well known that we can find ourselves hearing them but\nnot listening. Take our passage today, the story of Abraham hearing God’s call\nto sacrifice his son. We’ve heard it so many times, we find ourselves focussing\non the pain of Abraham, torn between the love of his son and his faithfulness to\nthe God who called him. If you look at all the commentaries on this passage\nand pretty well every sermon you will have heard on it, there is this same focus\non Abraham – poor Isaac is almost reduced to a supporting role.\nI remember being pulled up short on this in the course of a visit I made one\nMonday afternoon in Ahoghill. I was brought into the house, sat down, offered\na cup of tea and then the man of the house eyeballed me and said, ‘I’ve a bone\nto pick with you.’ I thought what had I done to this man. ‘What about?’ was\nall I could say. ‘Yesterday’s sermon.’ Well that narrowed it down a bit but I\nPage 2 of 4\nPROPER 8 – Year A - 2017 – Trinity 3\ncouldn’t think of my heresy I had preached. My sermon had been on the\npassage we read this morning. I had reflected on Abraham’s obedience and\npain. So again I said, ‘What about it?’\n‘What about it? You talked about the father’s pain. Did you ever stop to think\nabout that poor child? Suddenly tied up by the father he loved and a knife put\nto his throat – he must have been terrified.’ He was right of course – I had just\nthought of Abraham, I had not thought of poor Isaac. I went back home,\nlooked up my various commentaries and – surprise, surprise – they did not\nthink of Isaac either.\nSo from that point on, I have looked at this passage with a broader perspective.\nThis morning, I want to reflect on this passage from Isaac’s perspective. As we\nread the story, Abraham at least acted in the assurance that he was doing God’s\nwill, however painful that was. On that mountain top I would suspect that for\nIsaac must have seemed God seemed a long way away. This sets me thinking\nof circumstances in our own lives when maybe it is hard to see God in the\nsituation of pain or suffering that we, or a loved one, may be in.\nAs I have recalled before, some eight months before I was due to be ordained I\ngot a phone call from my elder brother. He was ringing to tell me that our\nmother has been diagnosed with an inoperable cancer and that we were looking\nat about six months. I was absolutely devastated. Some five years earlier my\nfather had suffered a severe brain haemorrhage from which, against all the\nodds, he had made a recovery. He was not however the man he was and he\ndepended on my mother. We had assumed that Dad would die before Mum\nand she was facing into a long widowhood. Now my father was to be robbed\nof the one he depended on and Mum was to be denied the retirement that she\nand Dad had looked forward to so much.\nPage 3 of 4\nPROPER 8 – Year A - 2017 – Trinity 3\nI was cross, I was hurt, I was angry. At that time I attended morning and\nevening prayer on a daily basis as part of the disciple of a theological student.\nI remember that for three weeks I was unable to say the creed – it just stuck in\nmy throat. As it turned out, around that time we received a series of lectures on\nthe Psalms which was just what I needed at that particular point in time. Our\nlecturer pointed out that these psalms contained the full range of human\nemotions – from pure joy to deep despair before God. The wonderful insight\nfor me was that the Psalmist could be himself before God. If he was happy he\npraised the Lord and called others to do so with every instrument available,\ndrums, trumpets, cymbals the lot. If he felt that God did not seem to care, he\ntold him – why had God abandoned him, why did the wicked seem to prosper,\nwhy, why, why?\nBut having got all that off his chest, he was able to see God’s purposes, even in\nhis pain. That spoke to me in my situation – I discovered that I could be honest\nwith God – he knew how I felt anyway. At that particular point in my life there\nwould have been no point saying ‘Lord your ways are wonderful’ because I\nwould have been lying and God would have known that. But I felt that God\nheard my pain and could begin to see my life, with all its ups and downs, in the\ncontext of his purposes.\nGoing back to Abraham and Isaac; the Bible is silent on whether the two ever\ndiscussed what went on that day on the mountain top, whether Abraham ever\ntried to explain, whether Isaac ever fully understood the actions of his father\nthat day. But one thing we do know is that Isaac grew up to play his part as\none of the Patriarchs of Israel. He came to see that his life, the whole of his\nlife, had a purpose before God.\nSome of you will have heard me say, ‘There are times when life is a bitch’,\ntimes when life is very hard to understand, times when life is very unfair. As I\nPage 4 of 4\nPROPER 8 – Year A - 2017 – Trinity 3\nread these Old Testament, As I reflect on the breadth of the Psalms, the psalms\nof pure joy, the psalms of deep pain and questioning, I become more and more\nconvinced that I am not alone, God does hear our pain, God does understand. I\nwill close with a passage I have quoted before. It is out of a book I have at\nhome, ‘Out of the Deep’, a series of reflections on the Psalms. It begins with\nthe author remembering a time of crisis of faith for himself. His father had\ndied suddenly while he was at school. He was studying music in Rome, prior\nto returning home to go to University. One rainy afternoon he found himself in\none of the great basilicas in Rome:\n‘When I went there …. teenagers were playing football in the park and\nhurtling around the piazza on motor scooters. I was suddenly gripped\nby a terrible loneliness; and when I entered the vast and dimly lit\nbasilica with its eighty marble columns and gorgeous mosaics I was\noverwhelmed, not just with awe but with anger, at the God who had\ntaken away my father and yet seemed to enjoy dwelling in buildings of\nsuch icy magnificence; anger too at a world which could go happily\nabout its business as heedless of my loss as God was. I gave vent to\nmy feelings in tears of fury and self pity; and neither the laughing\nfootballers nor the God of the great basilica took any notice. Yet I was\nleft with a strangely clear awareness that it was all right to be angry\nand lonely and to say so – and that, in some inexplicable sense, what I\nhad said had been heard.’\n(Out of the Deep – page 2)\nPsalm 139\n6 Where can I go then from your spirit? ♦\nOr where can I flee from your presence?\n7 If I climb up to heaven, you are there; ♦\nif I make the grave my bed, you are there also.\n8 If I take the wings of the morning ♦\nand dwell in the uttermost parts of the sea,\n9 Even there your hand shall lead me, ♦\nyour right hand hold me fast.\n10 If I say, ‘Surely the darkness will cover me ♦\nand the light around me turn to night,’\n11 Even darkness is no darkness with you;\nthe night is as clear as the day; ♦\ndarkness and light to you are both alike."
    }
}