{
    "title": "Navigating Life's Mists",
    "date": "2020-06-21",
    "blurb": "In this sermon, Kevin reflects on the challenges of navigating through life's uncertainties, likening it to walking in a misty bogland without landmarks. He emphasizes the importance of faith in Christ as a compass in a disoriented world, drawing from the teachings of John Stott and the example of the cross. The sermon encourages the community to live by the cross, bearing witness to Christ's love and discipline in a confusing world.",
    "raw_text": "PROPER 7 – Year A – 2020 – Trinity 2 – Christchurch Cathedral\n\nI remember at one stage when I was in College going for a walk with a friend in the Wicklow Mountains just outside Dublin around Sally Gap. We were tramping across bogland when a mist started to come down. It was quite an unnerving experience – suddenly all the familiar landmarks were gone – all we had was the eerie quiet of the mist. There were no landmarks to head towards, no sounds to guide us. The danger in these circumstances is that you can quickly lose your sense of direction. Fortunately, we had recently crossed a road so we carefully retraced our steps. We eventually found it and were able to head back safely down the valley.\n\nWe live in a hectic and confusing world. Old certainties of stability of family life are being overshadowed by pressures that seem to undermine it. All of us will know of people who have experienced the trauma of a marriage breakdown. The old certainties seem to strain as we come to terms with people establishing new relationships. The days of a job for life are now long past us. In the economic crash following the collapse of the Celtic Tiger and in the uncertainties in all areas of the economy as we contemplate the long term impact of Covid-19 leave people wondering where they stand.\n\nRecent events in the United States following the tragic death of George Floyd and in the demonstrations around the world have served to remind us of the darker side of humanity, the reality of racism (however politely expressed) and other examples of discrimination be they based on creed, class, gender, or sexuality; the tendency for society to look the other way until the situation explodes in our face.\n\nAdvances in technology, the explosion of social media sites have not only brought great benefits but they have also had their darker side. Cyberbullying resulting in suicides in young people, propagation of racist and homophobic material; the corruption of the whole political process as different groups spread fake news designed to undermine reasoned political debate.\n\nIt is almost as if a moral mist has settled on our society and we are drifting, in danger of losing ourselves. A while back I sat down and re-read a book by John Stott, 'The Cross of Christ'. He made a number of comments that, along with the New Testament Lesson and Gospel for today, set my mind thinking. He wrote; 'The very purpose of (Jesus') self-giving on the cross was not to save isolated individuals but to create a new community …. The Community of Christ is the Community of the Cross. Having been brought into being by the Cross it continues to live by and under the Cross. …. The Cross is not just a banner under which we march; it is the compass by which we orientate ourselves in a disorientated world.'\n\nThis emphasizes for me a fundamental truth. Faith in Christ is not an escape from the world in which we live. Rather it gives us direction and purpose as we seek to live for Christ in the world of today. On the night before he died, he prayed for his disciples not that the Father would take them out of the world but that he would keep them from the evil one.\n\nThis means that we will view the problems facing us from a particular perspective, that of the cross. The cross will change the way we look at things only to the extent the cross in fact changes us. Commenting on the call of Jesus to us all to take up our cross and follow him, the Second World War German theologian Dietrich Bonhoeffer wrote: 'When Christ calls a man he bids him come and die.' The portion we read from Paul's Letter to the Romans enlarges on this call. Faith in Christ is not about following a set of rules, it is about allowing the crucified and risen Christ to enter our hearts and lives, changing attitudes, changing priorities. To return to part of what John Stott was saying: 'The Community of Christ is the Community of the Cross. Having been brought into being by the Cross it continues to live by and under the Cross.' At the heart of the cross is a self-forgetting love and obedience to the Father. With it there is pain, there is forgiveness – and through it all there is triumph over evil.\n\nWe are called to bear witness to that in the confusing arena of the world in which we live. This does not mean that we bring to the problems of the world a set of ready-made, cut and dried answers. Our following of Christ gives a direction to our search and a confidence in our principles. But with this should go a compassion to those who are adrift in the world of today. This is what lies behind the ministry of the Church in the prisons, among drug abusers and those on the margins. This does not imply condoning illegal or antisocial behavior. It involves reaching out to those who are adrift in the world.\n\nThis Cathedral acts as a landmark in the centre of Dublin. People giving directions will say, 'Keep going until you see the Cathedral and then turn left, right – or whatever.' The community that gathers in this Cathedral, the communities that gather in our Parish Churches are called to be something of a landmark in the world of today as in our life we point to the crucified and risen Christ, showing something of the discipline and compassion of our Lord and so help people to find a direction to their lives in the confusing world of today.\n\nIn the words of the Bishop's charge in the service of ordination, we are all charged 'to seek for God's children in the wilderness of this world's temptations and to guide them through its confusions, so that they may be saved through Christ forever.'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper72020christchurch.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 7 – Year A – 2020 – Trinity 2 – Christchurch Cathedral\nI remember at one stage when I was in College going for a walk with a friend\nin the Wicklow Mountains just outside Dublin around Sally Gap. We were\ntramping across bogland when a mist started to come down. It was quite an\nun-nerving experience – suddenly all the familiar land marks were gone – all\nwe had was the eerie quiet of the mist. There were no landmarks to head\ntowards, no sounds to guide us. The danger in these circumstances is that you\ncan quickly lose your sense of direction. Fortunately we had recently crossed a\nroad so we carefully retraced our steps. We eventually found it and were able\nto head back safely down the valley.\nWe live in a hectic and confusing world. Old certainties of stability of family\nlife are being overshadowed by pressures that seem to undermine it. All of us\nwill know of people who have experienced the trauma of a marriage\nbreakdown. The old certainties seem to strain as we come to terms with people\nestablishing new relationships. The days of a job for life are now long past us.\nIn the economic crash following the collapse of the Celtic Tiger and in the\nuncertainties in all areas of the economy as we contemplate the long term\nimpact of Covid 19 leave people wondering where they stand.\nRecent events in the United States following the tragic death of George Floyd\nand in the demonstrations around the world have served to remind us of the\ndarker side of humanity, the reality of racism (however politely expressed) and\nother examples of discrimination be they based on creed, class, gender or\nsexuality; the tendency for society to look the other way until the situation\nexplodes in our face.\nPage 2 of 4\nPROPER 7 – Year A – 2020 – Trinity 2 – Christchurch Cathedral\nAdvances in technology, the explosion of social media sites have not only\nbrought great benefits but they have also had their darker side. Cyber bullying\nresulting in suicides in young people, propagation of racist and homophobic\nmaterial; the corruption of the whole political process as different groups\nspread fake news designed to undermine reasoned political debate.\nIt is almost as if a moral mist has settled on our society and we are drifting, in\ndanger of losing ourselves. A while back I sat down and re-read a book by\nJohn Stott, ‘The Cross of Christ’. He made a number of comments that, along\nwith the New Testament Lesson and Gospel for today, set my mind thinking.\nHe wrote; ‘The very purpose of (Jesus’) self giving on the cross was not to\nsave isolated individuals but to create a new community …. The Community of\nChrist is the Community of the Cross. Having been brought into being by the\nCross it continues to live by and under the Cross. …. The Cross is not just a\nbanner under which we march; it is the compass by which we orientate\nourselves in a disorientated world.’\nThis emphasises for me a fundamental truth. Faith in Christ is not an escape\nfrom the world in which we live. Rather it gives us direction and purpose as\nwe seek to live for Christ in the world of today. On the night before he died, he\nprayed for his disciples not that the Father would take them out of the world\nbut that he would keep them from the evil one.\nThis means that we will view the problems facing us from a particular\nperspective, that of the cross. The cross will change the way we look at things\nPage 3 of 4\nPROPER 7 – Year A – 2020 – Trinity 2 – Christchurch Cathedral\nonly to the extent the cross in fact changes us. Commenting on the call of\nJesus to us all to take up our cross and follow him, the Second World War\nGerman theologian Dietrich Boenhoffer wrote: ‘When Christ calls a man he\nbids him come and die.’ The portion we read from Paul’s Letter to the Romans\nenlarges on this call. Faith in Christ is not about following a set of rules, it is\nabout allowing the crucified and risen Christ to enter our hearts and lives,\nchanging attitudes, changing priorities. To return to part of what John Stott\nwas saying: ‘The Community of Christ is the Community of the Cross. Having\nbeen brought into being by the Cross it continues to live by and under the\nCross’. At the heart of the cross is a self-forgetting love and obedience to the\nFather. With it there is pain, there is forgiveness – and through it all there is\ntriumph over evil.\nWe are called to bear witness to that in the confusing arena of the world in\nwhich we live. This does not mean that we bring to the problems of the world\na set of ready-made, cut and dried answers. Our following of Christ gives a\ndirection to our search and a confidence in our principles. But with this should\ngo a compassion to those who are adrift in the world of today. This is what lies\nbehind the ministry of the Church in the prisons, among drug abusers and those\non the margins. This does not imply condoning illegal or antisocial behaviour.\nIt involves reaching out to those who are adrift in the world,\nThis Cathedral acts as a landmark in the centre of Dublin. People giving\ndirections will say, ‘Keep going until you see the Cathedral and then turn left,\nright – or whatever.’ The community that gathers in this Cathedral, the\ncommunities that gather in our Parish Churches are called to be something of a\nPage 4 of 4\nPROPER 7 – Year A – 2020 – Trinity 2 – Christchurch Cathedral\nlandmark in the world of today as in our life we point to the crucified and risen\nChrist, showing something of the discipline and compassion of our Lord and so\nhelp people to find a direction to their lives in the confusing world of today.\nIn the words of the Bishop’s charge in the service of ordination, we are all\ncharged ‘to seek for God’s children in the wilderness of this world’s\ntemptations and to guide them through its confusions, so that they may be\nsaved through Christ for ever.’"
    }
}