{
    "title": "Steps of Faith and Perspective",
    "date": "2009-07-26",
    "blurb": "Kevin reflects on the significance of small steps and new perspectives, drawing parallels between the moon landing and the journey of faith marked by baptism. He emphasizes the importance of community in this journey, sharing insights from the Letter to the Ephesians on comprehending the vastness of Christ's love and living a life aligned with baptismal promises.",
    "raw_text": "Where were you 40 years ago? As the world viewed those fuzzy black and white images of the man in the space suit as he made his way down the ladder onto the surface of the moon with those memorable words, 'One small step for man, one giant leap for mankind.' One of the other memorable images was that of the earth taken from the surface of the moon – the earth with which we are so familiar viewed from a completely perspective.\n\nI want to take these two elements of 'one small step' of major significance and viewing things from a different perspective into our thoughts today.\n\nJuly has been a month of Baptisms. I don't remember a month like it in my whole ministry. The parents who have brought their children for Baptism have come from a wide variety of national and cultural backgrounds – Dublin, England, Nigerian and today Northern Ireland. But all have come from a common perspective of seeking Christian Baptism, membership of the Body of Christ.\n\nBaptism, as the Prayer Book reminds us, is one small step, our first step on a life long journey of faith. This is a journey we undertake as individuals, but not as individuals in isolation, but as members of a community, the Church, the Body of Christ.\n\nToday, in the lessons set for today, we continue in our reading of the Letter to the Ephesians. The portion we have read today contains a wonderful prayer for us as we embark upon this journey of faith:\n\n> 16I pray ... that Christ may dwell in your hearts through faith, as you are being rooted and grounded in love.\n\nAt the heart of the Service of Baptism is the concept of inclusion, of welcome. The child already knows the love of family; today this child is drawn into the love of the Parish community and the wider Church, a love that has at its heart God's love for us in Christ – everything we do as a community is rooted and grounded in that love of God for us in Christ.\n\n'That you may have the power to comprehend with all the saints'. We are all engaged on a journey of discovery of faith in which we encourage each other, in which we learn from each other. As I constantly remark the questions that lie at the heart of Baptism are questions of people on a journey, not of people who have arrived, who have it all sorted.\n\nThere is something essentially provisional about faith, in that faith is always looking further forward, faith is always exploring, always developing, always growing.\n\nThe Apollo 11 astronauts were given the privilege of viewing the earth from a completely different perspective. Set against the huge expanse of space we get an insight into its vulnerability, its fragility. The pledges of Baptism are questions that remind us that life lived in faith is life viewed, life lived from a different perspective with different priorities, different values. These are values not just for the holy bits, the religious bits of my life. They are the values and priorities that inform the whole of my life, my business life, my family life, all facets of life. That is why the words of Michael Ramsey, Archbishop of Canterbury when I was growing up, have always rung true for me when he said, 'The whole of my life is lived in response to my Baptism' and 'The promises of Baptism are a yardstick for life.' To what extent, in all the busyness and messiness of life, do I repent of the sins that separate me from God and neighbour, to what extent do I submit to Christ as Lord? In the process we do get an insight into the 'breadth and length and height and depth' of God's love for us in Christ.\n\nThen our letter continues:\n\n> to know the love of Christ that surpasses knowledge, so that you may be filled with all the fullness of God.\n\nThere is a sense here of this oneness with God that comes through this apprehension of love. To know that I am loved is to realise that there is another who has placed a value upon me, not because of what I do or what I have but simply because of who I am. To realise deep down that this God whom I seek to serve and to follow loves me, values me has a profound effect upon my understanding of myself, my understanding of other people as ones made in the image of God.\n\nI spoke earlier of Baptism as our first step on a life long journey of faith; a journey we undertake as individuals, but not as individuals in isolation, but as members of a community, the Church, the Body of Christ. And so there is this sense of inclusion, of belonging. We are a community of fellow pilgrims on the road, each themselves seeking to work out in their own lives what it means to belong to this God who has loved us so extravagantly, so unconditionally.\n\nAs fellow pilgrims we have a commitment to one another arising out of a shared commitment to Christ. As flawed human beings we will have our differences of opinion, different tastes in worship styles quite apart from differences of personality and temperament – we may even fall out occasionally – but underneath it all, maybe occasionally obscured by it all, there is a fundamental peace, a unity of purpose, of commitment to Christ and to one another.\n\nAnd so later on in the service, after Olivia has been baptised and welcomed into the congregation we will turn to one anther and offer one another a sign of peace. This is not a casual shake of the hands and a muttered hello, this is a sign of our commitment to one another in Christ: 'The peace of the Lord be always with you', a prayer for this child, a prayer for one another, a prayer for the Church at large. 'The peace of the Lord be always with you – and also with you.'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Proper 12 - 2009.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 12 -2009 – Year B – Trinity 7\nWhere were you 40 years ago? As the world viewed those fuzzy black and white images\nof the man in the space suit as he made his way down the ladder onto the surface of the\nmoon with those memorable words, ‘One small step for man, one giant leap for mankind.’\nOne of the other memorable images was that of the earth taken from the surface of the\nmoon – the earth with which we are so familiar viewed from a completely perspective.\nI want to take these two elements of ‘one small step’ of major significance and viewing\nthings from a different perspective into our thoughts today.\nJuly has been a month of Baptisms. I don’t remember a month like it in my whole\nministry. The parents who have brought their children for Baptism have come from a\nwide variety of national and cultural backgrounds – Dublin, England, Nigerian and today\nNorthern Ireland. But all have come from a common perspective of seeking Christian\nBaptism, membership of the Body of Christ.\nBaptism, as the Prayer Book reminds us, is one small step, our first step on a life long\njourney of faith. This is a journey we undertake as individuals, but not as individuals in\nisolation, but as members of a community, the Church, the Body of Christ.\nToday, in the lessons set for today, we continue in our reading of the Letter to the\nEphesians. The portion we have read today contains a wonderful prayer for us as we\nembark upon this journey of faith:\n16I pray …… that Christ may dwell in your hearts through faith, as you\nare being rooted and grounded in love.\nAt the heart of the Service of Baptism is the concept of inclusion, of welcome. The child\nalready knows the love of family; today this child is drawn into the love of the Parish\ncommunity and the wider Church, a love that has at its heart God’s love for us in Christ –\neverything we do as a community is rooted and grounded in that love. of God for us in\nChrist.\nPage 2 of 3\nProper 12 -2009 – Year B – Trinity 7\nThe Letter continues:\n18I pray that you may have the power to comprehend, with all the\nsaints, what is the breadth and length and height and depth, 19and to\nknow the love of Christ that surpasses knowledge\n‘That you may have the power to comprehend with all the saints’. We are all engaged on\na journey of discovery of faith in which we encourage each other, in which we learn from\neach other. As I constantly remark the questions that lie at the heart of Baptism are\nquestions of people on a journey, not of people who have arrived, who have it all sorted.\nThere is something essentially provisional about faith, in that faith is always looking\nfurther forward, faith is always exploring, always developing, always growing..\nThe Apollo 11 astronauts were given the privilege of viewing the earth from a completely\ndifferent perspective. Set against the huge expanse of space we get an insight into its\nvulnerability, its fragility. The pledges of Baptism are questions that remind us that life\nlived in faith is life viewed, life lived from a different perspective with different\npriorities, different values. These are values not just for the holy bits, the religious bits of\nmy life. They are the values and priorities that inform the whole of my life, my business\nlife, my family life, all facets of life. That is why the words of Michael Ramsey,\nArchbishop of Canterbury when I was growing up, have always rung true for me when he\nsaid, ‘The whole of my life is lived in response to my Baptism’ and ‘The promises of\nBaptism are a yardstick for life.’ To what extent, in all the busyness and messiness of\nlife, do I repent of the sins that separate me from God and neighbour, to what extent do I\nsubmit to Christ as Lord? In the process we do get an insight into the ‘breadth and length\nand height and depth’ of God’s love for us in Christ.\nThen our letter continues:\nto know the love of Christ that surpasses knowledge, so\nthat you may be filled with all the fullness of God.\nPage 3 of 3\nProper 12 -2009 – Year B – Trinity 7\nThere is a sense here of this oneness with God that comes through this apprehension of\nlove. To know that I am loved is to realise that there is another who has placed a value\nupon me, not because of what I do or what I have but simply because of who I am. To\nrealise deep down that this God whom I seek to serve and to follow loves me, values me\nhas a profound effect upon my understanding of myself, my understanding of other\npeople as ones made in the image of God.\nI spoke earlier of Baptism as our first step on a life long journey of faith; a journey we\nundertake as individuals, but not as individuals in isolation, but as members of a\ncommunity, the Church, the Body of Christ. And so there is this sense of inclusion, of\nbelonging. We are a community of fellow pilgrims on the road, each themselves seeking\nto work out in their own lives what it means to belong to this God who has loved us so\nextravagantly, so unconditionally.\nAs fellow pilgrims we have a commitment to one another arising out of a shared\ncommitment to Christ. As flawed human beings we will have our differences of opinion,\ndifferent tastes in worship styles quite apart from differences of personality and\ntemperament – we may even fall out occasionally – but underneath it all, maybe\noccasionally obscured by it all, there is a fundamental peace, a unity of purpose, of\ncommitment to Christ and to one another.\nAnd so later on in the service, after Olivia has been baptised and welcomed into the\ncongregation we will turn to one anther and offer one another a sign of peace. This is not\na casual shake of the hands and a muttered hello, this is a sign of our commitment to one\nanother in Christ: ‘The peace of the Lord be always with you’, a prayer for this child, a\nprayer for one another, a prayer for the Church at large. ‘The peace of the Lord be\nalways with you – and also with you.’"
    }
}