{
    "title": "Tradition and Transition",
    "date": "2011-09-04",
    "blurb": "Kevin reflects on the significance of the Passover and its observance through generations, emphasizing the importance of passing traditions and faith from one generation to another. He introduces a new approach to Sunday School aimed at integrating young parishioners into the life and worship of the Church, while also addressing the need for flexibility in maintaining traditions to ensure they remain relevant and meaningful in contemporary times.",
    "raw_text": "## PROPER 18 – Year A - 2011 – Trinity 11\n\nWhat is your favourite time in the Church year? For many, particularly in country Parishes, it is Harvest, which this year we will be celebrating on the 9th October. For others, it is the season of Christmas. It is a time of family gatherings, the familiar hymns and carols, the Nativity, the Carol Service, the midnight service and the Family Service. People, who maybe do not have much of a Church attachment, make a point of being here sometime over that period. Myself, I have always loved Easter, coming as it does in the spring, at the end of the season of Lent, with its themes of new life, new beginnings, of hope.\n\nOur Old Testament Lesson this morning is the story of the first Passover. It is the climax of an ongoing stand-off between Moses and Pharaoh, the series of plagues and Pharaoh’s repeated refusal to let the people of Israel go, culminating in the night of Passover; a night of despair for the people of Egypt, a night of release for the people of Israel. Embedded in the story is the meal that they are commanded to eat that night, the roasted lamb, the unleavened bread and the bitter herbs, a meal they are to keep as a perpetual reminder of that first Passover night.\n\nThat is a ceremony that has been observed by Jews all over the world ever since in all the varied circumstances in which they have found themselves. It is at its core a family celebration as families gather to celebrate the Seder Meal on the eve of Passover. I recall a retired biochemist who attended some of our theological lectures, a Dr Horowitz, telling a group of us over coffee in the Buttery in Trinity between lectures how he was going to spend Passover. He spoke of the family who had invited him to share the Passover with them, of the details of the meal and their significance and then with visible emotion he voiced the hope 'One year, one year, I will eat it in Jerusalem.'\n\nOnce the people settled in the land and ever since, the Passover ceremony developed into its present form. In the ceremony the youngest child of the house asks a series of questions, designed to draw out the significance of what is being done:\n\n1. Tonight why do we eat only matzah?\n2. Tonight why do we eat bitter herbs?\n3. Tonight why do we dip into the salt water and charoset?\n4. Tonight why do we all lean?\n\nWhat has always struck me about this particular aspect of the ceremony is that this is something that includes all generations. The Passover meal is an action of the whole family that is present around that table as the tradition is celebrated, as the tradition is passed on from one generation to another. Those of you who were at the Family Eucharist over the summer will have noticed that the Communion Prayer we used in those services included questions asked by a young child as to the significance of what we were doing as we shared the bread and wine.\n\nOver the last few months I have been asking you to think about how we are to transmit the faith, the practice of the faith from one generation to another. I have referred to this in my notes this month’s Newsletter. Worship was never intended to be the action of just the older generation, it is an action of the whole community of the Church. We are all aware of the fall off in attendance, not just after Confirmation but also in the upper end of Sunday School.\n\nSo this year we are trying a different approach to Sunday School that I want to commend to you today. It is starting from the premise that one of the main purposes of Sunday School is to incorporate a rising generation of the Parish into the life and worship of the Church so attendance at public worship will be an integral part of our Sunday School teaching. The youngsters will be in the Parish Centre for two Sundays each month during the 11:00 service. There will continue to be the Family Service on the 2nd Sunday of the month, which will continue to be very much their service. At 11:00 Morning Prayer will now be on the 3rd Sunday and on the 4th Sunday we will have what I am calling a Family Communion Service. This will not be a second Family Service rather it will be an All Age Service seeking to meet the worship needs of all the generations. The Service will have a lighter feel than the Sung Communion on the 1st Sunday; there will be no communion chants and the sermon will be pitched someway between the Family Service Sunday and the other Sundays of the month. While I am fairly relaxed about movement and certain level of noise in the Family Service, at this service I would ask parents to encourage their children to stay in the pews and engage with the service – we will providing activity sheets related to the lessons of the day and copies of a children’s communion book produced by the Church of Ireland and there will be a crèche for the very young children. What we are trying to do here is to encourage our young people to experience ordinary Church of Ireland worship.\n\nIt will also enable our Sunday School teachers to regularly participate in the communion service – something that Sunday School teachers in all Parishes I have served in have said they very much miss.\n\nThis is an experiment and one that I am convinced is very worthwhile. I do appreciate it involves a modification to one of our existing services, a service that people value and enjoy. I would ask young families to respect this and encourage their children to do the same. But let us also recall that some three years ago I conducted a survey of worship preferences and 90% of our parents felt that some modification to our orders of worship and music would help them as they tried to encourage their own children to remain connected to the life and worship of the Church.\n\nI would ask you to go back and read what I have written in this month’s Newsletter, to reflect on what we have been thinking about. I leave you with words with which our new Archbishop began his sermon at his enthronement as Archbishop:\n\n'Flexibility is the companion of tradition, although it does not often come across like that. We must, of course, show appropriate respect for the good things which become ours through inheritance. Yet we cannot simply maintain those things as if their very maintenance is an end in itself and, therefore, constitutes a job well done. In each generation, it is our responsibility to bring the tradition forward to a new place, to make of it a fresh expression of God’s presence and God’s power, living and working with quite different people and in quite new situations. In this way, the tradition develops the confidence to act in ways appropriate to changed and changing circumstances. This it must do with sure confidence if it is to be a tradition for our time.'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper182011.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 18 –Year A - 2011 – Trinity 11\nWhat is your favourite time in the Church year? For many, particularly in\ncountry Parishes, it is Harvest, which this year we will be celebrating on the 9th\nOctober. For others it is the season of Christmas. It is a time of family\ngatherings, the familiar hymns and carols, the Nativity, the Carol Service, the\nmidnight service and the Family Service. People, who maybe do not have\nmuch of a Church attachment, make a point of being here sometime over that\nperiod. Myself, I have always loved Easter, coming as it does in the spring, at\nthe end of the season of Lent, with its themes of new life, new beginnings, of\nhope.\nOur Old Testament Lesson this morning is the story of the first Passover. It is\nthe climax of an ongoing stand-off between Moses and Pharaoh, the series of\nplagues and Pharaoh’s repeated refusal to let the people of Israel go,\nculminating in the night of Passover; a night of despair for the people of Egypt,\na night of release for the people of Israel. Embedded in the story is the meal\nthat they are commanded to eat that night, the roasted lamb, the unleavened\nbread and the bitter herbs, a meal they are to keep as a perpetual reminder of\nthat first Passover night.\nThat is a ceremony that has been observed by Jews all over the world ever\nsince in all the varied circumstances in which they have found themselves. It is\nat its core a family celebration as families gather to celebrate the Seder Meal on\nthe eve of Passover. I recall a retired biochemist who attended some of our\ntheological lectures, a Dr Horowitz, telling a group of us over coffee in the\nButtery in Trinity between lectures how he was going to spend Passover. He\nspoke of the family who had invited him to share the Passover with them, of\nPage 2 of 4\nPROPER 18 –Year A - 2011 – Trinity 11\nthe details of the meal and their significance and then with visible emotion he\nvoiced the hope ‘One year, one year, I will eat it in Jerusalem.’\nOnce the people settled in the land and ever since, the Passover ceremony\ndeveloped into its present form. In the ceremony the youngest child of the\nhouse asks a series of questions, designed to draw out the significance of what\nis being done:\n1. Tonight why do we eat only matzah?\n2. Tonight why do we eat bitter herbs?\n3. Tonight why do we dip into the salt water and charoset?\n4. Tonight why do we all lean?\nWhat has always struck me about this particular aspect of the ceremony is that\nthis is something that includes all generations. The Passover meal is an action\nof the whole family that is present around that table as the tradition is\ncelebrated, as the tradition is passed on from one generation to another. Those\nof you who were at the Family Eucharist over the summer will have noticed\nthat the Communion Prayer we used in those services included questions asked\nby a young child as to the significance of what we were doing as we shared the\nbread and wine.\nOver the last few months I have been asking you to think about how we are to\ntransmit the faith, the practice of the faith from one generation to another. I\nhave referred to this in my notes this month’s Newsletter. Worship was never\nintended to be the action of just the older generation, it is an action of the\nwhole community of the Church. We are all aware of the fall off in attendance,\nnot just after Confirmation but also in the upper end of Sunday School.\nPage 3 of 4\nPROPER 18 –Year A - 2011 – Trinity 11\nSo this year we are trying a different approach to Sunday School that I want to\ncommend to you today. It is starting from the premise that one of the main\npurposes of Sunday School is to incorporate a rising generation of the Parish\ninto the life and worship of the Church so attendance at public worship will be\nan integral part of our Sunday School teaching. The youngsters will be in the\nParish Centre for two Sundays each month during the 11:00 service. There\nwill continue to be the Family Service on the 2nd Sunday of the month, which\nwill continue to be very much their service. At 11:00 Morning Prayer will now\nbe on the 3rd Sunday and on the 4th Sunday we will have what I am calling a\nFamily Communion Service. This will not be a second Family Service rather it\nwill be an All Age Service seeking to meet the worship needs of all the\ngenerations. The Service will have a lighter feel than the Sung Communion on\nthe 1st Sunday; there will be no communion chants and the sermon will be\npitched someway between the Family Service Sunday and the other Sundays of\nthe month. While I am fairly relaxed about movement and certain level of\nnoise in the Family Service, at this service I would ask parents to encourage\ntheir children to stay in the pews and engage with the service – we will\nproviding activity sheets related to the lessons of the day and copies of a\nchildren’s communion book produced by the Church of Ireland and there will\nbe a crèche for the very young children. What we are trying to do here is to\nencourage our young people to experience ordinary Church of Ireland worship.\nIt will also enable our Sunday School teachers to regularly participate in the\ncommunion service – something that Sunday School teachers in all Parishes I\nhave served in have said they very much miss.\nPage 4 of 4\nPROPER 18 –Year A - 2011 – Trinity 11\nThis is an experiment and one that I am convinced is very worthwhile. I do\nappreciate it involves a modification to one of our existing services, a service\nthat people value and enjoy. I would ask young families to respect this and\nencourage their children to do the same. But let us also recall that some three\nyears ago I conducted a survey of worship preferences and 90% of our parents\nfelt that some modification to our orders of worship and music would help\nthem as they tried to encourage their own children to remain connected to the\nlife and worship of the Church.\nI would ask you to go back and read what I have written in this month’s\nNewsletter, to reflect on what we have been thinking about. I leave you with\nwords with which our new Archbishop began his sermon at his enthronement\nas Archbishop:\nFlexibility is the companion of tradition, although it does not often come\nacross like that. We must, of course, show appropriate respect for the good\nthings which become ours through inheritance. Yet we cannot simply\nmaintain those things as if their very maintenance is an end in itself and,\ntherefore, constitutes a job well done. In each generation, it is our\nresponsibility to bring the tradition forward to a new place, to make of it a\nfresh expression of God’s presence and God’s power, living and working\nwith quite different people and in quite new situations. In this way, the\ntradition develops the confidence to act in ways appropriate to changed\nand changing circumstances. This it must do with sure confidence if it is\nto be a tradition for our time."
    }
}