{
    "title": "Rhythms of Rest and Activity",
    "date": "2012-07-29",
    "blurb": "Kevin discusses the importance of balancing life's activities with moments of stillness, drawing on the Gospel reading and the wisdom of Ecclesiastes. He emphasizes the significance of the Sabbath in Jewish spirituality as a time for rest, community, and divine encounter. The sermon encourages finding space for God in our busy lives and the empowerment that comes from resting in His presence.",
    "raw_text": "One of the features of modern life is the smartphone – this piece of equipment that has found itself into so many of our pockets that has not only the phone but also the calendar, the camera, the internet, the apps that bring us news, railway and bus timetables and if you are lost it will tell you where you are. It is the mark of a busy society, a society of timetables, deadlines, targets. I am not saying that all this is wrong. In their proper place, timetables, deadlines, targets help to put a shape on life, help us to work more efficiently, more productively.\n\nBut do we ever turn these things off? I now find that one of the announcements I have to make at the start of a wedding or funeral service is to ask people to ensure that their mobiles are off. There are times for stillness, for leaving the world, the routines of the world aside.\n\nI thought of this as I read our Gospel reading for today. It is a passage marked by lots of activity. The disciples had just returned from the mission on which they had been sent by Jesus and there was lots to tell. There were people coming and going. Wherever Jesus appeared with his disciples the crowds were already there – coming to hear him preach, telling him their woes, bringing their sick to be healed. Lots and lots of activity; and in the midst of it all, Jesus says to his disciples:\n\n> 'Come away to a deserted place all by yourselves and rest a while.'\n\nThere is a time for activity and a time for stillness. This calls to mind the counsel of the writer of the Book Ecclesiastes:\n\n> 1 For everything there is a season, and a time for every matter under heaven:\n> 2 a time to be born, and a time to die;\n> a time to plant, and a time to pluck up what is planted;\n> 3 a time to kill, and a time to heal;\n> a time to break down, and a time to build up;\n> 4 a time to weep, and a time to laugh;\n> a time to mourn, and a time to dance;\n> 5 a time to throw away stones, and a time to gather stones together;\n> 6 a time to embrace, and a time to refrain from embracing;\n> 7 a time to seek, and a time to lose;\n> 8 a time to love, and a time to hate;\n> 9 a time for war, and a time for peace. Eccles 3:1-8\n\nWhat we are talking about here is finding the rhythm of life. That is why the whole concept of Sabbath is so important in Jewish spirituality. There is the weekly Sabbath on which no work was to be done. This is to follow the pattern of the creator who in six days made the heavens and the earth and all that is in it – and on the seventh day he rested. There is the Sabbath for the land which makes provision for the land to left fallow on the seventh year.\n\nCome away to a deserted place. In the Old Testament, the desert place is the place of encounter with God; Moses at the burning bush; Elijah at the mouth of the cave. Away from activity, away from the busy-ness of life – the importance of finding space in which God can come, in which God can speak into our hearts. From that space we return to the very proper activities and responsibilities of our daily life. Jonathan Sacks, the Chief Rabbi of Britain and the Commonwealth tells a story from the Jewish mystics of a rabbi who once asked his son, 'Where does God live?' The child could not understand the question. 'Surely', said the child, 'he fills the heavens and the earth?' 'No', said the rabbi, 'God lives wherever we let him in.' (Faith in the Future – Jonathan Sacks – p136)\n\nGod lives wherever we let him in. We come back to the importance of space, the deserted place. A place outside our timetables, our deadlines, our targets; a place to be still, to be quiet; a place where I can hear the still small voice of God.\n\nIn a world of individualism it is a place to rediscover community.\n\n> 'Come away to a deserted place all by yourselves and rest a while.'\n\nCome by yourselves, come together. In Jewish spirituality, the observance of Sabbath is always in the context of community. The family gathers on the Friday evening, the community gathers on the Sabbath morning. Jurgen Moltmann, in the section in his book 'God in Creation' that deals with the Sabbath, observes 'The peace of the Sabbath is peace with God first of all.' Sabbath a place, a time in which a community comes apart to be with God, to find peace with God, to find peace with one another. To encourage one another, to be encouraged; a place in which the cares and concerns of the world are set within their proper perspective.\n\nCome away and rest a while. ... and rest a while. This is not escapism; this is not hiding our heads in the sand. This is a place of empowerment; it is a place from which we go out to be the People of God in the world, in our homes and communities, our places of work, our places of recreation. Let us go out from this place to be Christ in and for the world in whatever situations we found ourselves this coming week.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper112012.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 11 – year B- 2012 Trinity 7\nOne of the features of modern life is the smartphone – this piece of equipment\nthat has found itself into so many of our pockets that has not only the phone but\nalso the calendar, the camera, the internet, the apps that bring us news, railway\nand bus timetables and if you are lost it will tell you where you are. It is the\nmark of a busy society, a society of timetables, deadlines, targets. I am not\nsaying that all this is wrong. In their proper place, timetables, deadlines,\ntargets help to put a shape on life, help us to work more efficiently, more\nproductively.\nBut do we ever turn these things off? I now find that one of the\nannouncements I have to make at the start of a wedding or funeral service is to\nask people to ensure that their mobiles are off. There are times for stillness, for\nleaving the world, the routines of the world aside.\nI thought of this as I read our Gospel reading for today. It is a passage marked\nby lots of activity. The disciples had just returned from the mission on which\nthey had been sent by Jesus and there was lots to tell. There were people\ncoming and going. Wherever Jesus appeared with his disciples the crowds\nwere already there – coming to hear him preach, telling him their woes,\nbringing their sick to be healed. Lots and lots of activity; and in the midst of it\nall, Jesus says to his disciples:\n‘Come away to a deserted place all by yourselves and rest a while.’\nThere is a time for activity and a time for stillness. This calls to mind the\ncounsel of the writer of the Book Ecclesiastes:\n1 For everything there is a season, and a time for every matter under heaven:\n2 a time to be born, and a time to die;\na time to plant, and a time to pluck up what is planted;\nPage 2 of 3\nProper 11 – year B- 2012 Trinity 7\n3 a time to kill, and a time to heal;\na time to break down, and a time to build up;\n4 a time to weep, and a time to laugh;\na time to mourn, and a time to dance;\n5 a time to throw away stones, and a time to gather stones together;\na time to embrace, and a time to refrain from embracing;\n6 a time to seek, and a time to lose;\na time to keep, and a time to throw away;\n7 a time to tear, and a time to sew;\na time to keep silence, and a time to speak;\n8 a time to love, and a time to hate;\na time for war, and a time for peace. Eccles 3:1-8\nWhat we are talking about here is finding the rhythm of life. That is why the\nwhole concept of Sabbath is so important in Jewish spirituality. There is the\nweekly Sabbath on which no work was to be done. This is to follow the\npattern of the creator who in six days made the heavens and the earth and all\nthat is in it – and on the seventh day he rested. There is the Sabbath for the\nland which makes provision for the land to left fallow on the seventh year.\nCome away to a deserted place. In the Old Testament, the desert place is the\nplace of encounter with God; Moses at the burning bush; Elijah at the mouth of\nthe cave. Away from activity, away from the busy-ness of life – the\nimportance of finding space in which God can come, in which God can speak\ninto our hearts. From that space we return to the very proper activities and\nresponsibilities of our daily life. Jonathan Sacks, the Chief Rabbi of Britain\nand the Commonwealth tells a story from the Jewish mystics of a rabbi who\nonce asked his son, ‘Where does God live?’ The child could not understand\nthe question. Where does God live? Where does he not live? ‘Surely’, said the\nchild, ‘he fills the heavens and the earth?’ ‘No’, said the rabbi, ‘God lives\nwherever we let him in.’ (Faith in the Future – Jonathan Sacks – p136)\nPage 3 of 3\nProper 11 – year B- 2012 Trinity 7\nGod lives wherever we let him in. We come back to the importance of space,\nthe deserted place. A place outside our timetables, our deadlines, our targets; a\nplace to be still, to be quiet; a place where I can hear the still small voice of\nGod.\nIn a world of individualism it is a place to rediscover community.\n‘Come away to a deserted place all by yourselves and rest a while.’\nCome by yourselves, come together. In Jewish spirituality, the observance of\nSabbath is always in the context of community. The family gathers on the\nFriday evening, the community gathers on the Sabbath morning. Jurgen\nMoltmann, in the section in his book ‘God in Creation’ that deals with the\nSabbath, observes ‘The peace of the Sabbath is peace with God first of all.’\nSabbath a place, a time in which a community comes apart to be with God, to\nfind peace with God, to find peace with one another. To encourage one\nanother, to be encouraged; a place in which the cares and concerns of the world\nare set within their proper perspective.\nCome away and rest a while. … and rest a while. This is not escapism; this is\nnot hiding our heads in the sand. This is a place of empowerment; it is a place\nfrom which we go out to be the People of God in the world, in our homes and\ncommunities, our places of work, our places of recreation. Let us go out from\nthis place to be Christ in and for the world in whatever situations we found\nourselves this coming week."
    }
}