{
    "title": "The Gift of Giving",
    "date": "2018-11-11",
    "blurb": "Kevin reflects on the true essence of giving through a childhood memory and the story of the poor widow's offering at the Temple. He emphasizes that the value of a gift lies not in its size, but in the spirit of gratitude with which it is given. Whether we are givers or receivers, no act of kindness is too small, and in each, we find the presence of Jesus. Kevin urges us to honor the memory of those lost in war by being peacemakers in our daily lives.",
    "raw_text": "Proper 27 – Year B – 2018 – Remembrance Day\nFamily Service\n\nI remember a birthday party I was at as a child. We had all brought presents for our friend. The party was like many other birthday parties – the usual games, the birthday cake, the jelly and ice cream, and of course the egg sandwiches I always associate with birthday parties of that era. But when we came to leave, the boy whose birthday we were celebrating handed a present back to one of his guests in front of us all. 'Thank you for bringing this Anthony but I don’t collect these things – so would you take it back?' I can still see the look of hurt, of rejection on Anthony Palmer’s face – that so little was thought of a gift that he had chosen for a friend.\n\nIn our reading this morning, we are given a picture of something happening around the Temple in Jerusalem. There’s a collection box. Lots of different people are coming along to make their donations. The rich and powerful are putting in their lavish gifts in a way that draws attention to them. Among those coming to give, Jesus spots someone that no-one else seems to notice, a poor widow quietly slips a few coins into the collection.\n\n> Jesus called his disciples over and said, \"The truth is that this poor widow gave more to the collection than all the others put together. All the others gave what they'll never miss; she gave extravagantly what she couldn't afford—she gave her all.\"\n\nOther people looking on saw the size of the gifts that were being offered. Jesus saw more than the size of the gift, Jesus saw what that gift meant for the woman who gave her few coins.\n\nWe’re talking here of gratitude. We are all called to be givers, people prepared to help, to encourage, to support. That might be in the school playground, in our place of work, in our homes and communities. It does not have to be big – the kind word, the hug, or simply listening. What is important is the spirit in which all this is done.\n\nAt some time or another, we are all going to be receivers when we are discouraged, when we are distressed. Whether we are giving or receiving, no gift is too small to make a difference; no gift is too small to be received with gratitude. In the kind word, the hug, the listening ear, Jesus is there. I often think back to the Parable of the Sheep and the Goats:\n\n> 'Lord, when was it that we saw you hungry and gave you food, or thirsty and gave you something to drink? And when was it that we saw you a stranger and welcomed you, or naked and gave you clothing? And when was it that we saw you sick or in prison and visited you?' And the king will answer them, 'Truly I tell you, just as you did it to one of the least of these who are members of my family, you did it to me.'\n\nIn a short while we will be offering up our prayers. We will be joining with people all over Europe who will be remembering the end of the First World War 100 years ago. We will be remembering all those who died, all those who suffered. How can we best remember, how can we best honor their loss?\n\nThe best way to do that would be to do whatever we can, however small, however insignificant to be peacemakers in our homes, in our schools, our places of work, in our communities.\n\nIn the words of a hymn we will be singing shortly:\n\n> Make me a channel of your peace:\n> where there’s despair in life let me bring hope,\n> where there’s darkness, only light,\n> and where there’s sadness, ever joy.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper272018famserv.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 27 – Year B – 2018 – Remembrance Day\nFamily Service\nI remember a birthday party I was at as a child. We had all brought\npresents for our friend. The party was like many other birthday\nparties – the usual games, the birthday cake, the jelly and ice cream\nand of course the egg sandwiches I always associate with birthday\nparties of that era.\nBut when we came to leave, the boy whose birthday we were\ncelebrating handed a present back to one of his guests in front of us\nall. ‘Thank you for bringing this Anthony but I don’t collect these\nthings – so would you take it back?’ I can still see the look of hurt, of\nrejection on Anthony Palmer’s face – that so little was thought of a\ngift that he had chosen for a friend.\nIn our reading this morning, we are given a picture of something\nhappening around the Temple in Jerusalem. There’s a collection box.\nLots of different people are coming along to make their donations.\nThe rich and powerful are putting in their lavish gifts in a way that\ndraws attention to them. Among those coming to give, Jesus spots\nsomeone that no-one else seems to notice, a poor widow quietly slips\na few coins into the collection.\nJesus called his disciples over and said, \"The truth is that this poor\nwidow gave more to the collection than all the others put together. All\nthe others gave what they'll never miss; she gave extravagantly what\nshe couldn't afford—she gave her all.\"\nPage 2 of 3\nProper 27 – Year B – 2018 – Remembrance Day\nFamily Service\nOther people looking on saw the size of the gifts that were being\noffered. Jesus saw more than the size of the gift, Jesus saw what that\ngift meant for the woman who gave her few coins.\nWe’re talking here of gratitude. We are all called to be givers, people\nprepared to help, to encourage, to support. That might be in the\nschool playground, in our place of work, in our homes and\ncommunities. It does not have to be big – the kind word, the hug, or\nsimply listening. What is important is the spirit in which all this is\ndone.\nAt some time or another, we are all going to be receivers when we are\ndiscouraged, when we are distressed. Whether we are giving or\nreceiving, no gift is too small to make a difference; no gift is too\nsmall to be received with gratitude. In the kind word, the hug, the\nlistening ear, Jesus is there. I often think back to the Parable of the\nSheep and the Goats\n‘Lord, when was it that we saw you hungry and gave you food, or\nthirsty and gave you something to drink? And when was it that we\nsaw you a stranger and welcomed you, or naked and gave you\nclothing? And when was it that we saw you sick or in prison and\nvisited you?’ And the king will answer them, ‘Truly I tell you, just as\nyou did it to one of the least of these who are members of my family,\nyou did it to me.’\nPage 3 of 3\nProper 27 – Year B – 2018 – Remembrance Day\nFamily Service\nIn a short while we will be offering up our prayers. We will be\njoining with people all over Europe who will be remembering the end\nof the Frist Word War 100 years ago. We will be remembering all\nthose who died, all those who suffered. How can we best remember,\nhow can we best honour their loss?\nThe best way to do that would be to do whatever we can, however\nsmall, however insignificant to be peace makers in our homes, in our\nschools, our places of work, in our communities.\nIn the words of a hymn we will be singing shortly:\nMake me a channel of your peace:\nwhere there’s despair in life let me bring hope,\nwhere there’s darkness, only light,\nand where there’s sadness, ever joy:"
    }
}