{
    "title": "Hierarchy and Service",
    "date": "2016-06-05",
    "blurb": "Kevin's sermon explores the concept of hierarchy through the lens of the Gospel, contrasting human structures of power with Jesus' model of servitude. He reflects on personal experiences and biblical teachings to emphasize the importance of service over authority, highlighting the radical reversal of hierarchy embodied by Jesus' incarnation and ministry.",
    "raw_text": "### PROPER 4 – Year C – 2016 - Trinity 1\n\n_\"For I also am a man set under authority, with soldiers under me; and I say to one, 'Go,' and he goes, and to another, 'Come,' and he comes, and to my slave, 'Do this,' and the slave does it.\"_ Luke 7:8\n\nAs I read those words of the centurion in the Gospel reading for today, my mind went back to a period I spent working for the UK Scientific Civil Service during the summer after the end of my first year in Trinity. I had been assigned to the Admiralty Surface Weapons Establishment overlooking Portsmouth harbour. We were a civilian establishment but even so everyone had a grade and with the grade came the corresponding office furniture. As a summer student I was very much at the bottom of the heap so I warranted a desk with a single draw in the centre and lino on the floor. As you moved up the grades the desk became more elaborate and the floor covering graduated to different grades of carpet. As I absorbed the significance of all this, I recall my boss explaining with a broad grin on his face, 'Put it this way Kevin, if you called into an office and you find the carpet coming up to your ankles, you know to say 'Sir'.'\n\nThere is something comfortable about hierarchy. There is a security in knowing where you stand. In human hierarchies there is also an element of power. As the centurion in our Gospel reading remarks, \"For I also am a man set under authority, with soldiers under me; and I say to one, 'Go,' and he goes, and to another, 'Come,' and he comes, and to my slave, 'Do this,' and the slave does it.\" Of course such structures are open to an abuse of power whether in the workplace, in the Church or the family.\n\nThe presence of the figure of Jesus in the story presents us with another model of hierarchy. A hierarchy not of power but of service. You sense the discomfort of the centurion in the story, Jesus is not fitting into his own understanding of hierarchy – 'Lord, do not trouble yourself, for I am not worthy to have you come under my roof; therefore I did not presume to come to you.'\n\nOf course it is not just the centurion who found Jesus' model of hierarchy challenging – elsewhere in the Gospels we find the disciples struggling with this one. They were brought up in a society of hierarchies – it is not surprising that we see examples of them jockeying for position vis a vis each other. In a passage in St Mark's Gospel that comes just before the final entry into Jerusalem we read, \"When the ten heard this, they began to be angry with James and John. So Jesus called them and said to them, 'You know that among the Gentiles those whom they recognize as their rulers lord it over them, and their great ones are tyrants over them. But it is not so among you; but whoever wishes to become great among you must be your servant, and whoever wishes to be first among you must be slave of all. For the Son of Man came not to be served but to serve, and to give his life a ransom for many.'\" Mark 10:41-45\n\n\"But it is not so among you; but whoever wishes to become great among you must be your servant, and whoever wishes to be first among you must be slave of all.\" That was a lesson that the disciples had to learn. That is a lesson that the Church has to learn afresh in each generation.\n\nBut this is not just something Jesus tells his followers to do – it is part of his very nature. Indeed the whole concept of Incarnation; God coming among us in human form, is an expression of this radical reversal of hierarchy.\n\nIn the words of Graham Kendrick's Hymn, \"Wisdom unsearchable, God the invisible, love indestructible, in frailty appears: Lord of infinity, stooping so tenderly, lifts our humanity to the heights of his throne.\" Church Hymnal 228\n\nWe are called to model this in our own discipleship of making Christ present in the world of today. Over these coming weeks of the season of Trinity we will be following Luke's account of the ministry of Jesus, his teaching, his healing, his standing alongside those on the margins of his society, the leper, the tax collector, the prostitute, the foreigner. As we do so we will reflect on our own calling as followers of Jesus to be instruments of healing, of forgiveness, of reconciliation in the world of today. Let us hear afresh Paul's words to his beloved Philippians as he wrote, \"Let the same mind be in you that was in Christ Jesus, who, though he was in the form of God, did not regard equality with God as something to be exploited, but emptied himself, taking the form of a slave.\" Phil 2:5-7\n\n\"May the mind of Christ my Saviour live in me from day to day, by his love and power controlling all I do and say.\" Irish Church Hymnal 636",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper42016.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 4 – Year C – 2016 - Trinity 1\n8For I also am a man set under authority, with soldiers under me; and I say to one, “Go,”\nand he goes, and to another, “Come,” and he comes, and to my slave, “Do this,” and the\nslave does it.’ Luke 7:8\nAs I read those words of the centurion in the Gospel reading for today, my\nmind went back to a period I spent working for the UK Scientific Civil Service\nduring the summer after the end of my first year in Trinity. I had been\nassigned to the Admiralty Surface Weapons Establishment overlooking\nPortsmouth harbour. We were a civilian establishment but even so everyone\nhad a grade and with the grade came the corresponding office furniture. As a\nsummer student I was very much at the bottom of the heap so I warranted a\ndesk with a single draw in the centre and lino on the floor. As you moved up\nthe grades the desk became more elaborate and the floor covering graduated to\ndifferent grades of carpet. As I absorbed the significance of all this, I recall my\nboss explaining with a broad grin on his face, ‘Put it this way Kevin, if you\ncalled into an office and you find the carpet coming up to your ankles, you\nknow to say ‘Sir’’.\nThere is something comfortable about hierarchy. There is a security in\nknowing where you stand.\nIn human hierarchies there is also an element of power. As the centurion in\nour Gospel reading remarks:\n‘8For I also am a man set under authority, with soldiers under me; and I\nsay to one, “Go,” and he goes, and to another, “Come,” and he comes,\nand to my slave, “Do this,” and the slave does it.’’ Of course susch\nstructures are open to an abuse of power whether in the work place, in\nthe Church or the family.\nPage 2 of 3\nPROPER 4 – Year C – 2016 - Trinity 1\nThe presence of the figure of Jesus in the story presents us with another model\nof hierarchy. A hierarchy not of power but of service.. You sense the\ndiscomfort of the centurion in the story, Jesus is not fitting in to his own\nunderstanding of hierarchy –\n‘Lord, do not trouble yourself, for I am not worthy to have you come\nunder my roof; 7therefore I did not presume to come to you.’\nOf course it is not just the centurion who found Jesus’ model of hierarchy\nchallenging – elsewhere in the Gospels we find the disciples struggling with\nthis one. They were brought up in a society of hierarchies – it is not surprising\nthat we see examples of them jockeying for position vis a vis each other. In a\npassage in St Mark’s Gospel that comes just before the final entry into\nJerusalem we read\n41 When the ten heard this, they began to be angry with James and\nJohn. 42 So Jesus called them and said to them, \"You know that\namong the Gentiles those whom they recognize as their rulers lord it\nover them, and their great ones are tyrants over them. 43 But it is not\nso among you; but whoever wishes to become great among you must\nbe your servant, 44 and whoever wishes to be first among you must\nbe slave of all. 45 For the Son of Man came not to be served but to\nserve, and to give his life a ransom for many.\" Mark 10:41-45\n43 But it is not so among you; but whoever wishes to become great among you\nmust be your servant, 44 and whoever wishes to be first among you must be\nslave of all. That was a lesson that the disciples had to learn. That is a lesson\nthat the Church has to learn afresh in each generation.\nPage 3 of 3\nPROPER 4 – Year C – 2016 - Trinity 1\nBut this is not just something Jesus tells his followers to do – it is part of his\nvery nature. Indeed the whole concept of Incarnation; God coming among us\nin human form, is an expression of this radical reversal of hierarchy.\nIn the words of Graham Kendrick’s Hymn\n3 Wisdom unsearchable,\nGod the invisible,\nlove indestructible,\nin frailty appears:\nLord of infinity,\nstooping so tenderly,\nlifts our humanity\nto the heights of his throne. Church Hymnal 228\nWe are called to model this in our own discipleship of making Christ present in\nthe world of today. Over these coming weeks of the season of Trinity we will\nbe following Luke’s account of the ministry of Jesus, his teaching, his healing,\nhis standing alongside those on the margins of his society, the leper, the tax\ncollector, the prostitute, the foreigner. As we do so we will reflect on our own\ncalling as followers of Jesus to be instruments of healing, of forgiveness, of\nreconciliation in the world of today. Let us hear afresh Paul’s words to his\nbeloved Philippians as he wrote:\n5 Let the same mind be in you that was in Christ Jesus,\n6 who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7 but emptied himself,\ntaking the form of a slave, Phil 2:5-7\n1 May the mind of Christ my Saviour\nlive in me from day to day,\nby his love and power controlling\nall I do and say. Irish Church Hymnal 636"
    }
}