{
    "title": "The Web of Deceit",
    "date": "2018-07-29",
    "blurb": "Kevin reflects on the story of David, Bathsheba, and Uriah, highlighting the dangers of deceit and the consequences of abusing power. He emphasizes the importance of moral accountability and integrity, drawing parallels between biblical times and contemporary society. The sermon calls for a reconnection with spiritual heritage and moral compass, urging the Christian community to align faith with action.",
    "raw_text": "There is an old saying from my childhood that goes along the lines:\n\n> 'O what a tangled web we weave\n> When first we practice to deceive.'\n\nIt was good advice to stick to the truth even if that were to be at some cost to ourselves. Failure to follow that maxim can lead us into all sorts of trouble. It has taken its toll on relationships, it has spelt the end of many a political career.\n\nOver these last few weeks we have been reading the story of David, from his anointing as the youngest boy in his family by Samuel through to his becoming King of the Kingdoms of Israel and Judah, the establishment of Jerusalem as his capital.\n\nLast week, with David now securely in power, we read of the message given to Nathan concerning the place of David and the house of David as an everlasting line. The Psalm that we used alongside this reading, the central portion of Psalm 83, spoke of God's steadfast love and faithfulness, an enduring love that would not be ultimately frustrated by any human failings.\n\nOur Old Testament reading for today is very different. If our lesson last week spoke of the reign of David as a Golden Age, the events related in today's reading must rank as among the darkest in the reign of David.\n\nIt is a story of a selfish recklessness and abuse of power both in the seduction of Bathsheba and also in the removal of Uriah. David, seeking to provide a cover for his sin, brings Uriah back from the battlefield. Uriah stays true to the soldier's commitment of the time to renounce all contact with his wife while on active service. For this act of faithfulness, David consigns him to certain death on his return to the front line.\n\nThe psalm that is set for our use in Psalm 14. It begins with the very stark statement:\n\n> 1 The fool has said in his heart, 'There | is no | God.'\n> Corrupt are they, and abominable in their wickedness;\n> there is | no one | that does | good.'\n\nOur Old Testament Lesson exhibits David as a genuinely foolish man. In this passage we read of a man who has become so powerful that he behaves as one who was exempt from God's Law and could do as he pleases. His actions arising from this set in train a tale of destruction for his family. David acts as if there were no God; he acts as if there was no moral accountability. His, if you like, could be termed a 'practical atheism'.\n\nIn the verses of this Psalm, the psalmist explores the working out of the consequences of this in the life of the individual and the community. He identifies a strong link between what we have described as a 'practical atheism', a view that there is no moral accountability with a decline in community and personal standards in morality and justice.\n\nWe are talking of a society that has lost touch with its spiritual heritage, that has lost touch with who they were as a people called by God, redeemed by God. They had if you like lost their moral compass. This is where this story of David, and with it this particular psalm, is a story for all time.\n\nEvery group, every society needs its basic standards, its basic code. Many teachers, at the beginning of a new School year, will encourage their class to draw up its own code of behaviour – people are not to talk while others are speaking, they are to respect one another, they are to stay quiet while the teacher is speaking. This is to encourage the children to recognise that without rules, without a code of behaviour there is chaos and everyone suffers.\n\nLooking back in history we see evidence of societies, even of Empires, crumbling when they lose their way, lose sight of their moral compass. Many would look to the era of the 'Celtic Tiger' as a period in which Ireland lost its way as a society, a time in which values of community, of family, of integrity were undermined as we sought our identity, our security not in each other but in a growing materialism.\n\nAs Ireland moves back into greater prosperity, I feel, the Christian faith, the Christian community has a distinctive contribution to make. I recall a prayer that Dean Tom Salmon (Dean of Christchurch when I was first ordained) used to use either at the end or the beginning of many of his sermons.\n\n> O Lord, grant that what we say with our lips,\n> we may believe in our hearts,\n> and what we believe in our hearts,\n> we may show forth in our lives,\n> through Jesus Christ our Lord. Amen.\n\nIt is this holding together of faith and action that runs through our Old and New Testament Scriptures. We see it affirmed in the prophets, we see it undermined in the actions of David that we read of today. It is the power of simple witness, a holding together of what we profess and what we do in our homes, our places of recreation, our place of work. It is done through Christian men and women in the places where decisions are made, at the bedsides of our hospitals and nursing homes, in the shops and offices of our city, in the yacht club, the golf course, the sports field, in the schools where our children are taught, in the helping hand, in the listening ear as we bear our witness in word and deed to the Christ who calls us, who says to each one of us, 'As much as you did it to the least of these brothers and sisters of mine you did it to me.'\n\n'You are the light of the world. A city built on a hill cannot be hid. No one after lighting a lamp puts it under the bushel basket, but on the lampstand, and it gives light to all in the house. In the same way, let your light shine before others, so that they may see your good works and give glory to your Father in heaven. Matt 5:14ff",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper122018.txt",
        "raw_ocr_content": "Page 1 of 5\nPROPER 12 – 2018 – Year B – Trinity 9\nThere is an old saying from my childhood that goes along the lines:\n‘O what a tangled web we weave\nWhen first we practice to deceive.’\nIt was good advice to stick to the truth even if that were to be at some cost to\nourselves. Failure to follow that maxim can lead us into all sorts of trouble. It\nhas taken its toll on relationships, it has spelt the end of many a political career.\nOver these last few weeks we have been reading the story of David, from his\nanointing as the youngest boy in his family by Samuel through to his becoming\nKing of the Kingdoms of Israel and Judah, the establishment of Jerusalem as\nhis capital.\nLast week, with David now securely in power, we read of the message given to\nNathan concerning the place of David and the house of David as an everlasting\nline. The Psalm that we used alongside this reading, the central portion of\nPsalm 83, spoke of God’s steadfast love and faithfulness, an enduring love that\nwould not be ultimately frustrated by any human failings.\nOur Old Testament reading for today is very different. If our lesson last week\nspoke of the reign of David as a Golden Age, the events related in today’s\nreading must rank as among the darkest in the reign of David.\nIt is a story of a selfish recklessness and abuse of power both in the seduction\nof Bathsheba and also in the removal of Uriah. David, seeking to provide a\ncover for his sin, brings Uriah back from the battlefield. Uriah stays true to the\nPage 2 of 5\nPROPER 12 – 2018 – Year B – Trinity 9\nsoldier’s commitment of the time to renounce all contact with his wife while on\nactive service. For this act of faithfulness, David consigns him to certain death\non his return to the front line.\n‘O what a tangled web we weave\nWhen first we practice to deceive.’\nI spoke last week of the function of the Psalm in our liturgy to draw out the\nmeaning, the significance of the Old Testament Lesson. This week the psalm\nthat is set for our use in Psalm 14. It begins with the very stark statement:\n1 The fool has said in his heart, ‘There | is no | God.’ ♦\nCorrupt are they, and abominable in their wickedness;\nthere is | no one | that does | good.\nFrom the outset, this is far more than an expression of 21st Century intellectual\natheism. This is in their hearts; it is an internal decision manifesting itself not\nin speech, as you would in debate, but in actions, in attitudes.\nOur Old Testament Lesson exhibits David as a genuinely foolish man. In this\npassage we read of a man who has become so powerful that he behaves as one\nwho was exempt from God’s Law and could do as he pleases. His actions\narising from this set in train a tale of destruction for his family. David acts as if\nthere were no God; he acts as if there was no moral accountability. His, if you\nlike, could be termed a ‘practical atheism’.\nIn the verses of this Psalm, the psalmist explores the working out of the\nconsequences of this in the life of the individual and the community. He\nidentifies a strong link between what we have described as a ‘practical\natheism’, a view that there is no moral accountability with a decline in\nPage 3 of 5\nPROPER 12 – 2018 – Year B – Trinity 9\ncommunity and personal standards in morality and justice. He looks around at\nhis society, at the powerful trampling on the weak as if they were nothing.\n4 Have they no knowledge, those | evil|doers, ♦\nwho eat up my people as if they ate bread\nThe fool in his seeming omnipotence, in his seeming indifference to the weak\nand the powerless must ultimately learn that there is one who stands alongside\nthem. In this our psalm echoes words of the writer of Proverbs:\nThose who oppress the poor insult their Maker,\nbut those who are kind to the needy honour him.\nThe wicked are overthrown by their evildoing,\nbut the righteous find a refuge in their integrity.\nWisdom is at home in the mind of one who has understanding,\nbut it is not known in the heart of fools. Proverbs 14:31ff\nWe are talking of a society that has lost touch with its spiritual heritage, that\nhas lost touch with who they were as a people called by God, redeemed by\nGod.\nThey had if you like lost their moral compass. This is where this story of\nDavid, and with it this particular psalm, is a story for all time.\nEvery group, every society needs its basic standards, its basic code. Many\nteachers, at the beginning of a new School year, will encourage their class to\ndraw up its own code of behaviour – people are not to talk while others are\nspeaking, they are to respect one another, they are to stay quiet while the\nteacher is speaking. This is to encourage the children to recognise that without\nrules, without a code of behaviour there is chaos and everyone suffers.\nLooking back in history we see evidence of societies, even of Empires,\ncrumbling when they lose their way, lose sight of their moral compass. Many\nPage 4 of 5\nPROPER 12 – 2018 – Year B – Trinity 9\nwould look to the era of the ‘Celtic Tiger’ as a period in which Ireland lost its\nway as a society, a time in which values of community, of family, of integrity\nwere undermined as we sought our identity, our security not in each other but\nin a growing materialism.\nAs Ireland moves back into greater prosperity, I feel, the Christian faith, the\nChristian community has a distinctive contribution to make. I recall a prayer\nthat Dean Tom Salmon (Dean of Christchurch when I was first ordained) used\nto use either at the end or the beginning of many of his sermons.\nO Lord, grant that what we say with our lips,\nwe may believe in our hearts,\nand what we believe in our hearts,\nwe may show forth in our lives,\nthrough Jesus Christ our Lord. Amen.\nIt is this holding together of faith and action that runs through our Old and New\nTestament Scriptures. We see it affirmed in the prophets, we see it undermined\nin the actions of David that we read of today. It is the power of simple witness,\na holding together of what we profess and what we do in our homes, our places\nof recreation, our place of work. It is done through Christian men and women\nin the places where decisions are made, at the bedsides of our hospitals and\nnursing homes, in the shops and offices of our city, in the yacht club, the golf\ncourse, the sports field, in the schools where our children are taught, in the\nhelping hand, in the listening ear as we bear our witness in word and deed to\nthe Christ who calls us, who says to each one of us, ‘As much as you did it to\nthe least of these brothers and sisters of mine you did it to me.’\n“You are the light of the world. A city built on a hill cannot be hid. No\none after lighting a lamp puts it under the bushel basket, but on the\nlampstand, and it gives light to all in the house. In the same way, let\nPage 5 of 5\nPROPER 12 – 2018 – Year B – Trinity 9\nyour light shine before others, so that they may see your good works\nand give glory to your Father in heaven. Matt 5:14ff"
    }
}