{
    "title": "Who is my Neighbour?",
    "date": "2016-07-10",
    "blurb": "This sermon explores the question 'Who is my neighbour?' as asked by a lawyer to Jesus. It delves into the concept of loving your neighbour as yourself and how that relates to one's self-identity. The sermon challenges the listener to look beyond their immediate community and extend their love and concern to all, regardless of their differences.",
    "raw_text": "Who is my neighbour?\n\nThat was the question a lawyer asked Jesus. There had been a discussion. 'Teacher, what must I do to inherit eternal life?' That was the sort of question that religious people ask. Jesus got the man to answer his own question. 'You shall love the Lord your God with all your heart, and with all your soul, and with all your strength, and with all your mind; and your neighbour as yourself.'\n\nFor the lawyer, loving God would be straightforward enough – there were plenty of regulations about worship, the right sacrifices to offer, the right prayers to say and what tithes you should pay. When it comes to neighbour things get a bit more complicated. It is not just a matter of 'Love your neighbour' but 'Love your neighbour as yourself' – that is not quite so straightforward. So who is my neighbour; who is it that I am meant to love as myself?\n\nIf you think about it; when I ask that, I am actually asking a question about myself, about how I see myself. I’m asking what lies at the heart of my own identity, my own self-understanding? The lawyer in our Gospel reading was living in a first century Jewish society in which there would have been concerns about ritual purity. Mix with the wrong sort of people and you would find yourself declared unclean and so not able to take part in the worship of the community. So you would keep clear of the wrong sort, you would steer clear of people like lepers. You would not keep company with people like tax-collectors, known sinners or Gentiles – and definitely not Samaritans. You would not have shared a meal with any of these people.\n\nThen with Judaism of the day, groups such as the Pharisees would have tended to restrict social contact to fellow Pharisees. In that society the concept of neighbour, the one I am obliged to love as my self would have been determined by how I saw myself, my understanding of my own identity.\n\nIt is easy to look askance at people of those day, that is just as true today as it was then. 'Who is my neighbour? Who am I?' What lies at the heart of my own identity, my own self understanding? Am I just a member of my own family? If that is the case then only my own flesh and blood is my neighbour. We could extend this and ask am I just a member of my own community. If that is so I am still restricting any claim on my concern to that of my own community. The poor, the alien, those who are different, the drug addict, the asylum seeker, the single parent, the traveller have no claim to my concern.\n\nBut the Bible is quite clear on this one, it tells me that I am more than a member of my family, more than a member of my own community, I am one made in the image of God. That applies not just to me but to everyone else on this planet. Moreover I am told that in Christ there is neither Jew nor Greek, slave nor free, male nor female. I am challenged to look beyond myself, beyond the familiar.\n\nOf course in times of uncertainty, we can forget this fundamental truth. In times of civil unrest, in times of economic uncertainty, the outsider, the one who is different can be viewed as a threat. And so in the wake of the Celtic Tiger’s demise we saw an increase in racism, in attacks on those from outside.\n\nAs a native of England, one thing that has saddened me about the recent Referendum was how the fear of the outsider was used quite cynically by some on the leave side to bolster their case. But just as circumstances can cause a narrowing of vision as to who is my neighbour, adversity can cause that circle to be widened. I recall from my time in Ahoghill Parish, which would have been quite a divided community, several people returning from inpatient treatment in Belvoir Park Cancer Hospital with stories of friendships formed across barriers of creed and political conviction. As one lady put it to me, 'Whatever our differences, we were all on the same path.'\n\nI am reminded that as my own vision of neighbourhood is narrowed, my own self understanding of what it means to be made in the image of God, my common humanity with all who walk this earth is diminished – and I am the poorer.\n\nOf course it was into a divided society that Jesus spoke the Parable of the Good Samaritan, a story that has become so familiar that it has lost something of its power to shock and to challenge that it had when it was first told.\n\nThe story of a pilgrim from Jerusalem who travelled a lonely highway, beaten, robbed and left for dead. There are the representatives of his own community, to whom he would have looked for support, who pass him by, not wanting to get involved, fearful for their own safety. It is a Samaritan, despised by every right thinking Jew who stops, who takes the risk of involvement, binding up his wounds and taking him to an inn; who makes an open ended commitment, telling the inn keeper, whatever more it costs you, I will repay you.\n\nJesus asked the lawyer, 'Who was neighbour to the man who fell among thieves?' 'The one who helped him.' 'Go and do the same.' The question was changed – from 'Who is my neighbour' to 'Who can I be a neighbour to'; from that of what am I obliged to do; to that of what can I do for those who need my help?\n\nEarlier, as we read the passage from Amos with the prophet’s vision of God setting a plumbline against his people and our psalm, we began to think of the importance of letting what we read and hear set the tone of our lives.\n\nThis parable of the good Samaritan is one of those stories that challenges me to look at the way I think and act in the light of Christ; to move out from the familiar security of family and community to find a common humanity with those who are different; to reach out in love and concern, to bring something of the love of Christ to bear on this wounded and hurting world. and so proclaim in my own lives the truth of the Lawyer’s words 'You shall love the Lord your God with all your heart, and with all your soul, and with all your strength, and with all your mind; and your neighbour as yourself.'\n\nGrant that what we say with our lips, we may believe in our hearts and what we believe in our hearts we may practice in our lives. Through Christ our Lord. Amen.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper102016.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 10 – Year C – 2016 – Trinity 7\n(Raheny & Coolock)\nWho is my neighbour?\nThat was the question a lawyer asked Jesus. There had been a discussion.\n‘Teacher, what must I do to inherit eternal life?’ That was the sort of question\nthat religious people ask. Jesus got the man to answer his own question.\n‘You shall love the Lord your God with all your heart, and with all\nyour soul, and with all your strength, and with all your mind; and\nyour neighbour as yourself.’\nFor the lawyer, loving God would be straightforward enough – there were\nplenty of regulations about worship, the right sacrifices to offer, the right\nprayers to say and what tithes you should pay. When it comes to neighbour\nthings get a bit more complicated. It is not just a matter of ‘Love your\nneighbour’ but ‘Love your neighbour as yourself’ – that is not quite so\nstraightforward. So who is my neighbour; who is it that I am meant to love as\nmyself?\nIf you think about it; when I ask that, I am actually asking a question about\nmyself, about how I see myself. I’m asking what lies at the heart of my own\nidentity, my own self-understanding? The lawyer in our Gospel reading was\nliving in a first century Jewish society in which there would have been\nconcerns about ritual purity. Mix with the wrong sort of people and you would\nfind yourself declared unclean and so not able to take part in the worship of the\ncommunity. So you would keep clear of the wrong sort, you would steer clear\nof people like lepers. You would not keep company with people like tax-\ncollectors, known sinners or Gentiles – and definitely not Samaritans. You\nwould not have shared a meal with any of these people.\nThen with Judaism of the day, groups such as the Pharisees would have tended\nto restrict social contact to fellow Pharisees. In that society the concept of\nPage 2 of 4\nPROPER 10 – Year C – 2016 – Trinity 7\n(Raheny & Coolock)\nneighbour, the one I am obliged to love as my self would have been determined\nby how I saw myself, my understanding of my own identity.\nIt is easy to look askance at people of those day, that is just as true today as it\nwas then. ‘Who is my neighbour? Who am I?’ What lies at the heart of my\nown identity, my own self understanding? Am I just a member of my own\nfamily? If that is the case then only my own flesh and blood is my neighbour.\nWe could extend this and ask am I just a member of my own community. If\nthat is so I am still restricting any claim on my concern to that of my own\ncommunity. The poor, the alien, those who are different, the drug addict, the\nasylum seeker, the single parent, the traveller have no claim to my concern.\nBut the Bible is quite clear on this one, it tells me that I am more than a\nmember of my family, more than a member of my own community, I am one\nmade in the image of God. That applies not just to me but to everyone else on\nthis planet. Moreover I am told that in Christ there is neither Jew nor Greek,\nslave nor free, male nor female. I am challenged to look beyond myself,\nbeyond the familiar\nOf course in times of uncertainty, we can forget this fundamental truth. In\ntimes of civil unrest, in times of economic uncertainty, the outsider, the one\nwho is different can be viewed as a threat. And so in the wake of the Celtic\nTiger’s demise we saw an increase in racism, in attacks on those from outside\nAs a native of England, one thing that has saddened me about the recent\nReferendum was how the fear of the outsider was used quite cynically by some\non the leave side to bolster their case. But just as circumstances can cause a\nnarrowing of vision as to who is my neighbour, adversity can cause that circle\nto be widened. I recall from my time in Ahoghill Parish, which would have\nbeen quite a divided community, several people returning from inpatient\ntreatment in Belvoir Park Cancer Hospital with stories of friendships formed\nPage 3 of 4\nPROPER 10 – Year C – 2016 – Trinity 7\n(Raheny & Coolock)\nacross barriers of creed and political conviction. As one lady put it to me,\n‘Whatever our differences, we were all on the same path.’\nI am reminded that as my own vision of neighbourhood is narrowed, my own\nself understanding of what it means to be made in the image of God, my\ncommon humanity with all who walk this earth is diminished – and I am the\npoorer.\nOf course it was into a divided society that Jesus spoke the Parable of the Good\nSamaritan, a story that has become so familiar that it has lost something of its\npower to shock and to challenge that it had when it was first told.\nThe story of a pilgrim from Jerusalem who travelled a lonely highway, beaten,\nrobbed and left for dead. There are the representatives of his own community,\nto whom he would have looked for support, who pass him by, not wanting to\nget involved, fearful for their own safety. It is a Samaritan, despised by every\nright thinking Jew who stops, who takes the risk of involvement, binding up his\nwounds and taking him to an inn; who makes an open ended commitment,\ntelling the inn keeper, whatever more it costs you, I will repay you.\nJesus asked the lawyer, ‘Who was neighbour to the man who fell among\nthieves?’ ‘The one who helped him.’ ‘Go and do the same.’ The question was\nchanged – from ‘Who is my neighbour’ to ‘Who can I be a neighbour to’;\nfrom that of what am I obliged to do; to that of what can I do for those who\nneed my help?\nEarlier, as we read the passage from Amos with the prophet’s vision of God\nsetting a plumbline against his people and our psalm, we began to think of the\nimportance of letting what we read and hear set the tone of our lives.\nPage 4 of 4\nPROPER 10 – Year C – 2016 – Trinity 7\n(Raheny & Coolock)\nThis parable of the good Samaritan is one of those stories that challenges me to\nlook at the way I think and act in the light of Christ; to move out from the\nfamiliar security of family and community to find a common humanity with\nthose who are different; to reach out in love and concern, to bring something\nof the love of Christ to bear on this wounded and hurting world. and so\nproclaim in my own lives the truth of the Lawyer’s words\n‘You shall love the Lord your God with all your heart, and with all\nyour soul, and with all your strength, and with all your mind; and\nyour neighbour as yourself.’\nGrant that what we say with our lips, we may believe in our hearts and\nwhat we believe in our hearts we may practice in our lives. Through\nChrist our Lord. Amen"
    }
}