{
    "title": "Let Your Light Shine",
    "date": "2017-11-19",
    "blurb": "The sermon 'Let Your Light Shine' emphasizes the importance of letting the love of God shine through us in all that we do. It draws a parallel between fireflies being recognized by their light and how people can recognize us by the light of God within us. The message encourages us to be consistent in our faith, not just on Sundays but every day, and to show which side we are on by our actions and dedication.",
    "raw_text": "2nd Sunday before Advent – Year A (Family Service)\n\nLet your light shine\n\nTeacher:\nHi Sunny. How are you today?\n\nSunny:\nI’m doing great! I just got back from visiting my grandmother.\n\nTeacher:\nThat sounds like fun.\n\nSunny:\nIt was. I had a great time.\n\nTeacher:\nWhat did you do?\n\nSunny:\nI got to go out in her backyard to catch fireflies. The only problem was I needed a jar first, and I couldn’t find one.\n\nTeacher:\nOh, really?\n\nSunny:\nAll I could find was a new jar of peanut butter. So I asked Grandma if I could make us some sandwiches.\n\nTeacher:\nBut two sandwiches won’t empty out a full jar of peanut butter.\n\nSunny:\nI know. But 37 will.\n\nTeacher:\nYou didn’t. (Sunny just looks at the Teacher, Teacher sighs) You did.\n\nSunny:\nI brought some back if you want one.\n\nTeacher:\nOk, so you got your jar. Did you catch any fireflies?\n\nSunny:\nNot at first. When I went outside it was still a little light, so I had to wait. That was kind of annoying, because there were these bugs flying all around. But then I saw one.\n\nTeacher:\nA firefly?\n\nSunny:\nYeah, or at least I thought it was. It was a bug, and it was yellow. And I had it right in my hand. The only problem was that it turned out to be a yellow jacket.\n\nTeacher:\n(shudders) Ouch.\n\nSunny:\nYou know when people say that yellow jackets will only bother you if you bother them first? Well, I guess that bothered him!\n\nTeacher:\nSo what did you do?\n\nSunny:\nSomething kind of like this. (starts bouncing up and down) AAAAAH! OUCH! OUCH! GRANDMA! AAAAH!\n\nTeacher:\nDid you stop after that?\n\nSunny:\nNo, after Grandma looked at my hand I went back out. And those bugs were still flying around. It was getting dark by now, so they got out their flashlights.\n\nTeacher:\nWho? The bugs?\n\nSunny:\nThat’s what I thought at first. They were flying around everywhere, and they reminded me of little sparks of fire. Flying fire. Fire that flies. Then it hit me, those were fireflies!\n\nTeacher:\nNo kidding.\n\nSunny:\nNo, they really were! I’m so smart.\n\nTeacher:\nHow did you know?\n\nSunny:\nBecause of their lights.\n\nTeacher:\nDid you know, people can tell who we are by our light too.\n\nSunny:\n(looking out at the kids) You mean they light up too? This I’ve want to see!\n\nTeacher:\nBut we don’t light up the same way the bugs do. Jesus said to let our light shine. We do that by letting the love of God shine through us in all that we do. That’s how we can let people know that we have Him in our hearts.\n\nSunny:\nSounds like a bright idea. Now if you’ll excuse me, I think I’ll go have a sandwich.\n\nStay with this idea of people knowing who we are.\n\nAnyone at the Aviva last night? Anyone wearing a South African shirt?\n\nPeople want to show who they support – people in Ireland and South Africa shirts.\n\nIn our Old Testament lesson – Joshua asking people ‘Whose side are you on?’ Which gods are you going to serve?\n\nAs for me and my household – we will serve the Lord.\n\nNext Sunday including 2 baptisms in our service of dedication.\n\nAt the heart of the service of Baptism is the question ‘Do you turn to Christ?’ – whose side are you on? Who are you going to serve?\n\nArchbishop will be back in February for the Service of Confirmation.\n\nThis time he will be asking these questions not of the parents and godparents of 2 babies – he will be asking them of our confirmation candidates.\n\nOur classes are now underway and a couple of the class have been helping this morning. Over the next few weeks we will be thinking through the questions the Archbishop will be asking, what it means to be a follower of Jesus.\n\nAs the puppet show demonstrated – we know a firefly by the light that it shines.\n\nGospel reading reminds us of the importance of letting our light shine – not just sometimes but all the time.\n\nFollowing Jesus not a part time business – not just something we do on a Sunday – we do it from the moment we get up to the moment we go to sleep.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper272017 - family service.txt",
        "raw_ocr_content": "Page 1 of 3\n2nd Sunday before Advent – Year A (Family Service)\nLet your light shine\nTeacher:\nHi Sunny. How are you today?\nSunny:\nI’m doing great! I just got back from visiting my grandmother.\nTeacher:\nThat sounds like fun.\nSunny:\nIt was. I had a great time.\nTeacher:\nWhat did you do?\nSunny:\nI got to go out in her backyard to catch fireflies. The only problem was I needed a jar first, and I couldn’t find one.\nTeacher:\nOh, really?\nSunny:\nAll I could find was a new jar of peanut butter. So I asked Grandma if I could make us some sandwiches.\nTeacher:\nBut two sandwiches won’t empty out a full jar of peanut butter.\nSunny:\nI know. But 37 will.\nTeacher:\nYou didn’t. (Sunny just looks at the Teacher, Teacher sighs) You did.\nSunny:\nI brought some back if you want one.\nTeacher:\nOk, so you got your jar. Did you catch any fireflies?\nSunny:\nNot at first. When I went outside it was still a little light, so I had to wait. That was kind of annoying, because there were these\nbugs flying all around. But then I saw one.\nTeacher:\nA firefly?\nSunny:\nYeah, or at least I thought it was. It was a bug, and it was yellow. And I had it right in my hand. The only problem was that it\nturned out to be a yellow jacket.\nTeacher:\n(shudders) Ouch.\nSunny:\nYou know when people say that yellow jackets will only bother you if you bother them first? Well, I guess that bothered him!\nTeacher:\nSo what did you do?\nSunny:\nSomething kind of like this. (starts bouncing up and down) AAAAAH! OUCH! OUCH! GRANDMA! AAAAH!\nTeacher:\nDid you stop after that?\nSunny:\nNo, after Grandma looked at my hand I went back out. And those bugs were still flying around. It was getting dark by now, so\nthey got out their flashlights.\nTeacher:\nWho? The bugs?\nSunny:\nThat’s what I thought at first. They were flying around everywhere, and they reminded me of little sparks of fire. Flying fire.\nFire that flies. Then it hit me, those were fireflies!\nTeacher:\nNo kidding.\nSunny:\nNo, they really were! I’m so smart.\nTeacher:\nHow did you know?\nSunny:\nBecause of their lights.\nTeacher:\nDid you know, people can tell who we are by our light too.\nSunny:\n(looking out at the kids) You mean they light up too? This I’ve want to see!\nTeacher:\nBut we don’t light up the same way the bugs do. Jesus said to let our light shine. We do that by letting the love of God shine\nthrough us in all that we do. That’s how we can let people know that we have Him in our hearts.\nSunny:\nSounds like a bright idea. Now if you’ll excuse me, I think I’ll go have a sandwich.\nby Sarah Brown\nPage 2 of 3\n2nd Sunday before Advent – Year A (Family Service)\nStay with this idea of people knowing who we are.\nAnyone at the Aviva last night? Anyone wearing a South African shirt?\nPeople want to show who they support – people in Ireland and South\nAfrica shirts.\nIn our Old Testament lesson – Joshua asking people ‘Whose side are you\non?’ Which gods are you going to serve?\nAs for me and my household – we will serve the Lord.\nNext Sunday including 2 baptisms in our service of dedication.\nAt the heart of the service of Baptism is the question ‘Do you turn to\nChrist?’ – whose side are you on? Who are you going to serve?\nArchbishop will be back in February for the Service of Confirmation.\nThis time he will be asking these questions not of the parents and\ngodparents of 2 babies – he will be asking them of our confirmation\ncandidates.\nOur classes are now underway and a couple of the class have been helping\nthis morning. Over the next few weeks we will be thinking through the\nPage 3 of 3\n2nd Sunday before Advent – Year A (Family Service)\nquestions the Archbishop will be asking, what it means to be a follower of\nJesus.\nAs the puppet show demonstrated – we know a firefly by the light that it\nshines.\nGospel reading reminds us of the importance of letting our light shine –\nnot just sometimes but all the time.\nFollowing Jesus not a part time business – not just something we do on a\nSunday – we do it from the moment we get up to the moment we go to\nsleep."
    }
}