{
    "title": "Back to Church Sunday",
    "date": "2012-09-30",
    "blurb": "Kevin's sermon on 'Back to Church Sunday' emphasizes the importance of community and belonging within the church family. He reflects on the diverse nature of families and the church, and the need for both young and old to support each other in faith. The sermon also includes a personal anecdote about the impact of a kind couple on Kevin's own journey back to church.",
    "raw_text": "### Proper 21 – 2012- year B\n### BACK TO CHURCH SUNDAY\n\nOn this Sunday, churches across Britain and Ireland and beyond are observing this Sunday as 'Back to Church Sunday'. In part this is a recognition that there has been a drift away from Church in the post-war years. That drift occurs for a number of reasons. In an increasingly secular society, people feel less and less connection with the Church and the message of the Church. There are people who have been hurt by the Church. I don't just mean the institutional Church, I am thinking of people who have been hurt within Parish communities, felt they haven't been understood or valued, and have retired to lick their wounds. Then there are people who have drifted away, taken time out if you like, and mean to come back but the time never seems right to take that step back in.\n\nBack to Church Sunday is designed as an opportunity to step back through the door. Those of you for whom this Church has always been your place of worship, or for whom worship has been a regular activity, do not always appreciate how difficult that step can be. As a non-churched teenager I can still recall how difficult that first step was – churches can be difficult places to step back into. In our friendship with each other we can fail to notice the stranger in our midst. I will always recall with great affection a delightful old couple, Mr & Mrs Bennett who on that first morning invited me into their pew and unobtrusively guided me through the service.\n\nAt the 11:00 service we are incorporating the sacrament of Baptism. On Sundays such as this I would often reflect on the promises. Today I want to reflect on the Pastoral introduction printed on page 357 of your Prayer Books which begins, 'Baptism marks the beginning of a journey with God which continues for the rest of our lives, the first step in response to God's love.' This is a journey that we undertake not as individuals but as a family.\n\nFamilies are by their very nature fairly diverse – there are differences, differences in age, in outlook, of preferences. I think back to childhood holidays in Bray. On the last night Dad would take us to a café on the front and he would slip sixpence into the jukebox and allow us to pick the pop tunes he inwardly loathed. My father had very different tastes that very much spoke to him. I recall on the night after Mum died, sitting with him at home and he reached for a piece that told the story of the journey of the soul from life to death. He put it on the record player and said, 'Just listen to this.' The mood of the music changed as it progressed. Bright and cheerful as the child began to grow, stronger and more assertive as it moved from youth towards adulthood. More reflective as the responsibilities of later life were assumed. More somber as the end approached then a sudden exhilaration as the soul progressed from the darkness of death towards the light of eternity. At the end he just smiled and said that is where your Mum is now. In our difference there was a unity.\n\nOf course families can drift apart, losing touch with each other for a while, families can have disagreements but there is a fundamental unity that brings us together to share in times of sorrow, times of celebration. Families need each other. Parents can often say as the children grow older, 'My children don't need me anymore.' They may not need us in quite the same way as they did in the past – but there is a different need, a different belonging.\n\nYoung and old need each other. We need each other in our families, we need each other in our Church. The other night I met with confirmation candidates and their parents. I spoke of their move towards independence, that they were coming to a point in their lives where faith had to become their faith, not a second hand version of mine or their parents, if faith was to be a faith that took them through life. So, as with many other areas of life, this was a time for asking questions, for exploring ideas. I also reminded the youngsters that their parents were once their age, facing many of the same issues and challenges in life, seeking their own independence, that they had a wisdom and experience in life that they should not ignore, that they would do well to draw on.\n\nGoing to the wider family of the Church, this family that is on this journey of faith through life, we need each other. We need people who will ask why, who will ask the awkward questions, why do we believe this, why do we do things this way, who will challenge our complacency. To say simply 'Because we have always done it this way' is in itself no answer at all. We need people with wisdom and experience, who have asked the questions and found answers that have sustained them, whose faith has been tested by the ups and downs of life, whose lives bears something of the mark of the Christ they have sought to serve and follow.\n\nSo on this Back to Church Sunday, on this day on which Aengus and Lisa bring their son Luke for Baptism, we welcome one another as fellow members of the Body of Christ, fellow travellers on a journey of a lifetime. We don't just tolerate, we don't just accommodate, we value one another in our diversity, diversity of age, of outlook, of life experiences, as young and old we seek to build each other up in our faith and service of the God and Father of our Lord Jesus Christ.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper21back2church2012.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 21 – 2012- year B\nBACK TO CHURCH SUNDAY\nOn this Sunday, churches across Britain and Ireland and beyond are observing\nthis Sunday as ‘Back to Church Sunday’. In part this is a recognition that there\nhas been a drift away from Church in the post war years. That drift occurs for\na number of reasons. In an increasingly secular society people feel less and\nless connection with the Church and the message of the Church. There are\npeople who have been hurt by the Church. I don’t just mean the institutional\nChurch, I am thinking of people who have been hurt within Parish\ncommunities, felt they haven’t been understood or valued, and have retired to\nlick their wounds. Then there are people who have drifted away, taken time out\nif you like, and mean to come back but the time never seems right to take that\nstep back in.\nBack to Church Sunday is designed as an opportunity to step back through the\ndoor. Those of you for whom this Church has always been your place of\nworship, or for whom worship has been a regular activity, do not always\nappreciate how difficult that step can be. As a non churched teenager I can still\nrecall how difficult that first step was – churches can be difficult places to step\nback into. In our friendship with each other we can fail to notice the stranger\nin our midst. I will always recall with great affection a delightful old couple,\nMr & Mrs Bennett who on that first morning invited me into their pew and\nunobtrusively guided me through the service.\nAt the 11:00 service we are incorporating the sacrament of Baptism. On\nSundays such as this I would often reflect on the promises. Today I want to\nreflect on the Pastoral introduction printed on page 357 of your Prayer Books\nwhich begins. ‘Baptism marks the beginning of a journey with God which\ncontinues for the rest of our lives, the first step in response to God’s love.’\nThis is a journey that we undertake not as individuals but as a family.\nPage 2 of 3\nProper 21 – 2012- year B\nBACK TO CHURCH SUNDAY\nFamilies are by their very nature fairly diverse – there are differences,\ndifferences in age, in outlook, of preferences. I think back to child hood\nholidays in Bray. On the last night Dad would take us to a café on the front\nand he would slip sixpence into the juke box and allow us to pick the pop tunes\nhe inwardly loathed. My father had very different tastes that very much spoke\nto him. I recall on the night after Mum died, sitting with him at home and he\nreached for a piece that told the story of the journey of the soul from life to\ndeath. He put it on the record player and said, ‘Just listen to this.’ The mood\nof the music changed as it progressed. Bright and cheerful as the child began\nto grow, stronger and more assertive as it moved from youth towards adult\nhood. More reflective as the responsibilities of later life were assumed. More\nsombre as the end approached then a sudden exhilaration as the soul progressed\nfrom the darkness of death towards the light of eternity. At the end he just\nsmiled and said that is where your Mum is now. In our difference there was a\nunity.\nOf course families can drift apart, losing touch with each other for a while,\nfamilies can have disagreements but there is a fundamental unity that brings us\ntogether to share in times of sorrow, times of celebration. Families need each\nother. Parents can often say as the children grow older, ‘My children don’t\nneed me any more.’ They may not need us in quite the same way as they did in\nthe past – but there is a different need, a different belonging.\nYoung and old need each other. We need each other in our families, we need\neach other in our Church. The other night I met with confirmation candidates\nand their parents. I spoke of their move towards independence, that they were\ncoming to a point in their lives where faith had to become their faith, not a\nsecond hand version of mine or their parents, if faith was to be a faith that took\nthem through life. So, as with many other areas of life, this was a time for\nPage 3 of 3\nProper 21 – 2012- year B\nBACK TO CHURCH SUNDAY\nasking questions, for exploring ideas. I also reminded the youngsters that their\nparents were once their age, facing many of the same issues and challenges in\nlife, seeking their own independence, that they had a wisdom and experience in\nlife that they should not ignore, that they would do well to draw on.\nGoing to the wider family of the Church, this family that is on this journey of\nfaith through life, we need each other. We need people who will ask why, who\nwill ask the awkward questions, why do we believe this, why do we do things\nthis way, who will challenge our complacency. To say simply ‘Because we\nhave always done it this way’ is in itself no answer at all. We need people with\nwisdom and experience, who have asked the questions and found answers that\nhave sustained them, whose faith has been tested by the ups and downs of life,\nwhose lives bears something of the mark of the Christ they have sought to\nserve and follow.\nSo on this Back to Church Sunday, on this day on which Aengus and Lisa\nbring their son Luke for Baptism, we welcome one another as fellow members\nof the Body of Christ, fellow travellers on a journey of a life time. We don’t\njust tolerate, we don’t just accommodate, we value one another in our diversity,\ndiversity of age, of outlook, of life experiences, as young and old we seek to\nbuild each other up in our faith and service of the God and Father of our Lord\nJesus Christ."
    }
}