{
    "title": "Companionship and Faith",
    "date": "2015-10-04",
    "blurb": "Kevin explores the essence of companionship and its relation to faith. He reflects on the importance of humor, trust, and the ability to be oneself in friendships and life partnerships. The sermon also delves into the concept of Jesus as a companion on life's journey, emphasizing the humanity of Jesus and his understanding of our experiences. Through the sacrament of Baptism, Kevin reminds us that we are not alone on this journey, as Jesus is with us in our trials and choices.",
    "raw_text": "PROPER 22 – Year B – 2015 – Trinity 18\n\nWhat do we look for in companions, in life partners? Rachel came across something a while back that we have both reflected on quite a bit since. 'We value our friends not because of their ability to amuse us but because of our ability to amuse them.' The more I think about that I realize this is a sign of empathy, an understanding, a realization that we are on the same wavelength. There is something about humor, our sense of humor that is very personal, that says something about us and so to share that with someone else says something about a bond of personalities, of individuals.\n\nBut of course there is more to friendship than just laughing together. We look for someone we can trust, with whom we can share feelings, with whom we can be ourselves. We cannot do that with everyone and we are truly blessed when we find that for it means that we are not alone.\n\nThe marriage service has some lovely insights into human friendship, human love. I often find myself returning to one of the intercessions in that service:\n\n> May their life together be a witness to your love in this troubled world;\n> may unity overcome division, forgiveness heal injury, and joy triumph over sorrow,\n\nand I would put it alongside a prayer that the couple would offer for each other at the end of the service:\n\n> God of tenderness and strength,\n> you have brought our paths together\n> and led us to this day;\n> go with us now as we travel through good times,\n> through trouble or through change.\n> Bless our home, our partings and our meetings.\n> Make us worthy of each other's best,\n> and tender with each other's dreams,\n> trusting in your love in Jesus Christ. Amen.\n\nI like them because both of them link their love for each other with Christ's love for them as individuals and as a couple.\n\nI want to stay with this theme of companionship. At the 11:00 service we are celebrating the sacrament of Baptism. In our books the service is preceded by a pastoral introduction which begins with the words:\n\n> Baptism marks the beginning of a journey with God which continues for the rest of our lives, the first response to God's love.\n\nA journey with God, a journey that we do not undertake alone. In our order of readings, between now and Advent, we will be reading a series of passages from the Letter to the Hebrews. There is a thread that runs through all of these passages that speak of Jesus as our companion along the road of life.\n\nWe begin today with a reflection on the humanity of Jesus. The one by whom and through whom all things are made comes among us in the person of Jesus. Jesus, being human, knows, really knows what it is to be human, what it is to be me. And so, like a dear friend I find I can share with him my hopes, my fears, my joys and my pain, knowing that he understands for he himself has known what it is to laugh and to cry, what it is to be afraid, to be misunderstood, what it is to suffer and to die.\n\nThen as this letter to the Hebrews continues we are drawn into a deeper reflection on Jesus our companion, the pioneer of our faith. As human beings we have the blessing and the turmoil of choice. We are free agents and as free agents we can choose, our friends, our companions, we can choose what we are going to do with our lives, the choice between good and bad. Sometimes those choices are straightforward, sometimes they are fraught with difficulty as we struggle between what we know may be right and what deep down we really want to do. We find ourselves agonizing with Paul:\n\n> So I find it to be a law that when I want to do what is good, evil lies close at hand. Rom 7:21\n\nThat can be a very lonely place – and we are reminded that he is with us even there as one who has been tempted in every way as we are. He is with me in my moments of trial and yes, even in my moments of failure.\n\n> He is able to deal gently with the ignorant and wayward, since he himself is subject to weakness; Heb 5:2\n\nThen, in the language of Old Testament sacrifice, our writer leads us into an understanding of Jesus breaking down every barrier between man and God. So that, together with our writer:\n\n> Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Heb 4:16\n\nThis is the God I meet in the person of Jesus. This is the one who has promised to be with me always, in all my doubts and certainties, in all my joys and sorrows, in all my strengths and weaknesses, even unto the very end of time.\n\nMay we, may the child we baptize this day, come to find in him a companion, a strength and stay, a source of strength, of forgiveness, of healing at every stage in life as, in the closing words of the Introduction to the Service of Baptism, we journey into the fullness of God's love.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper222015.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 22 – Year B – 2015 – Trinity 18\nWhat do we look for in companions, in life partners? Rachel came across\nsomething a while back that we have both reflected on quite a bit since.\n‘We value our friends not because of their ability to amuse us but\nbecause of our ability to amuse them’.\nThe more I think about that I realise this is a sign of an empathy, an\nunderstanding, a realisation that we are on the same wavelength. There is\nsomething about humour, our sense of humour that is very personal, that says\nsomething about us and so to share that with someone else says something\nabout a bond of personalities, of individuals.\nBut of course there is more to friendship that just laughing together. We look\nfor someone we can trust, with whom we can share feelings, with whom we\ncan be ourselves. We cannot do that with everyone and we are truly blessed\nwhen we find that for it means that we are not alone.\nThe marriage service has some lovely insights into human friendship, human\nlove. I often find myself returning to one of the intercessions in that service\nMay their life together be a witness to your love in this troubled world;\nmay unity overcome division, forgiveness heal injury, and joy triumph over sorrow,\nand I would put it alongside a prayer that the couple would offer for each other\nat the end of the service\nGod of tenderness and strength,\nyou have brought our paths together\nand led us to this day;\ngo with us now as we travel through good times,\nthrough trouble or through change.\nBless our home, our partings and our meetings.\nMake us worthy of each other’s best,\nand tender with each other’s dreams,\ntrusting in your love in Jesus Christ. Amen.\nPage 2 of 3\nPROPER 22 – Year B – 2015 – Trinity 18\nI like them because both of them link their love for each other with Christ’s\nlove for them as individuals and as a couple.\nI want to stay with this theme of companionship. At the 11:00 service we are\ncelebrating the sacrament of Baptism. In our books the service is preceded by\na pastoral introduction which begins with the words:\nBaptism marks the beginning of a journey with God which\ncontinues for the rest of our lives, the first response to God’s love.\nA journey with God, a journey that we do not undertake alone. In our order of\nreadings, between now and Advent, we will be reading a series of passages\nfrom the Letter to the Hebrews. There is a thread that runs through all of these\npassages that speak of Jesus as our companion along the road of life.\nWe begin today with a reflection on the humanity of Jesus. The one by whom\nand through whom all things are made comes among us in the person of Jesus.\nJesus, being human, knows, really knows what it is to be human, what it is to\nbe me. And so, like a dear friend I find I can share with him my hopes, my\nfears, my joys and my pain, knowing that he understands for he himself has\nknown what it is to laugh and to cry, what it is to be afraid, to be\nmisunderstood, what it is to suffer and to die.\nthen as this letter to the Hebrews continues we are drawn into a deeper\nreflection on Jesus our companion, the pioneer of our faith. As human beings\nwe have the blessing and the turmoil of choice. We are free agents and as free\nagents we can choose, our friends, our companions, we can choose what we are\nPage 3 of 3\nPROPER 22 – Year B – 2015 – Trinity 18\ngoing to do with our lives, the choice between good and bad. Sometimes those\nchoices are straightforward, sometimes they are fraught with difficulty as we\nstruggle between what we know may be right and what deep down we really\nwant to do. We find ourselves agonising with Paul:\nSo I find it to be a law that when I want to do what is good, evil lies\nclose at hand. Rom 7:21\nThat can be a very lonely place – and we are reminded that he is with us even\nthere as one who has been tempted in every way as we are. He is with me in\nmy moments of trial and yes, even in my moments of failure.\n2 He is able to deal gently with the ignorant and wayward, since he\nhimself is subject to weakness; Heb 5:2\nThen, in the language of Old Testament sacrifice, our writer leads us into an\nunderstanding of Jesus breaking down every barrier between man and God. So\nthat, together with our writer:\n16 Let us therefore approach the throne of grace with boldness, so that\nwe may receive mercy and find grace to help in time of need. Heb 4:16\nThis is the God I meet in the person of Jesus. This is the one who has promised\nto be with me always, in all my doubts and certainties, in all my joys and\nsorrows, in all my strengths and weaknesses, even unto the very end of time.\nMay we, may the child we baptise this day, come to find in him a companion, a\nstrength and stay, a source of strength, of forgiveness, of healing at every stage\nin life as, in the closing words of the Introduction to the Service of Baptism, we\njourney into the fullness of God’s love."
    }
}