{
    "title": "The Injustice of Grace",
    "date": "2011-09-18",
    "blurb": "Kevin's sermon explores the theme of God's provision to a rebellious and undeserving people, as illustrated in the story of manna in the wilderness and the Parable of the Labourers in the Vineyard. He emphasizes the 'injustice of grace,' highlighting that God's grace is not based on our merit but is a gift that challenges our notions of fairness. The sermon also addresses the importance of accepting each other before God, avoiding judgment, and embracing the diversity within the Christian community.",
    "raw_text": "### PROPER 20 – 2011 – year A – Trinity 16\n\nThis week our Old Testament lesson is a continuation in our reading of the Exodus story that lies at the heart of the Old Testament. It is a story of redemption, of rebellion, a story of highs and lows as a people journey from slavery in Egypt to freedom in the promised land. This week we find the people complaining to Moses – why did you bring us out of Egypt to die of hunger in the desert. It is almost as if the suffering in Egypt had never happened. They look back to the days in Egypt with something approaching nostalgia, preferring the certainties of slavery to the uncertainties of freedom.\n\nIn the story that follows, the God who had redeemed them continues to make provision for them in the gift of manna – a provision that will continue through all the ups and downs of the journey in the wilderness and on into the Promised Land.\n\nIt is this theme of God's gracious provision to an often rebellious and undeserving people that I want to carry on through into our reflection on our Gospel reading, the Parable of the Labourers in the Vineyard. This parable of Jesus is both familiar and troubling in that at the heart of the story there seems to lie a fundamental unfairness, dare I say injustice, as those who spent the day lying in the sun are paid the same as those who worked all through the heat of the day. To rub salt into the wound, when the latter complain they are rebuked. People will rationalise it by saying, 'Oh, the owner would know that these are family men with families to feed.' That may be true but it actually misses the point. At the heart of this story is the injustice of grace.\n\nWhen I say the injustice of grace, it is to emphasise the point that God's grace, God's love for you and for me is not dependant on my own worth or deserving. We acknowledge that every time we come to the communion rails in the Prayer of Humble Access, 'We do not presume to come to this your table trusting in our own righteousness but in your manifold and great mercies.' Grace is by its very nature gift. It actually cuts across all lines of justice to new beginnings, new starts, in our life before God.\n\nThis parable takes us into the whole issue of accepting each other before God. It addresses issues of grace – not just in how they apply to us in our relationship with God but also in our relationship with others before God. The issue that troubled the first workers was not their wages – for those had been agreed. What troubled them was that those who appeared later received the same – they are envious of the generosity shown to others. We have no problem with God's grace shown to us – the problem comes when we contemplate who else God seems to be showing grace to – people who don't seem to be measuring up.\n\nIt is of course an old story repeated several times in Scripture. Jonah sat on the hill overlooking the ancient city of Nineveh and fumed when God spared the city – in his eyes they did not deserve God's mercy. In the Parable of the Prodigal Son, the older brother thought the father a doting old fool when the father welcomed the younger Prodigal son home with open arms – as far as he was concerned he had had his chances and he had blown them. The Pharisee at prayer in the parable of the Pharisee and the Publican thanks God that he at least is not like the sinful publican. All these testify to a lingering feeling of merit in our own understanding of our position before God that flies in the face of grace as God's gift.\n\nThis story with its message of God's choice of those he chooses to welcome or reward and with it our failure to recognise that grace really is a gift and not a reward for good behaviour, these all raise other issues. There is that very human tendency to pass comment, pass judgement on others who differ from us. We can all be a bit smug, a bit condescending at times on issues that do not lie at the heart of the Gospel. Within a Christian community such as ours there are people with a wide range of experiences, of worship preferences, of theological views, of views on political and lifestyle issues, what I have referred to in the past as the 'grey areas' of Christian life, issues of human sexuality. Issues on which it is perfectly possible for Christians to hold sincerely held, differing opinions. This does not mean we cannot argue, even passionately, about these things. What we cannot do is pass judgement on one another.\n\nTo quote again the words of that well known woolly headed liberal, Oliver Cromwell as he argued with some even more hard headed Scots; 'I beseech you, in the bowels of Christ, think it possible you may be mistaken.' None of us has the total picture, we all see through a glass darkly. We each stand before God as ones made in the image of God, each with our own individual strengths and weaknesses, each recipients of his grace. So whether we have come to labour in the vineyard early or late, let us honour one another in the name of Christ and encourage and build each other up as members of the Body of Christ in this place.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper202011.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 20 – 2011 – year A – Trinity 16\nThis week our Old Testament lesson is a continuation in our reading of the\nExodus story that lies at the heart of the Old Testament. It is a story of\nredemption, of rebellion, a story of highs and lows as a people journey from\nslavery in Egypt to freedom in the promised land. This week we find the\npeople complaining to Moses – why did you bring us out of Egypt to die of\nhunger in the desert. It is almost as if the suffering in Egypt had never\nhappened. They look back to the days in Egypt with something approaching\nnostalgia, preferring the certainties of slavery to the uncertainties of freedom.\nIn the story that follows, the God who had redeemed them continues to make\nprovision for them in the gift of manna – a provision that will continue through\nall the ups and downs of the journey in the wilderness and on into the Promised\nLand.\nIt is this theme of God’s gracious provision to an often rebellious and\nundeserving people that I want to carry on through into our reflection on our\nGospel reading, the Parable of the Labourers in the Vineyard. This parable of\nJesus is both familiar and troubling in that at the heart of the story there seems\nto lie a fundamental unfairness, dare I say injustice, as those who spent the day\nlying in the sun are paid the same as those who worked all through the heat of\nthe day. To rub salt into the wound, when the latter complain they are rebuked.\nPeople will rationalise it by saying , ‘Oh, the owner would know that these are\nfamily men with families to feed.’ That may be true but it actually misses the\npoint. At the heart of this story is the injustice of grace.\nWhen I say the injustice of grace, it is to emphasise the point that God’s grace,\nGod’s love for you and for me is not dependant on my own worth or deserving.\nPage 2 of 3\nPROPER 20 – 2011 – year A – Trinity 16\nWe acknowledge that every time we come to the communion rails in the Prayer\nof Humble Access, ‘We do not presume to come to this your table trusting in\nour own righteousness but in your manifold and great mercies.’ Grace is by its\nvery nature gift. It actually cuts across all lines of justice to new beginnings,\nnew starts, in our life before God.\nThis parable takes us into the whole issue of accepting each other before God.\nIt addresses issues of grace – not just in how they apply to us in our\nrelationship with God but also in our relationship with others before God. The\nissue that troubled the first workers was not their wages – for those had been\nagreed. What troubled them was that those who appeared later received the\nsame – they are envious of the generosity shown to others. We have no\nproblem with God’s grace shown to us – the problem comes when we\ncontemplate who else God seems to be showing grace to – people who don’t\nseem to be measuring up.\nIt is of course an old story repeated several times in Scripture. Jonah sat on the\nhill overlooking the ancient city of Nineveh and fumed when God spared the\ncity – in his eyes they did not deserve God’s mercy. In the Parable of the\nProdigal Son, the older brother thought the father a doting old fool when the\nfather welcomed the younger Prodigal son home with open arms – as far as he\nwas concerned he had had his chances and he had blown them. The Pharisee at\nprayer in the parable of the Pharisee and the Publican thanks God that he at\nleast is not like the sinful publican. All these testify to a lingering feeling of\nmerit in our own understanding of our position before God that flies in the face\nof grace as God’s gift.\nPage 3 of 3\nPROPER 20 – 2011 – year A – Trinity 16\nThis story with its message of God’s choice of those he chooses to welcome or\nreward and with it our failure to recognise that grace really is a gift and not a\nreward for good behaviour, these all raise other issues. There is that very\nhuman tendency to pass comment, pass judgement on others who differ from\nus. We can all be a bit smug, a bit condescending at times on issues that do not\nlie at the heart of the Gospel. Within a Christian community such as ours there\nare people with a wide range of experiences, of worship preferences, of\ntheological views, of views on political and lifestyle issues, what I have\nreferred to in the past as the ‘grey areas’ of Christian life, issues of human\nsexuality. Issues on which it is perfectly possible for Christians to hold\nsincerely held, differing opinions. This does not mean we cannot argue, even\npassionately, about these things. What we cannot do is pass judgement on one\nanother.\nTo quote again the words of that well known woolly headed liberal, Oliver\nCromwell as he argued with some even more hard headed Scots; ‘I beseech\nyou, in the bowels of Christ, think it possible you may be mistaken.’ None of\nus has the total picture, we all see through a glass darkly. We each stand\nbefore God as ones made in the image of God, each with our own individual\nstrengths and weaknesses, each recipients of his grace. So whether we have\ncome to labour in the vineyard early or late, let us honour one another in the\nname of Christ and encourage and build each other up as members of the Body\nof Christ in this place."
    }
}