{
    "title": "Grace Amidst Imperfection",
    "date": "2008-07-13",
    "blurb": "Kevin reflects on the challenges within the Anglican Communion, particularly the debates on human sexuality and women's ministry. He draws parallels between the biblical story of Jacob and the Church's journey, emphasizing grace as the key element that allows God to work through human frailty. The sermon encourages embracing our imperfections and prejudices as God works through us to further His kingdom.",
    "raw_text": "Proper 10 – 2008 – year A – Trinity 8\n\nYou could certainly say that this has been a difficult time for the Anglican Communion. The whole build up to the forthcoming Lambeth Conference has been fraught with difficulty. It has been dominated by issues of human sexuality, the nature of authority in the church. What does it mean for two churches to be in communion with each other? At what point do differences become so great that it is no longer possible or meaningful to talk of the relationship in terms of communion or even impaired communion? It is now likely, despite the best efforts of Archbishop Rowan Williams that many bishops will not attend.\n\nThen of course, in the past week, the whole debate around the ministry of women in the Church was reignited as the General Synod of the Church of England voted to allow the consecration of women to the Episcopate. A decision incidentally taken by the Church of Ireland back in 1990 when we voted at the same time to ordain women to the priesthood. There is once again talk of people feeling they cannot remain in the Church of England and the Roman Catholic Church has described the move as an obstacle to further reconciliation.\n\nAll reminders, I suppose, if ever we needed them, of the frailty and imperfection of the Christian Church. And yet we continue to confess each Sunday, as we recite the historic Creeds, our belief in the one holy, catholic and apostolic Church. We retain a conviction that the Church is the Body of Christ; that the Church not just retains a link with the historical Jesus but in each generation continues the work of Jesus; called to be, in the words of Teresa of Avila, the hands, the lips, the feet of Christ in the world of today.\n\nSo the Church is both a divine institution but, at the same time, a very human institution. Yet who can doubt that God has worked in and through his very human and fallible Church. Of course at the heart of the doctrine of the Incarnation is the conviction that in and through the person, the humanity of Jesus of Nazareth God was present in the world, experiencing in himself the reality of our human nature.\n\nIt is at this point that I find that the story of Jacob, which we embark upon today in our Old Testament Lessons, speaks to our own situation. In a very real sense the story of Jacob is our story, both as individuals and as Church. I have a CD at home by the American singer John Prine called 'In Spite of Ourselves' – 'In spite of ourselves, we’ll end up sitting on a rainbow; in spite of ourselves we will be the big door prize.' Almost in spite of himself, Jacob finds his place in the story of redemption. The story of Jacob, his relationship with his twin brother Esau, his father in law Laban, is a complex one. It is a story of intrigues, of jealousies, of resentments. Jacob, the younger of the brothers, obtains the birthright due to Esau, leaving a rift between the brothers. Jacob, captivated by Rachel’s beauty, is tricked into marrying her older sister; such is his devotion to Rachel, he works for another seven years.\n\nJacob, in common with his forbears, is presented as a very real human being, with all his strengths and failings – yet it is through Jacob that God chooses to act. The key to it all lies in that word 'grace'. Every stage in the saga of Abraham, Isaac and Jacob involves an outworking of God’s grace. God is not limited by human frailty, God works in and through the imperfection of human nature.\n\nAs I remarked last week, there is a profound statement in a book by Philip Yanci that we have at home, 'What is so amazing about grace?' This book is something of a polemic against a spirituality that on the one hand proclaims justification by faith and then proceeds to pile on a whole catalogue of rules. 'There is nothing I can do to make God love me more and there is nothing I can do to make God love me less.' That is grace, that is the free unmerited love of God to which I can only respond.\n\nGod did work through Jacob, in all his frailty, as he did through David, through Peter, through Paul, in all their ambiguities. All these found themselves in service, despite of themselves. David, the youngest of the sons of Jesse, was painfully aware of his own times of failure before God. Of course Peter, so enthusiastic and at times so weak; Paul, arch persecutor of the Church, who could be so severe and hard to work with at times and at other times so caring. God could take each one of them and make up what was lacking.\n\nGod can and does work through us. He is not limited by our own particular frailties or failings. Like Jacob, David, Peter and Paul we bring to life, bring to our own service of God and his Church our own prejudices, our own conscious and unconscious agendas – even the way society, the way life has moulded us. This was recognised by the Anglican Reformers as they drew up the 39 Articles, that nestle in the small print at the back of our Prayer Books. Article 26 concerns the Ministry of Unworthy Ministers.\n\nIn spite of ourselves, we end up sitting on the rainbow, in spite of ourselves we are the big door prize.\n\nThe late Brother Roger of Taize had a lovely insight when he spoke of God working through the littleness, the poverty of our faith. For all we can offer is the faith we have – God works in and through that to bring us further on. God takes us in all our ambiguity.\n\nAs we are reminded each Christmas as we hear those wonderful words of the Prologue of St John’s Gospel: 'But to all who received him, who believed in his name, he gave power to become children of God, who were born, not of blood or of the will of the flesh or of the will of man, but of God.'\n\nStanding before him, like Jacob, like David, like Peter and Paul, we offer ourselves, as we are, in spite of ourselves, in his service in all our strengths and weaknesses, in all our prejudices and petty agendas. We pray that he may take our service in all its inadequacy, as individuals and as our deeply flawed and wonderful Church; that he may make up what is lacking in the power of his Holy Spirit; that his Kingdom may be advanced in our homes, in our community, in this world God has called us to serve in his name – that in spite of ourselves, we end up sitting on the rainbow.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper102008.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 10 – 2008 – year A – Trinity 8\nYou could certainly say that this has been a difficult time for the Anglican Communion.\nThe whole build up to the forthcoming Lambeth Conference has been fraught with\ndifficulty. It has been dominated by issues of human sexuality, the nature of authority in\nthe church. What does it mean for two churches to be in communion with each other? At\nwhat point do differences become so great that it is no longer possible or meaningful to\ntalk of the relationship in terms of communion or even impaired communion? It is now\nlikely, despite the best efforts of Archbishop Rowan Williams that many bishops will not\nattend.\nThen of course, in the past week, the whole debate around the ministry of women in the\nChurch was reignited as the General Synod of the Church of England voted to allow the\nconsecration of women to the Episcopate. A decision incidentally taken by the Church of\nIreland back in 1990 when we voted at the same time to ordain women to the priesthood.\nThere is once again talk of people feeling they cannot remain in the Church of England\nand the Roman Catholic Church has described the move as an obstacle to further\nreconciliation.\nAll reminders, I suppose, if ever we needed them, of the frailty and imperfection of the\nChristian Church. And yet we continue to confess each Sunday, as we recite the historic\nCreeds, our belief in the one holy, catholic and apostolic Church. We retain a conviction\nthat the Church is the Body of Christ; that the Church not just retains a link with the\nhistorical Jesus but in each generation continues the work of Jesus; called to be, in the\nwords of Teresa of Avila, the hands, the lips, the feet of Christ in the world of today.\nSo the Church is both a divine institution but, at the same time, a very human institution.\nYet who can doubt that God has worked in and through his very human and fallible\nChurch. Of course at the heart of the doctrine of the Incarnation is the conviction that in\nand through the person, the humanity of Jesus of Nazareth God was present in the world,\nexperiencing in himself the reality of our human nature.\nPage 2 of 4\nProper 10 – 2008 – year A – Trinity 8\nIt is at this point that I find that the story of Jacob, which we embark upon today in our\nOld Testament Lessons, speaks to our own situation. In a very real sense the story of\nJacob is our story, both as individuals and as Church. I have a CD at home by the\nAmerican singer John Prine called ‘In Spite of Ourselves’ – ‘In spite of ourselves, we’ll\nend up sitting on a rainbow; in spite of ourselves we will be the big door prize.’ Almost\nin spite of himself, Jacob finds his place in the story of redemption. The story of Jacob,\nhis relationship with his twin brother Esau, his father in law Laban, is a complex one. It is\na story of intrigues, of jealousies, of resentments. Jacob, the younger of the brothers,\nobtains the birthright due to Esau, leaving a rift between the brothers. Jacob, captivated by\nRachel’s beauty, is tricked into marrying her older sister; such is his devotion to Rachel,\nhe works for another seven years.\nJacob, in common with his forbears, is presented as a very real human being, with all his\nstrengths and failings – yet it is through Jacob that God chooses to act. The key to it all\nlies in that word ‘grace’. Every stage in the saga of Abraham, Isaac and Jacob involves an\noutworking of God’s grace. God is not limited by human frailty, God works in and\nthrough the imperfection of human nature.\nAs I remarked last week, there is a profound statement in a book by Philip Yanci that we\nhave at home, ‘What is so amazing about grace?’ This book is something of a polemic\nagainst a spirituality that on the one hand proclaims justification by faith and then\nproceeds to pile on a whole catalogue of rules. ‘There is nothing I can do to make God\nlove me more and there is nothing I can do to make God love me less.’ That is grace, that\nis the free unmerited love of God to which I can only respond.\nGod did work through Jacob, in all his frailty, as he did through David, through Peter,\nthrough Paul, in all their ambiguities. All these found themselves in service, despite of\nthemselves. David, the youngest of the sons of Jesse, was painfully aware of his own\ntimes of failure before God. Of course Peter, so enthusiastic and at times so weak; Paul,\nPage 3 of 4\nProper 10 – 2008 – year A – Trinity 8\narch persecutor of the Church, who could be so severe and hard to work with at times and\nat other times so caring. God could take each one of them and make up what was lacking.\nGod can and does work through us. He is not limited by our own particular frailties or\nfailings. Like Jacob, David, Peter and Paul we bring to life, bring to our own service of\nGod and his Church our own prejudices, our own conscious and unconscious agendas –\neven the way society, the way life has moulded us. This was recognised by the Anglican\nReformers as they drew up the 39 Articles, that nestle in the small print at the back of our\nPrayer Books. Article 26 concerns the Ministry of Unworthy Ministers (p 784)\nAlthough in the visible Church the evil be ever mingled with the good, and\nsometimes the evil have chief authority in the Ministration of the Word and\nSacraments, yet forasmuch as they do not the same in their own name, but\nin Christ's, and do minister by his commission and authority, we may use\ntheir Ministry, both in hearing the Word of God, and in receiving the\nSacraments. Neither is the effect of Christ's ordinance taken away by their\nwickedness, nor the grace of God's gifts diminished from such as by faith,\nand rightly, do receive the Sacraments ministered unto them; which be\neffectual, because of Christ's institution and promise, although they be\nministered by evil men.\nIn spite of ourselves, we end up sitting on the rainbow, in spite of ourselves we are the big\ndoor prize.\nThe late Brother Roger of Taize had a lovely insight when he spoke of God working\nthrough the littleness, the poverty of our faith. For all we can offer is the faith we have –\nGod works in and through that to bring us further on. God takes us in all our ambiguity.\nAs we are reminded each Christmas as we hear those wonderful words of the Prologue of\nSt John’s Gospel:\nPage 4 of 4\nProper 10 – 2008 – year A – Trinity 8\n‘But to all who received him, who believed in his name, he gave power to\nbecome children of God, who were born, not of blood or of the will of the\nflesh or of the will of man, but of God.’\nStanding before him, like Jacob, like David, like Peter and Paul, we offer ourselves, as we\nare, in spite of ourselves, in his service in all our strengths and weaknesses, in all our\nprejudices and petty agendas. We pray that he may take our service in all its inadequacy,\nas individuals and as our deeply flawed and wonderful Church; that he may make up what\nis lacking in the power of his Holy Spirit; that his Kingdom may be advanced in our\nhomes, in our community, in this world God has called us to serve in his name – that in\nspite of ourselves, we end up sitting on the rainbow."
    }
}