{
    "title": "The Parable of the Sower",
    "date": "2020-07-12",
    "blurb": "Kevin reflects on the Parable of the Sower, drawing parallels between gardening and nurturing one's faith. He emphasizes the importance of preparing oneself as fertile soil for God's teachings, finding stillness, and embracing the scriptures. The sermon encourages confidence in God's purposes, highlighting the potential for a bountiful spiritual harvest despite challenges.",
    "raw_text": "PROPER 10 – Year A – 2020 – Trinity 5\n\nAs you are by now well aware, my gardening skills are somewhat limited. The one aspect of gardening that does give me pleasure is vegetable gardening – not that I am very good at it but I do get a thrill out of eating my own rhubarb, salads, peas, beans and, even one year, the odd carrot. So when we moved into the current Rectory just over ten years ago, I set to work on an area at the end of the back garden that had been separated off as a vegetable patch.\n\nBack in those days the soil was quite a heavy clay, which meant it was hard to dig, hard to drain. Over the years of digging, weeding out roots of briar, scutch grass, bind weed, nettles and other undesirables, putting in garden and kitchen compost as well as manure the soil has now broken down and become much easier to work and more productive.\n\nThis morning we read as our Gospel reading the parable of the sower. It is one of those parables that would have spoken into the lives and experiences of his hearers. If they weren’t farmers themselves the farmer sowing his seed would have been a familiar sight. We all know (at least I certainly do) of seeds that do and seeds that don’t strike root and produce.\n\nAs Jesus tells the story, and enlarges on it later to the disciples, the story addresses the age old problem of why some people respond to Jesus’ teaching and some do not. The temptation is for us who are more confident in our faith to look down on those who aren’t, or those who have fallen away.\n\nThe parable itself ends with, 'Let anyone with ears, listen.' But then later on, when he is just with the disciples, Jesus says, 'Hear then the parable of the sower.' He puts the matter directly to them; 'How are you hearing this?' Not why aren’t others but how are you hearing this?\n\nThat puts the question back on me. How do I hear? What sort of soil am I in which God can plant his seed? Does my hearing lead to an understanding of what Jesus is talking about? I go back to my vegetable garden. Over the years I have had to work at the soil in that patch of ground, to make it more productive, more receptive to the seeds, to the seedlings I plant in it.\n\nIn my own following of Jesus, I must be prepared to do a bit of cultivation myself – setting aside some of that most precious commodity, our time. Time to be quiet, time to be still. I’m not talking of elaborate spiritual exercises – just finding space, finding time to be still.\n\nMaybe something that has come out of this prolonged period of lock down, of enforced inactivity, is that we have learned we don’t have to rush all the time, we don’t have to fill every moment of the day with activity – there is a time to rest, to reflect, to pray, to give God the soil in which to plant his seed.\n\nI know that we have only just started into the season of Trinity. On the Sunday on which this season ends we have that lovely Collect associated with Bible Sunday:\n\n> Blessed Lord,\n> who caused all holy Scriptures to be written for our learning:\n> help us so to hear them,\n> to read, mark, learn and inwardly digest them\n> that, through patience, and the comfort of your holy word,\n> we may embrace and for ever hold fast\n> the hope of everlasting life,\n> which you have given us in our Saviour Jesus Christ.\n\nI love the way in which those words roll off the tongue:- help us so to hear them, to read, mark, learn and inwardly digest them that, through patience, and the comfort of your holy word, we may embrace and for ever hold fast the hope of everlasting life.\n\nTake time, to reflect, to savour, to absorb.\n\nReturning to the parable, there is the final outcome of the harvest, 100 fold, 60 fold, 30 fold. The farmer of those days would have felt he was doing well if he got a harvest that was 7 or 10 fold. So, the final scene is not of birds snatching away seed on the path, rootless plants from seeds falling among the rocks, withering in the scorching sun, spindly stalks smothered by weeds but of a rich bountiful harvest. To the original disciples who were so few among so many, Matthew’s community dwarfed by its surroundings, the final scene is an encouragement to great confidence in God’s purposes. Though their numbers are small, the opposition hard to take, the rejections of their message painful, the remarkable size of the harvest is a reminder of the riches of God’s blessing.\n\nThe writer of the Letter of James tells us: 'Draw near to God and he will draw near to you.' James 4:8. Spend time in his presence and God will take what we have to offer and work in it and through it. I recall as a young curate talking to the late Canon Billy Wynne. Billy had just gone to St Ann’s and had started their daily lunchtime communion services. I asked him how many he was getting. I have never forgotten his reply. 'Brew,' he said, with a patient smile on his face, 'I will plant the seed – God will give the increase.' And a ministry started that continues to this day.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper102020.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 10 – Year A – 2020 – Trinity 5\nAs you are by now well aware, my gardening skills are somewhat limited. The\none aspect of gardening that does give me pleasure is vegetable gardening –\nnot that I am very good at it but I do get a thrill out of eating my own rhubarb,\nsalads, peas, beans and, even one year, the odd carrot.\nSo when we moved into the current Rectory just over ten years ago, I set to\nwork on an area at the end of the back garden that had been separated off as a\nvegetable patch.\nBack in those days the soil was quite a heavy clay, which meant it was hard to\ndig, hard to drain. Over the years of digging, weeding out roots of briar, scutch\ngrass, bind weed, nettles and other undesirables, putting in garden and kitchen\ncompost as well as manure the soil has now broken down and become much\neasier to work and more productive.\nThis morning we read as our Gospel reading the parable of the sower. It is one\nof those parables that would have spoken into the lives and experiences of his\nhearers. If they weren’t farmers themselves the farmer sowing his seed would\nhave been a familiar sight. We all know (at least I certainly do) of seeds that\ndo and seeds that don’t strike root and produce.\nAs Jesus tells the story, and enlarges on it later to the disciples, the story\naddresses the age old problem of why some people respond to Jesus’ teaching\nand some do not. The temptation is for us who are more confident in our faith\nto look down on those who aren’t, or those who have fallen away.\nPage 2 of 4\nPROPER 10 – Year A – 2020 – Trinity 5\nThe parable itself ends with, ‘Let anyone with ears, listen.’ But then later on,\nwhen he is just with the disciples, Jesus says, ‘Hear then the parable of the\nsower.’ He puts the matter directly to them; ‘How are you hearing this?’ Not\nwhy aren’t others but how are you hearing this?\nThat puts the question back on me. How do I hear? What sort of soil am I in\nwhich God can plant his seed? Does my hearing lead to an understanding of\nwhat Jesus is talking about? I go back to my vegetable garden. Over the years\nI have had to work at the soil in that patch of ground, to make it more\nproductive, more receptive to the seeds, to the seedlings I plant in it.\nIn my own following of Jesus, I must be prepared to do a bit of cultivation\nmyself – setting aside some of that most precious commodity, our time. Time\nto be quiet, time to be still. I’m not talking of elaborate spiritual exercises –\njust finding space, finding time to be still.\nMaybe something that has come out of this prolonged period of lock down, of\nenforced inactivity, is that we have learned we don’t have to rush all the time,\nwe don’t have to fill every moment of the day with activity – there is a time to\nrest, to reflect, to pray, to give God the soil in which to plant his seed.\nI know that we have only just started into the season of Trinity. On the Sunday\non which this season ends we have that lovely Collect associated with Bible\nSunday:\nBlessed Lord,\nwho caused all holy Scriptures to be written for our learning:\nhelp us so to hear them,\nPage 3 of 4\nPROPER 10 – Year A – 2020 – Trinity 5\nto read, mark, learn and inwardly digest them\nthat, through patience, and the comfort of your holy word,\nwe may embrace and for ever hold fast\nthe hope of everlasting life,\nwhich you have given us in our Saviour Jesus Christ.\nI love the way in which those words roll off the tongue:-\nhelp us so to hear them,\nto read, mark, learn and inwardly digest them\nthat, through patience, and the comfort of your holy word,\nwe may embrace and for ever hold fast\nthe hope of everlasting life,\nTake time, to reflect, to savour, to absorb.\nReturning to the parable, there is the final outcome of the harvest, 100 fold, 60\nfold, 30 fold. The farmer of those days would have felt he was doing well if he\ngot a harvest that was 7 or 10 fold. So, the final scene is not of birds snatching\naway seed on the path, rootless plants from seeds falling among the rocks,\nwithering in the scorching sun, spindly stalks smothered by weeds but of a rich\nbountiful harvest. To the original disciples who were so few among so many,\nMatthew’s community dwarfed by its surroundings, the final scene is an\nencouragement to great confidence in God’s purposes. Though their numbers\nare small, the opposition hard to take, the rejections of their message painful,\nthe remarkable size of the harvest is a reminder of the riches of God’s blessing.\nThe writer of the Letter of James tells us: ‘Draw near to God and he will draw\nnear to you.’ James 4:8. Spend time in his presence and God will take what we\nhave to offer and work in it and through it. I recall as a young curate talking to\nthe late Canon Billy Wynne. Billy had just gone to St Ann’s and had started\nPage 4 of 4\nPROPER 10 – Year A – 2020 – Trinity 5\ntheir daily lunchtime communion services. I asked him how many he was\ngetting. I have never forgotten his reply. ‘Brew,’ he said, with a patient smile\non his face, ‘I will plant the seed – God will give the increase.’ And a ministry\nstarted that continues to this day."
    }
}