{
    "title": "The Journey of Baptism",
    "date": "2009-07-12",
    "blurb": "Kevin reflects on the significance of Baptism, drawing inspiration from the late Archbishop Michael Ramsey. He emphasizes Baptism as the beginning of a lifelong journey in response to God's love. Through the metaphor of footprints and fingerprints, Kevin explores the marks we leave on others and the world. He concludes with a call to embody Christ's presence on earth, leaving Christ's footprints in our communities.",
    "raw_text": "As I said last week, during the course of this month we are having a series of Baptisms. Baptisms are lovely occasions of celebration as families celebrate the arrival of a new child in the family. They are occasions of inclusion as the local Parish community shares the joy of a family and welcomes the child into the Church.\n\nI am taking the opportunity of reflecting on the significance of Baptism for families, for the church, for us as individuals. In this regard I often think back to words of the late Archbishop Michael Ramsey, Archbishop of Canterbury as I was growing up, when he spoke of the whole of his Christian life as lived out in response to his Baptism; the promises of Baptism being a yardstick for life.\n\nLast Sunday we thought of Baptism in terms of a journey – in the words of the Pastoral Introduction to Baptism in the Prayer Book, 'Baptism marks the beginning of a journey, which continues for the rest of our lives, our first step in our response to God’s love.' I just want to continue that thought of my Christian life as a journey, thinking about what marks we leave upon the way.\n\nAs I walk down a footpath, I may leave a mark: That mark says someone with a size 12 shoe passed down this path – it will dry out and soon be gone. I may leave other, more permanent marks: That mark is unique to each one of us. Your fingerprint, my fingerprint are all different. When I leave a fingerprint it says I was there, I handled this item.\n\nOf course some footprints are more destructive: When I see the holes in my cabbage, when I see the signs of slugs near my plants I know who has been there and I can see the damage they have caused.\n\nThat set me thinking – 'What sort of footprints do we leave on our journey of life? What marks do we leave on the lives of others? What marks do we as parents leave on the lives of our children? What marks do we leave on the lives of our loved ones? Are they marks of our love, or marks of our selfishness, our thoughtlessness, our own inadequacy?'\n\nChurches, Parish communities can be places of great blessing but also of hurt as people have felt excluded, misunderstood. As we welcome this child into the fellowship of Christ’s Church today let it be an occasion of reflection of the welcome, the inclusion we offer to one another, the value we place on one another in the life of our Parish.\n\nI find myself returning again and again to that fundamental truth that we are the Body of Christ with the sacred responsibility placed upon us as individuals and as a community to speak and act for Christ in the world of today:\n\n> Christ has no body but yours,\n> No hands, no feet on earth but yours,\n> Yours are the eyes with which he looks\n> Compassion on this world,\n> Yours are the feet with which he walks to do good,\n> Yours are the hands, with which he blesses all the world.\n> Yours are the hands, yours are the feet,\n> Yours are the eyes, you are his body.\n> Christ has no body now but yours,\n> No hands, no feet on earth but yours,\n> Yours are the eyes with which he looks\n> compassion on this world.\n> Christ has no body now on earth but yours.\n\nWe can leave the footprints, the fingerprints of Christ on the life of another, on the community in which we live.\n\nAnd so in our welcome to this child today, Louise, on behalf of the congregation will say to baby Molly:\n\n'Together with all God’s people\nyou must explore the way of Jesus\nand grow in friendship with God,\nin love for his people,\nand in serving others.\nWith us you will listen to the word of God\nand receive the gifts of God.'\n\nThat is Molly’s Baptismal vocation, that is our Baptismal vocation; to explore the way of Jesus, to grow in friendship with God and in our love and service of his people, that we may in all our inadequacy be something of the lips, the hands, the feet of Christ. As we live in response to God’s love for us in Christ may we live the words of that lovely post communion prayer:\n\n> Father of all,\n> we give you thanks and praise,\n> that when we were still far off\n> you met us in your Son and brought us home.\n> Dying and living, he declared your love,\n> gave us grace, and opened the gate of glory.\n> May we who share Christ’s body live his risen life;\n> we who drink his cup bring life to others;\n> we whom the Spirit lights give light to the world.\n> Keep us firm in the hope you have set before us,\n> so we and all your children shall be free,\n> and the whole earth live to praise your name;\n> through Christ our Lord.\n> Amen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/Proper 10 - 2009.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 10 – Year B – 2009 – Trinity 5\nAs I said last week, during the course of this month we are having a series of Baptisms.\nBaptisms are lovely occasions of celebration as families celebrate the arrival of a new\nchild in the family. They are occasions of inclusion as the local Parish community shares\nthe joy of a family and welcomes the child into the Church.\nI am taking the opportunity of reflecting on the significance of Baptism for families, for\nthe church, for us as individuals. In this regard I often think back to words of the late\nArchbishop Michael Ramsey, Archbishop of Canterbury as I was growing up, when he\nspoke of the whole of his Christian life as lived out in response to his Baptism; the\npromises of Baptism being a yardstick for life.\nLast Sunday we thought of Baptism in terms of a journey – in the words of the Pastoral\nIntroduction to Baptism in the Prayer Book, ‘Baptism marks the beginning of a journey,\nwhich continues for the rest of our lives, our first step in our response to God’s love.’\nI just want to continue that thought of my Christian life as a journey, thinking about what\nmarks we leave upon the way.\nAs I walk down a footpath, I may leave a mark:\nSlide of Foot Print\nThat mark says someone with a size 12 shoe passed down this path – it will dry out and\nsoon be gone.\nI may leave other, more permanent marks:\nSlide of a fingerprint\nThat mark is unique to each one of us. Your fingerprint, my fingerprint are all different.\nWhen I leave a fingerprint it says I was there, I handled this item. Of course these can be\nused by the Gardai in proving that someone was at the scene of a crime, handled a knife,\nor gun or whatever.\nPage 2 of 3\nPROPER 10 – Year B – 2009 – Trinity 5\nOf course some footprints are more destructive:\nSlide of slug\nSlide of caterpillar\nWhen I see the holes in my cabbage, when I see the signs of slugs near my plants I know\nwho has been there and I can see the dame they have caused.\nThat set me thinking – ‘What sort of footprints do we leave on our journey of life? What\nmarks do we leave on the lives of others? What marks do we as parents leave on the lives\nof our children? What marks do we leave on the lives of our loved ones? Are they marks\nof our love, or marks of our selfishness, our thoughtlessness, our own inadequacy?\nChurches, Parish communities can be places of great blessing but also of hurt as people\nhave felt excluded, misunderstood. As we welcome this child into the fellowship of\nChrist’s Church today let it be an occasion of reflection of the welcome, the inclusion we\noffer to one another, the value we place on one another in the life of our Parish.\nI find myself returning again and again to that fundamental truth that we are the Body of\nChrist with the sacred responsibility place upon us as individuals and as a community to\nspeak and act for Christ in the world of today:\nSlide\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nSlide\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nSlide\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nPage 3 of 3\nPROPER 10 – Year B – 2009 – Trinity 5\nWe can leave the footprints, the fingerprints of Christ on the life of another, on the\ncommunity in which we live.\nAnd so in our welcome to this child today, Louise, on behalf of the congregation will say\nto baby Molly\nTogether with all God’s people\nyou must explore the way of Jesus\nand grow in friendship with God,\nin love for his people,\nand in serving others.\nWith us you will listen to the word of God\nand receive the gifts of God.\nThat is Molly’s Baptismal vocation, that is our Baptismal vocation; to explore the way of\nJesus, to grow in friendship with God and in our love and service of his people, that we\nmay in all our inadequacy be something of the lips, the hands, the feet of Christ. As we\nlive in response to God’s love for us in Christ may we live the words of that lovely post\ncommunion prayer:\nSlide\nFather of all,\nwe give you thanks and praise,\nthat when we were still far off\nyou met us in your Son and brought us home.\nDying and living, he declared your love,\ngave us grace, and opened the gate of glory.\nMay we who share Christ’s body live his risen life;\nwe who drink his cup bring life to others;\nwe whom the Spirit lights give light to the world.\nKeep us firm in the hope you have set before us,\nso we and all your children shall be free,\nand the whole earth live to praise your name;\nthrough Christ our Lord.\nAmen."
    }
}