{
    "title": "The Daffodil Minister",
    "date": "2017-10-08",
    "blurb": "Kevin reflects on the importance of staying motivated and encouraging others, using the story of a Presbyterian Minister who planted daffodils to leave a beautiful mark on his village. The sermon also touches on the community's efforts to repair the church roof, likening the task to eating an elephant in small pieces, and celebrates the togetherness and worship experienced during this time.",
    "raw_text": "## PROPER 22 – Family Service – Year A – 2017\n\nKevin shares a message about **Motivation** – staying focused and keeping at it when we are discouraged or face difficulties. He emphasizes the **Importance of encouraging others** and being the best person we can be. The Old Testament lesson of the giving of the 10 commandments is read, highlighting the best way to live with God and each other.\n\n> Kevin recounts the story of a Presbyterian Minister who, through simple acts of planting daffodil bulbs, left a lasting, beautiful mark on his village. This serves as a metaphor for how our small acts of service can have a significant impact on others' lives.\n\nThe sermon continues with the narrative of the church's roof repair, where the community worked together to overcome discouragement. Despite the challenges, they praised God and found joy in their worship and togetherness. The choir's contribution to the hymn singing is particularly appreciated.\n\nAs the congregation prepares to move back into the Parish Church, Kevin reminds them of the journey ahead. He draws a parallel to the people of Israel moving on from Mount Sinai, encouraging the community to continue their journey of witness and worship with God.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper222017famserv.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 22 – Family Service – Year A – 2017\nBurrow 6th Class service – each year there is a theme\nMotivation – staying focussed – keeping at it when we are\ndiscouraged, when we face difficulties.\nImportance of encouraging others\nbeing the best person we can be.\nOT lesson read of giving of the 10 commandments – God telling the\npeople the best way to live with him, the best way to live with each\nother.\nI just want to tell you of a Presbyterian Minister in a village about 20\nmiles from my last Parish of Ahoghill. He was in that congregation\nfor 50 years. He was a keen gardener and loved daffodils. Every time\nhe went out for a walk around the countryside he used to put a few\ndaffodil bulbs in his pocket. He would plant them in different places\nso that over the years the laneways around that village were lined with\ndaffodils. What you had over the years were simple, insignificant acts\nof service leaving a beautiful mark on that area.\nIn our service of God, in our service of each other, stay motivated,\nkeep at it, don’t be discouraged and you can leave a lovely mark on\nsomeone else’s life.\nWhen we were staring work on the Church I asked the youngsters in\nthe Burrow to produce some posters to encourage us. The hoardings\nare down now so we don’t see them but lots of people commented on\nPage 2 of 3\nPROPER 22 – Family Service – Year A – 2017\nthem with slogans like ‘Even though the roof looks odd you can still\npraise God.’\nDown at the School the other day I recalled how the whole job started.\nSlates started sliding off the roof one Sunday. We asked how much it\nwas going to cost and it was an awful amount of money. We were\nreally discouraged. Then some one asked ‘How do you eat an\nelephant?’ The answer is ‘In small pieces.’ We got going, we started\n- there were concerts and lots of other things – people gave very\ngenerously. And there were times when we got discouraged – the\nelephant got bigger, it was going to cost a lot more.\nBut we are now ready to go back into the Church – we’ve eaten the\nelephant.\nWhile all that was going on, even though the roof looked odd, we still\npraised God.’ We settled down to worship here in the Centre. Elke\nand others produced some lovely art work for the communion table\nand at the back. We discovered that it was lovely to sit together. It\nwas a bit awkward to receive communion but boy the hymn singing\nwas great. I just want to thank the choir for their part in that.\nLet’s not forget what has been special about this last five months, that\nsense of togetherness – and with that the hymn singing has been\nwonderful. I am concerned that if we just head back to our old seats\nPage 3 of 3\nPROPER 22 – Family Service – Year A – 2017\nthen we will lose something special. So to remind us of that, how nice\nit is to be closer together, we are going to continue to have our Family\nServices here in the Parish Centre..\nOn Thursday night we will carry everything back in to the Church.\nOn Sunday we have our Harvest and lots of people from neighbouring\nchurches are coming to celebrate with us on our first Sunday back in\nthe Church.\nThe people of Israel did not stay at the foot of Mount Sinai. God led\nthem on in their journey. So we prepare to move out from here and\nback into our Parish Church to continue our journey of witness and\nworship. God will travel with us, the God who has been worshipped\non this site for over 200 years and will be in the years to come. In\nfellowship with those who have gone before us (and I’m conscious of\nthose who, unknown to us were buried in our grounds for over a\nthousand years) let us press on in our journey with Christ, and into\nChrist that his name may be glorified and his kingdom advanced in the\nyears to come."
    }
}