{
    "title": "Signs of God's Presence",
    "date": "2012-11-18",
    "blurb": "Kevin explores the concept of believing in God and recognizing His presence in the world. He discusses the significance of the Mount of Olives in biblical context and Jesus' ministry. The sermon encourages us to see God in everyday experiences, in others, and to be signs of Christ's presence in our own lives.",
    "raw_text": "PROPER 28 – 2012 – year B – 2nd Sunday before Advent\n\nOver the last couple of weeks I have been getting to know our latest Confirmation Class. The Apostles’ Creed, which they will be affirming in the context of their Confirmation next April begins with the basic assertion, 'I believe in God.' And so we have started by thinking through what it means to believe in God. And then what sort of God are we believing in. How can we know this God, how can we relate to this God? What sort of signs are there of his presence in the world? How does God make himself known?\n\nAs we draw towards the end of the season of Trinity, as we draw closer to the season of Advent, our lessons, Sunday by Sunday, are beginning to take on a theme of Advent. Our Gospel reading this morning begins with the disciples in Jerusalem and their reaction to seeing the Temple, this seat of God’s presence that lay at the heart of Jewish spirituality. We also hear of Jesus talking of its coming destruction. The scene then shifts to the Mount of Olives, overlooking the city. The disciples start to ask Jesus about what he has meant by this talk of destruction, what will be the sign that all this is about to happen.\n\nIt is interesting at this point to look at the place of the Mount of Olives, this hill that overlooks the city of Jerusalem, in its wider biblical context. In the prophet Zechariah, the Mount of Olives is a place of great eschatological significance; it is a place of God breaking into the world. The prophet talks of the Lord standing on the Mount of Olives, the mountain being split in two.\n\nIn Mark’s account of the closing week of the ministry of Jesus we find a number of references to the Mount of Olives. It was from the Mount of Olives that Jesus set out on his triumphal entry into Jerusalem. The Garden is evidently a place to which Jesus would go to pray. We then have the episode that we have read of today. Finally, after the Last Supper Jesus lead his disciples out to the Mount of Olives, there to pray, to be betrayed and to be lead away prisoner. In placing these events in and around the Mount of Olives, the Gospel writer is presenting us with a very clear picture of God, present in the person of Jesus, on the Mount of Olives, entering into the city, appearing in the Temple.\n\nIn sharp contrast with the figure portrayed by Zechariah, the one who comes to the Mount of Olives is one who comes riding on a donkey, one who prays 'Father let this cup pass from me. Nevertheless not my will but yours be done.' One who gives of himself, empties himself, even unto death, a death on a cross.\n\nGoing back to our Confirmation Group, we thought of how God might make himself known in our own day. One of the girls in the class painted a lovely picture of seeing an evening sky, the setting sun behind clouds just above the horizon and rays of sunlight radiating from the cloud. Others spoke of music, some of the songs they sing in the Burrow. There were stories of the teaching and ministry of Jesus, we thought of some of the parables, in particular the parable of the Prodigal Son, the unconditional love of a father towards his wayward son. Then we started thinking about people, seeing God in other people. We can all think of people who have been important in our own spiritual journey. Looking back over my own life I can think of famous people who have inspired me; Archbishop Michael Ramsey, Archbishop George Simms of Armagh, Brother Roger of Taize – individuals who, for me, radiated something of the presence of God. Then there were those people who impacted on my own person spiritual journey – the Rector and people of St Laurence’s where I had been baptised and to which I returned 17 years later looking and searching – some of my first insights into God were in the faces I met in that place.\n\nThen we started thinking – If I can see something of God in other people, what about other people being able to see something of God in us? We started to think of the Church as the Body of Christ and in that body everyone has a place, everyone has a part to play. I go back to the prayer of Teresa of Avila:\n\n> Christ has no body but yours,\n> No hands, no feet on earth but yours,\n> Yours are the eyes with which he looks\n> Compassion on this world,\n> Yours are the feet with which he walks to do good,\n> Yours are the hands, with which he blesses all the world.\n> Yours are the hands, yours are the feet,\n> Yours are the eyes, you are his body.\n> Christ has no body now but yours,\n> No hands, no feet on earth but yours,\n> Yours are the eyes with which he looks\n> compassion on this world.\n> Christ has no body now on earth but yours.\n\nThe disciples asked of Jesus, 'What are the signs that all this is about to happen?' He basically said, look around you. What are the signs of Christ’s presence in the world of today? Look around you. You and I are called to be signs of Christ in the world of today; called to be the feet, the hands, the eyes, the body of Christ. You are called to be signs of Christ on the street in which you live, in the office in which you work, in the club in which you play, in the casual conversations with friend and neighbour; signs of the presence of the Kingdom of God in the world.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper282012.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 28 – 2012 – year B – 2nd Sunday before Advent\nOver the last couple of weeks I have been getting to know our latest\nConfirmation Class. The Apostles’ Creed, which they will be affirming in the\ncontext of their Confirmation next April begins with the basic assertion, ‘I\nbelieve in God.’ And so we have started by thinking through what it means to\nbelieve in God. And then what sort of God are we believing in. How can we\nknow this God, how can we relate to this God? What sort of signs are there of\nhis presence in the world? How does God make himself known?\nAs we draw towards the end of the season of Trinity, as we draw closer to the\nseason of Advent, our lessons, Sunday by Sunday, are beginning to take on a\ntheme of Advent. Our Gospel reading this morning begins with the disciples in\nJerusalem and their reaction to seeing the Temple, this seat of God’s presence\nthat lay at the heart of Jewish spirituality. We also hear of Jesus talking of its\ncoming destruction. The scene then shifts to the Mount of Olives, overlooking\nthe city. The disciples start of ask Jesus about what he has meant by this talk\nof destruction, what will be the sign that all this is about to happen.\nIt is interesting at this point to look at the place of the Mount of Olives, this hill\nthat overlooks the city of Jerusalem, in its wider biblical context. In the\nprophet Zechariah, the Mount of Olives is a place of great eschatological\nsignificance; it is a place of God breaking into the world. the prophet talks of\nthe Lord standing on the Mount of Olives, the mountain being split in two.\nIn Mark’s account of the closing week of the ministry of Jesus we find a\nnumber of references to the Mount of Olives. It was from the Mount of Olives\nthat Jesus set out on his triumphal entry into Jerusalem. The Garden is\nPage 2 of 4\nPROPER 28 – 2012 – year B – 2nd Sunday before Advent\nevidently a place to which Jesus would go to pray. We then have the episode\nthat we have read of today. Finally, after the Last Supper Jesus lead his\ndisciples out to the Mount of Olives, there to pray, to be betrayed and to be\nlead away prisoner. In placing these events in and around the Mount of Olives,\nthe Gospel writer is presenting us with a very clear picture of God, present in\nthe person of Jesus, on the Mount of Olives, entering into the city, appearing in\nthe Temple.\nIn sharp contrast with the figure portrayed by Zechariah, the one who comes to\nthe Mount of Olives is one who comes riding on a donkey, one who prays\n‘Father let this cup pass from me. Nevertheless not my will but yours be\ndone.’ One who gives of himself, empties himself, even unto death, a death on\na cross.\nGoing back to our Confirmation Group, we thought of how God might make\nhimself known in our own day. One of the girls in the class painted a lovely\npicture of seeing an evening sky, the setting sun behind clouds just above the\nhorizon and rays of sunlight radiating from the cloud. Others spoke of music,\nsome of the songs they sing in the Burrow. There were stories of the teaching\nand ministry of Jesus, we thought of some of the parables, in particular the\nparable of the Prodigal Son, the unconditional love of a father towards his\nwayward son. Then we started thinking about people, seeing God in other\npeople. We can all think of people who have been important in our own\nspiritual journey. Looking back over my own life I can think of famous people\nwho have inspired me; Archbishop Michael Ramsey, Archbishop George\nSimms of Armagh, Brother Roger of Taize – individuals who, for me, radiated\nPage 3 of 4\nPROPER 28 – 2012 – year B – 2nd Sunday before Advent\nsomething of the presence of God. Then there were those people who\nimpacted on my own person spiritual journey – the Rector and people of St\nLaurence’s where I had been baptised and to which I returned 17 years later\nlooking and searching – some of my first insights into God were in the faces I\nmet in that place.\nThen we started thinking – If I can see something of God in other people, what\nabout other people being able to see something of God in us? We started to\nthink of the Church as the Body of Christ and in that body everyone has a\nplace, everyone has a part to play. I go back to the prayer of Teresa of Avila:\nChrist has no body but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\nCompassion on this world,\nYours are the feet with which he walks to do good,\nYours are the hands, with which he blesses all the world.\nYours are the hands, yours are the feet,\nYours are the eyes, you are his body.\nChrist has no body now but yours,\nNo hands, no feet on earth but yours,\nYours are the eyes with which he looks\ncompassion on this world.\nChrist has no body now on earth but yours.\nThe disciples asked of Jesus, ‘What are the signs that all this is about to\nhappen?’ He basically said, look around you. What are the signs of Christ’s\npresence in the world of today? Look around you. You and I are called to be\nsigns of Christ in the world of today; called to be the feet, the hands, the eyes,\nthe body of Christ. You are called to be signs of Christ on the street in which\nyou live, in the office in which you work, in the club in which you play, in the\nPage 4 of 4\nPROPER 28 – 2012 – year B – 2nd Sunday before Advent\ncasual conversations with friend and neighbour; signs of the presence of the\nKingdom of God in the world."
    }
}