{
    "title": "The Eagle's True Potential",
    "date": "2020-11-15",
    "blurb": "Kevin's sermon, based on the Parable of the Talents, encourages us to recognize and celebrate our God-given talents. He uses the story of an eagle raised among chickens to illustrate the importance of understanding our true potential. By embracing and using our gifts, we can serve others and honor God's gifts to us, including the ultimate gift of His Son.",
    "raw_text": "## PROPER 28 – Year A – 2020 – 2nd Sunday before Advent – Family Service\n\n### The Eagle Who Thought He Was a Chicken\n\nA baby eagle became orphaned when something happened to his parents. He glided down to the ground from his nest but was not yet able to fly. A man picked him up. The man took him to a farmer and said, “This is a special kind of barnyard chicken that will grow up big.” The farmer said, “Don’t look like no barnyard chicken to me.” “Oh yes, it is. You will be glad to own it.” The farmer took the baby eagle and placed it with his chickens.\n\nThe baby eagle learned to imitate the chickens. He could scratch the ground for grubs and worms too. He grew up thinking he was a chicken. Then one day an eagle flew over the barnyard. The eagle looked up and wondered, “What kind of animal is that? How graceful, powerful, and free it is. It would be thrilling to soar like that!” Then he asked another chicken, “What is that?” The chicken replied, “Oh, that is an eagle. But don’t worry yourself about that. You will never be able to soar like that.” The eagle replied, “I guess you are right, and I might fall out of the sky if I tried.”\n\nAfraid to challenge what the chicken told him, afraid to take a hard look and recognize that he was fully capable of soaring, the eagle went back to scratching the ground. He continued to behave like the chicken he thought he was. Finally he died, never knowing the grand life that could have been his. Never knowing what it felt like to soar.\n\nAre you really an eagle who thinks he’s a chicken?\n\nWe’ve read as our Lesson this morning that parable of Jesus known as the Parable of the Talents. We’ve deliberately taken that word talent and used it in two ways. There are talents used as money as would have been used in Jesus’ time. Then there are talents as – well talents – things we are good at. In the opening video Elke drew together some of the huge range of talents that you find in the people of our Parish.\n\nI suppose first of all we have to recognise the talents, the gifts, that God has given us. That’s the point behind the story Aubrey has just read. The eagle in the story had the ability to soar just like any other eagle – he just didn’t realise it.\n\nThen there is the matter of recognising the talent and being thankful. I’m not talking of boasting or bragging – it is just enjoying the talent we have been given. Members of St Mary’s Choir love singing and sharing that with others. Matthew Ryan clearly loves his Lego; Olive Angulu has real gifts as an artist.\n\nSo we recognise the gift, we celebrate the gift, the we use the gift, not only for ourselves but for God and other people. Ola Olunrumi, who was a member of the Parish for a number of years after coming from Nigeria, developed his gifts and is now a nurse on one of our Covid Wards.\n\nI suppose that is what marked off the men in the Parable. Two went out and used them, developed them. The other just went out and buried it.\n\nWe have each been given talents, gifts, capabilities: gifts to be used, gifts to be celebrated. As we approach Christmas, we also acknowledge a gifts from God in the gift of his Son. We read in John’s Gospel, Jesus telling Nicodemus, ‘God so loved the world that he gave his only Son’. Our gratitude for that gift should set the tone for the way we use the other gifts that God has given us.\n\nOne way I like to look at it is that we should let our commitment of faith loose in our lives. By that I mean we should let that colour everything we say and think and do; how we exercise and offer the talents that God has given us.\n\nI’ll just illustrate this with a very simple story. When I was first ordained, the Rector of Holy Trinity Church, just off Wall street in New York was in Dublin. He told us that his Church was near Wall Street but Wall Street did not come near his Church. One Sunday he shared his hopes for a ministry among the office workers in Wall Street and asked his congregation for suggestions. A number of people came out and said that was a great idea – but no suggestions how to take it further. One lady came up rather nervously said she had an idea but he wasn’t to laugh. She went on to say that she had a talent, a talent for making tasty meals at a very economic price. The Rector laughed – and then stopped. Office workers are looking for good food at a reasonable price. So the Church started offering meals at a reasonable price and people started coming. In the early stages no one mentioned faith, then people started asking about the Church and a ministry began to develop and the Church began to grow.\n\nThe lady had a gift; she offered that gift and that gift was used by God in ways she never dreamed of.\n\nWe all have gifts. Let us recognise the gifts that God has given us and let us use them in the service of others.\n\nI’ll leave you with a challenge. Covid 19 has impacted the Church and Church life in ways we never imagined 12 months ago. It has had a huge financial impact – and I would like to thank folk for the wonderful response to our appeal earlier in the year and our Gift Day so far. It has also brought home to us something we realised but weren’t sure how to tackle – the future role of internet, social media, Facebook, YouTube, Zoom in communications, in the life of society, the life of the Church. In the emergency that descended on us last March we kind of cobbled together a response that has sort of worked – but it needs to be put on a firmer footing. So I’m asking today – do you have talents, do you know of someone who has talents who can put this on a firmer footing?\n\nI’ll leave that with you.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper282020family.txt",
        "raw_ocr_content": "Page 1 of 5\nPROPER 28 – Year A – 2020 – 2nd Sunday before Advent – Family Service\nThe Eagle Who Thought He Was a Chicken\nA baby eagle became orphaned when something happened to\nhis parents. He glided down to the ground from his nest but\nwas not yet able to fly. A man picked him up. The man took\nhim to a farmer and said, “This is a special kind of barnyard\nchicken that will grow up big.” The farmer said, “Don’t look\nlike no barnyard chicken to me.” “Oh yes, it is. You will be\nglad to own it.” The farmer took the baby eagle and placed it\nwith his chickens.\nThe baby eagle learned to imitate the chickens. He could\nscratch the ground for grubs and worms too. He grew up\nthinking he was a chicken.\nThen one day an eagle flew over the barnyard. The eagle\nlooked up and wondered, “What kind of animal is that? How\ngraceful, powerful, and free it is. It would be thrilling\nto soar like that!” Then he asked another chicken, “What is\nthat?” The chicken replied, “Oh, that is an eagle. But don’t\nworry yourself about that. You will never be able to soar like\nthat.” The eagle replied, “I guess you are right, and I might fall\nout of the sky if I tried.”\nAfraid to challenge what\nthe chicken told him, afraid to take a hard look and recognize\nPage 2 of 5\nPROPER 28 – Year A – 2020 – 2nd Sunday before Advent – Family Service\nthat he was fully capable of soaring, the eagle went back to\nscratching the ground. He continued to behave like the chicken\nhe thought he was.\nFinally he died, never knowing the grand life that could have\nbeen his. Never knowing what it felt like to soar.\nAre you really an eagle who thinks he’s a chicken?\nWe’ve read as our Lesson this morning that parable of Jesus known as the\nParable of the Talents. We’ve deliberately taken that word talent and used it in\ntwo ways. There are talents used as money as would have been used in Jesus’\ntime. Then there are talents as – well talents – things we are good at. In the\nopening video Elke drew together some of the huge range of talents that you\nfind in the people of our Parish.\nI suppose first of all we have to recognise the talents, the gifts, that God has\ngiven us. That’s the point behind the story Aubrey has just read. The eagle in\nthe story had the ability to soar just like any other eagle – he just didn’t realise\nit.\nThen there is the matter of recognising the talent and being thankful. I’m not\ntalking of boasting or bragging – it is just enjoying the talent we have been\ngiven. Members of St Mary’s Choir love singing and sharing that with others.\nMatthew Ryan clearly loves his Lego; Olive Angulu has real gifts as an artist.\nPage 3 of 5\nPROPER 28 – Year A – 2020 – 2nd Sunday before Advent – Family Service\nSo we recognise the gift, we celebrate the gift, the we use the gift, not only for\nourselves but for God and other people. Ola Olunrumi, who was a member of\nthe Parish for a number of years after coming from Nigeria, developed his gifts\nand is now a nurse on one of our Covid Wards.\nI suppose that is what marked off the men in the Parable. Two went out and\nused them, developed them. The other just went out and buried it.\nWe have each been given talents, gifts, capabilities: gifts to be used, gifts to be\ncelebrated. As we approach Christmas, we also acknowledge a gifts from God\nin the gift of his Son. We read in John’s Gospel, Jesus telling Nicodemus,\n‘God so loved the world that he gave his only Son’. Our gratitude for that gift\nshould set the tone for the way we use the other gifts that God has given us.\nOne way I like to look at it is that we should let our commitment of faith loose\nin our lives. By that I mean we should let that colour everything we say and\nthink and do; how we exercise and offer the talents that God has given us.\nI’ll just illustrate this with a very simple story. When I was first ordained, the\nRector of Holy Trinity Church, just off Wall street in New York was in Dublin.\nHe told us that his Church was near Wall Street but Wall Street did not come\nnear his Church. One Sunday he shared his hopes for a ministry among the\noffice workers in Wall Street and asked his congregation for suggestions. A\nnumber of people came out and said that was a great idea – but no suggestions\nhow to take it further. One lady came up rather nervously said she had an idea\nPage 4 of 5\nPROPER 28 – Year A – 2020 – 2nd Sunday before Advent – Family Service\nbut he wasn’t to laugh. She went on to say that she had a talent, a talent for\nmaking tasty meals at a very economic price. The Rector laughed – and then\nstopped. Office workers are looking for good food at a reasonable price. So\nthe Church started offering meals at a reasonable price and people started\ncoming. In the early stages no one mentioned faith, then people started asking\nabout the Church and a ministry began to develop and the Church began to\ngrow.\nThe lady had a gift; she offered that gift and that gift was used by God in ways\nshe never dreamed of.\nWe all have gifts. Let us recognise the gifts that God has given us and let us\nuse them in the service of others.\nI’ll leave you with a challenge. Covid 19 has impacted the Church and Church\nlife in ways we never imagined 12 months ago. It has had a huge financial\nimpact – and I would like to thank folk for the wonderful response to our\nappeal earlier in the year and our Gift Day so far. It has also brought home to\nus something we realised but weren’t sure how to tackle – the future role of\ninternet, social media, Facebook, YouTube, Zoom in communications, in the\nlife of society, the life of the Church. In the emergency that descended on us\nlast March we kind of cobbled together a response that has sort of worked – but\nit needs to be put on a firmer footing. So I’m asking today – do you have\nPage 5 of 5\nPROPER 28 – Year A – 2020 – 2nd Sunday before Advent – Family Service\ntalents, do you know of someone who has talents who can put this on a firmer\nfooting?\nI’ll leave that with you."
    }
}