{
    "title": "One Holy Catholic and Apostolic Church",
    "date": "2010-07-04",
    "blurb": "On the occasion of the sacrament of Baptism, the sermon reflects on the identity of the Church and its members. It emphasizes the Church as Apostolic, Catholic, Holy, and One. The Church is 'sent' to look beyond itself, it is part of the universal Church of Christ, it is set apart for a purpose, and it is one because Christ is one.",
    "raw_text": "I believe in one holy catholic and apostolic Church. Today, July 4th, citizens of the United States are celebrating Independence Day. In the course of the many demonstrations and parades, both large and small, they will be not just celebrating the fact that the original colonists threw off British rule back in 1776, they will also be celebrating the nation they have become in the years that have followed. They will, in short, be celebrating their identity, their contribution to the wider world. For all its shortcomings, a nation that has been built out of many nations, a place that has given opportunity and hope to people fleeing persecution and poverty in their own land.\n\nToday, in the context of our morning service, we are celebrating the sacrament of Baptism, in which we are welcoming young Johnny Blake into the fellowship of the Church. This Service, a service of inclusion, of welcome very much celebrates the identity not just of the one being baptised today but of the whole Church. It is a celebration of who we are as individuals and as a community before God.\n\nEach of us come as ones made in the image of God. This means that in all our imperfection we encounter something of God in each other, we manifest something of God to one another.\n\nAs members of the Christian Church we gather this morning to welcome Johnny into our fellowship. Each Sunday we meet for worship we declare our common faith in the words of one of the historic creeds. This morning we use the Apostles’ Creed, in our Communion Services we use the Nicene Creed in which we declare our belief in the Church.\n\nWe believe in one holy catholic and apostolic Church.\n\nThe very familiarity of those words can cloud our understanding. So let us, in the context of Johnny’s Baptism, reflect on what we are saying.\n\nWe believe the Church is Apostolic. When we say this we are talking about a lot more than an historical link. In our Gospel reading, which tells of Jesus sending out the seventy to places he was going to visit himself, the word used in the Greek text for ‘he sent’ is ajpevsteilen, from which of course we derive our words, ‘apostle’, ‘apostolic’. So when we say the Church is Apostolic, we are saying the Church is ‘sent’. The Church as a community must be always looking out beyond itself. A former Archbishop of Canterbury, William Temple, once described the Church as the only community that exists for the sake of those outside itself. In the way we order our life, the way we order our worship, we must be always mindful not just of ourselves but also the wider community in which we are placed to whom we are called to be a sign of God’s presence in the world of today, inviting those outside the Church to join with us on the journey of faith.\n\nWe believe the Church is Catholic. We are part and parcel of the universal Church of Christ. We are Catholic. This means the Church is far bigger than our own particular Parish, our own particular tradition. I think this is why the Taize Community in France has been so important in my own particular thinking on the nature of the Church. This community seeks to draw on the riches of all the strands of the Christian Church. Coming from the Church of Ireland with our roots not only in the Anglican Communion but also the Celtic tradition we have much to offer the Church but we also have much to learn; not only from the established traditions of the Churches of Western Europe but also the evolving Churches of Africa and Asia. And so ecumenism is not an optional extra in the life of the Church it has to be an essential feature of the life of the Church if we are to be faithful to our assertion that the Church is Catholic.\n\nWe believe the Church is holy. Holy is one of those words that is often misunderstood. It is often seen as implying perfection. The Church is anything but perfect and so for those looking at the Church from outside ‘holy’ has connotations of self-righteousness, judgemental even hypocrisy. Holy is the word we use to translate the Greek word hagios, which has the meaning of set apart, set apart for a purpose. Jesus called the disciples for a purpose, to be a community gathered around him that was to be a sign of God’s kingdom breaking into the world. In our Gospel reading he called the 70 together for a purpose, to go ahead of him to communities to prepare them to welcome him when he came. We are holy not because we have an inflated idea of our own virtue; rather we are conscious that in all our imperfection and inadequacy God has a purpose for this place, for the community that gathers here, that we might be a sign of God’s kingdom in this place and time in which God has placed us.\n\nWe believe the Church is one. We believe the Church is one because Christ is one and we are the Body of Christ. The unity of the Church is important because that is nothing less than the declared will of Christ himself, as we read in John’s Gospel 20 \"I ask not only on behalf of these, but also on behalf of those who will believe in me through their word, 21 that they may all be one. As you, Father, are in me and I am in you, may they also be in us, so that the world may believe that you have sent me. John 17:20,21\n\nMay they be one, so that the world may believe. Disunity undermines the mission of the Church in the world of today. The World Council of Churches has its origins in a Missionary Conference held in Edinburgh before the First World War that recognised how divisions in the Church undermined the credibility of the mission of the Church in Africa and Asia. In our own situation we may not be able to do anything about divisions in the wider Church but we can recognise the importance of unity in the context of our own Church life, in which in all our differences of age, of temperament, of preferences we accept and honour one another, and at times to defer to one another, as fellow members of the Body of Christ in this place.\n\nToday we welcome Johnny into the fellowship of the Body of Christ in this place and celebrate our identity as members of the one, holy, catholic and apostolic Church.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper//Year C/proper92010.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 9 – 2010 – year C – Trinity 5\nI bielieve in one holy catholic and apostolic Church\nToday, July 4th, citizens of the United States are celebrating Independence Day. In the\ncourse of the many demonstrations and parades, both large and small, they will be not just\ncelebrating the fact that the original colonists threw off British rule back in 1776, they will\nalso be celebrating the nation they have become in the years that have followed – they\nwill, in short, be celebrating their identity, their contribution to the wider world. For all its\nshortcomings, a nation that has been built out of many nations, a place that has given\nopportunity and hope to people fleeing persecution and poverty in their own land.\nToday, in the context of our morning service, we are celebrating the sacrament of Baptism,\nin which we are welcoming young Johnny Blake into the fellowship of the Church. This\nService, a service of inclusion, of welcome very much celebrates the identity not just of\nthe one being baptised today but of the whole Church. It is a celebration of who we are as\nindividuals and as a community before God.\nEach of us come as ones made in the image of God. This means that in all our\nimperfection we encounter something of God in each other, we manifest something of God\nto one another.\nAs members of the Christian Church we gather this morning to welcome Johnny into our\nfellowship. Each Sunday we meet for worship we declare our common faith in the words\nof one of the historic creeds. This morning we use the Apostles’ Creed, in our\nCommunion Services we use the Nicene Creed in which we declare our belief in the\nChurch.\nWe believe in one holy catholic and apostolic Church.\nThe very familiarity of those words can cloud our understanding. So let us, in the context\nof Johnny’s Baptism, reflect on what we are saying.\nWe believe the Church is Apostolic. When we say this we are talking about a lot more\nthan an historical link. In our Gospel reading, which tells of Jesus sending out the seventy\nPage 2 of 3\nProper 9 – 2010 – year C – Trinity 5\nI bielieve in one holy catholic and apostolic Church\nto places he was going to visit himself, the word used in the Greek text for ‘he sent’ is\najpevsteilen, from which of course we derive our words, ‘apostle’, ‘apostolic’. So when\nwe say the Church is Apostolic, we are saying the Church is ‘sent’. The Church as a\ncommunity must be always looking out beyond itself. A former Archbishop of\nCanterbury, William Temple, once described the Church as the only community that exists\nfor the sake of those outside itself. In the way we order our life, the way we order our\nworship, we must be always mindful not just of ourselves but also the wider community in\nwhich we are placed to whom we are called to be a sign of God’s presence in the world of\ntoday, inviting those outside the Church to join with us on the journey of faith.\nWe believe the Church is Catholic. We are part and parcel of the universal Church of\nChrist. We are Catholic. This means the Church is far bigger than our own particular\nParish, our own particular tradition. I think this is why the Taize Community in France\nhas been so important in my own particular thinking on the nature of the Church.\n(www.taize.fr ) This community seeks to draw on the riches of all the strands of the\nChristian Church. Coming from the Church of Ireland with our roots not only in the\nAnglican Communion but also the Celtic tradition we have much to offer the Church but\nwe also have much to learn; not only from the established traditions of the Churches of\nWestern Europe but also the evolving Churches of Africa and Asia. And so ecumenism is\nnot an optional extra in the life of the Church it has to be an essential feature of the life of\nthe Church if we are to be faithful to our assertion that the Church is Catholic.\nWe believe the Church is holy. Holy is one of those words that is often misunderstood. It\nis often seen as implying perfection. The Church is anything but perfect and so for those\nlooking at the Church from outside ‘holy’ has connotations of self-righteousness,\njudgemental even hypocrisy. Holy is the word we use to translate the Greek word hagios,\nwhich has the meaning of set apart, set apart for a purpose. Jesus called the disciples for a\npurpose, to be a community gathered around him that was to be a sign of God’s kingdom\nbreaking into the world. In our Gospel reading he called the 70 together for a purpose, to\nPage 3 of 3\nProper 9 – 2010 – year C – Trinity 5\nI bielieve in one holy catholic and apostolic Church\ngo ahead of him to communities to prepare them to welcome him when he came. We are\nholy not because we have an inflated idea of our own virtue; rather we are conscious that\nin all our imperfection and inadequacy God has a purpose for this place, for the\ncommunity that gathers here, that we might be a sign of God’s kingdom in this place and\ntime in which God has placed us.\nWe believe the Church is one. We believe the Church is one because Christ is one and we\nare the Body of Christ. The unity of the Church is important because that is nothing less\nthan the declared will of Christ himself, as we read in John’s Gospel\n20 \"I ask not only on behalf of these, but also on behalf of those who\nwill believe in me through their word, 21 that they may all be one. As\nyou, Father, are in me and I am in you, may they also be in us, so that\nthe world may believe that you have sent me. John 17:20,21\nMay they be one, so that the world may believe. Disunity undermines the mission of the\nChurch in the world of today. The World Council of Churches has its origins in a\nMissionary Conference held in Edinburgh before the First World War that recognised how\ndivisions in the Church undermined the credibility of the mission of the Church in Africa\nand Asia. In our own situation we may not be able to do anything about divisions in the\nwider Church but we can recognise the importance of unity in the context of our own\nChurch life, in which in all our differences of age, of temperament, of preferences we\naccept and honour one another, and at times to defer to one another, as fellow members of\nthe Body of Christ in this place.\nToday we welcome Johnny into the fellowship of the Body of Christ in this place and\ncelebrate our identity as members of the one, holy, catholic and apostolic Church"
    }
}