{
    "title": "Treasures of the Church",
    "date": "2020-11-15",
    "blurb": "Kevin's sermon reflects on the true treasures of the Church, drawing parallels between the story of St. Lawrence and the Parable of the Talents. He emphasizes the importance of community, interdependence, and using our gifts in service to God. The sermon encourages us to see each other as treasures of the Church, to support and uplift one another, and to live out the Gospel in our daily lives.",
    "raw_text": "PROPER 28 – 2020 – Year A – 2nd Sunday before Advent\n\nTwo weeks ago, on All Saints Day you may recall that I drew your attention to the East Window in St Mary’s Church in Howth, given in memory of the last Earl of Howth. This morning I want to begin by returning to that window. At the centre of that window is the figure of the risen and ascended Christ. Surrounding him are a number of figures associated with the history of the Church, the Apostles, saints of the Irish Church and others. Among these is the figure of St Lawrence, reflecting the history of the St Lawrence family in Howth Castle over the last 800 years. For me there is a rather nice personal connection, in that my home Parish Church in Northfield, Birmingham is dedicated to St Lawrence.\n\nThe Lawrence in this case was a deacon in the Church in Rome, died during the persecution of the Emperor Valerian in 258. Tradition has it, when asked by the Prefect of Rome to produce the treasures of the Church, Lawrence appeared the following day with a group of children and the poor, saying, 'These are the treasures of the Church.' For his insolence, the Prefect ordered that he be roasted alive on a grid-iron. This is why in images and statues, Lawrence is always depicted, as he is on our window, holding a grid iron.\n\nThe story of Lawrence came to my mind as I read over the Gospel reading appointed for today, Matthew’s account of the parable of the Talents. This is one of a series of Parables told by Jesus that we find in St Matthew’s Gospel that speak of people in waiting, waiting for the bridegroom last week, waiting for the master to return this week. In the run up to Christmas, as we are about to enter upon the season of Advent, we are reminded that we stand in an in-between time, between the coming of Jesus as a child in Bethlehem and his coming at the end of time. So these parables of waiting are about the priorities of a community in waiting.\n\nAs I read our Parable, as I reflect on the story of Lawrence, the questions that come to my mind are, 'What are our treasures? What do we do with the treasures entrusted to us?' Maybe we should first ask, 'What do we see as our treasures?' In this period of lock down, many people have spoken to me of it being an opportunity of asking what is really important to us, what are our priorities in life. People are really missing the opportunity of simply meeting together. We go to the shops to get what we need – but as we do so, we relish those chance meetings in the supermarket with those we have not seen for a while. We go out for a walk to clear our heads – but that meeting with a friend on the harbour wall or in the park lifts our spirits.\n\nWe miss the opportunity to meet together in our churches for worship – and just be with each other; those apparently inconsequential chats as we wait for the service to begin or over coffee after the service, the enquiry after our health, our loved ones, the arrangement to meet up during the week. We are deep down community beings, we draw strength from community, we miss community.\n\nIn the second of the Creation narratives in the Book Genesis we read, as God sets man in the Garden of Eden, 'the Lord said it is not good for man to be alone.' Gen 2:18 We are not just a collection of individuals, we are a community, we are interdependent, physically, mentally, spiritually. Paul, in writing to the Church in Corinth uses the very powerful image of the Body, the Body of Christ. As he reflects on the individual gifts of the Spirit, he goes on to say:\n\n'For just as the body is one and has many members, and all the members of the body, though many, are one body, so it is with Christ. Indeed, the body does not consist of one member but of many. If the foot would say, “Because I am not a hand, I do not belong to the body,” that would not make it any less a part of the body. And if the ear would say, “Because I am not an eye, I do not belong to the body,” that would not make it any less a part of the body. If all were a single member, where would the body be? As it is, there are many members, yet one body. The eye cannot say to the hand, “I have no need of you,” nor again the head to the feet, “I have no need of you.” If one member suffers, all suffer together with it; if one member is honoured, all rejoice together with it. Now you are the body of Christ and individually members of it.' I Cor 12:12ff (selected verses)\n\nHe goes on from this passage to talk in those wonderful terms about Christian love ... love is patient, love is kind ...\n\nLove is fundamentally directed out from ourselves to other people. The opposite to this is self centredness, selfishness. I remember being at a conference on Church development. One of the questions we were asked was, 'What difference would it make to your wider community if your Parish did not exist?' I put that alongside an expression I have heard in several contexts; 'A community that lives to itself, dies by itself.' – a community that just focuses on its own interests, its own survival, with no vision beyond itself becomes detached and isolated. That applies to individuals, to communities, to nations.\n\nWith these thoughts in mind, I turn back to the Parable of the Talents, to those who used the resources their master had given them and those who just buried them. Alongside that, I would set the idea of 'letting our commitment to Christ loose in our lives.' By that I would mean letting our commitment to Christ influence all aspects of our lives, what we do, what we think and say, our attitude to other people, our attitude to ourselves – sharing the Gospel in what we say and think and do. In this regard, I love those words of St Francis, 'Preach the Gospel at all times – and if necessary use words.'\n\nChrist can and does take what we offer in witness, in service, in love and works in it and through it, sometimes in ways we can barely imagine and empowers us to do more in his service. Let us take the talents that God has given us, the particular gifts that he has endowed us with and use them in his service and to his glory.\n\nI go back to the question I asked earlier. Do we see each other, do we see ourselves, as the treasures of the Church, ones made in God’s image, ones redeemed by Christ, members of the Body of Christ wherever he has placed us. We have a ministry to each other of encouragement, of building each other up. Each one of us is a vital part of the Body of Christ in this place. The encouraging word, the encouraging presence with someone in difficulty brings something of the love and presence of Christ into the life of another.\n\nThe Prefect of Rome demanded of Lawrence, bring me the treasures of the Church. We bring ourselves, we bring one another as:\n\n'we offer you our souls and bodies to be a living sacrifice. Send us out in the power of your Spirit to live and work to your praise and glory.' Amen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper282020.txt",
        "raw_ocr_content": "Page 1 of 5\nPROPER 28 – 2020 – Year A – 2nd Sunday before Advent\nTwo weeks ago, on All Saints Day you may recall that I drew your attention to\nthe East Window in St Mary’s Church in Howth, given in memory of the last\nEarl of Howth. This morning I want to begin by returning to that window. At\nthe centre of that window is the figure of the risen and ascended Christ.\nSurrounding him are a number of figures associated with the history of the\nChurch, the Apostles, saints of the Irish Church and others. Among these is the\nfigure of St Lawrence, reflecting the history of the St Lawrence family in\nHowth Castle over the last 800 years. For me there is a rather nice personal\nconnection, in that my home Parish Church in Northfield, Birmingham is\ndedicated to St Lawrence.\nThe Lawrence in this case was a deacon in the Church in Rome, died during\nthe persecution of the Emperor Valerian in 258. Tradition has it, when asked\nby the Prefect of Rome to produce the treasures of the Church, Lawrence\nappeared the following day with a group of children and the poor, saying,\n‘These are the treasures of the Church.’ For his insolence, the Prefect ordered\nthat he be roasted alive on a grid-iron. This is why in images and statues,\nLawrence is always depicted, as he is on our window, holding a grid iron.\nThe story of Lawrence came to my mind as I read over the Gospel reading\nappointed for today, Matthew’s account of the parable of the Talents. This is\none of a series of Parables told by Jesus that we find in St Matthew’s Gospel\nthat speak of people in waiting, waiting for the bridegroom last week, waiting\nfor the master to return this week. In the run up to Christmas, as we are about\nto enter upon the season of Advent, we are reminded that we stand in an in-\nbetween time, between the coming of Jesus as a child in Bethlehem and his\ncoming at the end of time. So these parables of waiting are about the priorities\nof a community in waiting.\nPage 2 of 5\nPROPER 28 – 2020 – Year A – 2nd Sunday before Advent\nAs I read our Parable, as I reflect on the story of Lawrence, the questions that\ncome to my mind are, ‘What are our treasures? What do we do with the\ntreasures entrusted to us?’\nMaybe we should first ask, ‘What do we see as our treasures?’\nIn this period of lock down, many people have spoken to me of it being an\nopportunity of asking what is really important to us, what are our priorities in\nlife. People are really missing the opportunity of simply meeting together. We\ngo to the shops to get what we need – but as we do so, we relish those chance\nmeetings in the supermarket with those we have not seen for a while. We go\nout for a walk to clear our heads – but that meeting with a friend on the harbour\nwall or in the park lifts our spirits.\nWe miss the opportunity to meet together in our churches for worship – and\njust be with each other; those apparently inconsequential chats as we wait for\nthe service to begin or over coffee after the service, the enquiry after our\nhealth, our loved ones, the arrangement to meet up during the week. We are\ndeep down community beings, we draw strength from community, we miss\ncommunity.\nIn the second of the Creation narratives in the Book Genesis we read, as God\nsets man in the Garden of Eden,\n‘the Lord said it is not good for man to be alone.’ Gen 2:18\nWe are not just a collection of individuals, we are a community, we are inter-\ndependant, physically, mentally, spiritually. Paul, in writing to the Church in\nPage 3 of 5\nPROPER 28 – 2020 – Year A – 2nd Sunday before Advent\nCorinth uses the very powerful image of the Body, the Body of Christ. As he\nreflects on the individual gifts of the Spirit, he goes on to say:\nFor just as the body is one and has many members, and all the\nmembers of the body, though many, are one body, so it is with Christ.\n………Indeed, the body does not consist of one member but of many.\nIf the foot would say, “Because I am not a hand, I do not belong to the\nbody,” that would not make it any less a part of the body. And if the\near would say, “Because I am not an eye, I do not belong to the body,”\nthat would not make it any less a part of the body …………. If all\nwere a single member, where would the body be? As it is, there are\nmany members, yet one body. The eye cannot say to the hand, “I have\nno need of you,” nor again the head to the feet, “I have no need of\nyou.” ……….If one member suffers, all suffer together with it; if one\nmember is honoured, all rejoice together with it. ………..\nNow you are the body of Christ and individually members of it.\nI Cor 12:12ff (selected verses)\nHe goes on from this passage to talk in those wonderful terms about Christian\nlove ….. love is patient, love is kind …..\nLove is fundamentally directed out from ourselves to other people. The\nopposite to this is self centredness, selfishness. I remember being at a\nconference on Church development. One of the questions we were asked was,\n‘What difference would it make to your wider community if your Parish did\nnot exist?’ I put that alongside an expression I have heard in several contexts;\n‘A community that lives to itself, dies by itself.’ – a community that just\nfocusses on its own interests, its own survival, with no vision beyond itself\nbecomes detached and isolated. That applies to individuals, to communities, to\nnations.\nWith these thoughts in mind, I turn back to the Parable of the Talents, to those\nwho used the resources their master had given them and those who just buried\nPage 4 of 5\nPROPER 28 – 2020 – Year A – 2nd Sunday before Advent\nthem. Alongside that, I would set the idea of ‘letting our commitment to Christ\nloose in our lives.’ By that I would mean letting our commitment to Christ\ninfluence all aspects of our lives, what we do, what we think and say, our\nattitude to other people, our attitude to ourselves – sharing the Gospel in what\nwe say and think and do. In this regard, I love those words of St Francis,\n‘Preach the Gospel at all times – and if necessary use words.’\nChrist can and does take what we offer in witness, in service, in love and works\nin it and through it, sometimes in ways we can barely imagine and empowers\nus to do more in his service. Let us take the talents that God has given us, the\nparticular gifts that he has endowed us with and use them in his service and to\nhis glory.\nI go back to the question I asked earlier. Do we see each other, do we see\nourselves, as the treasures of the Church, ones made in God’s image, ones\nredeemed by Christ, members of the Body of Christ wherever he has placed us.\nWe have a ministry to each other of encouragement, of building each other up.\nEach one of us is a vital part of the Body of Christ in this place. The\nencouraging word, the encouraging presence with someone in difficulty brings\nsomething of the love and presence of Christ into the life of another.\nThe Prefect of Rome demanded of Lawrence, bring me the treasures of the\nChurch. We bring ourselves, we bring one another as:\nwe offer you our souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen.\nPage 5 of 5\nPROPER 28 – 2020 – Year A – 2nd Sunday before Advent"
    }
}