{
    "title": "Journey of Faith and Presence",
    "date": "2011-10-23",
    "blurb": "Kevin reflects on the journey of faith as a path guided by God's presence, drawing parallels between the Israelites' journey from Mount Sinai and our own spiritual journey. He emphasizes the importance of God's grace and the Holy Spirit in overcoming challenges and growing in likeness to Jesus Christ. The sermon encourages believers to be living signs of God's kingdom, embodying hope and purpose in the world.",
    "raw_text": "Proper 24 – 2011 – year A – Trinity 21\n\nI remember a few years ago sitting with a lady in hospital drawing close to the end of a long battle with cancer over a period of 20 years. Liz had maintained a wonderful, yet deeply rooted, positivity over that period. We chatted over lots of things, her family, the ups and downs of her battle with cancer and we almost drifted into the whole issue of faith. I asked her, “You do know that God loves you, don’t you?” She smiled and said, “If I had not known that I would not have been able to cope.”\n\nShe had a sense of God’s presence with her at every stage of her journey – even when that presence seemed remote – even when she found it hard to pray. In our Old Testament Lesson we read of the people of Israel preparing to move on from Mount Sinai. The preceding sections of this Book Exodus have told of the highs and the lows, the giving of the Law and the incident of the Golden Calf. In this particular passage, Moses is wrestling with the enormity of the task that God has laid upon him. He hears God’s promise that his presence will go with him. To which Moses comes back with a reply that could be summarised by, “If you are not going to be with us, I do not even want to start.”\n\nWe are talking here of setting out on a journey, a journey home. Not that they had even lived there – it was a place where they belonged as a people, a land promised to their ancestors. It was to be a journey fraught with danger and difficulty. The account of this journey that we have in Exodus has its highs and lows, its moments of great faithfulness, its moments of abject failure. But all through this journey, God is with them – the pillar of cloud, the provision of manna.\n\nWe too are on a journey; at one level a journey from life to death; on the level of faith a journey into life. I think of the words of Hymn 1, a chant from the Taize community:\n\n> Bless the Lord my soul, and bless God’s holy name.\n> Bless the Lord my soul, who leads me into life.\n\nLike Moses in our Lesson, we seek God’s presence with us on this journey of a lifetime, this journey home. As I think of God’s presence with us on our journey, two expressions, two categories of God’s presence with us come to mind; those of grace and the Holy Spirit. As I reflected on this I turned to the Revised Catechism. On the issue of grace it asks the question, in the context of keeping the commandments:\n\n“How can you carry out these duties and overcome temptation and sin?”\n“I can do these things only by the help of God through his grace.”\n\nThis is followed by the question:\n\n“What do you mean by God’s grace?”\n“By God’s grace I mean that God himself acts in Jesus Christ to forgive, inspire, and strengthen me by his Holy Spirit.”\n\nGod forgiving me, inspiring me, strengthening me.\n\nTurning to the question on the Holy Spirit:\n\n“The Church teaches that God the Holy Spirit inspires all that is good in humanity; that he came in his fullness at Pentecost to be the giver of life to the Church, and that he enables me to grow in likeness to Jesus Christ.”\n\nInspires all that is good; enables me to grow in likeness to Jesus Christ.\n\nJust continuing our thoughts of life as a journey in the presence of God, a God who forgives, who inspires, who strengthens, who enables me to grow in likeness to Jesus Christ; I am called not just to travel but to travel with a purpose. The writer of Genesis tells us that when God called Abram, he called him with a purpose. “I will make of you a great nation … I will bless you and make your name great, so that you will be a blessing … in you all the families of the earth will be blessed.” (Gen 12:2-3) The nation was called not just for its own sake but that it might be a sign, an instrument of blessing on the wider world.\n\nIn teaching his own disciples, he called them to be signs. ‘You are the salt of the earth … you are the light of the world … let your light shine before others that they may see your good works and give glory to your Father in heaven.’ (Matt 5:13,14,16).\n\nWe are called to travel the journey of life with a purpose, to be signs of the Kingdom, to be beacons of hope in the world in which we live. And so in the post communion prayer set for today, as we give thanks for God giving us “every good and perfect gift” we pray that we may “be a living sign of that perfect kingdom, where your whole creation will be made perfect in Jesus Christ our Lord.”\n\nAnd so, as we prepare to go back out into the world, to continue our journey before God, we join in praying:\n\nAlmighty God,\nwe thank you for feeding us\nwith the spiritual food\nof the body and blood of your Son Jesus Christ.\nThrough him we offer you our souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper242011.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 24 – 2011 – year A – Trinity 21\nI remember a few years ago sitting with a lady in hospital drawing close to the\nend of a long battle with cancer over a period of 20 years. Liz had maintained\na wonderful, yet deeply rooted, positivity over that period. We chatted over\nlots of things, her family, the ups and downs of her battle with cancer and we\nalmost drifted into the whole issue of faith. I asked her, “You do know that\nGod loves you, don’t you?” She smiled and said, “If I had not known that I\nwould not have been able to cope.”\nShe had a sense of God’s presence with her at every stage of her journey –\neven when that presence seemed remote – even when she found it hard to pray.\nIn our Old Testament Lesson we read of the people of Israel preparing to move\non from Mount Sinai. The preceding sections of this Book Exodus have told of\nthe highs and the lows, the giving of the Law and the incident of the Golden\nCalf. In this particular passage, Moses is wrestling with the enormity of the\ntask that God has laid upon him. He hears God’s promise that his presence will\ngo with him. To which Moses comes back with a reply that could be\nsummarised by, “If you are not going to be with us, I do not even want to\nstart.”\nWe are talking here of setting out on a journey, a journey home. Not that they\nhad even lived there – it was a place where they belonged as a people, a land\npromised to their ancestors. It was to be a journey fraught with danger and\ndifficulty. The account of this journey that we have in Exodus has its highs\nand its lows, its moments of great faithfulness, its moments of abject failure.\nPage 2 of 4\nProper 24 – 2011 – year A – Trinity 21\nBut all through this journey, God is with them – the pillar of cloud, the\nprovision of manna.\nWe too are on a journey; at one level a journey from life to death; on the level\nof faith a journey into life. I think of the words of Hymn 1, a chant from the\nTaize community:\nBless the Lord my soul, and bless God’s holy name.\nBless the Lord my soul, who leads me into life.\nLike Moses in our Lesson, we seek God’s presence with us on this journey of a\nlifetime, this journey home. As I think of God’s presence with us on our\njourney, two expressions, two categories of God’s presence with us come to\nmind; those of grace and the Holy Spirit. As I reflected on this I turned to the\nRevised Catechism. On the issue of grace it asks the question, in the context of\nkeeping the commandments:\n“How can you carry out these duties and overcome temptation and sin?”\n“I can do these things only by the help of God through his grace.”\nThis is followed by the question:\n“What do you mean by God’s grace?”\n“By God’s grace I mean that God himself acts in Jesus Christ to forgive,\ninspire, and strengthen me by his Holy Spirit.”\nGod forgiving me, inspiring me, strengthening me.\nTurning to the question on the Holy Spirit:\n“What does the Church teach about God the Holy Spirit?”\nPage 3 of 4\nProper 24 – 2011 – year A – Trinity 21\n“The Church teaches that God the Holy Spirit inspires all that is good in\nhumanity; that he came in his fullness at Pentecost to be the giver of life to the\nChurch, and that he enables me to grow in likeness to Jesus Christ.”\nInspires all that is good; enables me to grow in likeness to Jesus Christ.\nJust continuing our thoughts of life as a journey in the presence of God, a God\nwho forgives, who inspires, who strengthens, who enables me to grow in\nlikeness to Jesus Christ; I am called not just to travel but to travel with a\npurpose. The writer of Genesis tells us that when God called Abram, he called\nhim with a purpose. “I will make of you a great nation …. I will bless you and\nmake your name great, so that you will be a blessing …. in you all the families\nof the earth will be blessed.” (Gen 12:2-3) The nation was called not just for\nits own sake but that it might be a sign, an instrument of blessing on the wider\nworld.\nIn teaching his own disciples, he called them to be signs. ‘You are the salt of\nthe earth …. you are the light of the world …. let your light shine before\nothers that they may see your good works and give glory to your Father in\nheaven.” (Matt 5:13,14,16).\nWe are called to travel the journey of life with a purpose, to be signs of the\nKingdom, to be beacons of hope in the world in which we live. And so in the\npost communion prayer set for today, as we give thanks for God giving us\n“every good and perfect gift” we pray that we may “be a living sign of that\nPage 4 of 4\nProper 24 – 2011 – year A – Trinity 21\nperfect kingdom, where your whole creation will be made perfect in Jesus\nChrist our Lord.”\nAnd so, as we prepare to go back out into the world, to continue our journey\nbefore God, we join in praying:\nAlmighty God,\nwe thank you for feeding us\nwith the spiritual food\nof the body and blood of your Son Jesus Christ.\nThrough him we offer you our souls and bodies\nto be a living sacrifice.\nSend us out in the power of your Spirit\nto live and work to your praise and glory. Amen."
    }
}