{
    "title": "Grace in Human Frailty",
    "date": "2011-07-10",
    "blurb": "Kevin reflects on the end of the News of the World paper and draws parallels with the human stories of the Bible, particularly the saga of Jacob. He emphasizes the theme of grace throughout the biblical narrative, illustrating how God works through human imperfection. The sermon concludes with a call to service, recognizing our own strengths and weaknesses, and the transformative power of God's grace.",
    "raw_text": "Proper 10 – 2011 – year A – Trinity 3\n\nToday sees the final publication of the News of the World, the center of the phone hacking scandal. The paper's slogan, 'All human life is here,' resonates with the Bible, which portrays humanity at its best and worst, from deep despair to exultation.\n\nWe've been reading from Genesis, moving on to Jacob's story, which we'll follow for the next few weeks. It's a very human story with God involved at each stage, from God’s call to Abraham to leave his homeland to the promise of descendants. Despite setbacks, such as Sarai's barrenness and the demand on Abraham to sacrifice Isaac, God's grace is evident at each stage.\n\nThe complex story of Jacob includes intrigues, jealousies, and resentments. Jacob obtains the birthright and blessing due to Esau, causing a rift between the brothers. He is tricked into marrying Rachel's less attractive sister but remains devoted to Rachel, working another seven years for her.\n\nJacob, like his ancestors, is a real human being with strengths and failings. Yet, it is through Jacob that God chooses to act. The key lies in 'grace.' As Philip Yancey's book 'What's So Amazing About Grace?' suggests, God's love is unconditional and unmerited.\n\nThis common thread runs through the Bible. God worked through Jacob, David, Peter, and Paul, despite their frailties. God takes us, in all our strengths and weaknesses, and calls us to his service. We offer ourselves so that through us, his Kingdom may be advanced in our homes, streets, and places of work and play.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper10notused.txt",
        "raw_ocr_content": "Page 1 of 3\nProper 10 – 2011 – year A – Trinity 3\nNOT USED – WORTH AMENDING & WORKING ON\nToday sees the final publication of that paper that has been the centre of the\nphone hacking scandal for the last few years. The News of the World is now\nno more. A number of years ago their advertising slogan was ‘All human life\nis here’. I recall Rev John Bartlett observing that this could be more truthfully\nsaid of the Bible. For in the Bible we see humanity at its best and at its worst;\nthe full range of human emotion from deep despair to exultation.\nOver the last number of weeks we have been reading from Genesis and we are\nnow moving on to the story of Jacob, one that we will be following for the next\nfew weeks. This is a story that encompasses all aspects of our human nature.\nThe Jacob story is part of that bigger sage, the story of an emerging people\nwith the God of Abraham, the God of Isaac , the God of Jacob.\nIt is a very human story with God involved at each stage in that story,\nbeginning with God’s call to leave his homeland and travel to a distant land.\nWith that call there is the promise of descendants. From the very outset the\npromise seems to stall, for Sarai is barren. But after a long wait, and Abram\ntrying to force the pace by having a child by his wife’s hand maid Hagar, Sarai\nconceives and bears a son Isaac.\nAgain the promise seems to stall. First there is the demand on Abraham to\nsacrifice his son Isaac and then Isaac’s wife, Rebekah, herself proves to be\nbarren. But she in turn conceives and, as we read this morning gives birth to\nPage 2 of 3\nProper 10 – 2011 – year A – Trinity 3\ntwins, Esau and Jacob. Each stage in this story involves a gracious act of God,\neach stage is an outworking of God’s grace.\nSo begins the complex story of Jacob and his relationship with his twin borther\nEsau and his father in law Laban. It is a story of intrigues, of jealousies, of\nresentments. Jacob, the younger of the brothers, obtains the birthright and the\nblessing due to Esau, leaving a rift between the two brothers. Jacob, captivated\nby Rachel’s beauty, is tricked into marrying her less attractive older sister; such\nis his devotion to Rachel he works for another seven years.\nJacob, in common with his forbears, is presented as a real human being, with\nall his strengths and failings. Yet it is through Jacob that God chooses to act.\nThe ky to it all lies in that word ‘grace’. As I said at every stage in this saga of\nAbraham, and Isaac and Jacob involves an outworking of God’s grace. God is\nnot limited by human frailty, God works in and through the imperfection of our\nhuman nature.\nThere is a profound statement in a book by Philip Yanci that we have at home,\n‘What is so amazing about grace?’ It is something of a polemic against a\nspirituality that on the one hand proclaims justification by faith and then piles\non a whole catalogue of rules. It is this, ‘There is nothing I can do to make\nGod love me more and there is nothing I can do to make God love me less.’\nThat is grace, that is the free unmerited love of God to which I can only\nrespond.\nPage 3 of 3\nProper 10 – 2011 – year A – Trinity 3\nThis is a common thread that runs right through the Bible. God did work\nthrough Jacob, in all his frailty, as he did through David, through Peter,\nthrough Paul in all their ambiguities. All these found themselves in service\nalmost despite of themselves – David the youngest of the sons of jesse, who\nknew his times of failure before God; Peter so enthusiastic and at times so\nweak; Paul – arch persecutor of the Church, severe and hard to work with at\ntimes – and at other times so caring. As John Bartlett said of the Bible, ‘All\nhuman life is there.’ God could take each one of these very different characters,\nin all their strengths and inadequacies, and make up what is lacking.\nGod takes us, strange creatures that we are, in all our strengths and weaknesses,\nour many gifts and inadequacies and calls us to his service. Today we each\noffer ourselves, that he may send us out in the power of his Holy Spirit to live\nand work to his honour and glory so that through unlikely beings like you and\nme his Kingdom may be advanced in our homes, our streets, the places where\nwe work and play."
    }
}