{
    "title": "Keeping Up Appearances",
    "date": "2012-09-02",
    "blurb": "Kevin's sermon draws parallels between the sitcom 'Keeping Up Appearances' and the Gospel's message on authenticity in faith. He challenges the congregation to reflect on the facades they present to the world and the importance of being true to oneself before God. The sermon emphasizes the danger of hypocrisy and the need for a genuine relationship with God, beyond mere external rituals.",
    "raw_text": "PROPER 17 – 2012 – year B – Trinity 13\n\nThey say of humour that the old ones are the best. Maybe it is a sign of age and nostalgia but I do think the 1980’s and 1990’s were a period when some of the best situation comedy was produced on UK television. As I read over our Gospel reading for today, one that came to mind was the series 'Keeping Up Appearances.' The central character of the series, for those of you who recall it, is one Mrs Hyacinthe Bucket, or 'Bouquet' as she prefers to be addressed. Along with her we meet her long suffering husband, Richard, her undesirable sisters and Onslow, her most undesirable brother-in-law.\n\nWe are never quite sure has Hyacinthe’s sister married beneath her in marrying Onslow or, as I tend to suspect, has Marjorie, having cornered poor George, managed a bit of nifty social climbing herself. Poor Hyacinth is determined to present to the world a carefully crafted image of refinement, of what she perceives to be class. She seeks to cultivate as friends people who want to have nothing to do with her. Her life is lived in perpetual fear of being found out, of being discovered to be related to Onslow; that the young lady who wears skirts and shorts that are, to say the least, economical in their use of material, is in fact her youngest sister.\n\nHers is indeed a life of keeping up appearances, of portraying an image that is not true to who she really is. Of course, as in all of these programmes, part of the humour comes from the fact that the programme is but a slight exaggeration of life as it really is. For we all, to a greater of lesser extent, play this game of keeping up appearances – often quite unconsciously. Rachel frequently complains that when she first met me she had this image in her mind of a well organised Englishman who spoke with a BBC accent, who never seemed to get rattled – by the time she discovered the real person behind the make it was too late. For my part, I did not consciously present an image of calm unruffled order to my new found love – but that is obviously what came across.\n\nHow often do we find ourselves asking, 'What will the neighbours think?' Or if someone is visiting the house, telling the children not to do this or that until the visitors have gone. I am not saying there is something essentially wrong in this. We do not want to cause needless offence to elderly relatives. Or, if we go for an interview, we want to be sure that we give a good impression of ourselves. Where the whole thing can get out of hand is when the image we present is divorced from reality and we get into the area of double standards and hypocrisy.\n\nIt is here that what I have been talking about this morning impacts on our reading of the Gospel appointed for today as we resume our readings from St Mark’s Gospel. In our Gospel reading this morning we find Jesus engaged in one of his many discussions with the Pharisees. On this occasion he had been challenged on the issue of his disciples’ failure to observe the Jewish rituals of washing before meals.\n\nNow what we are talking about here is a lot more that the simple rinsing of hands before meals that simple hygiene would demand. What the Pharisees were talking about was the elaborate ritual of prayers that went with the washing to ensure ritual purity. It was symptomatic of an approach in which the externals of faith began to become more important than the substance of faith.\n\nNow we tend to look down on the Pharisees as we hear passages such as this read in our Church services. They are the bad guys. But in truth, these were not bad men. They were utterly sincere in their approach. In truth the Pharisees are alive and well in the 21st Century. In truth our attitudes are very often not very far divorced from theirs. For we too can present a façade of religious virtue. Our worship can be beautifully ordered, we can sing the hymns with gusto. We say all the right things in our worship, in our prayers and from the pulpit. But behind the façade can lie all sorts of inconsistencies. The important thing is to be honest with ourselves, to acknowledge that our life before God is still a work in process. That we don’t try to play this game of 'keeping up appearances' before God.\n\nThe people to whom Jesus was talking had made the fundamental mistake of identifying where the problem of sin lay, that it could be dealt with through the medium of ritual – that if the externals were right then we were OK with God. There was one expression I never felt at ease with in all my time in Northern Ireland and that was the term 'good living.' All too often when I heard it used it seemed to be related to the externals of faith – did you smoke, did you drink, did you play cards, wear makeup – it had more to do with the externals and had connotations of respectability.\n\nAs he did so often, Jesus referred his hearers to the Scriptures.\n\n> 'This people honours me with their lips,\n> but their hearts are far from me;\n> in vain do they worship me,\n> teaching human precepts as doctrines.' Mark 7:6,7\n\nHe goes on to identify the root cause of 'uncleanness' that so obsessed the Pharisees.\n\n> 'There is nothing outside a person that by going in can defile, but the\n> things that come out are what defile. For it is from within, from the\n> human heart, that evil intentions come: fornication, theft, murder,\n> adultery, avarice, wickedness, deceit, licentiousness, envy, slander,\n> pride, folly. All these evil things come from within, and they defile a\n> person.' Mark 7:15,21-23\n\nThe externals can be dealt with by keeping the rules, by keeping up appearances. That which comes out from us bears witness to who we really are, our attitudes, our morals and our principles. These are dealt with only in the context of surrender – surrender of heart and soul to the God and Father of our Lord Jesus Christ as we seek to apply the Word, both the written word of Scripture and the Living Word, the crucified and risen Christ in our hearts and lives as daily we seek to live out our vocation as members of the Body of Christ in this place.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper172012.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 17 – 2012 – year B – Trinity 13\nThey say of humour that the old ones are the best. Maybe it is a sign of age and\nnostalgia but I do think the 1980’s and 1990’s were a period when some of the best\nsituation comedy was produced on UK television. As I read over our Gospel\nreading for today, one that came to mind was the series ‘Keeping Up Appearances.’\nThe central character of the series, for those of you who recall it, is one Mrs\nHyacinthe Bucket, or ‘Bouquet’ as she prefers to be addressed. Along with her we\nmeet her long suffering husband, Richard, her undesirable sisters and Onslow, her\nmost undesirable brother-in-law.\nWe are never quite sure has Hyacinthe’s sister married beneath her in marrying\nOnslow or, as I tend to suspect, has Marjorie, having cornered poor George,\nmanaged a bit of nifty social climbing herself.\nPoor Hyacinth is determined to present to the world a carefully crafted image of\nrefinement, of what she perceives to be class. She seeks to cultivate as friends\npeople who want to have nothing to do with her. Her life is lived in perpetual fear\nof being found out, of being discovered to be related to Onslow; that the young lady\nwho wears skirts and shorts that are, to say the least, economical in their use of\nmaterial, is in fact her youngest sister.\nHers is indeed a life of keeping up appearances, of portraying an image that is not\ntrue to who she really is.\nOf course, as in all of these programmes, part of the humour comes from the fact\nthat the programme is but a slight exaggeration of life as it really is. For we all, to a\ngreater of lesser extent, play this game of keeping up appearances – often quite\nunconsciously. Rachel frequently complains that when she first met me she had this\nimage in her mind of a well organised Englishman who spoke with a BBC accent,\nwho never seemed to get rattled – by the time she discovered the real person behind\nthe make it was too late. for my part, I did not consciously present an image of calm\nunruffled order to my new found love – but that is obviously what came across.\nPage 2 of 3\nPROPER 17 – 2012 – year B – Trinity 13\nHow often do we find ourselves asking, ‘What will the neighbours think?’ Or if\nsomeone is visiting the house, telling the children not to do this or that until the\nvisitors have gone.\nI am not saying there is something essentially wrong in this. We do not want to\ncause needless offence to elderly relatives. Or, if we go for an interview, we want to\nbe sure that we give a good impression of ourselves. Where the whole thing can get\nout of hand is when the image we present is divorced from reality and we get into\nthe area of double standards and hypocrisy.\nIt is here that what I have been talking about this morning impacts on our reading of\nthe Gospel appointed for today as we resume our readings from St Mark’s Gospel.\nIn our Gospel reading this morning we find Jesus engaged in one of his many\ndiscussions with the Pharisees. On this occasion he had been challenged on the\nissue of his disciples’ failure to observe the Jewish rituals of washing before meals.\nNow what we are talking about here is a lot more that the simple rinsing of hands\nbefore meals that simple hygiene would demand. What the Pharisees were talking\nabout was the elaborate ritual of prayers that went with the washing to ensure ritual\npurity. It was symptomatic of an approach in which the externals of faith began to\nbecome more important than the substance of faith.\nNow we tend to look down on the Pharisees as we hear passages such as this read in\nour Church services. They are the bad guys. But in truth, these were not bad men.\nThey were utterly sincere in their approach. In truth the Pharisees are alive and well\nin the 21st Century. In truth our attitudes are very often not very far divorced from\ntheirs. for we too can present a façade of religious virtue. Our worship can be\nbeautifully ordered, we can sing the hymns with gusto. We say all the right things in\nour worship, in our prayers and from the pulpit. But behind the façade can lie all\nsorts of inconsistencies. The important thing is to be honest with ourselves, to\nacknowledge that our life before God is still a work in process. That we don’t try to\nplay this game of ‘keeping up appearances’ before God.\nPage 3 of 3\nPROPER 17 – 2012 – year B – Trinity 13\nThe people to whom Jesus was talking had made the fundamental mistake of\nidentifying where the problem of sin lay, that it could be dealt with through the\nmedium of ritual – that if the externals were right then we were OK with God.\nThere was one expression I never felt at ease with in all my time in Northern Ireland\nand that was the term ‘good living’. All too often when I heard it used it seemed to\nbe related to the externals of faith – did you smoke, did you drink, did you play\ncards, wear makeup – it had more to do with the externals and had connotations of\nrespectability.\nAs he did so often, Jesus referred his hearers to the Scriptures.\n“This people honours me with their lips,\nbut their hearts are far from me;\n7in vain do they worship me,\nteaching human precepts as doctrines.”’ Mark 7:6,7\nHe goes on to identify the root cause of ‘uncleanness’ that so obsessed the Pharisees.\n15there is nothing outside a person that by going in can defile, but the\nthings that come out are what defile.’ 21For it is from within, from the\nhuman heart, that evil intentions come: fornication, theft, murder,\n22adultery, avarice, wickedness, deceit, licentiousness, envy, slander,\npride, folly. 23All these evil things come from within, and they defile a\nperson.’ Mark 7:15,21-23\nThe externals can be dealt with by keeping the rules, by keeping up appearances.\nThat which comes out from us bears witness to who we really are, our attitudes, our\nmorals and our principles. These are dealt with only in the context of surrender –\nsurrender of heart and soul to the God and Father of our Lord Jesus Christ as we\nseek to apply the Word, both the written word of Scripture and the Living Word, the\ncrucified and risen Christ in our hearts and lives as daily we seek to live out our\nvocation as members of the Body of Christ in this place."
    }
}