{
    "title": "Path to Repentance",
    "date": "2018-08-05",
    "blurb": "In this sermon, Kevin reflects on the theme of repentance, drawing parallels between King David's confession and the characters in the film 'Shawshank Redemption'. He emphasizes the importance of honesty, vulnerability, and the transformative power of God's forgiveness. The sermon encourages self-reflection and the embrace of God's absolution as a path to peace and renewal.",
    "raw_text": "PROPER 13 – 2018 – Year B – Trinity 10\n\n'For I acknowledge my faults and my sin is ever before me.' Psalm 51:3\n\nWords from Psalm 51, the Psalm we have sung this morning. Tradition associates the composition of this Psalm as being written by David in the context of his adulterous relationship with Bathsheba, and his arrangement for the death in battle of her husband Uriah, (an episode that we read of last week) and with it the prophet Nathan confronting David with the reality of what he has done.\n\nLast week, as we thought of this dark period in the life of David, we thought of how David, enjoying the trappings and privileges of power, had lost his way, had lost sight of his moral compass, acting as if he was accountable to no-body, not even God. He had let himself down. Maybe looking back, we can think of people who may have let us down or people we have let down. Of course, we can trap people in unrealistic expectations that they can never meet. People are human and human beings can inspire and human beings can fail and disappoint. But God takes us and uses us in our humanity, in our strengths and in our weaknesses, in our faithfulness and in our failures. This is underlined by the fact that Jesus is identified in the New Testament as being born of the house of David. Even in our failure God can work redemption.\n\nBut of course, last week we heard only part of the story. This week we have read of Nathan coming to David and confronting him with the truth of what he had done. Having heard that we went on to sing and sung the words of Psalm 51. As I read our Old Testament Lesson and our Psalm, my mind turned to a scene in the film 'Shawshank Redemption'. It is a story of two prisoners serving long sentences in Shawshank, a brutal high security prison in the Southern United States. There is Andy Dufrense, a white prisoner, whom we are lead to believe has been falsely convicted. The second is a more seasoned black prisoner, we know simply as Red, who befriended Andy. At periodic intervals Red is brought before the Parole Board who are given the task of assessing whether Red is ready to return to the outside world. Each time he argues for his release until this last time, forty years into his sentence, he is brought before the Board:\n\n> Am I sorry for what I did? Not a day goes by when I don't regret what I did. I want to talk to that stupid young kid who committed that terrible crime – I want to talk some sense to him – I can't, that kid is long gone – this old man is all that's left.\n\nThis moment of realisation is the start of a new beginning. Red, expecting nothing, finds himself on the road to freedom. Our Old Testament Lesson concludes with David's confession and a pronouncement of hope:\n\n> 13David said to Nathan, 'I have sinned against the LORD.' Nathan said to David, 'Now the LORD has put away your sin; you shall not die.'\n\nWhat we are talking about here is repentance. Repentance is more than just saying sorry, repentance is about changing. In David before Nathan, in Red before the Parole Board, the barriers have come down. There is an honesty, a vulnerability, almost a nakedness as they articulate a truth about themselves that they have hidden from the world, perhaps hidden from themselves. That point of vulnerability from which they have hidden, becomes a point of new beginning, new birth. Red finds himself outside the prison walls, David hears assurances of forgiveness.\n\nAs we go through the Psalm we have sung this morning, we can follow the thread of David's path to repentance. There is a change in mood as we go through this Psalm.\n\n> 3 For I acknowledge my faults and my sin is ever before me.\n> 5 So that you are justified in your sentence and righteous in your judgment.\n\nThere is an acknowledgement that he has no claim, as of right, on God's mercy. There is a wonderful truth in the words of Absolution in the old Service of Morning Prayer, that pick up words from the Book of the prophet Ezekiel:\n\nAlmighty God, the Father of our Lord Jesus Christ, who desireth not the death of a sinner, but rather that he may turn from his wickedness, and live;\n\nThe starting point of that healing for David was truth, as he goes on to reflect:\n\n> 7. Behold, you desire truth deep within me and shall make me understand wisdom in the depths of my heart.\n\nIt is in that truth, that vulnerability before God, that David begins to regain peace with God.\n\n> 9 Make me hear of joy and gladness, that the bones you have broken may rejoice.\n> 11 Make me a clean heart, O God, and renew a right spirit within me.\n> 13 Give me again the joy of your salvation and sustain me with your gracious spirit;\n\nEvery service here on Sunday includes within it a prayer of confession and absolution. None of us come here with the same burdens that David had on his conscience and we can choose to rattle through it with little thought. But there are occasions when this can be a time of honesty with ourselves and with God and an occasion of healing and renewal. One exercise that I would often do with Confirmation candidates is to give them a slip of paper on which I ask them to write down one thing they regret. They show this to no-one. After a period of reflection they fold it up and then we burn them all, mixing up all the ashes so that nothing remains and I then say the prayer of absolution from the Prayer Book. I use this exercise to illustrate the totality of God's forgiveness when we are honest and open before him. That is often the thing remembered and remarked on – one group asked me to repeat it before their confirmation.\n\nAlmighty God, the Father of our Lord Jesus Christ, who desireth not the death of a sinner, but rather that he may turn from his wickedness, and live;\n\nGod's will for each one of us is peace in his presence, peace with God thorough faith in Christ, peace with one another. Then, freed from all that would hold us back, we can better live out our calling as articulated in the opening of our lesson from the letter to the Ephesians:\n\n> to lead a life worthy of the calling to which you have been called,\n> 2with all humility and gentleness, with patience, bearing with one another in love, 3making every effort to maintain the unity of the Spirit in the bond of peace. Ephesians 4:1-3",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper132018.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 13 – 2018 – Year B – Trinity 10\n‘For I acknowledge my faults and my sin is ever before me.’ Psalm 51:3\nWords from Psalm 51, the Psalm we have sung this morning. Tradition associates\nthe composition of this Psalm as being written by David in the context of his\nadulterous relationship with Bathsheba, and his arrangement for the death in battle\nof her husband Uriah, (an episode that we read of last week) and with it the prophet\nNathan confronting David with the reality of what he has done.\nLast week, as we thought of this dark period in the life of David, we thought of how\nDavid, enjoying the trappings and privileges of power, had lost his way, had lost\nsight of his moral compass, acting as if he was accountable to no-body, not even\nGod. He had let himself down. Maybe looking back, we can think of people who\nmay have let us down or people we have let down. Of course, we can trap people in\nunrealistic expectations that they can never meet. People are human and human\nbeings can inspire and human beings can fail and disappoint. But God takes us and\nuses us in our humanity, in our strengths and in our weaknesses, in our faithfulness\nand in our failures. This is underlined by the fact that Jesus is identified in the New\nTestament as being born of the house of David. Even in our failure God can work\nredemption.\nBut of course, last week we heard only part of the story. This week we have read of\nNathan coming to David and confronting him with the truth of what he had done.\nHaving heard that we went on to sing and sung the words of Psalm 51. As I read our\nOld Testament Lesson and our Psalm, my mind turned to a scene in the film\n‘Shawshank Redemption’. It is a story of two prisoners serving long sentences in\nShawshank, a brutal high security prison in the Southern United States. There is\nAndy Dufrense, a white prisoner, whom we are lead to believe has been falsely\nconvicted. The second is a more seasoned black prisoner, we know simply as Red,\nwho befriended Andy. At periodic intervals Red is brought before the Parole Board\nwho are given the task of assessing whether Red is ready to return to the outside\nworld. Each time he argues for his release until this last time, forty years into his\nsentence, he is brought before the Board:\nPage 2 of 4\nPROPER 13 – 2018 – Year B – Trinity 10\nhttps://www.youtube.com/watch?v=gcn6v7IaIfA\nAm I sorry for what I did? Not a day goes by when I don’t regret what I did.\nI want to talk to that stupid young kid who committed that terrible crime – I\nwant to talk some sense to him – I can’t, that kid is long gone – this old man\nis all that’s left.\nThis moment of realisation is the start of a new beginning. Red, expecting nothing,\nfinds himself on the road to freedom. Our Old Testament Lesson concludes with\nDavid’s confession and a pronouncement of hope:\n13David said to Nathan, ‘I have sinned against the LORD.’ Nathan said to\nDavid, ‘Now the LORD has put away your sin; you shall not die.’\nWhat we are talking about here is repentance. Repentance is more than just saying\nsorry, repentance is about changing. In David before Nathan, in Red before the\nParole Board, the barriers have come down. There is an honesty, a vulnerability,\nalmost a nakedness as they articulate a truth about themselves that they have hidden\nfrom the world, perhaps hidden from themselves. That point of vulnerability from\nwhich they have hidden, becomes a point of new beginning, new birth. Red finds\nhimself outside the prison walls, David hears assurances of forgiveness.\nAs we go through the Psalm we have sung this morning, we can follow the thread of\nDavid’s path to repentance. There is a change in mood as we go through this Psalm.\n3 For I ac|knowledge my | faults ♦\nand my | sin is | ever be|fore me.\n5† So that you are justified | in your | sentence ♦\nand | righteous | in your | judgment.\nThere is an acknowledgement that he has no claim, as of right, on God’s mercy.\nThere is a wonderful truth in the words of Absolution in the old Service of Morning\nPrayer, that pick up words from the Book of the prophet Ezekiel:\nPage 3 of 4\nPROPER 13 – 2018 – Year B – Trinity 10\nAlmighty God, the Father of our Lord Jesus Christ, who desireth not the\ndeath of a sinner, but rather that he may turn from his wickedness, and\nlive;\nThe starting point of that healing for David was truth, as he goes on to reflect:\n7. Behold, you desire truth | deep with|in me ♦\nand shall make me understand wisdom\n| in the | depths of my | heart.\nIt is in that truth, that vulnerability before God, that David begins to regain peace\nwith God.\n9 Make me hear of | joy and | gladness, ♦\nthat the bones you have | broken | may re|joice.\n11 Make me a clean | heart, O | God, ♦\nand re|new a right | spirit with|in me.\n13 Give me again the joy of | your sal|vation ♦\nand sustain me | with your | gracious | spirit;\nEvery service here on Sunday includes within it a prayer of confession and\nabsolution. None of us come here with the same burdens that David had on his\nconscience and we can choose to rattle through it with little thought. But there are\noccasions when this can be a time of honesty with ourselves and with God and an\noccasion of healing and renewal. One exercise that I would often do with\nConfirmation candidates is to give them a slip of paper on which I ask them to write\ndown one thing they regret. They show this to no-one. After a period of reflection\nthey fold it up and then we burn them all, mixing up all the ashes so that nothing\nremains and I then say the prayer of absolution from the Prayer Book. I use this\nexercise to illustrate the totality of God’s forgiveness when we are honest and open\nbefore him. That is often the thing remembered and remarked on – one group asked\nme to repeat it before their confirmation.\nAlmighty God, the Father of our Lord Jesus Christ, who desireth not the\ndeath of a sinner, but rather that he may turn from his wickedness, and\nlive;\nPage 4 of 4\nPROPER 13 – 2018 – Year B – Trinity 10\nGod’s will for each one of us is peace in his presence, peace with God thorough\nfaith in Christ, peace with one another. Then, freed from all that would hold us\nback, we can better live out our calling as articulated in the opening of our lesson\nfrom the letter to the Ephesians:\nto lead a life worthy of the calling to which you have been called,\n2with all humility and gentleness, with patience, bearing with one\nanother in love, 3making every effort to maintain the unity of the\nSpirit in the bond of peace. Ephesians 4:1-3"
    }
}