{
    "title": "Service and Humility",
    "date": "2011-07-31",
    "blurb": "Kevin reflects on the history of the Church of Ireland and its journey from political power to a focus on serving the community. He emphasizes the importance of humility and service, drawing parallels between the disciples' experiences and the modern Church's challenges. The sermon encourages finding strength in weakness and being willing instruments of God's work, using the feeding of the five thousand as a metaphor for God's ability to work through our inadequacies.",
    "raw_text": "Proper 13 – 2011 – year A – Trinity 6\n\nIn the house of the Archbishop of Dublin in Milltown, there is a table that came from Downing Street. In the centre, there is a plaque with the inscription, 'Around this table Gladstone and his associates plotted the destruction of the Ancient and Apostolic Church of Ireland'. The plot referred to is the process that culminated in the Disestablishment of the Church of Ireland in 1871. Prior to that date, the Church of Ireland, as part of the United Church of England and Ireland, held power and influence disproportionate to our numbers. At Disestablishment, the Church was stripped of political power and much of its wealth. The redistribution of wealth benefited Assemblies College in Belfast and Maynooth College, among others. We were allowed to keep our Church buildings, but the Church had to buy back its Rectories from the Government. The Church of Ireland had to learn a new way of being Church in a rapidly changing Ireland.\n\nFar from leading to the destruction of the Church, Disestablishment allowed the Church to pioneer the concept of Synodical government in the Anglican Communion with the involvement of the laity at all levels. The loss of secular power was a liberation, as the Church focused on its fundamental role in society of witnessing to and proclaiming the Gospel.\n\nThe Christian Church has always struggled with the balance between living in the world but not being of the world. Bernard of Clairvaux founded the great Abbey of the monastery as a centre of reform, which later became a place of great wealth and was destroyed in the French Revolution. The Church has had to learn the futility of seeking status and privilege, often compromising its witness.\n\nJesus taught his disciples about true leadership, saying, \"The greatest among you must become like the youngest, and the leader like one who serves\" (Luke 22:25ff). The feeding of the five thousand illustrates God working with what is available, no matter how inadequate, to fulfill his purposes.\n\nWe are the ones through whom God chooses to act today. Our effectiveness rests not on talent or strength but on our willingness to be used. Paul reflects on this in 2 Corinthians 12:7ff, stating that \"power is made perfect in weakness.\"\n\nThe Disestablishment of the Church of Ireland seemed like an end, but it led to a renewal that better equipped the Church for ministry in a changing environment. Today, we witness a similar disestablishment with the Church in Ireland, a reminder that the Church's effectiveness lies not in power but in faithfulness to Christ's example of service. May God use our loaves and fishes of service, empower them with his Holy Spirit, and use them for the advancement of his Kingdom.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper132011.txt",
        "raw_ocr_content": "Page 1 of 4\nProper 13 – 2011 – year A – Trinity 6\nIn the house of the Archbishop of Dublin in Milltown there is a table that came\nfrom Downing Street. In the centre there is a plaque with the inscription,\n‘Around this table Gladstone and his associates plotted the destruction of the\nAncient and Apostolic Church of Ireland’. The plot that is referred to is the\nprocess that culminated in the Disestablishment of the Church of Ireland in\n1871. Prior to that date, as part of the United Church of England and Ireland,\nthe Church of Ireland as the Established Church held a power and influence\nquite disproportionate to our numbers. At Disestablishment the Church was\nstripped of all vestiges of political power as well as much of its wealth.\nAssemblies College in Belfast and Maynooth College, among others benefited\nfrom the redistribution of wealth. We were allowed to keep our Church\nbuildings but the Church had to buy back its Rectories from the Government.\nWithin a very short period of time the Church of Ireland had to learn a new\nway of being Church in a rapidly changing Ireland that was within fifty years\nto experience full scale revolution and civil war.\nFar from leading to the destruction of the Ancient and Apostolic Church of\nIreland, the Church, now free from the constraints of Parliamentary oversight,\npioneered the whole concept of Synodical government in the Anglican\nCommunion with the involvement of the laity at all levels of Church\nadministration from Select Vestries through to the General Synod and the\nappointment of clergy and Bishops.\nThe loss of secular power and influence was in fact a liberation as the Church\nwas thrown back on its fundamental role in society of witnessing to and\nproclaiming the Gospel. From the time of the Emperor Constantine, when the\nPage 2 of 4\nProper 13 – 2011 – year A – Trinity 6\nChurch found itself moving from a position of being persecuted to one of\nprivilege in the Empire, the Christian Church has always had a problem in\nfinding the balance between living in the world but not being of the world, in\nresisting the temptation to get caught up by the power and influence of the\nworld. When we go to Taize, we camp in Cluny within sight of the ruins of the\ngreat Abbey of the monastery. That monastery was founded by Bernard of\nClairvaux as a centre of reform and renewal of the monastic movement in the\nMiddle Ages. It became in its latter days a place of great wealth and was\ndestroyed in the wake of the French Revolution. All that now remains of the\nonce magnificent basilica is one of the great towers we can see from our\ncampsite and the remains of a few walls now incorporated into houses in the\ntown centre.\nTime and time again, right up to the present day, the Church has had to learn\nthe futility of standing on dignity, of seeking status and privilege in the society\nit is called to serve in the name of Christ. Time and time again the\nfundamental witness of the Church has been compromised by its failure to\nlearn that fundamental truth. In the process the people, often the most\nvulnerable, have been hurt and the love of God hidden behind a veil of human\npride. There is something in our human nature that finds this very difficult.\nEven among the first disciples there was clearly evidence of a jockeying for\nposition. In St Luke’s Gospel we read of Jesus teaching his disciples:\nBut he said to them, \"The kings of the Gentiles lord it over them; and\nthose in authority over them are called benefactors. 26 But not so with\nyou; rather the greatest among you must become like the youngest, and\nthe leader like one who serves. 27 For who is greater, the one who is at\nthe table or the one who serves? Is it not the one at the table? But I am\namong you as one who serves. Luke 22:25ff\nPage 3 of 4\nProper 13 – 2011 – year A – Trinity 6\n‘I am among you as one who serves’ - and we are called to do the same. The\nposition of the servant is one who offers service, who is available. The passage\nwe read as our Gospel reading this morning, the feeding of the five thousand\ntakes this last point of availability one stage further. The story as told to us is\nnot one of manna dropping out of the sky, the feeding begins with a\ncomparison between the very meagre supplies the disciples can come up with\nand the massive need of a hungry crowd. It is a story of God working with\nwhat is available, in all its inadequacy, to fulfil his purposes.\nWhat is available to God to fulfil his purposes in the world of today, in this\nparticular community in which we are set? The short answer is you and me.\nWe are the ones through whom God chooses to act in the world of today. Our\neffectiveness rests not on any particular talent or strength but on our\nwillingness to be used, the degree to which we are prepared to offer that talent\nor strength in the service of others. On occasion God can work most\neffectively through what we may see as our weakness. Paul reflects on this in\nhis 2nd Letter to the Church at Corinth, a Church that would seem to have laid\ngreat store on outward signs of effectiveness:\nTherefore, to keep me from being too elated, a thorn was given me in\nthe flesh, a messenger of Satan to torment me, to keep me from being\ntoo elated. 8 Three times I appealed to the Lord about this, that it\nwould leave me, 9 but he said to me, \"My grace is sufficient for you,\nfor power is made perfect in weakness.\" So, I will boast all the more\ngladly of my weaknesses, so that the power of Christ may dwell in me.\n2 Cor 12:7ff\nPower is made perfect in weakness.\nPage 4 of 4\nProper 13 – 2011 – year A – Trinity 6\nWe began by thinking of the Disestablishment of the Church of Ireland back in\n1871. To many in the Church at the time, the plot that was hatched in\nDowning Street spelled the end of the Church of Ireland as they knew it.\nRobbed of the wealth and influence that seemed to be essential to its life and\nmission, the Church was left with what seemed to be the equivalent of a few\nloaves and fishes with which to do its work. But in the process the Church\nexperienced a renewal in its life and worship that better equipped it for\nministry in a rapidly changing political and social environment.\nIn our own day we are witnessing what almost amounts to a disestablishment\nof the Church in Ireland with all the pain and the trauma that goes with that.\nThe tenor of the Taoiseach’s speech in Dail Eireann marked a turning point in\nthe relationship between Church and State in modern Ireland, a time when\nIreland moved closer to becoming the Republic it aspires to be. The Letters\nPage in the Irish Times demonstrates the turmoil of emotions among people\nand clergy as they come to terms with what has happened in the past. This is\nno occasion for any pride or triumphalism on our part for our own history is\nnot without blemish. It is a salutary reminder that the effectiveness of the\nChurch lies not in vestiges of power and prestige in the eyes of the world but in\nfaithfulness to him who said, ‘I am among you as one who serves.’\nMay God take the inadequacy of the loaves and fishes of service we offer. May\nhe empower them with his Holy Spirit and use them for the advancement of his\nKingdom in the world of today to the honour and glory of his name. May we\nbe content to be simply the hands, the feet, the lips of Christ in the world of\ntoday."
    }
}