{
    "title": "The First Step of Faith",
    "date": "2019-07-14",
    "blurb": "Kevin's sermon explores the challenge of taking the first step in faith, drawing parallels with everyday life's hesitations. He reflects on St. Augustine's struggle for chastity and the universal fear of change, emphasizing the Christian belief that we are not meant to face life's trials alone. The sermon reassures us that God's presence and the guidance of the Holy Spirit empower us to embark on our faith journey, despite our fears and failures.",
    "raw_text": "Every so often as we read the Gospels, as we read the teaching of Jesus, we come across passages where I certainly find myself saying, 'Hmm, that is a bit harsh. I wish you hadn't said that Lord.' The Gospel passage appointed for today would fall into that category as Jesus seems to dismiss those potential followers who say to him, 'Lord, first let me go and bury my father.' 'But let me first say farewell to those at my home.' This seems to fly in the face of compassion, of loyalty to family. So, what are we to make of this?\n\nI suppose we can begin by thinking in terms of reluctance to make a first step, that initial commitment. When I began to think along those lines my mind went back to that initial prayer of St. Augustine. St. Augustine, Bishop of Hippo, born in North Africa in 354 AD. Augustine was a giant of the early Church but he was very definitely a saint with a past. The son of devout Christian parents, to the distress of his mother, he led a very dissolute early life and his path to faith was certainly not an easy one. In his book, 'Confessions,' he talks of that crucial time he wrestled with faith and the implications that would have for his lifestyle. He wrote:\n\n> But I, miserable young man, supremely miserable even at the outset of my youth, had entreated chastity of you, and said, 'Grant me chastity... but not yet.' For I was afraid lest you should hear me soon, and soon deliver me from the disease of concupiscence, which I desired to have satisfied rather than extinguished. (Confessions 13:7:17)\n\nwhich has often been paraphrased, 'Lord make me pure – but not yet.' He wanted to embrace the Christian life but there was something still holding him back.\n\nSo what we are talking about here is taking that first step. This isn't something that is exclusively religious. We come across this in all areas of life as we ask ourselves 'Will we? Won't we?' It can be on the mundane level of getting motivated to start that job we should have started ages ago – clearing out the attic, tidying up the spare room, starting to get back into a fitness routine, starting that diet – there are lots of reasons why we should and lots of excuses for why we don't. We'll get round to it eventually, sometime or another.\n\nWhen we do there is that sense of relief and we ask ourselves why we didn't do it ages ago. I suppose there is that nagging question, will I be able to keep it up, what if it doesn't work out. There can be something of that in our own Christian pilgrimage. We can be so conscious of the times we fall short, the times we fall at the old familiar hurdles, we lose our temper, we succumb to temptation, we are conscious of a sense of failure, of our own weakness – we feel like giving it up, just throwing in the towel. But this is to forget a fundamental Christian truth – we were never meant to do this on our own, in our own strength.\n\nIn his Christmas broadcast at the start of the last War, George VI quoted from the poem by Minnie Louise Haskins:\n\n> And I said to the man who stood at the gate of the year:\n> 'Give me a light that I may tread safely into the unknown.'\n> And he replied:\n> 'Go out into the darkness and put your hand into the Hand of God.\n> That shall be to you better than light and safer than a known way.'\n> So I went forth, and finding the Hand of God, trod gladly into the night.\n> And He led me towards the hills and the breaking of day in the lone East.\n\nThe God who calls us, empowers us and walks the way with us. Paul explores this whole idea of God walking alongside us, working in and through us by his Holy Spirit in the portion we read from his letter to the Galatians. He encourages us, 'Live by the Spirit' (v 16) We would also translate the word Paul uses as 'walk with, accompany.' So I rather like the way the translation 'The Message' puts this text:\n\n> 16 My counsel is this: Live freely, animated and motivated by God's Spirit.\n\nThen at the end of our portion we are encouraged to allow ourselves to 'be guided by the Spirit' (v 25) The word that we have translated as guided has connections with military formation, of a group of soldiers marching in a row, keeping in step with their leader. So we have 'be guided by the Spirit,' 'Keep in step with the Spirit.'\n\nSo, knowing that we are not alone, confident of God's presence, keeping in step with the Spirit, animated and motivated by the Spirit, we embark on our journey of faith. Yes we may fail at times, we may be confused even hurt, but God is there ready to forgive, to strengthen, to heal.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper82019.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 8 – Trinity2 –Year C - 2019\nEvery so often as we read the Gospels, as we read the teaching Jesus, we come\nacross passages where I certainly find myself saying, ‘Hmm, that is a bit harsh.\nI wish you hadn’t said that Lord’ The Gospel passage appointed or today\nwould fall into that category as Jesus seems to dismiss those potential followers\nwho say to him, ‘Lord, first let me go and bury my father.’ ‘but let me first say\nfarewell to those at my home.’ This seems to fly in the face of compassion, of\nloyalty to family. So, what are we to make of this?\nI suppose we can begin by thinking in terms of reluctance to make a first step,\nthat initial commitment. When I began to think along those lines my mind\nwent back to that initial prayer of St Augustine. St Augustine, Bishop of\nHippo, born in North Africa in 354 AD. Augustine was a giant of the early\nChurch but he was very definitely a saint with a past. The son of devout\nChristian parents, to the distress of his mother, he led a very dissolute early life\nand his path to faith was certainly not an easy one. In his book, ‘Confessions’,\nhe talks of that crucial time he wrestled with faith and the implications that\nwould have for his life style. He wrote\nBut I, miserable young man, supremely miserable even at the outset of\nmy youth, had entreated chastity of you, and said, Grant me chastity…\nbut not yet. For I was afraid lest you should hear me soon, and soon\ndeliver me from the disease of concupiscence, which I desired to have\nsatisfied rather than extinguished. Confessions 13:7:17\nwhich has often been paraphrased, ‘Lord make me pure – but not yet.’ He\nwanted to embrace the Christian life but there was something still holding him\nback.\nSo what we are talking about here is taking that first step. This isn’t something\nthat is exclusively religious. We come across this in all areas of life as we ask\nPage 2 of 3\nPROPER 8 – Trinity2 –Year C - 2019\nourselves ‘Will we? Won’t we?’ It can be on the mundane level of getting\nmotivated to start that job we should have started ages ago – clearing out the\nattic, tidying up the spare room, starting to get back into a fitness routine,\nstarting that diet – there are lots of reasons why we should and lots of excuses\nfor why we don’t. We’ll get round to it eventually, sometime or another.\nWhen we do there is that sense of relief and we ask ourselves why we didn’t do\nit ages ago. I suppose there is that nagging question, will I be able to keep it\nup, what if it doesn’t work out. There can be something of that in our own\nChristian pilgrimage. We can be so conscious of the times we fall short, the\ntimes we fall at the old familiar hurdles, we lose out temper, we succumb to\ntemptation, we are conscious of a sense of failure, of our own weakness – we\nfeel like giving it up, just throwing in the towel. But this is to forget a\nfundamental Christian truth – we were never meant to do this on our own, in\nour own strength.\nIn his Christmas broadcast at the start of the last War George 6th quoted from\nthe poem by Minnie Louise Haskins\nAnd I said to the man who stood at the gate of the year:\n“Give me a light that I may tread safely into the unknown.”\nAnd he replied:\n“Go out into the darkness and put your hand into the Hand of God.\nThat shall be to you better than light and safer than a known way.”\nSo I went forth, and finding the Hand of God, trod gladly into the night.\nAnd He led me towards the hills and the breaking of day in the lone East.\nFrom ‘God knows’ Minnie Louise Haskins\nThe God who calls us, empowers us and walks the way with us. Paul explores\nthis whole idea of God walking alongside us, working in and through us by his\nPage 3 of 3\nPROPER 8 – Trinity2 –Year C - 2019\nHoly Spirit in the portion we read from his letter to the Galatians. He\nencourages us, ‘Live by the Spirit ‘ (v 16) We would also translate the word\nPaul uses as ‘walk with, accompany’. So I rather like the way the translation\n‘The Message’ puts this text:\n16 My counsel is this: Live freely, animated and motivated by God’s Spirit.\nThen at the end of our portion we are encouraged to allow ourselves to ‘be\nguided by the Spirit’ (v 25) The word that we have translated as guided has\nconnections with military formation, of a group of soldiers marching in a row,\nkeeping in step with their leader. So we have ‘be guided by the Spirit’, ‘Keep\nin step with the Spirit.’.\nSo, knowing that we are not alone, confident of God’s presence, keeping in\nstep with the Spirit, animated and motivated by the Spirit, we embark on our\njourney of faith. Yes we may fail at times, we may be confused even hurt, but\nGod is there ready to forgive, to strengthen, to heal.\nAnd I said to the man who stood at the gate of the year:\n“Give me a light that I may tread safely into the unknown.”\nAnd he replied:\n“Go out into the darkness and put your hand into the Hand of God.\nThat shall be to you better than light and safer than a known way.”\nSo I went forth, and finding the Hand of God, trod gladly into the night.\nAnd He led me towards the hills and the breaking of day in the lone East."
    }
}