{
    "title": "The Extravagance of Mercy",
    "date": "2019-08-04",
    "blurb": "Kevin's sermon reflects on the concept of mercy as an extravagant, gracious act that goes beyond justice, drawing from the story of a mother's plea to Napoleon for her son and the biblical texts from Hosea and the Psalms. It emphasizes God's enduring love and mercy, the steadfast love (chesed) that persists despite human disobedience. The sermon connects this Old Testament theme to the New Covenant through Jesus' incarnation, highlighting the transformative power of God's love and the call for believers to embody this love in the world.",
    "raw_text": "PROPER 13 – 2019 – Year C Trinity 7\n\nThere is a story dating back to the Napoleonic wars. A young officer had been condemned to death for cowardice in the face of the enemy and was due to be shot the next day. The young man’s mother came to make one desperate plea for her son’s life to the Emperor himself, asking for mercy. Napoleon listened to her plea and simply replied, 'Madame, your son does not deserve mercy.' To which the woman replied, 'Sir, if he deserved mercy it would not be mercy.' It is a story that has always appealed to me – it underlines for me the extravagance of mercy, the sheer graciousness of mercy, to the point of going beyond what is just. This came to my mind as I read our Lesson from Hosea and the psalm appointed for today.\n\nIn recent weeks, our readings appointed from Amos and Hosea, the so-called minor prophets operating in the Northern Kingdom of Israel in the 8th century BC, can make for uncomfortable hearing; containing as they do words of judgement, words that speak of the consequences of judgement, a return to slavery as the prophet speaks of God turning his back on his people. Reading these passages, we can all too easily come to the conclusion that these are angry men, motivated by a rage against those to whom they are speaking. Our reading from Hosea this morning provides a more complete picture.\n\nThe opening verses speak of God’s love for wayward Israel in terms of a mother’s love. You sense a heartache as the prophet articulates God’s pain as he watches the inevitable consequences of their disobedience. The passage speaks of a love that loves through all rejection, despite all disobedience, that never ends.\n\nOur Psalm opens with the words:\n\n'O give thanks to the Lord, for he is gracious,\nfor his steadfast love endures forever.'\n\n'Steadfast love' translates a Hebrew word chesed. It is also translated as mercy, as loving kindness. In the context of the Old Testament, it is a word associated with Covenant, Covenant between God and his people Israel and loyalty to that Covenant. It speaks particularly of God’s loving kindness in condescending to the needs of his creation – we see many expressions of this in the Psalms; a particularly striking example of this is to be found in Psalm 136.\n\nThere is a progression from an acknowledgement of God’s greatness, through his acts of creation, of the redemption of the people from slavery in Egypt, their entry into the land and their preservation in the face of their enemies, in each verse recalling 'for his mercy endures forever.' At all stages in the story of creation, of redemption, God’s mercy, God’s chesed endures forever.\n\nOur reading from Hosea, seen in the light of God’s chesed, is not the story of an indulgent God but a faithful God. Israel may forget, may disobey, may abandon but God will never forget, is always ready to respond, one whose ultimate purpose is redemption.\n\nMoving from the Old Covenant to the New, we can see the Incarnation, God coming among us in the person of Jesus in terms of God’s chesed, God’s steadfast love. The love outlined for us in the passage from Hosea is love given to the ungrateful, the undeserving. It is love thrown back on the lover and yet the lover continues to love. This is what we see in the mystery of the Incarnation, God among us in the person of Jesus. As we read each Christmas Day:\n\n'He was in the world, and the world came into being through him; yet the world did not know him. He came to what was his own, and his own people did not accept him. But to all who received him, who believed in his name, he gave power to become children of God.'\n\nBut chesed love is covenant love and there are two parties to the covenant. Love may be rejected or ignored and love may be received; love received has the power to change the beloved. The writer of the Letter to the Colossians, in the passage we read this morning, in language reminiscent of baptism, talks of dying, of life hidden with Christ, of being raised with Christ, of stripping off the old self, of putting on the new. Lives that have been captivated by the love of the Lover are called to incarnate something of that love in the world in which we live; the love that turns the other cheek, that goes the second mile, that surrenders the second coat.\n\n'In this is love, not that we loved God but that he loved us and sent his Son to be the atoning sacrifice for our sins. Beloved, since God loved us so much, we also ought to love one another.'\n\nThis is love, this is chesed love, steadfast love. This is the love of the Eternal Lover, that has the power to change even me.\n\n'Let the same mind be in you that was in Christ Jesus,\nwho, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\nbut emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\nhe humbled himself\nand became obedient to the point of death--\neven death on a cross.'",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper132019.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 13 – 2019 – Year C Trinity 7\nThere is a story dating back to the Napoleonic wars. A young officer had been\ncondemned to death for cowardice in the face of the enemy and was due to be\nshot the next day. The young man’s mother came to make one desperate plea\nfor her son’s life to the Emperor himself, asking for mercy. Napoleon listened\nto her plea and simply replied, ‘Madame, your son does not deserve mercy.’\nTo which the woman replied, ‘Sir, if he deserved mercy it would not be\nmercy.’\nIt is a story that has always appealed to me – it underlines for me the\nextravagance of mercy, the sheer graciousness of mercy, to the point of going\nbeyond what is just. This came to my mind as I read our Lesson from Hosea\nand the psalm appointed for today.\nIn recent weeks, our readings appointed from Amos and Hosea, the so called\nminor prophets operating in the Northern Kingdom of Israel in the 8th century\nBC, can make for uncomfortable hearing; containing as they do words of\njudgement, words that speak of the consequences of judgement, a return to\nslavery as the prophet speaks of God turning his back on his people. Reading\nthese passages, we can all too easily come to the conclusion that these are\nangry men, motivated by a rage against those to whom they are speaking. Our\nreading from Hosea this morning provides a more complete picture.\nThe opening verses speak of God’s love for wayward Israel in terms of a\nmother’s love. You sense a heartache as the prophet articulates God’s pain as\nhe watches the inevitable consequences of their disobedience. The passage\nspeaks of a love that loves through all rejection, despite all disobedience, that\nnever ends.\nOur Psalm opens with the words:\n1 O give thanks to the Lord, for | he is | gracious, ♦\nfor his steadfast | love en|dures for | ever.\nPage 2 of 3\nPROPER 13 – 2019 – Year C Trinity 7\n‘Steadfast love’ translates a Hebrew word chesed. It is also translated as mercy,\nas loving kindness.\nIn the context of the Old Testament it is a word associated with Covenant,\nCovenant between God and his people Israel and loyalty to that Covenant. It\nspeaks particularly of God’s loving kindness in condescending to the needs of\nhis creation – we see many expressions of this in the Psalms; a particularly\nstriking example of this is to be found in Psalm 136 (page 751, BCP 2004)\nThere is a progression from an acknowledgement of God’s greatness, through\nhis acts of creation, of the redemption of the people from slavery in Egypt,\ntheir entry into the land and their preservation in the face of their enemies, in\neach verse recalling\n‘for his mercy endures for ever’\nAt all stages in the story of creation, of redemption, God’s mercy, God’s\nchesed endures for ever.\nOur reading from Hosea, seen in the light of God’s chesed, is not the story of\nan indulgent God but a faithful God. Israel may forget, may disobey, may\nabandon but God will never forget, is always ready to respond, one whose\nultimate purpose is redemption.\nMoving from the Old Covenant to the New, we can see the Incarnation, God\ncoming among us in the person of Jesus in terms of God’s chesed, God’s\nsteadfast love. The love outlined for us in the passage from Hosea is love\ngiven to the ungrateful, the undeserving. It is love thrown back on the lover\nand yet the lover continues to love. This is what we see in the mystery of the\nIncarnation, God among us in the person of Jesus. As we read each Christmas\nDay:\nPage 3 of 3\nPROPER 13 – 2019 – Year C Trinity 7\n10 He was in the world, and the world came into being through him; yet\nthe world did not know him. 11 He came to what was his own, and his\nown people did not accept him. 12 But to all who received him, who\nbelieved in his name, he gave power to become children of God,\nJohn 1:10-12\nBut chesed love is covenant love and there are two parties to the covenant.\nLove may be rejected or ignored and love may be received; love received has\nthe power to change the beloved. The writer of the Letter to the Colossians, in\nthe passage we read this morning, in language reminiscent of baptism, talks of\ndying, of life hidden with Christ, of being raised with Christ, of stripping off\nthe old self, of putting on the new. Lives that have been captivated by the love\nof the Lover are called to incarnate something of that love in the world in\nwhich we live; the love that turns the other cheek, that goes the second mile,\nthat surrenders the second coat.\n10 In this is love, not that we loved God but that he loved us and sent\nhis Son to be the atoning sacrifice for our sins. 11 Beloved, since God\nloved us so much, we also ought to love one another. 1 John 4:10-11\nThis is love, this is chesed love, steadfast love. This is the love of the Eternal\nLover, that has the power to change even me.\n5 Let the same mind be in you that was in Christ Jesus,\n6 who, though he was in the form of God,\ndid not regard equality with God\nas something to be exploited,\n7 but emptied himself,\ntaking the form of a slave,\nbeing born in human likeness.\nAnd being found in human form,\n8 he humbled himself\nand became obedient to the point of death--\neven death on a cross. Phil 2:5-8"
    }
}