{
    "title": "Spiritual Confirmation",
    "date": "2019-10-20",
    "blurb": "This sermon discusses the significance of confirmation and ordination in the Christian faith. It emphasizes the role of the Holy Spirit in empowering individuals for service and spiritual growth. The message highlights the transformative power of God's Spirit in guiding believers towards wisdom, understanding, and reverence for God.",
    "raw_text": "With full assurance of faith, abounding in hope, the bishop prays the confirmation prayer and rooted and grounded in love. Almighty and everliving God, whose Son Jesus Christ was crucified and rose again to break the power of sin and death. We give thanks and praise for the gift of your Holy Spirit by whom your servants have been born again and made your children. Grant that in the power of the same Holy Spirit they may continue to grow in the knowledge and likeness of Christ; to whom with you and the Holy Spirit, belong glory and honour, worship and praise, now and for ever. Amen.\n\n> \"Then the LORD God formed man from the dust of the ground, and breathed into his nostrils the breath of life; and the man became a living being.\" - Genesis 2:6.\n\nThose to be confirmed kneel before the bishop, who lays his hand upon the head of each one, saying, \"Confirm, O Lord, with your heavenly grace, that he/she may continue to be yours forever, and daily increase in your Holy Spirit more and more until he/she comes to your eternal kingdom.\"\n\nDuring ordination, the bishop lays hands on the head of each candidate and says, \"Pour out your Holy Spirit upon them for the office and work of a deacon in your Church.\" The bishop continues, \"Fill them with grace and power that they may fulfil their ministry. Make them faithful to serve, ready to teach, constant in advancing your Gospel, proclaiming by word and action the word of salvation.\"\n\n> \"All scripture is inspired by God and is useful for teaching, for reproof, for correction, and for training in righteousness.\" - 2 Timothy 3:16.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year C/proper 24 - notes.txt",
        "raw_ocr_content": "with full assurance of faith,\nCONFIRMATION\nabounding in hope\nThe bishop prays the confirmation prayer and rooted and grounded in love.\nAlmighty and everliving God, Pour out your Spirit, Lord.\nwhose Son Jesus Christ was crucified and rose again\nGrant them wisdom and discipline to work faithfully\nto break the power of sin and death:\nwith their fellow-servants in Christ,\nWe give you thanks and praise for the gift of your Holy Spirit\ncontinuing strong and steadfast in your Son Jesus Christ our Lord.\nby whom your servants have been born again\nand made your children. Pour out your Spirit, Lord.\nGrant that in the power of the same Holy Spirit\nAccept our prayers, most merciful Father,\nthey may continue to grow\nthrough your Son Jesus Christ our Lord,\nin the knowledge and likeness of Christ;\nto whom with you and your Holy Spirit,\nincrease in them your gracious gifts,\nbelong glory and honour, worship and praise,\nthe spirit of wisdom and understanding,\nnow and for ever. Amen.\nthe spirit of right judgment and inward strength,\nthe spirit of knowledge and godly living;\nand fill them, O Lord, with the spirit of reverence for you.\n:Ge 2:6.\n-- 7 then the LORD God formed man from the dust of the ground, and breathed\nThose to be confirmed kneel before the bishop, who shall lay his hand upon into his nostrils the breath of life; and the man became a living being. 8\nthe head of each one, saying\nGe 25:8.\nConfirm … ., O Lord, with your heavenly grace,\nAbraham breathed his last and died in a good old age, an old man and full of\nthat he/she may continue to be yours for ever,\nyears, and was gathered to his people.\nand daily increase in your Holy Spirit more and more\nuntil he/she comes to your eternal kingdom.\nMt 27:50.\n50 Then Jesus cried again with a loud voice and breathed his last.\nORDINATION\n:Jn 20:22.\nHere the bishop lays hands on the head of each candidate and says 22 When he had said this, he breathed on them and said to them, \"Receive the Holy\nSpirit.\npour out your Holy Spirit upon .…\nfor the office and work of a deacon in your Church.\n:2Ti 3:16.\nThe bishop having laid hands on all of them, continues 2Ti 3:16 pa'sa grafh; qeovpneusto\" kai; wjfevlimo\" pro;\" didaskalivan, pro;\"\nFill them with grace and power that they may fulfil their ministry. ejlegmovn, pro;\" ejpanovrqwsin, pro;\" paideivan th;n ejn dikaiosuvnh/,\nPour out your Spirit, Lord.\nMake them faithful to serve,\n:2Ti 3:16\nready to teach,\n16 All scripture is inspired by God and is useful for teaching, for reproof, for\nconstant in advancing your Gospel,\ncorrection, and for training in righteousness,\nproclaiming by word and action the word of salvation"
    }
}