{
    "title": "Mustard Seed Faith",
    "date": "2022-10-02",
    "blurb": "This sermon explores the concept of faith, not as a commodity, but as a relationship. It emphasizes that faith is about trust rather than certainty, and that it is not just about us seeking God, but God meeting us on our journey. The sermon also highlights the idea of 'mustard seed faith' - that even a small amount of faith can grow into something significant.",
    "raw_text": "It is funny how things may come into your mind. As I started to read the Gospel reading for this morning, the Apostles’ plea to Jesus, ‘Increase our faith!’; the image that flashed into my mind was of a Basil Fawlty like character in a dog collar, screaming back at them; ‘What’s wrong with you? You must have more faith!’\n\nThat’s not entirely inappropriate, because which of us has not at some stage felt guilty at the precariousness of our faith in times of anxiety or testing; maybe even sensed a touch of pity, or even disapproval, from fellow Christians. So if the Basil Fawlty approach is wrong, what do we make of this word faith and an appeal to faith?\n\nI love that description of faith that we find in the Letter to the Hebrews:\n\nNow faith is the assurance of things hoped for, the conviction of things not seen. Heb 11:1\n\nI suppose what I like about it is that it speaks of trust rather than certainty. When I am certain my mind is all too often closed. When I trust, my heart and mind are open. This 11th chapter of the Letter to the Hebrews goes on to recall the readers’ ancestors, Noah, Abraham, Isaac, Jacob, Moses; in their time of trial and uncertainty they trusted in what they could not see. And so faith, a trusting, expectant faith involves a looking forward in hope, not a vague hope but one that has stood the test of time in the lives of our spiritual ancestors.\n\nAnd I love the way the Message translation puts it:\n\nThe fundamental fact of existence is that this trust in God, this faith, is the firm foundation under everything that makes life worth living. It's our handle on what we can't see.\n\nAnd so, as we move away from faith as a commodity, as per Basil Fawlty in a dog collar; we come to see that faith is more about relationship.\n\nAnd so, let’s start with those words out of ‘The Message’ translation. Faith is ‘our handle on what we can’t see.’ Faith is one of the ways in which people of faith, followers of Jesus make sense of our human existence in all its highs and lows, its triumphs, its disappointments – and yes, its failures. Alone, among all other living creatures, we as human beings are conscious of living in time. We remember our past, we can think about what is happening in the present and we are conscious of a future lying before us.\n\nThe writer of the Letter to the Hebrews, writing to a community who were facing persecution, encouraged his readers to think back to the past, to people in Israel’s history who faced trials every bit as hard as what they were facing; who knew God’s presence with them and were used by God in the time and place in which God set them.\n\nWe in our day, as people of faith, are invited to look back to what God has done in Christ; on what God has done and is doing in the lives of extraordinary and ordinary people in God’s service in the world of today; and in turn commit ourselves to his service.\n\nAgain, looking back to the past and the great figures of faith, we discover a pattern of not so much of them seeking God as God seeking them. I think of Moses at the burning bush; the boy Samuel hearing that voice in the night; Elijah, fearful for his life, hiding in the cave; Isaiah in the Temple; Saul of Tarsus confronted by the Risen Jesus on the Damascus Road.\n\nAnd so, it is not just a matter of us seeking God, chasing after God. The very one we seek meets us on the road, travels the road with us, listening to us, understanding us and calls us further on.\n\nFaith, this trusting, expectant, hopeful faith, takes us beyond ourselves. As we look out from ourselves towards the God who calls us, who has met us in Christ, we discover who we are; who we really are, as ones made in the image of God, loved by God, redeemed by God. It is as we let go, we discover the truth of those words:\n\nFor those who want to save their life will lose it, and those who lose their life for my sake will find it. Matt 16:25\n\nPaul, writing to the Galatians, takes this further, talks of identifying with Christ:\n\nI have been crucified with Christ and I no longer live, but Christ lives in me. The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me. Gal 2:20\n\nThe life I live in the body, I live by faith; this God centred, Christ centred expectant, trusting hope.\n\nLet’s now just pause and take stock of where we have come from. I took as my starter that description of faith that we find in ‘The Message’\n\nIt's our handle on what we can't see.\n\nWe’ve thought of faith, not in terms of commodity but of relationship.\n\nNot just us seeking God but God meeting us on the road, listening, understanding, leading us on. In the process we discover who we really are; ones made in the image of God, redeemed by God, called to be living signs of God’s presence in the world.\n\nNow let us return to our Gospel reading.\n\nThe apostles said to the Lord, “Increase our faith!” The Lord replied, “If you had faith the size of a mustard seed, you could say to this mulberry tree, ‘Be uprooted and planted in the sea,’ and it would obey you. Luke 17:5\n\nAt first reading this seems to take us back to faith as a commodity – and the words seem discouraging, even harsh.\n\nBut then Jesus uses the illustration of mustard seed else where doesn’t he? Earlier in Luke’s Gospel we read of Jesus saying:\n\nHe said therefore, “What is the kingdom of God like? And to what should I compare it? It is like a mustard seed that someone took and sowed in the garden; it grew and became a tree, and the birds of the air made nests in its branches.” Luke 13:18\n\nThe Kingdom of Heaven is like a mustard seed – if you had faith the size of a mustard seed. The mustard seed can grow into a great tree. The Kingdom of Heaven can grow out of small beginnings. Taken in this light, Jesus’ words about faith take on a new significance for me.\n\nBrother Roger, the founder of the Ecumenical Taizé Community in France, used to talk of ‘mustard seed faith’. God, he used to say, can take the littleness of the faith we are able to offer in the present and work through it. I often think of the father who came to Jesus desperately asking for help for his child. When Jesus asks if he has faith, he cries ‘Lord I believe, help my unbelief!’ Jesus takes the faith of the father and works through it in all its weakness and ambiguity.\n\nLike the father, we can be discouraged by what we see as the littleness of our faith; discouraged, we pull back thinking that we can be of no use to God. Over and over again we need to remind ourselves that the Kingdom doesn’t depend on me, on my strengths, on my talents. The Kingdom is built by God, working through us in all our strengths and weaknesses.\n\nAnd so, if we let him, if we open ourselves to him, God takes us in the inadequacy and ambiguity of our faith, in all our littleness and can use us as signs, as instruments in making his kingdom present among the people and situations in which he has placed us.\n\nO Lord, take our Mustard Seed Faith and work through it and us in the building up of your Mustard Seed Kingdom.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/COGS/Proper/Year C/proper222022Sunday.txt",
        "raw_ocr_content": "Page 1 of 5\nPROPER 22 – Year C – 2022 – Trinity 16 – COGS 2/10/22\nIt is funny how things may come into your mind. As I started to read the\nGospel reading for this morning, the Apostles’ plea to Jesus, ‘Increase our\nfaith!’; the image that flashed into my mind was of a Basil Fawlty like\ncharacter in a dog collar, screaming back at them; ‘What’s wrong with you?\nYou must have more faith!’\nThat’s not entirely inappropriate, because which of us has not at some stage felt\nguilty at the precariousness of our faith in times of anxiety or testing; maybe\neven sensed a touch of pity, or even disapproval, from fellow Christians. So if\nthe Basil Fawlty approach is wrong, what do we make of this word faith and an\nappeal to faith?\nI love that description of faith that we find in the Letter to the Hebrews:\nNow faith is the assurance of things hoped for, the conviction of\nthings not seen. Heb 11:1\nI suppose what I like about it is that it speaks of trust rather than certainty.\nWhen I am certain my mind is all too often closed. When I trust, my heart and\nmind are open. This 11th chapter of the Letter to the Hebrews goes on to recall\nthe readers’ ancestors, Noah, Abraham, Isaac, Jacob, Moses; in their time of\ntrial and uncertainty they trusted in what they could not see. And so faith, a\ntrusting, expectant faith involves a looking forward in hope, not a vague hope\nbut one that has stood the test of time in the lives of our spiritual ancestors.\nAnd I love the way the Message translation puts it:\nThe fundamental fact of existence is that this trust in God, this faith, is\nthe firm foundation under everything that makes life worth living. It's\nour handle on what we can't see.\nPage 2 of 5\nPROPER 22 – Year C – 2022 – Trinity 16 – COGS 2/10/22\nAnd so, as we move away from faith as a commodity, as per Basil Fawlty in a\ndog collar; we come to see that faith is more about relationship.\nAnd so, let’s start with those words out of ‘The Message’ translation. Faith is\n‘our handle on what we can’t see.’ Faith is one of the ways in which people of\nfaith, followers of Jesus make sense of our human existence in all its highs and\nlows, its triumphs, its disappointments – and yes, its failures. Alone, among all\nother living creatures, we as human beings are conscious of living in time. We\nremember our past, we can think about what is happening in the present and we\nare conscious of a future lying before us.\nThe writer of the Letter to the Hebrews, writing to a community who were\nfacing persecution, encouraged his readers to think back to the past, to people\nin Israel’s history who faced trials every bit as hard as what they were facing;\nwho knew God’s presence with them and were used by God in the time and\nplace in which God set them.\nWe in our day, as people of faith, are invited to look back to what God has\ndone in Christ; on what God has done and is doing in the lives of extraordinary\nand ordinary people in God’s service in the world of today; and in turn commit\nourselves to his service.\nAgain, looking back to the past and the great figures of faith, we discover a\npattern of not so much of them seeking God as God seeking them. I think of\nMoses at the burning bush; the boy Samuel hearing that voice in the night;\nPage 3 of 5\nPROPER 22 – Year C – 2022 – Trinity 16 – COGS 2/10/22\nElijah, fearful for his life, hiding in the cave; Isaiah in the Temple; Saul of\nTarsus confronted by the Risen Jesus on the Damascus Road.\nAnd so, it is not just a matter of us seeking God, chasing after God. The very\none we seek meets us on the road, travels the road with us, listening to us,\nunderstanding us and calls us further on.\nFaith, this trusting, expectant, hopeful faith, takes us beyond ourselves. As we\nlook out from ourselves towards the God who calls us, who has met us in\nChrist, we discover who we are; who we really are, as ones made in the image\nof God, loved by God, redeemed by God. It is as we let go, we discover the\ntruth of those words:\nFor those who want to save their life will lose it, and those who lose\ntheir life for my sake will find it. Matt 16:25\nPaul, writing to the Galatians, takes this further, talks of identifying with\nChrist:\nI have been crucified with Christ and I no longer live, but Christ lives\nin me. The life I now live in the body, I live by faith in the Son of\nGod, who loved me and gave himself for me. Gal 2:20\nThe life I live in the body, I live by faith; this God centred, Christ centred\nexpectant, trusting hope.\nLet’s now just pause and take stock of where we have come from. I took as my\nstarter that description of faith that we find in ‘The Message’\nIt's our handle on what we can't see.\nWe’ve thought of faith, not in terms of commodity but of relationship.\nPage 4 of 5\nPROPER 22 – Year C – 2022 – Trinity 16 – COGS 2/10/22\nNot just us seeking God but God meeting us on the road, listening,\nunderstanding, leading us on. In the process we discover who we really are;\nones made in the image of God, redeemed by God, called to be living signs of\nGod’s presence in the world.\nNow let us return to our Gospel reading.\nThe apostles said to the Lord, “Increase our faith!” The Lord replied,\n“If you had faith the size of a mustard seed, you could say to this\nmulberry tree, ‘Be uprooted and planted in the sea,’ and it would obey\nyou. Luke 17:5\nAt first reading this seems to take us back to faith as a commodity – and the\nwords seem discouraging, even harsh.\nBut then Jesus uses the illustration of mustard seed else where doesn’t he?\nEarlier in Luke’s Gospel we read of Jesus saying:\nHe said therefore, “What is the kingdom of God like? And to what\nshould I compare it? It is like a mustard seed that someone took and\nsowed in the garden; it grew and became a tree, and the birds of the air\nmade nests in its branches.” Luke 13:18\nThe Kingdom of Heaven is like a mustard seed – if you had faith the size of a\nmustard seed. The mustard seed can grow into a great tree. The Kingdom of\nHeaven can grow out of small beginnings. Taken in this light, Jesus’ words\nabout faith take on a new significance for me.\nBrother Roger, the founder of the Ecumenical Taizé Community in France,\nused to talk of ‘mustard seed faith’. God, he used to say, can take the littleness\nof the faith we are able to offer in the present and work through it. I often\nthink of the father who came to Jesus desperately asking for help for his child.\nPage 5 of 5\nPROPER 22 – Year C – 2022 – Trinity 16 – COGS 2/10/22\nWhen Jesus asks if he has faith, he cries ‘Lord I believe, help my unbelief!’\nJesus takes the faith of the father and works through it in all its weakness and\nambiguity.\nLike the father, we can be discouraged by what we see as the littleness of our\nfaith; discouraged, we pull back thinking that we can be of no use to God.\nOver and over again we need to remind ourselves that the Kingdom doesn’t\ndepend on me, on my strengths, on my talents. The Kingdom is built by God,\nworking through us in all our strengths and weaknesses.\nAnd so, if we let him, if we open ourselves to him, God takes us in the\ninadequacy and ambiguity of our faith, in all our littleness and can use us as\nsigns, as instruments in making his kingdom present among the people and\nsituations in which he has placed us.\nO Lord, take our Mustard Seed Faith and work through it and us in the building\nup of your Mustard Seed Kingdom."
    }
}