{
    "title": "Unity in Faith and Charity",
    "date": "2015-09-06",
    "blurb": "Kevin's sermon emphasizes the common dignity and unity of all people before God, regardless of social status. He draws from the Book of Proverbs and the teachings of St. Paul to highlight the Christian value of treating everyone as equals in Christ. The sermon also addresses the refugee crisis, urging the congregation to remember their own history of exile and to respond with compassion and practical support to those in need.",
    "raw_text": "## PROPER 18 – Year B – 2015 – Trinity 14\n\n_\"The rich and the poor have this in common: the LORD is the maker of them all.\"_ Proverbs 22.2\n\nAs you look around the Church, you will see remembered in the windows and in the tablets on the walls a wide range of people who in the past have been part and parcel of the life of this Parish. But all of them, be they the Earl, the barrister, the shopkeeper, the servant, the fisherman, all will have knelt at the same communion rail, taken hold of this cup, remembering the Christ that died that each should live. This is why I have always valued the practice in the Church of Ireland of drinking from a common cup, kneeling side by side at the communion rail. It underlines that fundamental unity expressed in our reading from the Book Proverbs: _\"The rich and the poor have this in common: the LORD is the maker of them all.\"_ Proverbs 22.2\n\nThat unity in which Earl and fisherman come to drink from this cup runs deeper than that. It is a unity arising from a common faith, a common allegiance to Christ. St Paul, in writing to the Galatians reminded them: _\"As many of you as were baptized into Christ have clothed yourselves with Christ. There is no longer Jew or Greek, there is no longer slave or free, there is no longer male and female; for all of you are one in Christ Jesus.\"_ Gal 3:27-28\n\nThe Old Testament talks of another common identity that spans all races, cultures and time as it speaks of an understanding of man not just made by God, but made in the image of God. The Jewish people have always had a very strong sense of their identity, of who they are before God, of their particular place in salvation history. Nevertheless, the Old Testament Scriptures speak of obligations to those on the outside, to the poor and the alien, recalling their own experience as a people of slavery and alienation.\n\nIn Leviticus we read: _\"When an alien resides with you in your land, you shall not oppress the alien. The alien who resides with you shall be to you as the citizen among you; you shall love the alien as yourself, for you were aliens in the land of Egypt: I am the LORD your God.\"_ Lev 19:33-34\n\nIn Deuteronomy, there is an obligation of practical care, a sharing of resources: _\"When you gather the grapes of your vineyard, do not glean what is left; it shall be for the alien, the orphan, and the widow. Remember that you were a slave in the land of Egypt; therefore I am commanding you to do this.\"_ Deut 24:21-22\n\nFor the last few years we have watched the unfolding conflicts in Syria, Libya and Northern Iraq with the emergence of the so-called Islamic State. With this we have seen a growing number of refugees flowing into neighbouring countries. And now the problem moves closer to home as refugees have moved out beyond Italy and Greece in what is becoming one of the largest movements of population since the Second World War.\n\nWhat are we to do? The initial reaction may be to throw up our hands and say this problem is too big for us, but can we in all integrity do this? What would it say about us as a people? This is where I find the injunction in Leviticus very pertinent. _\"When an alien resides with you in your land, you shall not oppress the alien. The alien who resides with you shall be to you as the citizen among you; you shall love the alien as yourself, for you were aliens in the land of Egypt: I am the LORD your God.\"_\n\nOur Christian heritage, our own national experience of exile have all contributed to who we are as a nation, to our values as a people. What are these values that we bring to our response to the current crisis facing us? I think, first of all, there is a recognition of fundamental human dignity. Then there is a God-given responsibility to respond to those in need.\n\nWhat can you or I do? Part of the solution to this current crisis will be in lots of small pieces coming together. Maybe as refugees arrive, there will be opportunities to reach out in simple acts of charity and hospitality. Let us begin to think imaginatively of ways in which we could engage either as a community or in partnership with other churches as a practical expression of our commitment to the Christian values that are a part of who we are.\n\n_\"Suppose a brother or sister is without clothes and daily food. If one of you says to him, 'Go, I wish you well; keep warm and well fed,' but does nothing about his physical needs, what good is it? In the same way, faith by itself, if it is not accompanied by action, is dead.\"_ As we kneel at the rails to drink of the cup, let us ponder on how we can serve the Christ we meet in bread and wine in the pain and turmoil of this world.\n\n**Prayers for the Refugee Crisis in Europe and the Middle East**\n\nLord Jesus, as a child, you fled from persecution; You have lived the fear, desperation, hunger, cold, and isolation that being a refugee brings. Bring comfort and peace of heart, Lord, to all those risking their lives to seek safety, Protect and guide their journeys, Lord. _\"Faith, hope and charity, but the greatest of these is charity.\"_ Father, bless those who see the plight of refugees, and who are meeting those needs. For those who are exhausted, give them renewed strength; For those who feel overwhelmed, give them courage; For those who feel fearful, we pray for peace and compassion.\n\nLord, we want to hear your voice again, Guide us as we, as Mothers’ Union, reach out in your name to refugees both in Europe and the Middle East and those affected by conflict in South Sudan and Burundi, in Thailand and many other areas across the world. Bless the work of Mothers’ Union, And lead us, Lord, to fully play our part.\n\nWe thank God that our countries our blessed with resources. We uphold in prayer the governments across Europe and the Middle East, asking for wisdom for leaders to meet the needs of the most vulnerable. Father God, you are our place of refuge and safety, We pray for you to help us at this time of need. Give us compassion combined with wisdom to meet need with the right resources. May our practical action be rooted in your love as we reach out as the hands of Christ. Amen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper182015.txt",
        "raw_ocr_content": "Page 1 of 5\nPROPER 18 – Year B – 2015 – Trinity 14\n2The rich and the poor have this in common:\nthe LORD is the maker of them all. Proverbs 22.2\nAs you look around the Church you will see remembered in the windows and\nin the tablets on the walls a wide range of people who in the past have been\npart and parcel of the life of this Parish. You will see references to the last Earl\nof Howth, those who have distinguished themselves in politics, in law, in the\nmilitary, in academic life. But of course these are not the only ones who\nassembled here Sunday by Sunday – there were those for whom there are no\nmemorial tablets, no references to their presence, to their faithfulness in their\nworship and service of God and their fellow man.\nBut all of them, be they the Earl, the barrister, the shopkeeper, the servant, the\nfisherman, all will have knelt at the same communion rail, taken hold of this\ncup, remembering the Christ that died that each should live. This is why I have\nalways valued the practice in the Church of Ireland of drinking from a common\ncup, kneeling side by side at the communion rail. It underlines that\nfundamental unity expressed in our reading from the Book Proverbs:\n2The rich and the poor have this in common:\nthe LORD is the maker of them all. Proverbs 22.2\nThat unity in which Earl and fisherman come to drink from this cup runs\ndeeper than that. It is a unity arising from a common faith, a common\nallegiance to Christ. St Paul, in writing to the Galatians reminded them:\nAs many of you as were baptized into Christ have clothed\nyourselves with Christ. 28 There is no longer Jew or Greek, there\nis no longer slave or free, there is no longer male and female; for\nall of you are one in Christ Jesus. Gal 3:27-28\nHe speaks of an identity that transcends what would have been seen as\nunassailable barriers of culture, of class, of gender. So barrister and servant\ncame forward to drink of this one cup.\nPage 2 of 5\nPROPER 18 – Year B – 2015 – Trinity 14\nThe Old Testament talks of another common identity that spans all races,\ncultures and time as it speaks of an understanding of man not just made by\nGod, but made in the image of God. That does not mean that we are all\nidentical but it does mean that we have a common dignity.\nThe Jewish people have always had a very strong sense of their identity, of\nwho they are before God, of their particular place in salvation history.\nNevertheless the Old Testament Scriptures speak of obligations of the Jew not\njust in the sphere of his or her religious and community life, they also speak\nvery powerfully of obligations to those on the outside, to the poor and the alien,\nrecalling their own experience as a people of slavery and alienation. And so\nwe read in the book Leviticus\nWhen an alien resides with you in your land, you shall not oppress the\nalien. 34 The alien who resides with you shall be to you as the citizen\namong you; you shall love the alien as yourself, for you were aliens in\nthe land of Egypt: I am the LORD your God. Lev 19:33-34\nIn Deuteronomy, there is not just an obligation not to oppress; there is an\nobligation of practical care, a sharing of resources:\n21 When you gather the grapes of your vineyard, do not glean what is\nleft; it shall be for the alien, the orphan, and the widow. 22 Remember\nthat you were a slave in the land of Egypt; therefore I am commanding\nyou to do this. Deut 24:21-22\nIn each case, with the injunction comes the reminder: ‘remember you were\nonce aliens, you were once slaves in the land of Egypt.’\nFor the last few years we have watched on our television screens the unfolding\nconflicts in Syria, in Libya and in Northern Iraq with the emergence of the so\ncalled Islamic State. With this we have seen a growing number of refugees\nflowing into neighbouring countries such as Jordan, Lebanon and Turkey. In\nmore recent weeks and months we have witnessed tragic scenes in the\nMediterranean and refugees in their desperation have resorted to traffickers\nPage 3 of 5\nPROPER 18 – Year B – 2015 – Trinity 14\nwho have put them on flimsy vessels and pointed them in the direction of Italy\nand the Greek islands. Many, despite the efforts of European naval vessels ,\nhave perished. And now the problem moves closer to home as refugees have\nmoved out beyond Italy and Greece in what is becoming one of the largest\nmovements of population since the Second Wold War and we have witnessed\nrefugees walking the motorway out of Budapest in a desperate effort to reach\nthe Austrian border and refuge in Germany.\nWhat are we to do? The initial reaction may be to throw up our hands and say\nthis problem is too big for us, we have enough problems of our own to deal\nwith. But can we in all integrity do this? What would it say about us as a\npeople? This is where I find the injunction in Leviticus very pertinent.\nWhen an alien resides with you in your land, you shall not oppress the\nalien. 34 The alien who resides with you shall be to you as the citizen\namong you; you shall love the alien as yourself, for you were aliens in\nthe land of Egypt: I am the LORD your God.\n‘For you were aliens ..’ Of course in the mid 19th century there was a mass\nexodus from this island of people who felt they had no choice; better to risk\ndeath in the coffin ships than face starvation here at home – as the Famine\nMemorial on Custom House Quay reminds us. There is another memorial by\nthe same artist in Ireland Park in Toronto of the emigrants arriving – the\ndesperation of the first replaced by the hope of the second.\nOur Christian heritage, our own national experience of exile have all\ncontributed to who we are as a nation, to our values as a people. What are\nthese values that we bring to our response to the current crisis facing us.? I\nthink, first of all there is a recognition of fundamental human dignity – as the\nmake shift posters held aloft by the migrants declare, ‘We are not animals’.\nThen there is a God given responsibility to respond to those in need. ‘For as\nmuch as you did it to least of these you did it to me.’ There are no easy\nPage 4 of 5\nPROPER 18 – Year B – 2015 – Trinity 14\nsolutions. But whatever course of action is followed, it must be informed, it\nmust reflect these fundamental values.\nWhat can you or I do? What we have to offer seems so insignificant in the face\nof the enormity of the problem. You may recall when we were embarking on\nour Roof Fund and I mentioned a figure of 200,000 euro I said, ‘What is the\nbest way to eat an elephant? - In small pieces.’ Part of the solution to this\ncurrent crisis will be in lots of small pieces coming together. Only last week\none lady asked me, ‘Is there nothing we can do as a community?’ Maybe as\nrefugees arrive, there will be opportunities to reach out in simple acts of charity\nand hospitality – let us begin to think imaginatively of ways in which we could\nengage either as a community or in partnership with other churches as a\npractical expression of our commitment to the Christian values that are a part\nof who we are\nI leave the last word to the writer of the Letter of James:\nSuppose a brother or sister is without clothes and daily food. If one of\nyou says to him, “Go, I wish you well; keep warm and well fed,” but\ndoes nothing about his physical needs, what good is it? In the same\nway, faith by itself, if it is not accompanied by action, is dead.\nAs we kneel at the rails to drink of the cup, let us ponder on how we can serve\nthe Christ we meet in bread and wine in the pain and turmoil of this world..\nPage 5 of 5\nPROPER 18 – Year B – 2015 – Trinity 14\nPrayers for the Refugee Crisis in Europe and the Middle East\nLord Jesus, as a child, you fled from persecution; You have lived the fear, desperation, hunger, cold, and\nisolation that being a refugee brings. Bring comfort and peace of heart, Lord, to all those risking their lives\nto seek safety, Protect and guide their journeys,Lord.\n“Faith, hope and charity, but the greatest of these is charity. “Father, bless those who see the plight of\nrefugees, and who are meeting those needs. For those who are exhausted, give them renewed strength; For\nthose who feel overwhelmed, give them courage; For those who feel fearful, we pray for peace and\ncompassion.\nLord, we want to hear your voice again, Guide us as we, as Mothers’ Union, reach out in your name to\nrefugees both in Europe and the Middle East and those affected by conflict in South Sudan and Burundi, in\nThailand and many other areas across the world. Bless the work of Mothers’ Union, And lead us, Lord, to\nfully play our part.\nWe thank God that our countries our blessed with resources. We uphold in prayer the governments across\nEurope and the Middle East, asking for wisdom for leaders to meet the needs of the most vulnerable.\nFather God, you are our place of refuge and safety, We pray for you to help us at this time of need. Give us\ncompassion combined with wisdom to meet need with the right resources. May our practical action be\nrooted in your love as we reach out as the hands of Christ. Amen"
    }
}