{
    "title": "Living with Difference",
    "date": "2011-07-10",
    "blurb": "Kevin reflects on the importance of remembering and living with differences, drawing parallels between the biblical story of Jacob and Esau and the historical and contemporary conflicts in Ireland. He emphasizes the need for mutual understanding and reconciliation, recognizing the trauma and pain of all communities involved. The sermon calls for empathy and the role of individuals as agents of healing and reconciliation in their own contexts.",
    "raw_text": "PROPER 10 – 2011 – year A – Trinity 3\n\nToday is observed in Ireland as a National Day of Commemoration, a day of remembering members of the Irish Defence Forces who have given their lives in the service. Remembering will also be of others who have suffered in conflicts in our own land. Remembering can be a funny thing. Different people can remember the same things in different ways.\n\nWe read as our Old Testament lesson this morning the account given by the writer of Genesis of the beginnings of a family argument that was to go on for years between Jacob and his brother Esau. Family rows, community rows, international rows are as old as time itself. All this raises the issue of how do we live with difference, difference within families, within communities – differences within Churches.\n\nAs I read that story of Jacob and Esau, it occurred to me that this coming Tuesday is the 12th of July and next year will see the centenary of the signing of the Ulster Covenant – the first of a series of centenaries of significant events in the recent history of this island of Ireland. How will we choose to remember these things? The Ulster Covenant crystallised the opposition of Northern Unionists to passing of the Home Rule Act that would have established a Home Rule Parliament of the whole of Ireland sitting in Dublin. This all triggered two very significant events – the running of guns into Larne, organised by the Northern Unionists and then the arrival of the Asgard here in Howth with guns for the IRB. The ground was laid for the conflict that was to continue on and off for the next hundred years in a society, North and South, that has had difficulty living with difference and with different aspirations, different memories.\n\nNext Tuesday there will be many who will enjoy the parades, the colour, the music, the atmosphere. There will be many who will not be under any direct threat but who will just get out. There will be people on both sides who will have a strong sense of their community being under threat but who will have no corresponding understanding of the fears and grievances of the other community.\n\nI think I may have mentioned this next incident before. One summer, around the time of the prisoner releases that followed on from the Good Friday Agreement, Rachel and I went to a couple of events in the West Belfast Festival, including a guided walk on the Cavehill, which at that stage had not been opened to the public. I fell into step with a man I realised was a former prisoner and we started to chat. He introduced himself to me as Davy and I just introduced myself as Kevin. I asked where he came from he asked me where I was living and I said Ahoghill. Then he asked me what I did for a living. The answer, 'I’m the Church of Ireland Rector of Ahoghill' was a bit of a conversation stopper. Ahoghill in republican circles was known as a 'Black Loyalist hole'. We then got into a very interesting conversation. He turned out to be a cousin of Gerry Adams and was playing the role of Bobby Sands in a play on the Hunger Strikes, a play we had in fact already booked tickets for. I said that up to that point I had only seen the hunger strikes and the hunger strikers through the eyes of my own community; I felt I had to at least try and also see them through the eyes of the Nationalist community. We both came to the conclusion that peace will only come when both communities have been traumatised and both are prepared to acknowledge the pain of the other, without trying to say my pain is more valid than your pain.\n\nHow do we learn to live with difference? How could Jacob learn to live with Esau and Esau with Jacob in the light of what had gone on between them. How do communities separated by years of mutual suspicion learn to live in peace.\n\nOf course this is not just a problem for Jacob and Esau, or for the divided communities of Northern Ireland. These all raise issues of healing and reconciliation at all levels. We see it in families, tensions between children, in relationships, between different branches of a family. We see it in the classrooms of our schools. I think one of the most valuable lessons to be learned in our schools is in this whole area of living with difference, working through tensions and disagreements\n\nMay we, in whatever situation we find ourselves in, whatever memories of hurt are on our minds, go out this week as ones willing to listen to, to understand the hurts of another, that we may be agents of his healing reconciling love in whatever situation God has placed us in.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper102011.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 10 – 2011 – year A – Trinity 3\nToday is observed in Ireland as a National Day of Commemoration, a day of\nremembering members of the Irish Defence Forces who have given their lives\nin the service. Remembering will also be of others who have suffered in\nconflicts in our own land. Remembering can be a funny thing. Different\npeople can remember the same things in different ways.\nWe read as our Old Testament lesson this morning the account given by the\nwriter of Genesis of the beginnings of a family argument that was to go on for\nyears between Jacob and his brother Esau. Family rows, community rows,\ninternational rows are as old as time itself. All this raises the issue of how do\nwe live with difference, difference within families, within communities –\ndifferences within Churches.\nAs I read that story of Jacob and Esau, it occurred to me that this coming\nTuesday is the 12th of July and next year will see the centenary of the signing of\nthe Ulster Covenant – the first of a series of centenaries of significant events in\nthe recent history of this island of Ireland. How will we choose to remember\nthese things? The Ulster Covenant crystallised the opposition of Northern\nUnionists to passing of the Home Rule Act that would have established a\nHome Rule Parliament of the whole of Ireland sitting in Dublin. This all\ntriggered two very significant events – the running of guns into Larne,\norganised by the Northern Unionists and then the arrival of the Asgard here in\nHowth with guns for the IRB. The ground was laid for the conflict that was to\ncontinue on and off for the next hundred years in a society, North and South,\nthat has had difficulty living with difference and with different aspirations,\ndifferent memories.\nPage 2 of 3\nPROPER 10 – 2011 – year A – Trinity 3\nNext Tuesday there will be many who will enjoy the parades, the colour, the\nmusic, the atmosphere. There will be many who will not be under any direct\nthreat but who will just get out. There will be people on both sides who will\nhave a strong sense of their community being under threat but who will have\nno corresponding understanding of the fears and grievances of the other\ncommunity.\nI think I may have mentioned this next incident before. One summer, around\nthe time of the prisoner releases that followed on from the Good Friday\nAgreement, Rachel and I went to a couple of events in the West Belfast\nFestival, including a guided walk on the Cavehill, which at that stage had not\nbeen opened to the public. I fell into step with a man I realised was a former\nprisoner and we started to chat. He introduced him self to me as Davy and I\njust introduced myself as Kevin (which was a very safe name in that part of\nBelfast). I asked where he came from he asked me where I was living and I\nsaid Ahoghill. Then he asked me what I did for a living. The answer, ‘I’m the\nChurch of Ireland Rector of Ahoghill’ was a bit of a conversation stopper.\nAhoghill in republican circles was known as a ‘Black Loyalist hole’. We then\ngot into a very interesting conversation. He turned out to be a cousin of Gerry\nAdams and was playing the role of Bobby Sands in a play on the Hunger\nStrikes, a play we had in fact already booked tickets for. I said that up to that\npoint I had only seen the hunger strikes and the hunger strikers through the\neyes of my own community; I felt I had to at least try and also see them\nthrough the eyes of the Nationalist community. We both came to the\nconclusion that peace will only come when both sides accept that both\nPage 3 of 3\nPROPER 10 – 2011 – year A – Trinity 3\ncommunities have been traumatised and both are prepared to acknowledge the\npain of the other, without trying to say my pain is more valid than your pain.\nHow do we learn to live with difference? How could Jacob learn to live with\nEsau and Esau with Jacob in the light of what had gone on between them.\nHow do communities separated by years of mutual suspicion learn to live in\npeace.\nOf course this is not just a problem for Jacob and Esau, or for the divided\ncommunities of Northern Ireland. These all raise issues of healing and\nreconciliation at all levels. We see it in families, tensions between children, in\nrelationships, between different branches of a family. We see it in the class\nrooms of our schools. I think one of the most valuable lessons to be learned in\nour schools is in this whole area of living with difference, working through\ntensions and disagreements\nMay we, in whatever situation we find ourselves in, whatever memories of hurt\nare on our minds, go out this week as ones willing to listen to, to understand\nthe hurts of another, that we may be agents of his healing reconciling love in\nwhatever situation God has placed us in."
    }
}