{
    "title": "Humanity and Divine Purpose",
    "date": "2017-06-25",
    "blurb": "Kevin reflects on the raw humanity of Old Testament characters, emphasizing that God works through real people with their strengths and weaknesses. He draws parallels between the biblical narrative of Sarah, Hagar, and Abraham, and contemporary issues of division and reconciliation. The sermon encourages the understanding that God's purposes of unity and peace prevail, even in the face of human emotions and actions that may cause division.",
    "raw_text": "### PROPER 7 – Year A – 2017 – Trinity 1\n\nAt the conclusion of our first and second readings in the service of Holy Communion the reader will declare: 'This is the word of the Lord.' and we will respond; 'Thanks be to God'. Could I ask what was in your mind as you heard our Old Testament reading and the proclamation; 'This is the word of the Lord'. Did you perhaps mentally cross your fingers as you responded; 'Thanks be to God'?\n\nIt is not a pleasant passage. There is a working out of the tension between two women. Sarah is fiercely protective of a son she thought she would never have. She is possibly still feeling the pain of watching Hagar with a child while she had none. One senses the pain of Abraham as he is torn between the wife who has shared the ups and downs of their long life together and what she is asking him to do.\n\nThis is the word of the Lord. In what way can we see this as God's word to us in our place and in our time?\n\nAs I reflected on that my mind went back to an advertising slogan for the now defunct Sunday tabloid, 'The News of the World' which declared 'All human life is there' – by which it meant the sordid and the salacious. Rev John Bartlett, who was lecturing us in Old Testament at the time, suggested that this slogan could be more accurately applied to the Old Testament. For in its pages you get the full spectrum of human emotion; we see man at his best and man at his worst. We are not presented with a series of plaster cast saints, remote from human life and human failings. But by the same token, this means that in the Old Testament narrative, God is working in and through real human beings.\n\nTo go back to our Old Testament Lesson; it is as I say not a pleasant passage. The tensions between the two women are played out in Sarah's demand of Abraham that Hagar and Ishmael be driven out of the house and Abraham unable to dissuade her. The story darkens as we find Hagar in the wilderness, distraught as she contemplates the death of her son and herself under the desert sun.\n\nThe story of Abraham, of Isaac and Jacob is so familiar to us, that we can overlook important aspects of the story the writer is telling us. As she prepares to watch her son die, Hagar hears a voice:\n\n> 'What troubles you, Hagar? Do not be afraid; for God has heard the voice of the boy where he is. Come, lift up the boy and hold him fast with your hand, for I will make a great nation of him.'\n\nI will make a great nation of him, words that are strikingly similar to the promise made to Abraham. God has a purpose for Ishmael that is distinct to that he has for Isaac and that purpose is not going to be frustrated by human emotions and jealousies.\n\nAs we read on further in Genesis, we come to the death of Abraham and his funeral\n\n> Abraham breathed his last and died in a good old age, an old man and full of years, and was gathered to his people. His sons Isaac and Ishmael buried him in the cave of Machpelah, in the field of Ephron son of Zohar the Hittite, east of Mamre, the field that Abraham purchased from the Hittites. There Abraham was buried, with his wife Sarah. Genesis 25:8-10\n\nIsaac and Ishmael, two boys who played together, separated in childhood, come together in adult life to bury their father.\n\nWhat do I take from all this? I take a simple encouragement from the raw humanity of these Old Testament characters. They are real people with strengths and weaknesses, with virtues and failings. In the Old Testament story God takes them and works in and through them. It is not always straight forward; there are setbacks along the way. Through David in both his times of abject failure and his many strengths and through that very complex figure of Jacob\n\nI'm encouraged because I realize that if God can work through them, then maybe he can work through the likes of you and me. I realize God doesn't wait for us to be perfect; he takes us as we are on our own journey of faith, in our own strengths and weaknesses, our own virtues and failings. That if you like has been God's word to me as I have reflected on this passage over this last week.\n\nHuman emotions such as jealousy, as pride, resentment, fear so often serve to divide families, divide communities. Time and time again we see God's purposes of unity, of peace and reconciliation ultimately prevailing in even the most difficult of circumstances. In the recent wave of terror attacks in the UK we have seen actions by extremists that are designed to frighten, to promote division and distrust. Time and time again we have seen communities responding not in retaliation but in coming together in an almost defiant togetherness.\n\nMay God continue to strengthen and inspire all those who, in this broken and divided world, promote peace and reconciliation, justice and respect.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper72017.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 7 – Year A – 2017 – Trinity 1\nAt the conclusion of our first and second readings in the service of Holy\nCommunion the reader will declare: ‘This is the word of the Lord.’ and we will\nrespond; ‘Thanks be to God’. Could I ask what was in your mind as you heard\nour Old Testament reading and the proclamation; ‘This is the word of the\nLord’. Did you perhaps mentally cross your fingers as you responded; ‘Thanks\nbe to God’?\nIt is not a pleasant passage. There is a working out of the tension between two\nwomen. Sarah is fiercely protective of a son she thought she would never\nhave. She is possibly still feeling the pain of watching Hagar with a child\nwhile she had none. One senses the pain of Abraham as he is torn between the\nwife who has shared the ups and downs of their long life together and what she\nis asking him to do.\nThis is the word of the Lord. In what way can we see this as God’s word to us\nin our place and in our time?\nAs I reflected on that my mind went back to an advertising slogan for the now\ndefunct Sunday tabloid, ‘The News of the World’ which declared ‘All human\nlife is there’ – by which it meant the sordid and the salacious. Rev John\nBartlett, who was lecturing us in Old Testament at the time, suggested that this\nslogan could be more accurately applied to the Old Testament. For in its pages\nyou get the full spectrum of human emotion; we see man at his best and man at\nhis worst. We are not presented with a series of plaster cast saints, remote\nfrom human life and human failings. But by the same token, this means that in\nthe Old Testament narrative, God is working in and through real human beings.\nPage 2 of 3\nPROPER 7 – Year A – 2017 – Trinity 1\nTo go back to our Old Testament Lesson; it is as I say not a pleasant passage.\nThe tensions between the two women are played out in Sarah’s demand of\nAbraham that Hagar and Ishmael be driven out of the house and Abraham\nunable to dissuade her. The story darkens as we find Hagar in the wilderness,\ndistraught as she contemplates the death of her son and herself under the desert\nsun.\nThe story of Abraham, of Isaac and Jacob is so familiar to us, that we can\noverlook important aspects of the story the writer is telling us. As she prepares\nto watch her son die, Hagar hears a voice:\n‘What troubles you, Hagar? Do not be afraid; for God has heard the\nvoice of the boy where he is. 18Come, lift up the boy and hold him fast\nwith your hand, for I will make a great nation of him.’\nI will make a great nation of him, words that are strikingly similar to the\npromise made to Abraham. God has a purpose for Ishmael that is distinct to\nthat he has for Isaac and that purpose is not going to be frustrated by human\nemotions and jealousies.\nAs we read on further in Genesis, we come to the death of Abraham and his\nfuneral\nAbraham breathed his last and died in a good old age, an old man and\nfull of years, and was gathered to his people. 9 His sons Isaac and\nIshmael buried him in the cave of Machpelah, in the field of Ephron\nson of Zohar the Hittite, east of Mamre, 10 the field that Abraham\npurchased from the Hittites. There Abraham was buried, with his wife\nSarah. Genesis 25:8-10\nIsaac and Ishmael, two boys who played together, separated in childhood,\ncome together in adult life to bury their father.\nPage 3 of 3\nPROPER 7 – Year A – 2017 – Trinity 1\nWhat do I take from all this? I take a simple encouragement from the raw\nhumanity of these Old Testament characters. They are real people with\nstrengths and weaknesses, with virtues and failings. In the Old Testament story\nGod takes them and works in and through them. It is not always straight\nforward; there are setbacks along the way. Through David in both his times of\nabject failure and his many strengths and through that very complex figure of\nJacob\nI’m encouraged because I realise that if God can work through them, then\nmaybe he can work through the likes of you and me. I realise God doesn’t wait\nfor us to be perfect; he takes us as we are on our own journey of faith, in our\nown strengths and weaknesses, our own virtues and failings. That if you like\nhas been God’s word to me as I have reflected on this passage over this last\nweek.\nHuman emotions such as jealousy, as pride, resentment, fear so often serve to\ndivide families, divide communities. Time and time again we see God’s\npurposes of unity, of peace and reconciliation ultimately prevailing in even the\nmost difficult of circumstances. In the recent wave of terror attacks in the UK\nwe have seen actions by extremists that are designed to frighten, to promote\ndivision and distrust. Time and time again we have seen communities\nresponding not in retaliation but in coming together in an almost defiant\ntogetherness.\nMay God continue to strengthen and inspire all those who, in this broken and\ndivided world, promote peace and reconciliation, justice and respect."
    }
}