{
    "title": "God Breathed",
    "date": "2010-10-17",
    "blurb": "This sermon explores the concept of 'God breathed' and its significance in life and faith. It discusses the role of God's breath or Spirit in the life of the Church and the individual. The sermon encourages engagement with the Scriptures and highlights the transformative power of God's breath in shaping a life that reflects Christ.",
    "raw_text": "Whenever you go to the surgery the doctor will often take out the stethoscope, plonk it on your chest and say, 'Breathe in, out, in again – that’s grand.' Those of you who sing in a choir know the importance of breathing – get it wrong and you end up gasping at the end of a verse of a hymn. Any runners among you know the same thing. Get the breathing right and you are fine – get it wrong and you end up leaning over a wall gasping for breath.\n\nBreathe in, breathe out.\n\nWhat got me on to this line of thought you may ask? I begin with the portion of our Epistle, which in the translation we use, reads 'All scripture is inspired by God.' The word in the original text that we translate as 'inspired by God' (qeovpneusto\" – 'theopneustos') means literally 'God breathed'\n\nThat set me thinking about breathing and the references to breathing or breath in the Bible. Breath, and particularly the breath of God is associated with life. In the second account of creation in Genesis we read:\n\n'then the LORD God formed man from the dust of the ground, and breathed into his nostrils the breath of life; and the man became a living being.' Genesis 2:7\n\nIn this account, man, alone among the rest of creation, is imbued with the breath of the divine, marking him out from the rest of the animal kingdom. One made for fellowship with God, for partnership with God.\n\nJust as the breath of God is associated with life, so the absence of breath is associated with death. And so later on in Genesis we read Abraham breathed his last and died in a good old age, an old man and full of years, and was gathered to his people. Gen 25:8\n\nWords reminiscent of Jesus on the cross:\n\n50 Then Jesus cried again with a loud voice and breathed his last. Matt 27:50\n\nThen we read in John’s Gospel, after the Cross, after the resurrection, in a scene reminiscent of that early chapter of Genesis, the risen Christ appears to the disciples and offers words of peace:\n\n22 When he had said this, he breathed on them and said to them, \"Receive the Holy Spirit. John 20:22\n\nAll these situations are God-breathed in which God’s breath gives life, gives meaning, gives power.\n\nMan, formed from the dust of the ground.\n\nWords written by very human characters such as David and Paul.\n\nA group of men broken by their experiences of Calvary, their feeling of failure.\n\nSo far so good. But then I find myself asking, to what extent can I look upon myself as God breathed? First and foremost I am a human being, made in the image of God. So even in my brokenness I show something of the divine. But what of the continuing influence of the Spirit of God? What is the role of God’s breath, God’s Spirit in the life of the Church, in the life of the individual?\n\nTo begin with, God continues to breath, to inspire in and through the Scriptures. For this to impinge on me, I must be prepared to engage with the Scriptures which are themselves a story of an engagement of faith, as succeeding writers grapple with issues of faith, what it is to be the people of God, issues of suffering, of failure, of judgement and redemption.\n\nIt has been said that I must not just read the Bible, I must allow the Bible to read me; I must, in the words of the Collect for next Sunday be prepared to:-\n\n'hear them, to read, mark, learn and inwardly digest them that, through patience, and the comfort of your holy word, we may embrace and for ever hold fast the hope of everlasting life, which you have given us in our Saviour Jesus Christ,\n\nBreathe in, breathe out. We begin to be changed by what we read.\n\nWhat is to be the mark of a life that is changed, what is to be the mark of a God-breathed life? A good starting point is to be found in the Revised Catechism:\n\n11 What does the Church teach about God the Holy Spirit?\n\nThe Church teaches that God the Holy Spirit inspires all that is good in mankind; that he came in his fullness at Pentecost to be the giver of life in the Church, and that he enables me to grow in likeness to Jesus Christ.\n\nThe Holy Spirit enables me to grow in likeness to Jesus Christ. Enables each one of us to be ones through whom and in whom Christ is not just made known, but made present in the world of today; made present in our homes, our neighbourhood, our places of work and recreation.\n\nBreathe on me, breath of God, fill me with life anew, that I may love what thou dost love, and do what thou wouldst do.\n\nBreathe on me, breath of God, until my heart is pure; until with thee I will one will, to do and to endure.\n\nBreathe on me, breath of God, till I am wholly thine; until this earthly part of me glows with thy fire divine.\n\nBreathe on me, breath of God: so shall I never die, but live with thee the perfect life of thine eternity. Hymn 293 (C of I Hymnal)",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/proper242010.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 24 -2010 – year C – Trinity 20\nWhenever you go to the surgery the doctor will often take out the stethoscope, plonk it on\nyour chest and say, ‘Breathe in, out, in again – that’s grand.’ Those of you who sing in a\nchoir know the importance of breathing – get it wrong and you end up gasping at the end\nof a verse of a hymn. Any runners among you know the same thing. Get the breathing\nright and you are fine – get it wrong and you end up leaning over a wall gasping for\nbreath.\nBreathe in, breathe out.\nWhat got me on to this line of thought you may ask? I begin with the portion of our\nEpistle, which in the translation we use, reads ‘All scripture is inspired by God.’ The\nword in the original text that we translate as ‘inspired by God’ (qeovpneusto\" –\n‘theopneustos’) means literally ‘God breathed’\nThat set me thinking about breathing and the references to breathing or breath in the Bible.\nBreath, and particularly the breath of God is associated with life. In the second account of\ncreation in Genesis we read:\n‘then the LORD God formed man from the dust of the\nground, and breathed into his nostrils the breath of life;\nand the man became a living being.’ Genesis 2:7\nIn this account, man, alone among the rest of creation, is imbued with the breath of the\ndivine, marking him out from the rest of the animal kingdom. One made for fellowship\nwith God, for partnership with God.\nJust as the breath of God is associated with life, so the absence of breath is associated with\ndeath. And so later on in Genesis we read\nAbraham breathed his last and died in a good old age, an\nold man and full of years, and was gathered to his people.\nGen 25:8\nWords reminiscent of Jesus on the cross:\nPage 2 of 3\nPROPER 24 -2010 – year C – Trinity 20\n50 Then Jesus cried again with a loud voice and\nbreathed his last. Matt 27:50\nThen we read in John’s Gospel, after the Cross, after the resurrection, in a scene\nreminiscent of that early chapter of Genesis, the risen Christ appears to the disciples and\noffers words of peace:\n22 When he had said this, he breathed on them and said to\nthem, \"Receive the Holy Spirit. John 20:22\nAll these situations are God-breathed in which God’s breath gives life, gives meaning,\ngives power.\nMan, formed from the dust of the ground.\nWords written by very human characters such as David and Paul.\nA group of men broken by their experiences of Calvary, their feeling of failure.\nSo far so good. But then I find myself asking, to what extent can I look upon myself as\nGod breathed? First and foremost I am a human being, made in the image of God. So\neven in my brokenness I show something of the divine. But what of the continuing\ninfluence of the Spirit of God? What is the role of God’s breath, God’s Spirit in the life of\nthe Church, in the life of the individual?\nTo begin with, God continues to breath, to inspire in and through the Scriptures. For this\nto impinge on me, I must be prepared to engage with the Scriptures which are themselves\na story of an engagement of faith, as succeeding writers grapple with issues of faith, what\nit is to be the people of God, issues of suffering, of failure, of judgement and redemption.\nIt has been said that I must not just read the Bible, I must allow the Bible to read me; I\nmust, in the words of the Collect for next Sunday be prepared to:-\n‘hear them,\nto read, mark, learn and inwardly digest them\nthat, through patience, and the comfort of your holy word,\nwe may embrace and for ever hold fast\nthe hope of everlasting life,\nwhich you have given us in our Saviour Jesus Christ,\nPage 3 of 3\nPROPER 24 -2010 – year C – Trinity 20\nBreathe in, breathe out. We begin to be changed by what we read.\nWhat is to be the mark of a life that is changed, what is to be the mark of a God-breathed\nlife? A good starting point is to be found in the Revised Catechism:\n11 What does the Church teach about God the Holy Spirit?\nThe Church teaches that God the Holy Spirit inspires all\nthat is good in mankind; that he came in his fullness at\nPentecost to be the giver of life in the Church, and that he\nenables me to grow in likeness to Jesus Christ.\nThe Holy Spirit enables me to grow in likeness to Jesus Christ. Enables each one of us to\nbe ones through whom and in whom Christ is not just made known, but made present in\nthe world of today; made present in our homes, our neighbourhood, our places of work\nand recreation.\nBreathe on me, breath of God,\nfill me with life anew,\nthat I may love what thou dost love,\nand do what thou wouldst do.\nBreathe on me, breath of God,\nuntil my heart is pure;\nuntil with thee I will one will,\nto do and to endure.\nBreathe on me, breath of God,\ntill I am wholly thine;\nuntil this earthly part of me_\nglows with thy fire divine.\nBreathe on me, breath of God:\nso shall I never die,\nbut live with thee the perfect life_\nof thine eternity. Hymn 293 (C of I Hymnal)"
    }
}