{
    "title": "Understanding the Bigger Picture",
    "date": "2015-07-12",
    "blurb": "Kevin reflects on the importance of understanding the broader context of scripture, using the story of John the Baptist's death to illustrate how individual narratives fit into the wider message of the Gospel. He emphasizes the tension between the values of God's Kingdom and those of the world, and the inner conflict that Christians face in reconciling these differences. The sermon encourages believers to bring their whole selves to God, embracing inner tensions as part of the journey towards healing and restoration.",
    "raw_text": "PROPER 10 – 2015 – Year B – Trinity 6\n\nI remember when I was at school, a friend pointed out an advertisement in the 'Readers Digest' for a speed reading course. As with many of these ads there was a testimonial by someone famous, in this case an American comedian (whose name I have forgotten). He testified; \"After taking this speed reading course, I read Tolstoy’s 'War and Peace' in four hours – it's about Russia.\" He had if you liked got the big picture, even if the finer details of the story had passed him by.\n\nEach Sunday, we read passages of scripture as part of our worship – I think the ordered reading of the Scriptures is a wonderful part of our tradition. But we sometimes lose sight of the wider context in which the passages we read are set. We get focused on the finer detail and lose sight of the bigger picture.\n\n> Take our Gospel reading for today. At one level it is anything but Good News – it is St Mark’s account of the death of John the Baptist. It is a story of a powerful man trapped by his own vanity and weakness. Rather than lose face in front of his guests, he feels trapped into fulfilling the request made by a pretty woman to whom he has made a rash promise. In the process, John the Baptist falls victim to human frailty, human sin, manifesting itself in the vanity of Herod. It seems rather incongruous to say at the end – 'This is the Gospel of the Lord. Praise to you Lord Jesus Christ.'\n\nSo let us just step back and take a look at the bigger picture, the context in which Mark has set this story. It is an example of how the way the individual writers select and lay out their material tells its own wider story. In this case St Mark has set his account of the death of John the Baptist between the account of Jesus sending out the disciples in pairs on their own ministry and that of their return with news of their successes.\n\nThis is a reminder that our Christian witness, our Christian service does not happen in isolation; it is offered in the context of our life in the wider world.\n\nJohn, like the prophets before him, in his own day spoke truth to power and power did not like what it heard. This story is a sombre reminder of the fact that this is a world that operates under very different value systems. It is a reminder that, even in a society that would describe itself as Christian, the values of the Kingdom of God and the values of the Kingdom of this world are not identical; they may at times be at odds with each other. This is why messages of reconciliation in areas of conflict; calls for justice for the poor, relief of debt, establishment of fair trade regimes for producers in the 3rd world, demands for racial equality in South Africa in times of Apartheid have each in their own time been treated with scorn by those in positions of power.\n\nBut of course it is easy to point the finger at others. The more I think about this story of Herod and John the Baptist and its setting in the wider story told to us by St Mark’s Gospel, the more I come to realise that we are ourselves a bundle of ambiguities. In our daily living we find ourselves caught between the demands of the Kingdom of God and the demands of the world; caught between our own aspirations to Christian discipleship, Christian service and our own frailty.\n\nThis inner tension, with which we can all identify, is articulated in St Paul’s words in his letter to the Church at Rome:\n\n> \"So I find it to be a law that when I want to do what is good, evil lies close at hand. For I delight in the law of God in my inmost self, but I see in my members another law at war with the law of my mind, making me captive to the law of sin that dwells in my members. Wretched man that I am! Who will rescue me from this body of death? Thanks be to God through Jesus Christ our Lord!\" (Rom 7:21-25)\n\nLike Paul, I must accept the reality of that tension within me; and I bring the whole of my being, the good and the bad, the light and the dark, the strong and the frail, the attractive and the ugly; I bring it all into the presence of God and I offer the whole of my being in the service of God. As we were thinking last week, the whole of my life, my journey with God, my journey into God and back to God is a journey of healing and restoration as we work through these inner conflicts and tensions that are part of our seeking to live our discipleship in this broken and imperfect world.\n\nThere is a prayer that I would often use around Passiontide and Holy Week:\n\n> \"O Jesus, Master Carpenter of Nazareth, who on the cross through wood and nails didst work man’s whole salvation; Wield well thy tools in this thy workshop; that we who come to thee rough hewn may by thy hand be fashioned to a truer beauty and a greater usefulness; for the honour of thy name.\"\n\nThat in itself is a prayer for Christian healing and restoration.\n\nGod is a God who can work in and through our inner tensions and ambiguities. I take encouragement from the way the writer of St Mark’s Gospel has set out his material. Either side of the tragic and pointless death of John, something wonderful is happening in the lives of twelve ordinary men as they are sent out in the service of Christ and return with wonderful news of all that has happened on their journey. We are witnessing the beginnings of the Christian Church which has outlasted the Herods, the Neros, the Hitlers and the Stalins of this world.\n\nMay God take each one of us in all our weakness and imperfection:\n\n> \"that we who come to thee rough hewn may by thy hand be fashioned to a truer beauty and a greater usefulness;\"\n\nthat God’s name may be honoured and advanced in our lives.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/proper102015.txt",
        "raw_ocr_content": "Page 1 of 3\nPROPER 10 – 2015 – Year B – Trinity 6\nI remember when I was at school, a friend pointed out an advertisement in the\n‘Readers Digest’ for a speed reading course. As with many of these ads there\nwas a testimonial by someone famous, in this case an American comedian\n(whose name I have forgotten). He testified; “After taking this speed reading\ncourse, I read Tolstoy’s ‘War and Peace’ in four hours – its about Russia.” He\nhad if you liked got the big picture, even if the finer details of the story had\npassed him by.\nEach Sunday, we read passages of scripture as part of our worship – I think the\nordered reading of the Scriptures is a wonderful part of our tradition. But we\nsometimes lose sight of the wider context in which the passages we read are\nset. We get focussed on the finer detail and lose sight of the bigger picture.\nTake our Gospel reading for today. At one level it is anything but Good News\n– it is St Mark’s account of the death of John the Baptist. It is a story of a\npowerful man trapped by his own vanity and weakness. Rather than lose face\nin front of his guests, he feels trapped into fulfilling the request made by a\npretty woman to whom he has made a rash promise. In the process, John the\nBaptist falls victim to human frailty, human sin, manifesting itself in the vanity\nof Herod.. It seems rather incongruous to say at the end – ‘\nThis is the Gospel of the Lord. Praise to you Lord Jesus Christ.\nSo let us just step back and take a look at the bigger picture, the context in\nwhich Mark has set this story. It is an example of how the way the individual\nwriters select and lay out their material tells its own wider story. In this case St\nMark has set his account of the death of John the Baptist between the account\nof Jesus sending out the disciples in pairs on their own ministry and that of\ntheir return with news of their successes.\nThis is a reminder that our Christian witness, our Christian service does not\nhappen in isolation; it is offered in the context of our life in the wider world.\nPage 2 of 3\nPROPER 10 – 2015 – Year B – Trinity 6\nJohn, like the prophets before him, in his own day spoke truth to power and\npower did not like what it heard. This story is a sombre reminder of the fact\nthat this is a world that operates under very different value systems. It is a\nreminder that , even in a society that would describe itself as Christian, the\nvalues of the Kingdom of God and the values of the Kingdom of this world are\nnot identical; they may at times be at odds with each other. This is why\nmessages of reconciliation in areas of conflict; calls for justice for the poor,\nrelief of debt, establishment of fair trade regimes for producers in the 3rd world,\ndemands for racial equality in South Africa in times of Apartheid have each in\ntheir own time been treated with scorn by those in positions of power. They\nmay not be in a position to lop off heads and serve them up on a platter any\nmore but they will certainly try to discredit and vilify those who challenge the\nnorms of contemporary society.\nBut of course it is easy to point the finger at others. The more I think a bout\nthis story of Herod and John the Baptist and its setting in the wider story told to\nus by St Mark’s Gospel, the more I come to realise that we are ourselves a\nbundle of ambiguities. In our daily living we find ourselves caught between\nthe demands of the Kingdom of god and the demands of the world; caught\nbetween our own aspirations to Christian discipleship, Christian service and\nour own frailty.\nThis inner tension, with which we can all identify, is articulated in St Paul’s\nwords in his letter to the Church at Rome:\n21 So I find it to be a law that when I want to do what is good, evil lies\nclose at hand. 22 For I delight in the law of God in my inmost self, 23\nbut I see in my members another law at war with the law of my mind,\nmaking me captive to the law of sin that dwells in my members. 24\nWretched man that I am! Who will rescue me from this body of death?\n25 Thanks be to God through Jesus Christ our Lord! (Rom 7:21-25)\nPage 3 of 3\nPROPER 10 – 2015 – Year B – Trinity 6\nLike Paul, I must accept the reality of that tension within me; and I bring the\nwhole of my being, the good and the bad, the light and the dark, the strong and\nthe frail, the attractive and the ugly; I bring it all into the presence of God and I\noffer the whole of my being in the service of God. As we were thinking last\nweek, the whole of my life, my journey with God, my journey into God and\nback to God is a journey of healing and restoration as we work through these\ninner conflicts and tensions that are part of our seeking to live our discipleship\nin this broken and imperfect world\nThere is a prayer that I would often use around Passiontide and Holy Week:\nO Jesus, Master Carpenter of Nazareth, who on the cross through wood\nand nails didst work man’s whole salvation; Wield well thy tools in\nthis thy workshop; that we who come to thee rough hewn may by they\nhand be fashioned to a truer beauty and a greater usefulness; for the\nhonour of thy name.’\nThat in itself is a prayer for Christian healing and restoration.\nGod is a God who can work in and through our inner tensions and ambiguities.\nI take encouragement from the way the writer of St Mark’s Gospel has set out\nhis material. Either side of the tragic and pointless death of John, something\nwonderful is happening in the lives of twelve ordinary men as they are sent out\nin the service of Christ and return with wonderful news of all that has happened\non their journey. We are witnessing the beginnings of the Christian Church\nwhich has outlasted the Herods, the Neros, the Hitlers and the Stalins of this\nworld.\nMay God take each one of us in all our weakness and imperfection:\n‘that we who come to thee rough hewn may by thy hand be fashioned\nto a truer beauty and a greater usefulness;’\nthat God’s name may be honoured and advanced in our lives."
    }
}