{
    "title": "Memory and Identity",
    "date": "2011-07-24",
    "blurb": "Kevin reflects on the role of memory in shaping community identity, drawing from Psalm 105 and historical events. He discusses the impact of media on collective memory and emphasizes the importance of remembering in the context of faith. The sermon encourages understanding our place before God through the act of remembrance, especially during the Holy Communion.",
    "raw_text": "PROPER 12 – 2011 – Trinity 5 – year A\n\nThe Spanish born American author George Santayana once wrote, 'Those who cannot remember the past are condemned to repeat it.' Our Psalm for today is a portion of Psalm 105, which is in itself one of a series of Psalms that rehearses a community’s remembering of its past, of God’s dealings with his people from the call of Abraham through to the entry into the Promised Land. It recalls the great events of Israel’s redemptive history along with the times of failure and rebellion. It is a story of the judgement and the mercy of God and lies at the heart of their self-understanding of who they were, a people belonging to God.\n\nThis set me thinking about remembering and how a community remembers its past, and how that remembering contributes to their own understanding of who they are. Memories can be skewed by a number of factors, including prejudice, past or perceived hurt, and a range of social and political factors. I recall early on in the Troubles in Northern Ireland, seeing two newspaper clippings on the SRC Notice Board in Trinity. They were reports of disturbances in Belfast that had taken place earlier that week – but told from very different perspectives. The reports were each moulding the memories of their respective readerships; each reinforcing their communities’ understanding of themselves as victims and the other as aggressor in the developing conflict.\n\nI also recall being present at a meeting of the Church of Ireland clergy in the Antrim Ballymena area at which the speaker was Dr. David Alderdyce, then leader of the Alliance Party. It was the beginning of the peace process, the IRA had declared its ceasefire and he had just held his first meeting with Gerry Adams. He was speaking of the part played by the Churches in the history of Northern Ireland. He said, 'Too often in the past the clergy had acted as chaplains to the tribe, offering comfort to their own, rather than prophets speaking God’s word into the situation of conflict.' That, he said, would have to change if we were to play our part in promoting reconciliation and healing in Northern Ireland.\n\nOver the past few weeks, we have witnessed the growing revelations of organised hacking of the phones of hundreds of people in the field of politics but also bereaved relatives of victims of crime, of armed conflict by staff of News Corporation. We have also learned of the often incestuous relationship between that same organisation and leading politicians and members of the Metropolitan Police. It brings home the potential of powerful media groups to influence our society, to bring their own particular political agenda to bear on the presentation of the news that we tune into through newspaper, radio, television and internet and through that influence the very democratic process that we cherish.\n\nWhat I have been thinking about so far is the importance of the memory, be it of an individual or a community, in understanding who we are. We have also seen how a memory that is distorted by prejudice or fear or guilt can distort that self-understanding of ourselves or of others. We have also seen how powerful media groups have the potential to mould a community’s self-understanding in line with its own political agenda.\n\nJudaism has long understood the importance of memory in their understanding of themselves as a people called by God. The Old Testament Scriptures enshrine a community’s memory of a growing relationship with the God who called them. We see it in their worship – in Psalms such as we used today, in the great Festivals such as Passover, when a community remembers themselves as a people redeemed from slavery. Then at crucial times in their history, there is a renewal of the Covenant, when the people reaffirm their commitment to God. And so their remembering is more than just a recollection of past events, a matter of historical curiosity, it is a remembering that shapes their whole understanding of who they are as a people before God.\n\nSunday by Sunday we remember. In the reading of Scripture, in the singing of Psalms, of Canticles, of hymns we recall the events, the people that lie at the heart of our faith. The Scriptures themselves are written within the context of faith, written from faith to faith, that we might believe. Sunday by Sunday we set our own faith journey, our past, our present and our future in the context of the faith journey of the People of God down through the ages.\n\nThen, as we do today, in the Service of Holy Communion we remember. 'In Christ you shared our life that we might live in him and he in us.' As we eat the bread and drink the cup, we not only remember the cross and resurrection as events that happened in the distant past to the historical figure of Jesus. As we remember, as we eat the bread and drink the cup, we bring these events into our present, our hopes, our fears, our relationships. We offer up our faith, our lives to be shaped by the Cross and Resurrection, by the self-sacrificing, self-emptying love of Christ himself. We remember who we are, as individuals and as a community, whose we are and whom we serve. As we prepare to leave we pray:\n\nAlmighty God,\nwe thank you for feeding us\nwith the body and blood of your Son Jesus Christ.\nThrough him we offer you our souls and bodies\nto be a living sacrifice.\nSend us out\nin the power of your Spirit\nto live and work\nto your praise and glory.\nAmen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/proper122011.txt",
        "raw_ocr_content": "Page 1 of 4\nPROPER 12 – 2011 – Trinity 5 – year A\nThe Spanish born American author George Santayana once wrote, ‘Those who\ncannot remember the past are condemned to repeat it.’ Our Psalm for today is\na portion of Psalm 105, which is in itself one of a series of Psalms that\nrehearses a community’s remembering of its past, of God’s dealings with his\npeople from the call of Abraham through to the entry into the Promises Land.\nIt recalls the great events of Israel’s redemptive history along with the times of\nfailure and rebellion. It is a story of the judgement and the mercy of God and\nlies at the heart of their self understanding of who they were, a people\nbelonging to God.\nThis set me thinking about remembering and how a community remembers its\npast, and how that remembering contributes to their own understanding of who\nthey are. Memories of course can be skewed by a number of factors, by\nprejudice, by past or perceived hurt and by a whole range of social and political\nfactors. I recall early on in the Troubles in Northern Ireland, seeing two\nnewspaper clippings on the SRC Notice Board in Trinity. They were reports in\nthe Newsletter and the Irish News of disturbances in Belfast that had taken\nplace earlier that week – but told from very different perspectives. The\nNewsletter described a riot that had been instigated by Republicans and the\nIrish News presented it as a riot instigated by Loyalists. If you think about it\nthe reports in both the Newsletter and the Irish News were each moulding the\nmemories or their respective readerships; each reinforcing their communities’\nunderstanding of themselves as victims and the other as aggressor in the\ndeveloping conflict.\nI also recall being present at a meeting of the Church of Ireland clergy in the\nAntrim Ballymena area at which the speaker was Dr David Alderdyce, then\nleader of the Alliance Party. It was the beginning of the peace process, the\nIRA had declared its ceasefire and he had just held his first meeting with Gerry\nAdams. He was speaking of the part played by the Churches in the history of\nPage 2 of 4\nPROPER 12 – 2011 – Trinity 5 – year A\nNorthern Ireland. He himself had grown up in a Presbyterian Manse in\nBallymena. He said at one point, ‘Too often in the past the clergy had acted as\nchaplains to the tribe, offering comfort to their own, rather than prophets\nspeaking God’s word into the situation of conflict.’ That, he said, would have\nto change if we were to play our part in promoting reconciliation and healing in\nNorthern Ireland.\nOver the past few weeks, we have witnessed the growing revelations of\norganised hacking of the phones of hundreds of people in the field of politics\nbut also bereaved relatives of victims of crime, of armed conflict by staff of\nNews Corporation. We have also learned of the often incestuous relationship\nbetween that same organisation and leading politicians and members of the\nMetropolitan Police. It brings home the potential of powerful media groups to\ninfluence our society, to bring their own particular political agenda to bear on\nthe presentation of the news that we tune into through newspaper, radio,\ntelevision and internet and through that influence the very democratic process\nthat we cherish.\nWhat I have been thinking about so far is the importance of the memory, be it\nof an individual or a community, in understanding who we are. We have also\nseen how a memory that is distorted by prejudice or fear or guilt can distort\nthat self understanding of ourselves or of others. We have also seen how\npowerful media groups have the potential to mould a community’s self\nunderstanding in line with its own political agenda.\nJudaism has long understood the importance of memory in their understanding\nof themselves as a people called by God. The Old Testament Scriptures\nenshrine a community’s memory of a growing relationship with the God who\ncalled them. We see it in their worship – in Psalms such as we used today, in\nthe great Festivals such as Passover, when a community remembers themselves\nPage 3 of 4\nPROPER 12 – 2011 – Trinity 5 – year A\nas a people redeemed from slavery. Then at crucial times in their history, there\nis a renewal of the Covenant, when the people reaffirm their commitment to\nGod. And so their remembering is more than just a recollection of past events,\na matter of historical curiosity, it is a remembering that shapes their whole\nunderstanding of who they are as a people before God.\nSunday by Sunday we remember. In the reading of Scripture, in the singing of\nPsalms, of Canticles, of hymns we recall the events, the people that lie at the\nheart of our faith. The Scriptures themselves are written within the context of\nfaith, written from faith to faith, that we might believe. Sunday by Sunday we\nset our own faith journey, our past, our present and our future in the context of\nthe faith journey of the People of God down through the ages.\nThen, as we do today, in the Service of Holy Communion we remember.\nIn Christ you shared our life that we might live in him and he in us\nAs we eat the bread and drink the cup, we not only remember the cross and\nresurrection as events that happened in the distant past to the historical figure\nof Jesus. As we remember, as we eat the bread and drink the cup, we bring\nthese events into our present, our hopes, our fears, our relationships. We offer\nup our faith, our lives to be shaped by the Cross and Resurrection, by the self\nsacrificing, self emptying love of Christ himself. We remember who we are, as\nindividuals and as a community, whose we are and whom we serve. As we\nprepare to leave we pray:\nAlmighty God,\nwe thank you for feeding us\nwith the body and blood of your Son Jesus Christ.\nThrough him we offer you our souls and bodies\nto be a living sacrifice.\nSend us out\nin the power of your Spirit\nto live and work\nto your praise and glory.\nAmen.\nPage 4 of 4\nPROPER 12 – 2011 – Trinity 5 – year A\nWe close by saying together the Prayer of General Thanksgiving which is\nprinted on the 3rd page of your lesson sheets\nPrayer of General Thanksgiving\nAlmighty God, Father of all mercies,\nwe your unworthy servants\ngive you most humble and hearty thanks\nfor all your goodness and loving-kindness.\nWe bless you for our creation, preservation,\nand all the blessings of this life;\nbut above all for your immeasurable love\nin the redemption of the world\nby our Lord Jesus Christ,\nfor the means of grace and for the hope of glory.\nAnd give us, we pray,\nsuch a sense of all your mercies\nthat our hearts may be unfeignèdly thankful,\nand that we show forth your praise,\nnot only with our lips but in our lives,\nby giving up ourselves to your service,\nand by walking before you,\nin holiness and righteousness, all our days;\nthrough Jesus Christ our Lord,\nto whom with you and the Holy Spirit,\nbe all honour and glory,\nfor ever and ever. Amen."
    }
}