{
    "title": "Remembering Roderick O'Dowd",
    "date": "2023-01-04",
    "blurb": "This sermon, delivered at the funeral of Roderick O'Dowd, reflects on the nature of love and light in times of loss and separation. It emphasizes the enduring nature of love and the unquenchable light of Christ, even in the face of death. The sermon invites the congregation to hold onto their memories of Roderick and give thanks for his life.",
    "raw_text": "Funeral of Roderick O’Dowd – 3rd January 2023 – Brown’s Funeral Parlour\n\nChristmas is normally a time of coming together, of meeting up, of exchange of gifts. But for the O’Dowd family this Christmas has been a time of loss, of separation as Roderick died quite suddenly just before Christmas.\n\nToday, as we gather for Roderick’s funeral, we remember the one we have lost. I’m sure over the last few days the family have shared many memories with a mixture of tears and laughter. In a few moments Colin will share with us the family’s reflections and memories of Roderick as husband, as father and grandfather and what made Roderick the man he was. You will all have come here this morning with your own personal memories of Roderick and I invite you to hold these memories before God and give thanks to God for all that was good and true in his life.\n\nThose of us outside the immediate family circle gather here to support you in your loss and to assure you of their continued love and support in the days that lie ahead.\n\nRoderick’s death, coming as it did in the Christmas season, carries its own particular poignancy. One of the lessons regularly read at Christmas comes from the 1st chapter of John’s Gospel, in which he writes of the coming of Christ into the world.\n\n> He was in the beginning with God. All things came into being through him, and without him not one thing came into being. What has come into being in him was life, and the life was the light of all people. The light shines in the darkness, and the darkness did not overcome it.\n\nThe light shines in the darkness and the darkness did not overcome it.\n\nJane has just read as our lesson for today that lovely passage form Paul’s 1st Letter to the Corinthians in which Paul gives us a lovely word picture of love:\n\n> Love is patient; love is kind; love is not envious or boastful or arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice in wrongdoing, but rejoices in the truth. It bears all things, believes all things, hopes all things, endures all things. Love never ends.\n\nIt is a picture of a love that never gives up, that keeps on loving.\n\nAs we prepare to say our final farewells, I would just ask you to hold these two images together:\n\n- of a light that no darkness can extinguish\n- of a love that never gives up.\n\nAs I said, this is a time of loss and separation. Someone we have loved and who has loved us is no longer with us. Roderick and the family had a clear bond of love between them. A love that has taken you through good times and bad times; through times of joy at the birth of children, grandchildren, marriages and celebrations. Like all families you will have had your times of sadness and disappointment. It is our hope and prayer that that same love will sustain you through your time of bereavement.\n\nAt a time such as this I always think of God’s love towards us. God’s love is a love that will never give up on us. Even when God seems distant, he is close; as we confess each Christmas he is a light that can never be extinguished.\n\nAs we commend Roderick to God this day, may you all know God’s peace in the days to come as with tears and laughter you give thanks for all that was good and true in the life of Roderick O’Dowd.\n\nWe give them back to thee, dear Lord, who gavest them to us. Yet as thou didst not lose them in giving, so we have not lost them by their return. What thou gavest thou takest not away, O Lover of souls; for what is thine is ours also if we are thine. And life is eternal and love is immortal, and death is only an horizon, and an horizon is nothing save the limit of our sight. Lift us up, strong Son of God, that we may see further; cleanse our eyes that we may see more clearly; and draw us closer to thyself that we may know ourselves to be nearer to our loved ones who are with thee. And while thou dost prepare for us, prepare us also for that happy place, that where they are and thou art, we too may be for evermore.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Funerals/Connor Diocese/Roderick O_Dowd - 4th Jan 2023.txt",
        "raw_ocr_content": "Page 1 of 3\nFuneral of Roderick O’Dowd – 3rd January 2023 – Brown’s Funeral Parlour\nChristmas is normally a time of coming together, of meeting up, of exchange\nof gifts. But for the O’Dowd family this Christmas has been a time of loss, of\nseparation as Roderick died quite suddenly just before Christmas.\nToday, as we gather for Roderick’s funeral, we remember the one we have lost.\nI’m sure over the last few days the family have shared many memories with a\nmixture of tears and laughter. In a few moments Colin will share with us the\nfamily’s reflections and memories of Roderick as husband, as father and\ngrandfather and what made Roderick the man he was. You will all have come\nhere this morning with your own personal memories of Roderick and I invite\nyou to hold these memories before God and give thanks to God for all that was\ngood and true in his life.\nThose of us outside the immediate family circle gather here to support you in\nyour loss and to assure you of their continued love and support in the days that\nlie ahead.\nRoderick’s death, coming as it did in the Christmas season, carries its own\nparticular poignancy. One of the lessons regularly read at Christmas comes\nfrom the 1st chapter of John’s Gospel, in which he writes of the coming of\nChrist into the world\nHe was in the beginning with God. All things came into being through\nhim, and without him not one thing came into being. What has come\ninto being in him was life, and the life was the light of all people. The\nlight shines in the darkness, and the darkness did not overcome it.\nThe light shines in the darkness and the darkness did not overcome it.\nPage 2 of 3\nFuneral of Roderick O’Dowd – 3rd January 2023 – Brown’s Funeral Parlour\nJane has just read as our lesson for today that lovely passage form Paul’s 1st\nLetter to the Corinthians in which Paul gives us a lovely word picture of love:\nLove is patient; love is kind; love is not envious or boastful or\narrogant or rude. It does not insist on its own way; it is not irritable or\nresentful; it does not rejoice in wrongdoing, but rejoices in the truth. It\nbears all things, believes all things, hopes all things, endures all\nthings.\nLove never ends.\nIt is a picture of a love that never gives up, that keeps on loving.\nAs we prepare to say our final farewells, I would just ask you to hold these two\nimages together:\nof a light that no darkness can extinguish\nof a love that never gives up.\nAs I said, this is a time of loss and separation. Someone we have loved and\nwho has loved us is no longer with us. Roderick and the family had a clear\nbond of love between them. A love that has taken you through good times and\nbad times; through times of joy at the birth of children, grandchildren,\nmarriages and celebrations. Like all families you will have had your times of\nsadness and disappointment. It is our hope and prayer that that same love will\nsustain you through your time of bereavement.\nAt a time such as this I always think of God’s love towards us. God’s love is a\nlove that will never give up on us. Even when God seems distant, he is close;\nas we confess each Christmas he is a light that can never be extinguished.\nPage 3 of 3\nFuneral of Roderick O’Dowd – 3rd January 2023 – Brown’s Funeral Parlour\nAs we commend Roderick to God this day, may you all know God’s peace in\nthe days to come as with tears and laughter you give thanks for all that was\ngood and true in the life of Roderick O’Dowd.\nWe give them back to thee, dear Lord, who gavest them to us. Yet as\nthou didst not lose them in giving, so we have not lost them by their\nreturn. What thou gavest thou takest not away, O Lover of souls; for\nwhat is thine is ours also if we are thine. And life is eternal and love is\nimmortal, and death is only an horizon, and an horizon is nothing save\nthe limit of our sight. Lift us up, strong Son of God, that we may see\nfurther; cleanse our eyes that we may see more clearly; and draw us\ncloser to thyself that we may know ourselves to be nearer to our loved\nones who are with thee. And while thou dost prepare for us, prepare us\nalso for that happy place, that where they are and thou art, we too may\nbe for evermore."
    }
}