{
    "title": "The Image of His Father",
    "date": "2013-11-24",
    "blurb": "This sermon explores the concept of Jesus as the 'image of the invisible God', drawing parallels between the familial resemblance between parents and children and the spiritual resemblance between God and Jesus. It emphasizes the humility and servitude of Jesus, who came not to be served, but to serve. The sermon concludes with an invitation to follow Jesus, the Servant King.",
    "raw_text": "Isn’t he the image of his father? How often has that been said over many a child lying in a cot or starting to toddle around a room. Of course, we should not be surprised at this when you think of the very sharing of DNA in the bringing to birth of a child.\n\nI know I get great amusement at looking at pictures of my own children growing up as we come to recognise ourselves and even our own parents in our children. Of course as they grow up we begin to see far more than just physical characteristics but similarities of character, of mannerisms. Sometimes as parents give off about things their children have been up to, I sometimes remind them, 'You know, we do have our own children.' Or, as they used to say in Laois, 'They don’t lick it up off the ground.'\n\nIsn’t he the image of his father? All this came to my mind as I reflected on the passage we read from Paul’s letter to the Colossians, in which he says, referring to Jesus, 'He is the image of the invisible God'. I want to set those words alongside, the family pictures we look at, the shared characteristics we notice in parent and child. In this context I often find myself turning back to words of that of that often misunderstood Bishop of Durham, David Jenkins, when he wrote of his understanding of Jesus as Son of God: 'Jesus is the face of God towards us; God with us, God for us.' And later on in the same passage; '..the down to earth mystery of the Incarnation – that God as Jesus spoke his last and final word about everything.' ('Free to Believe’ David & Rebecca Jenkins - pp62, 63)\n\nJesus – the image of God, the likeness of God, the face of God towards us.\n\nIn just a few weeks we will be celebrating Christmas, the birth of Jesus. So who is this God who we meet in the person of Jesus? I often find that hymns, with their combination of memorable words and tune, can encapsulate deep spiritual truth. For me the words of Hymn 219, 'From heaven you came helpless babe' do this for me as I try to get my head around the idea of God, the maker and creator of all that is, in the person of Jesus.\n\n1 From heaven you came, helpless babe,\nentered our world, your glory veiled;\nnot to be served but to serve,\nand give your life that we might live.\n\nA God who meets us in the ordinary, in a child, in a stable. One who will kneel at the feet of his friends as he silently washes their feet. One who will give of himself, totally and utterly – even to the point of death, death on a cross.\n\n3 Come see his hands and his feet,\nthe scars that speak of sacrifice,\nhands that flung stars into space\nto cruel nails surrendered.\n\nThis is the mystery, meekness and majesty, coming together in the person of Jesus. On Christmas Eve we will hear once more those words of St John:\n\n1In the beginning was the Word, and the Word was with God, and the Word was God. 2He was in the beginning with God. 3All things came into being through him, and without him not one thing came into being. ……….. 11He came to what was his own, and his own people did not accept him. 12But to all who received him, who believed in his name, he gave power to become children of God, John 1\n\nThis is the God who meets us in the face of Jesus Christ.\n\nThis is our God, the Servant King,\nhe calls us now to follow him,\nto bring our lives as a daily offering\nof worship to the Servant King.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Special Occasions/Proper/Year C/sundaybeforeadvent2013.txt",
        "raw_ocr_content": "Isn’t he the image of his father? How often has that been said over\nmany a child lying in a cot or starting to toddle around a room. Of\ncourse, we should not be surprised at this when you think of the very\nsharing of DNA in the bringing to birth of a child.\nI know I get great amusement at looking at pictures of my own\nchildren growing up as we come to recognise ourselves and even our\nown parents in our children. Of course as they grow up we begin to\nsee far more than just physical characteristics but similarities of\ncharacter, of mannerisms. Sometimes as parents give off about things\ntheir children have been up to, I sometimes remind them, ‘You know,\nwe do have our own children.’ Or, as they used to say in Laois, ‘They\ndon’t lick it up off the ground.’\nIsn’t he the image of his father? All this came to my mind as I\nreflected on the passage we read from Paul’s letter to the Colossians,\nin which he says, referring to Jesus, ‘He is the image of the invisible\nGod’. I want to set those words alongside, the family pictures we look\nat, the shared characteristics we notice in parent and child. In this\ncontext I often find myself turning back to words of that of that often\nmisunderstood Bishop of Durham, David Jenkins, when he wrote of\nhis understanding of Jesus as Son of God: ‘Jesus is the face of God\ntowards us; God with us, God for us.’ And later on in the same\npassage; ‘..the down to earth mystery of the Incarnation – that God as\nJesus spoke his last and final word about everything.\n’ (‘Free to Believe’\nDavid & Rebecca Jenkins - pp62, 63)\nJesus – the image of God, the likeness of God, the face of God\ntowards us.\nIn just a few weeks we will be celebrating Christmas, the birth of\nJesus. So who is this God who we meet in the person of Jesus? I\noften find that hymns, with their combination of memorable words\nand tune, can encapsulate deep spiritual truth. For me the words of\nHymn 219, ‘From heaven you came helpless babe’ do this for me as I\ntry to get my head around the idea of God, the maker and creator of all\nthat is, in the person of Jesus.\n1 From heav’n you came, helpless babe,\nentered our world, your glory veiled;\nnot to be served but to serve,\nand give your life that we might live.\nA God who meets us in the ordinary, in a child, in a stable. One who\nwill kneel at the feet of his friends as he silently washes their feet.\nOne who will give of himself, totally and utterly – even to the point of\ndeath, death on a cross.\n3 Come see his hands and his feet,\nthe scars that speak of sacrifice,\nhands that flung stars into space\nto cruel nails surrendered.\nThis is the mystery, meekness and majesty, coming together in the\nperson of Jesus. On Christmas Eve we will hear once more those\nwords of St John:\n1In the beginning was the Word, and the Word was with God, and\nthe Word was God. 2He was in the beginning with God. 3All things\ncame into being through him, and without him not one thing came\ninto being. …………….. 11He came to what was his own, and his\nown people did not accept him. 12But to all who received him, who\nbelieved in his name, he gave power to become children of God,\nJohn 1\nThis is the God who meets us in the face of Jesus Christ.\nThis is our God, the Servant King,\nhe calls us now to follow him,\nto bring our lives as a daily offering\nof worship to the Servant King."
    }
}