{
    "title": "Truth Amidst Turmoil",
    "date": "2015-11-22",
    "blurb": "In the sermon delivered on the Sunday before Advent in 2015, Kevin reflects on the recent terrorist attacks in Paris and the broader context of violence in the name of faith. He explores the role of sacred texts in shaping values and responding to contemporary challenges. Kevin emphasizes the importance of listening to the teachings of Jesus, especially in the face of adversity, and calls for maintaining values of justice, tolerance, freedom, and reconciliation.",
    "raw_text": "Sunday before Advent – 2015 – Year B\n\nLast Sunday, in the wake of the dreadful attacks in Paris the previous Friday, we struggled to come to terms with what had happened; we thought of men and women caught up in the violence of those who purported to act in the name of faith. We thought of words of President Michael Higgins in his poem 'The Prophets are weeping' in which he wrote:\n\n> The Prophets are weeping,\n> At the abuse\n> Of their words,\n> Scattered to sow an evil seed.\n> Rumour has it that,\n> The Prophets are weeping,\n> At their texts distorted,\n> The death and destruction,\n> Imposed in their name.\n\nHe had earlier spoken of the “incredible threats from those who abuse sacred texts”\n\nAnother week has gone by. There was further death and destruction in the Paris suburb of St Denis and yesterday Brussels went into lockdown in the face of a serious terrorist threat from those who masterminded the carnage in Paris. Forces on the right, with their own agendas, have sought to use these events to further their own aims of division, of marginalisation of refugees who have fled the horror of the situation that is the Middle East at this time.\n\nWhat have our own sacred texts, those texts that we read Sunday by Sunday in our worship, texts that have shaped our own society, our own values; what have these to say in the face of this continued turmoil? These texts were written in a particular time and place, in particular circumstances – all very different to our own.\n\nChristians down through the ages have seen these scriptures as addressed to them, in their circumstances, speaking into the situations that they face. This does not mean that they provide cut and dried answers. What it does mean is that as we read, as we hear it read, God speaks to us through these texts.\n\nThis means we are not just to hear – we are to listen. That is deeper that just hearing the spoken words. How often have we heard someone saying to us 'You’re not listening to me!'? You’re not paying attention.\n\nThe lessons we have heard from the Book Daniel and John’s Gospel both speak of Kingship. We have two very different pictures. The first is of the heavenly courts, of authority bestowed on one like a human being coming with the clouds of heaven. And he came to the Ancient One and was presented before him. To him was given dominion and glory and kingship, that all peoples, nations, and languages should serve him.\n\nThe other, in John’s Gospel, seems a parody of Kingship. A battered and bruised Jesus brought before the representative of the might of the Roman Empire who asks of him, 'Are you the King of the Jews?' You can sense the disdain in Pilate’s voice – you are irrelevant.\n\nWhat does that battered and bruised Jesus have to say to us in the present situation of international terrorism? So let us not just hear, let us listen to this passage, let us engage with this passage.\n\nLet us begin by imagining ourselves as part of that scene. How do we see the battered and bruised figure of Jesus on that morning in Jerusalem? Do we see him as the High Priests and religious leaders saw him – a disruptive influence, a trouble maker, a dangerous influence who needs to be silenced. Or do we see him through the eyes of Pilate, an irrelevance who has got himself into an awful lot of trouble – but not worth worrying about. We continue to listen to the exchange between Jesus and Pilate. Towards the end of our Lesson we read:\n\nPilate asked him, 'So you are a king?' Jesus answered, 'You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.'\n\nAnd if you recall, Pilate replies: 'And what is truth?'\n\n'And what is truth?' As I hear, as I listen, as I engage – these are the words that speak to me across barriers of time and circumstance and culture – this has been, if you like, God’s word to me this week.\n\nHow do we respond as individuals or as a community in the face of recent events and the continuing threat. As I said last week, it would be tempting to say that Europe should close its borders, that we should take no more refugees. But do we just abandon them to their fate? Surely that would be to allow the brutality and inhumanity of others to diminish our own Christian understanding of humanity and justice – in a very real sense, if we do that then the extremists have won. Or do listen, do we engage with him who is the 'Way, the Truth and the Life?' Of course we cannot ignore serious issues of security, of public safety. But as we protect our way of life and our values we must ensure that we maintain those very values of justice, of tolerance, of freedom and reconciliation that we hold dear.\n\nOur President has spoken of “incredible threats from those who abuse sacred texts” Let us for our part listen and lay hold of the lessons of our sacred texts as we continue to pray for the city of Paris, for the people of France; for those who have been scarred in body, mind and soul, for those who mourn, for those who are tempted to turn to hate and thoughts of revenge against innocent people. We pray for leaders of governments as they seek to resolve the long standing issues that have divided the Middle East, that have fuelled the emergence of extremist groups such as ISIS. We pray for those responsible for security, for protection of our citizens. We pray that God may stand alongside those who, across divisions of culture, of race, of creed, work for peace, for reconciliation, for justice in our world – that truth, sacred truth may prevail.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/Year B/sundaybeforeadvent2015.txt",
        "raw_ocr_content": "Page 1 of 3\nSunday before Advent – 2015 – Year B\nLast Sunday, in the wake of the dreadful attacks in Paris the previous Friday,\nwe struggled to come to terms with what had happened; we thought of men\nand women caught up in the violence of those who purported to act in the name\nof faith. We thought of words of President Michael Higgins in his poem ‘The\nProphets are weeping’ in which he wrote:\nThe Prophets are weeping,\nAt the abuse\nOf their words,\nScattered to sow an evil seed.\nRumour has it that,\nThe Prophets are weeping,\nAt their texts distorted,\nThe death and destruction,\nImposed in their name.\nHe had earlier spoken of the: “incredible threats from those who abuse sacred\ntexts”\nAnother week has gone by. There was further death and destruction in the\nParis suburb of St Denis and yesterday Brussels went into lockdown in the face\nof a serious terrorist threat from those who masterminded the carnage in Paris.\nForces on the right, with their own agendas, have sought to use these events to\nfurther their own aims of division, of marginalisation of refugees who have\nfled the horror of the situation that is the Middle East at this time.\nWhat have our own sacred texts, those texts that we read Sunday by Sunday in\nour worship, texts that have shaped our own society, our own values; what\nhave these to say in the face of this continued turmoil? These texts were\nwritten in a particular time and place, in particular circumstances – all very\ndifferent to our own.\nChristians down through the ages have seen these scriptures as addressed to\nthem, in their circumstances, speaking into the situations that they face.. This\ndoes not mean that they provide cut and dried answers. What it does mean is\nthat as we read, as we hear it read, God speaks to us through these texts.\nPage 2 of 3\nSunday before Advent – 2015 – Year B\nThis means we are not just to hear – we are to listen. That is deeper that just\nhearing the spoken words. How often have we heard someone saying to us\n‘You’re not listening to me!’? You’re not paying attention..\nThe lessons we have heard from the Book Daniel and John’s Gospel both\nspeak of Kingship. We have two very different pictures. The first is of the\nheavenly courts, of authority bestowed on :\none like a human being\ncoming with the clouds of heaven.\nAnd he came to the Ancient One\nand was presented before him.\n14To him was given dominion\nand glory and kingship,\nthat all peoples, nations, and languages\nshould serve him.\nThe other, in John’s Gospel, seems a parody of Kingship. A battered and\nbruised Jesus brought before the representative of the might of the Roman\nEmpire who asks of him, ‘Are you the King of the Jews?’ You can sense the\ndisdain in Pilate’s voice – you are irrelevant.\nWhat does that battered and bruised Jesus have to say to us in the present\nsituation of international terrorism? So let us not just hear, let us listen to this\npassage, let us engage with this passage.\nLet us begin by imagining ourselves as part of that scene. How do we see the\nbattered and bruised figure of Jesus on that morning in Jerusalem? Do we see\nhim as the High Priests and religious leaders saw him – a disruptive influence,\na trouble maker, a dangerous influence who needs to be silenced. Or do we see\nhim through the eyes of Pilate, an irrelevance who has got himself into an\nawful lot of trouble – but not worth worrying about. We continue to listen to\nthe exchange between Jesus and Pilate. Towards the end of our Lesson we\nread:\n37Pilate asked him, ‘So you are a king?’ Jesus answered, ‘You say that I\nam a king. For this I was born, and for this I came into the world, to\nPage 3 of 3\nSunday before Advent – 2015 – Year B\ntestify to the truth. Everyone who belongs to the truth listens to my\nvoice.’\nAnd if you recall, Pilate replies: ‘And what is truth?’\n‘And what is truth?’ As I hear, as I listen, as I engage – these are the words\nthat speak to me across barriers of time and circumstance and culture – this has\nbeen, if you like, God’s word to me this week.\nHow do we respond as individuals or as a community in the face of recent\nevents and the continuing threat. As I said last week, it would be tempting to\nsay that Europe should close its borders, that we should take no more refugees.\nBut do we just abandon them to their fate? Surely that would be to allow the\nbrutality and inhumanity of others to diminish our own Christian understanding\nof humanity and justice – in a very real sense, if we do that then the extremists\nhave won. Or do listen, do we engage with him who is the ‘Way, the Truth and\nthe Life?’ Of course we cannot ignore serious issues of security, of public\nsafety. But as we protect our way of life and our values we must ensure that\nwe maintain those very values of justice, of tolerance, of freedom and\nreconciliation that we hold dear.\nOur President has spoken of “incredible threats from those who abuse sacred\ntexts” Let us for our part listen and lay hold of the lessons of our sacred texts\nas we continue to pray for the city of Paris, for the people of France; for those\nwho have been scarred in body, mind and soul, for those who mourn, for those\nwho are tempted to turn to hate and thoughts of revenge against innocent\npeople. We pray for leaders of governments as they seek to resolve the long\nstanding issues that have divided the Middle East, that have fuelled the\nemergence of extremist groups such as ISIS. We pray for those responsible for\nsecurity, for protection of our citizens. We pray that God may stand alongside\nthose who, across divisions of culture, of race, of creed, work for peace, for\nreconciliation, for justice in our world – that truth, sacred truth may prevail."
    }
}