{
    "title": "Community and Faith",
    "date": "2017-11-26",
    "blurb": "Kevin discusses the challenges of living in a world burdened by anxiety and stress, focusing on the high suicide rates among young people and the fears they face. He emphasizes the importance of community and the role of the church in providing hope and support. The sermon concludes with the message of the Great Commission, urging the congregation to share the good news and engage with all communities, following Jesus' example.",
    "raw_text": "Family Service Talk for 26th November 2017\n\nWe live in a world that is weighed down by anxiety and stress. The country we live in is currently ranked 6th in the 0-25 year age bracket for suicide rates in Europe. We drink too much, misuse drugs, and have a high percentage of individuals on prescription anti-depressants... why? The answer suggests that human beings are not psychologically self-sufficient. We strive to fit in and long to be a part of a community.\n\nOur Gospel reading today is situated at the end of Matthew's account of the life and death and resurrection of Jesus. Jesus directs the disciples to meet him at the top of the mountain, a significant place where God engages with His people throughout history.\n\nJesus makes an astonishing affirmation: \"All authority in heaven and on earth has been given to me.\" He is the Lord of history and the universe. The disciples are now invited to invite humanity to learn from Jesus, baptizing them into the name of the triune God: the Father, the Son, and the Holy Spirit.\n\nNext week is the beginning of Advent, a time of hope and expectation. As Christians, we hope that Christ's light will shine in the darkness of the world in which we live.\n\nThe Great Commission is sandwiched between a great affirmation on the one hand and a great promise on the other: all authority is given... I will be with you always. Faith motivates us to proceed, supported by the trinity and the community of the church. As a church, we have much to offer in times of hopelessness. Jesus on the mountain confirms that it is God's desire for his disciples to share the good news concerning Christ. We are called to cross barriers and engage with people who are different from us, following Jesus' example.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/sundaybeforeadvent 26th November 2017 - Tom O_Brien.txt",
        "raw_ocr_content": "Adult and Child suicide rates per 100,000 population.\nhttps://www.youtube.com/watch?v=yFqTf74COs4\nFamily Service Talk for 26th November 2017\nWe live in a world that is weighed down by anxiety and stress\n(slide 1).\nThe country we live in is currently ranked 6th in the 0-25 year\nage bracket for suicide rates in Europe (slide 2).\nWe Drink too much, we misuse drugs we have a high\npercentage of individuals on prescription anti-depressants.\n….why?\nThe answer for me (and I suspect this because it is the topic of\nmy thesis…so I had better be right) suggests that human\nbeings are not psychologically self-sufficient. We strive to fit in\nand long to be a part of a community. From the moment a child\nis born to the time when an old aged individual dies, people\ndevote themselves to establishing and maintaining a place in\nsociety. But what if that society which is supposed to support a\nsense of community is dysfunctional? Look at where we are\ntoday, people are anxious over job security, paying bills,\nloneliness,…. I was at a meeting last week in the church of the\nassumption and the speaker, Rev Dr Julian Hamilton spoke\nabout research concerning young people and the church. He\npresented data from a questionnaire that suggested:\nThe top three fears that young people have for themselves\nare:\nExams – College and money.\nThe three top concerns they had for others were :\nWorld war/terrorism – the environment and the future.\nIn other words, young people are in a state of anxiety not only\nfor themselves, but they are concerned for the word we live in\nalso!\nOur Gospel reading today is situated at the end of Matthews\naccount of the life and death and resurrection of Jesus. We are\nbeginning at the end! Jesus directs the disciples to meet him at\nthe top of the mountain and this is important, for history shows\nit is on mountains that God engages with His people. Noah’s\nark settled on the mountain and a new covenant with humanity\nwas entered into. It was on mount Moriah where God engaged\nwith Abraham regarding his son Isaac. Moses interacted with\nGod on Mount Horeb using a burning bush, The\ncommandments were issued on Mount Sinai, it was the Mount\nof Olives where Jesus spoke with God and Golgotha where\nJesus was crucified. Mount Zion is mentioned more than any\nother mountain and is associated with hope of a new kingdom\nof peace and justice.\nBut we read that some of the disciples were not convinced and\ndoubted Jesus was real?\nIt is at this stage that Jesus makes an astonishing affirmation:\n“All authority in heaven and on earth has been given to me”. He\nis the Lord of history, he is the Lord of governments, he is the\nLord of nations, he is the Lord of the universe.\nThe eleven disciples to whom Jesus is speaking here were all\nJews who had left their jobs, everything that they owned, to\nattach themselves to this man, to become apprentice to him.\nThat's what a disciple means, an apprentice or a student. Now,\nsays Jesus, just as you have apprenticed yourself to me and\nlearned from me during these past three years, now you must\ninvite humanity to do the same. Baptizing them into the name of\nthe triune God: the Father, the Son, and the Holy Spirit.\nBaptism is a corporate event, not an individual event. You are\nbaptized into the community of all those who profess the name\nof the Triune God. So it is in the context of community that\npeople learn what discipleship means.\nNext week is the beginning of Advent. Advent is a period in the\nChristian calendar leading up to Christmas. It is a time of hope,\na time of expectation of looking forward. As Christians we hope\nthat Christ’s light will shine in the darkness of the world in which\nwe live.\nI am not sure if you have ever seen the film Mission Impossible\n3? (slide 3)\nWell I love movies and this was one of the best thrillers in the\nseries. Peter Rollin’s provides a good concept in his book ‘the\nidolatry of God’, but I have changed the application to suit my\nsermon. The film’s opening sequence begins much like our\nGospel reading this morning, at the end of the story and then\nworks its way back for the next two hours to show us how it got\nto this point. At the very start our hero, Ethan Hawke (Tom\nCruise) is sat tied to a chair. A blindfold is removed and across\nfrom him sits who he believes to be his wife. She is gagged and\nbound and has a gun pointed at her head. The villain of the film\nasks Tom for the Rabbits foot. Tom was convinced he had\ngiven him the rabbits foot already, but the villain (Philip\nSeymour Hoffman) says that what was given to him was\ncertainly not the rabbits foot. Hoffman begins to count down\nfrom 10, each time asking for the foot. Panic sets in because\nTom Cruise who genuinely believes he provided what was\nasked of him. Throughout the next 2 hours cars explode,\nbombs detonate, people are shot, killed, dive off buildings….\nand the strange thing is that as the film progresses it becomes\nclear that no one knows what the rabbits foot is. Now I am in no\nway suggesting that we should become violent, but the point is\nthat although The villain or M I 5 did not fully understand what it\nwas that they were chasing after, they were still willing to do\nanything to get it. They did not understand the whole meaning\nof the rabbits foot, but somehow, they knew the safety of the\nworld depended on it.\nFaith is hope, certain hope in Christ our lord. The Great\nCommission is actually sandwiched between a great affirmation\non the one hand and a great promise on the other: all authority\nis given…I will be with you always. While we may not be\nabsolutely sure all the time what it is that we are seeking, faith\nmotivates us to proceed. This faith is encouraged and\nsupported by the trinity, but it is also supported by the\ncommunity of the church. As a church we have much to offer in\ntimes of hopelessness. Throughout the bible, the people of God\nfound themselves in impossible situations. Constantly in a state\nof impending doom due to wars, famines and exile, the people\nof God worked together to build a faith that was worth sharing.\nTheir trust in God supported renewal and provided liberation\nand hope. Jesus on the mountain confirms that it is God’s\ndesire for his disciples to share the good news concerning\nChrist. And while we may be slightly afraid or exhausted or\nbusy, it should remain our priority. We are called to cross\nbarriers in engaging and loving people who are different to us.\nNot just associating with those who are like us. This is the\nexample that Jesus set in the preceding gospel of Matthew. His\nmessage and willingness to integrate with all communities\nwhether socially accepted or outcasts transformed the world.\nThe disciples continued his ministry because they saw the\nprofound effect that Jesus had when he engaged with people.\nHe provided assured hope for those who were exhausted,\nprovided healing to the sick, included outcasts and challenged\nsocietal norms. This is church! (video clip 4)\nhttps://www.youtube.com/watch?v=yFqTf74COs4"
    }
}