{
    "title": "Understanding the Trinity",
    "date": "2017-06-11",
    "blurb": "In this sermon for Trinity Sunday, Kevin draws parallels between the vastness of the cosmos and the awe-inspiring nature of God. He emphasizes that the God who created the universe is also a God who cares deeply for each individual. Through Jesus, God understands human experiences, and through the Holy Spirit, God is always present to guide and comfort us.",
    "raw_text": "TRINITY SUNDAY – Year A – 2017 – Family Service\n\nWhen we were setting out the Fete this year we had to allow for a rather large white container where the Bric a Brac tent usually goes. The Scouts have been giving us wonderful help in sorting out tents, where they go and in putting them up and taking them down. In the days leading up to the Fete, Cathal Yeats from the Scouts met up with a few of us. As he looked around he said 'Let's measure this out – see where everything will fit.' I thought of Cathal as I read over our first lesson for today as we read of Isaiah asking 'Who has measured the sky?'\n\nI want to do something like that today so we'll start with our own solar system. Let's look at the numbers:\n\n- Distance from the Earth to the Moon is 400,000km\n- Distance from Sun to Earth is 150,000,000 km\n- Distance from Sun to Pluto is 6,000,000,000 km\n\nThat's a bit big – so let's make a scale model – instead of the moon being 400,000 km from the earth we'll say that it is 4cm. On this scale the earth is 15m from the sun.\n\nOK Tom – start walking out that door – take 15 paces – Tom, where are you?\n\nSo if on our model, the earth is 15 m from the sun, where would that put Pluto? - that comes out as 600 m. I reckon that would be down near Offington – we won't get Tom to check that one out.\n\nEven on our tiny scale model, our solar system is huge – so the God who made it is awesome. Do we just worship a God who makes things? Down through the years people have come to realise that the God who makes is a God who cares. There is a Psalm we often use in Church (we used it at the 9:30 this morning), Psalm 8 that puts this very well; the psalmist asks:\n\n> 4 When I consider your heavens, the work of your fingers,\n> the moon and the stars that you have ordained,\n> 5 What are mortals, that you should be mindful of them;\n> mere human beings, that you should seek them out?\n\nJesus, as he spoke of challenges that would face the disciples said this:\n\n> 29 Are not two sparrows sold for a penny? Yet not one of them will fall to the ground apart from your Father. 30 And even the hairs of your head are all counted. Matt 10:29,30\n\nThe God who made the heavens and the earth, knows each one of us, cares for each one of us.\n\nNot only that, in the person of Jesus he has come to us. Living as a human being, he knows what it is like to be me, to be you; what it is to laugh, to cry, to be loved, to be let down by friends. That is a God who understands, who I can talk to. 'Whoever has seen the face of Jesus has seen the face of God.'\n\nAs we read in our Gospel reading this morning, even as he prepares to leave them, he promises that they will never be alone. 'I am with you always to the very end of time.'\n\nThe God who makes, the God who understands, who knows what it is like to be human, promises to be always at our side; the Holy Spirit who strengthens us, who guides us, who comforts us.\n\nWhich is why I love that blessing that I use from time to time:\n\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place of your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\n\nAmen.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Special Occasions/Proper/year A/trinitysunday2017 - family.txt",
        "raw_ocr_content": "Page 1 of 3\nTRINITY SUNDAY – Year A – 2017 – Family Service\nWhen we were setting out the Fete this year we had to allow for a\nrather large white container where the Bric a Brac tent usually goes.\nThe Scouts have been given us wonderful help in sorting out tents,\nwhere they go and in putting them up and taking them down.\nIn the days leading up to the Fete, Cathal Yeats from the Scouts met\nup with a few of us. As he looked around he said ‘Let’s measure this\nout – see where everything will fit.’ I thought of Cathal as I read over\nour first lesson for today as we read of Isaiah asking ‘Who has\nmeasured the sky?’\nI want to do something like that today so we’ll start with our own\nsolar system.\nLet’s look at the numbers:\nDistance from the Earth to the Moon is 400,000km\nDistance from Sun to Earth is 150,000,000 km\nDistance from Sun to Pluto is 6,000,000,000 km\nThat’s a bit big – so let’s make a scale model – instead of the moon\nbeing 400,000 km from the earth we’ll say that it is 4cm\nOn this scale the earth is 15m from the sun.\nPage 2 of 3\nTRINITY SUNDAY – Year A – 2017 – Family Service\nOK Tom – start walking out that door – take 15 paces – Tom, where\nare you?\nSo if on our model, the earth is 15 m from the sun, where would that\nput Pluto? - that comes out as 600 m. I reckon that would be down\nnear Offington – we won’t get Tom to check that one out.\nEven on our tiny scale model, our solar system is huge – so the God\nwho made it is awesome. Do we just worship a God who makes\nthings? Down through the years people have come to realise that the\nGod who makes is a God who cares. There is a Psalm we often use in\nChurch (we used it at the 9:30 this morning), Psalm 8 that puts this\nvery well; the psalmist asks:\n4 When I consider your heavens, the work of your fingers, ♦\nthe moon and the stars that you have ordained,\n5 What are mortals, that you should be mindful of them; ♦\nmere human beings, that you should seek them out?\nJesus, as he spoke of challenges that would face the disciples said this:\n29 Are not two sparrows sold for a penny? Yet not one of them will fall\nto the ground apart from your Father. 30 And even the hairs of your\nhead are all counted. Matt 10:29,30\nThe God who made the heavens and the earth, knows each one of us,\ncares for each one of us.\nNot only that, in the person of Jesus he has come to us. Living as a\nhuman being, he knows what it is like to be me, to be you; what it is\nto laugh, to cry, to be loved, to be let down by friends. That is a God\nPage 3 of 3\nTRINITY SUNDAY – Year A – 2017 – Family Service\nwho understands, who I can talk to. ‘Whoever has seen the face of\nJesus has seen the face of God’.\nAs we read in our Gospel reading this morning, even as he prepares to\nleave them, he promises that they will never be alone. ‘I am with you\nalways to the very end of time.’\nThe God who makes, the God who understands, who knows what it is\nlike to be human, promises to be always at our side; the Holy Spirit\nwho strengthens us, who guides us, who comforts us.\nWhich is why I love that blessing that I use from time to time:\nGo, and know that the Lord goes with you:\nlet him lead you each day into the quiet place\nof your heart, where he will speak with you;\nknow that he watches over you –\nthat he listens to you in gentle understanding,\nthat he is with you always,\nwherever you are and however you may feel:\nand the blessing of God Almighty,\nthe Father, the Son and the Holy Spirit\nbe upon you and remain with you always.\nAmen."
    }
}