{
    "title": "Blessing of Union",
    "date": "2009-06-20",
    "blurb": "In this sermon, Kevin speaks on the occasion of Ursula Woods and Jed's wedding, reflecting on the significance of marriage and the Christian understanding of love. He emphasizes the importance of being Christ for one another, embodying forgiveness, reconciliation, and sacrificial love. Kevin also highlights the need for individual growth within the unity of marriage, drawing on the wisdom of 'The Prophet' and the biblical passage from 1 Corinthians 13:4-7.",
    "raw_text": "Wedding Blessing – June 20th – Ursula Woods and Jed\n\nWe are here in the grounds of St Mary’s in Howth on this beautiful day to celebrate and ask God’s blessing on the marriage of Ursula and Jed. Cultures down through the ages have celebrated, have built rituals around the coming together of two people in love, to live together, to share their lives together, to build family life together, to support each other in all the ups and downs of life. Some of the early kibbutz, some of the early communes in post revolutionary Russia tried to collectivise family life – all ultimately came to realise the value of the basic family unit.\n\nI often think back to a book I read just coming up to my own marriage. It was called 'The Courage to be Married' and one particular section really struck a chord with me. In this it said, 'In marriage a couple make Christ sacramentally present to one another.' In other words we are to be Christ for one another. I find that both inspiring and quite challenging. In his teaching Christ said some wonderful things. The Beatitudes in the Sermon on the Mount are admired across many cultures. He also said some quite challenging, even troubling things; about forgiveness, about reconciliation, turning the other cheek, going the second mile. Also, at the heart of his ministry, there was in his death on the cross an act of self giving, self forgetting, sacrificial love in which nothing is held back. And so there must be something of that self giving, self forgetting sacrificial love in our love of one another.\n\nBut do not smother each other. You met as individuals, you were captivated by the other in each one of you. And so in the unity of your marriage, allow each other space to grow as individuals so that you may continue to grow as a couple. As we read in those lovely words from 'The Prophet':\n\n> Let there be spaces in your togetherness, … Even as the strings of a lute are alone though they quiver with the same music.\n\nThere are some lovely passages in the Bible that speak of the nature of Christian love, that self forgetting, self emptying love that we see in Christ himself. This passage, from Paul’s 1st Letter to the Church at Corinth, is one that is often used in Marriage Services.\n\n> Love is patient; love is kind; love is not envious or boastful or arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice in wrongdoing, but rejoices in the truth. It bears all things, believes all things, hopes all things, endures all things. ! Cor 13:4-7\n\nAs I read that I often think back to a young woman who was married in Ahoghill when I was there. She told me one time that when she was annoyed she used to go to her room and read this passage – Love is PATIENT, love is KIND.\n\nThere are times when we will annoy one another, when we will disappoint one another, when we will fail one another – this does not mean that failure, that disappointment do not matter – of course they do. It is how we deal with them that is important. In a good marriage these are dealt with in and through that Christ centred, Christ like love that we are talking about – to which we can bring our love, our hurts, our regrets, our hopes.\n\nJed, Ursula, may you know that love, may you show that in your own life together. May your marriage be a source of joy and happiness to you and to all those you love – may God bless you both in all that lies ahead of you.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Wedding/Wedding Blessing - Jed and Ursula.txt",
        "raw_ocr_content": "Page 1 of 3\nWedding Blessing – June 20th – Ursula Woods and Jed\nWe are here in the grounds of St Mary’s in Howth on this beautiful\nday to celebrate and ask God’s blessing on the marriage of Ursula and\nJed. Cultures down through the ages have celebrated, have built\nrituals around the coming together of two people in love, to live\ntogether, to share their lives together, to build family life together, to\nsupport each other in all the ups and downs of life. Some of the early\nkibbutz, some of the early communes in post revolutionary Russia\ntried to collectivise family life – all ultimately came to realise the\nvalue of the basic family unit.\nI often think back to a book I read just coming up to my own\nmarriage. It was called ‘The Courage to be Married’ and one\nparticular section really struck a chord with me. In this it said, ‘In\nmarriage a couple make Christ sacramentally present to one another.’\nIn other words we are to be Christ for one another. I find that both\ninspiring and quite challenging. In his teaching Christ said some\nwonderful things. The Beatitudes in the Sermon on the Mount are\nadmired across many cultures. He also said some quite challenging,\neven troubling things; about forgiveness, about reconciliation, turning\nthe other cheek, going the second mile. Also, at the heart of his\nministry, there was in his death on the cross an act of self giving, self\nforgetting, sacrificial love in which nothing is held back. And so there\nPage 2 of 3\nWedding Blessing – June 20th – Ursula Woods and Jed\nmust be something of that self giving, self forgetting sacrificial love in\nour love of one another.\nBut do not smother each other. You met as individuals, you were\ncaptivated by the other in each one of you. And so in the unity of\nyour marriage, allow each other space to grow as individuals so that\nyou may continue to grow as a couple. As we read in those lovely\nwords from ‘The Prophet’:\nLet there be spaces in your togetherness, …….. Even as the\nstrings of a lute are alone though they quiver with the same\nmusic.\nThere are some lovely passages in the Bible that speak of the nature of\nChristian love, that self forgetting, self emptying love that we see in\nChrist himself. This passage, from Paul’s 1st Letter to the Church at\nCorinth, is one that is often used in Marriage Services.\nLove is patient; love is kind; love is not envious or boastful\nor arrogant 5 or rude. It does not insist on its own way; it is\nnot irritable or resentful; 6 it does not rejoice in wrongdoing,\nbut rejoices in the truth. 7 It bears all things, believes all\nthings, hopes all things, endures all things. ! Cor 13:4-7\nAs I read that I often think back to a young woman who was married\nin Ahoghill when I was there. She told me one time that when she\nwas annoyed she used to go to her room and read this passage – Love\nis PATIENT, love is KIND.\nPage 3 of 3\nWedding Blessing – June 20th – Ursula Woods and Jed\nThere are times when we will annoy one another, when we will\ndisappoint one another, when we will fail one another – this does not\nmean that failure, that disappointment do not matter – of course they\ndo. It is how we deal with them that is important. In a good marriage\nthese are dealt with in and through that Christ centred, Christ like love\nthat we are talking about – to which we can bring our love, our hurts,\nour regrets, our hopes.\nJed, Ursula, may you know that love, may you show that in your own\nlife together. May your marriage be a source of joy and happiness to\nyou and to all those you love – may God bless you both in all that lies\nahead of you."
    }
}