{
    "title": "Fruits of the Spirit: Love",
    "date": "2010-02-17",
    "blurb": "The sermon focuses on the concept of Love as a fruit of the Spirit. It emphasizes the self-giving, self-sacrificing nature of Christian love, drawing parallels with God's unfailing mercy. The ultimate expression of love is seen in Jesus' sacrifice on the cross. The sermon encourages believers to show a healing, reconciling, and redeeming love in their lives, just like Jesus.",
    "raw_text": "On Ash Wednesday we began thinking about the whole issue of change that we might want to see in ourselves. Desire to change arises out of a sense of dissatisfaction with ourselves – overweight - we go on a diet. Out of condition – we go on a fitness routine. Discipline only part of Lent – also a penitential season – designed to encourage us to think about repentance.\n\nRepentance is a change in direction – so alongside the discipline, the giving up, the laying aside – there is also a process of building up. We expect to see results. The diet, the fitness routine – we look for signs that this is working – we look for fruits of our discipline.\n\nPaul uses the word fruits in his letter to the Galatians when he speaks of fruits of the Spirit. I set that alongside the teaching of the Revised Catechism: Holy Spirit enables me to become more like Jesus. So we look for these fruits of the Spirit as they are to be found in Jesus and in God himself.\n\nTonight focus on LOVE. English language has only one word that covers the whole range of love from the physical, the friendship, the self giving, spiritual aspects of love. Christian love, be it the spiritual or indeed the physical or the friendship must always have within it the self giving, self sacrificing love of God.\n\nLove is a word that occurs right through the Bible. In the Old Testament , one of the most common of usages is that of ‘the unfailing mercy of God’.\n\nScriptures described as God’s love letter to mankind – a story of love that continues in the face of all setbacks. Man turns his back of god but God will not, cannot turn his back on man.\n\nUltimate expression of love is Jesus on the Cross. It is what I like to call Calvary love – love at full stretch – image of child asking how much we love them – do you love me this much. God in Christ is saying I love you this much – arms stretched out, nailed to the Cross – love at full stretch.\n\nThis is the starting point for my response of love. This is where the teaching of the work of the Holy Spirit comes in. Holy Spirit enables me to become more like Jesus. Jesus love is a healing, reconciling, redeeming love - our lives should show the same.\n\nLove relational - not conditional or manipulative – if you loved me etc …… Love in Jesus very opposite of conditional – makes the first step. ‘While we were yet sinners, Christ died for us’. His love precedes my repentance, my response. God has done his part – now up to me to respond.\n\nI am called to be an initiator in reconciliation, in forgiveness – how can we begin to make this happen? Love that knows no boundaries – love not just our neighbour but also our enemy – example of Gordon Wilson.\n\nLove that does not count the cost - cost of the cross in words ‘ My God, my God! Why have you forsaken me?’ In the extent of God’s love, love at full stretch I recognise the poverty of my response. Not a simple imitation, something done in my own strength and my own will power. Letting Jesus live in and through me.\n\nAs Paul wrote to the Galatians: I have been crucified with Christ; 20 and it is no longer I who live, but it is Christ who lives in me. And the life I now live in the flesh I live by faith in the Son of God, who loved me and gave himself for me. Holy Spirit enables me to become more like Jesus. What are the obstacles to God’s love?",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/mid week/2010 - fruits of the Spirit/Week 1 - Love.txt",
        "raw_ocr_content": "Page 1 of 3\nLent Mid Week – 2010 – Fruit of the Spirit\n(1) Love\nOn Ash Wednesday we began thinking about the whole issue of change that we\nmight want to see in ourselves.\nDesire to change arises out of a sense of dissatisfaction with ourselves –\noverweight - we go on a diet. Out of condition – we go on a fitness routine.\nDiscipline only part of Lent – also a penitential season – designed to encourage\nus to think about repentance\nRepentance is a change in direction – so alongside the discipline, the giving up,\nthe laying aside – there is also a process of building up.\nWe expect to see results. The diet, the fitness routine – we look for signs that\nthis is working – we look for fruits of our discipline.\nPaul uses the word fruits in his letter to the Galatians when he speaks of fruits\nof the Spirit\nREAD GALATIANS PASSAGE\nI set that alongside the teaching of the Revised Catechism:\nHoly Spirit enables me to become more like Jesus\nSo we look for these fruits of the Spirit as they are to be found in Jesus and in\nGod himself.\nTonight focus on LOVE\nEnglish language has only one word that covers the whole range of love from\nthe physical, the friendship, the self giving, spiritual aspects of love.\nChristian love, be it the spiritual or indeed the physical or the friendship must\nalways have within it the self giving, self sacrificing love of God..\nLove is a word that occurs right through the Bible.\nIn the Old Testament , one of the most common of usages is that of ‘the\nunfailing mercy of God’\nPage 2 of 3\nLent Mid Week – 2010 – Fruit of the Spirit\n(1) Love\nScriptures described as God’s love letter to mankind – a story of love that\ncontinues in the face of all setbacks.\nMan turns his back of god but God will not, cannot turn his back on man.\nUltimate expression of love is Jesus on the Cross. It is what I like to call\nCalvary love – love at full stretch – image of child asking how much we love\nthem – do you love me this much\nGod in Christ is saying I love you this much – arms stretched out, nailed to the\nCross – love at full stretch\nThis is the starting point for my response of love\nREAD EPHESIANS PASSAGE\nThis is where the teaching of the work of the Holy Spirit comes in\nHoly Spirit enables me to become more like Jesus\nJesus love is a healing, reconciling, redeeming love - our lives should show the\nsame\nLove relational - not conditional or manipulative – if you loved me etc ………\nLove in Jesus very opposite of conditional – makes the first step\n‘While we were yet sinners, Christ died for us’.\nHis love precedes my repentance, my response. God has done his part – now\nup to me to respond\nI am called to be an initiator in reconciliation, in forgiveness – how can we\nbegin to make this happen?\nLove that knows no boudaries – love not just our neighbour but also our\nenemy – example of Gordon Wilson\nPage 3 of 3\nLent Mid Week – 2010 – Fruit of the Spirit\n(1) Love\nLove that does not count the cost - cost of the cross in words ‘ My God, my\nGod! Why have you forsaken me?’\nIn the extent of God’s love, love at full stretch I recognise the poverty of my\nresponse.\nNot a simple imitation, something done in my own strength and my own will\npower.\nLetting Jesus live in and through me\nAs Paul wrote to the Galatians:\nI have been crucified with Christ; 20 and it is no longer I who live, but it is Christ who\nlives in me. And the life I now live in the flesh I live by faith in the Son of God, who loved\nme and gave himself for me.\nHoly Spirit enables me to become more like Jesus\nWhat are the obstacles to God’s love?"
    }
}