{
    "title": "Truth and Kingdoms",
    "date": "2013-03-28",
    "blurb": "This sermon, given during Holy Week 2013, reflects on the character of Pilate and his interaction with Jesus. It explores the concept of truth as presented in the Gospel of John and how it relates to our understanding of Jesus. The sermon also discusses the intersection of the Kingdom of God and the world, and how the values of the world can impact the Church and individual Christians.",
    "raw_text": "Holy week 2013 – Were you there when they crucified my Lord\nThursday - Pilate\n\n'Were you there when they crucified my Lord?' So runs the old Negro spiritual that has formed the overarching title of our thoughts for this Holy week. Whereas the spiritual reflects on the different aspects of Jesus suffering on the Cross itself, David and I have taken it to group together different characters who participated in the whole drama that lead up to the crucifixion of Jesus. As we have reflected on Peter, the High Priest and last night, Judas we see them not as remote figures but as ones with whom, like it or not, we at times can identify. There is something of Peter, of the High Priest, of Judas in me. But what we also realise as we reflect on the Cross of Christ is God’s love, a love that knows no bounds, that sets no limits.\n\nAs I remarked on Tuesday night, I seem to have taken upon myself to reflect on figures representing the religious and political establishment of the day. The other night we thought of the High Priest and the Sanhedrin. These were not wicked men, these were men who saws themselves as the guardians of the nation’s faith. Establishments find mavericks unsettling, even threatening. Jesus had claimed an intimate association with the Father, for anyone other than the son of God to say that was nothing short of blasphemous so Jesus had to go.\n\nTonight our attention turns to the figure of Pilate. In the account of the trial of Jesus before Pilate, St John present us an encounter between two very different worlds\n\nThe writer of John’s Gospel presents this as a series of encounters between Jesus and Pilate interspersed with his contacts with the Jewish leaders and the crowd waiting outside his house. Pilate’s questions of Jesus say as much about where he is coming from as the information he is trying to find out from the prisoner before him. One senses an impatience on the part of Pilate with Jesus. With the crowds outside baying for his blood, Jesus seems almost indifferent. Throughout their discourse Pilate often reminds him he is in serious trouble, asking him, 'Don’t you realise I have power to release you and power to crucify you?' With all this going on, Jesus talks of his vocation to bear witness to the truth. One can imagine the sneer in Pilate’s voice, 'What is truth?'\n\nIn the wider context of John’s Gospel as a whole, truth, the source of truth is a theme that reoccurs at different points in John’s Gospel and also in the Letters of John. So in fact Pilate’s question, 'What is truth?' lies at the heart of our whole understanding of who this character Jesus is. If we go back to the first chapter of John’s Gospel:\n\n'17 The law indeed was given through Moses; grace and truth came through Jesus Christ.' John 1:17\n\nTruth, truth about God, truth about man lies at the very heart of who Jesus is and what he came to do. Early in his ministry, as people began to reject or follow Jesus, he declared to those who followed him.\n\n'32 and you will know the truth, and the truth will make you free.' John 8:32\n\nAnd in that extended teaching in the upper room described for us by John, Jesus declares to his disciples:\n\n'I am the way, and the truth, and the life. No one comes to the Father except through me.' John 14:6\n\nThat day Pilate asks, 'What is truth?' and truth was standing before him.\n\nThat question that Pilate asked of Jesus is a question that faces each one of us. 'What is truth?' What is the foundation on which I lay my life, my understanding of right and wrong, my understanding of my humanity, my mortality, my hopes and fears, my understanding of God himself?\n\nIt is said that the first casualty of war is the truth, as propaganda delivered by both sides in the conflict obscures rather than contributes to the search for truth.\n\nAs I said at the outset, Pilate and Jesus represent not just two very different personalities but two very different world views. In fact they represent two very different Kingdoms, the Kingdom of God and the Kingdom of this world. As followers of Jesus, like our Lord, we are called to embody the values of the Kingdom of God on Pilate’s home territory, the Kingdom of this world. Jesus, in praying for the disciples on the night before he died, reminded them of this fundamental truth:\n\n14 I have given them your word, and the world has hated them because they do not belong to the world, just as I do not belong to the world. 15 I am not asking you to take them out of the world, but I ask you to protect them from the evil one. 16 They do not belong to the world, just as I do not belong to the world. 17 Sanctify them in the truth; your word is truth. 18 As you have sent me into the world, so I have sent them into the world. John 17:14-18\n\nChristian life is lived out at that intersection between the Kingdom of God and the world (or as the Americans put it 'Where the rubber hits the road'). It is at that sometimes painful intersection we have to answer the question of Pilate, 'What is truth?' The values of the world are always seeking to impinge on our lives. That is the underlying theme of the Temptations of Jesus in the wilderness, as Satan showed Jesus all the kingdoms of the world in all their splendour and said, 'Bow down and worship me and all this will be yours.'\n\nThe world, and the values of the world, will seek to impinge on the life of the Church itself, blunting our witness to the truth. An example of this is to be found in the very origins of Methodism itself. Large sections of the Church of England of John Wesley’s day had allowed itself to become absorbed with secular concerns, the comfort of Establishment. Methodism arose in direct response to this. Many parts of the Church in the Southern United States became comfortable with the racialism of the society in which it was set and so we saw 'white only' churches and of course we also saw the South African Dutch Reformed Church’s previous endorsement of the whole system of Apartheid from which they have since formally repented.\n\nEvery Church community, every individual Christian, standing as they do at that interface between the Kingdom of God and the Kingdom of the World, in the way we order our lives, in the way we set our priorities, in daily life, in public life, in Church life faces that question that Pilate posed to Jesus, 'What is truth?' Is it to be the truth as expressed in the life and teaching, the death and resurrection of Jesus Christ or the truth that the world of Pilate purports to proclaim where power and privilege prevail?\n\nJohn 18:33-40\n\nJn 18:33 Then Pilate entered the headquarters again, summoned Jesus, and asked him, 'Are you the King of the Jews?' 34 Jesus answered, 'Do you ask this on your own, or did others tell you about me?' 35 Pilate replied, 'I am not a Jew, am I? Your own nation and the chief priests have handed you over to me. What have you done?' 36 Jesus answered, 'My kingdom is not from this world. If my kingdom were from this world, my followers would be fighting to keep me from being handed over to the Jews. But as it is, my kingdom is not from here.' 37 Pilate asked him, 'So you are a king?' Jesus answered, 'You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.' 38 Pilate asked him, 'What is truth?' After he had said this, he went out to the Jews again and told them, 'I find no case against him. 39 But you have a custom that I release someone for you at the Passover. Do you want me to release for you the King of the Jews?' 40 They shouted in reply, 'Not this man, but Barabbas!' Now Barabbas was a bandit.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2013/wereyoutherepilate.txt",
        "raw_ocr_content": "Page 1 of 5\nHoly week 2013 – Were you there when they crucified my Lord\nThursday - Pilate\n‘Were you there when they crucified my Lord?’ So runs the old Negro\nspiritual that has formed the overarching title of our thoughts for this Holy\nweek. Whereas the spiritual reflects on the different aspects of Jesus\nsuffering on the Cross itself, David and I have taken it to group together\ndifferent characters who participated in the whole drama that lead up to\nthe crucifixion of Jesus. As we have reflected on Peter, the High Priest\nand last night, Judas we see them not as remote figures but as ones with\nwhom, like it or not, we at times can identify. There is something of\nPeter, of the High Priest, of Judas in me. But what we also realise as we\nreflect on the Cross of Christ is God’s love, a love that knows no bounds,\nthat sets no limits.\nAs I remarked on Tuesday night, I seem to have taken upon myself to\nreflect on figures representing the religious and political establishment of\nthe day. The other night we thought of the High Priest and the Sanhedrin.\nThese were not wicked men, these were men who saws themselves as the\nguardians of the nation’s faith. Establishments find mavericks unsettling,\neven threatening. Jesus had claimed an intimate association with the\nFather, for anyone other than the son of God to say that was nothing short\nof blasphemous so Jesus had to go.\nTonight our attention turns to the figure of Pilate. In the account of the\ntrial of Jesus before Pilate, St John present us an encounter between two\nvery different worlds\nThe writer of John’s Gospel presents this as a series of encounters between\nJesus and Pilate interspersed with his contacts with the Jewish leaders and\nthe crowd waiting outside his house. Pilate’s questions of Jesus say as\nPage 2 of 5\nHoly week 2013 – Were you there when they crucified my Lord\nThursday - Pilate\nmuch about where he is coming from as the information he is trying to\nfind out from the prisoner before him. One senses an impatience on the\npart of Pilate with Jesus. With the crowds outside baying for his blood,\nJesus seems almost indifferent. Throughout their discourse Pilate often\nreminds him he is in serious trouble, asking him, ‘Don’t you realise I have\npower to release you and power to crucify you?’ With all this going on,\nJesus talks of his vocation to bear witness to the truth. One can imagine\nthe sneer in Pilate’s voice, ‘What is truth?’\nIn the wider context of John’s Gospel as a whole, truth, the source of truth\nis a theme that reoccurs at different points in John’s Gospel and also in the\nLetters of John. So in fact Pilate’s question, ‘What is truth?’ lies at the\nheart of our whole understanding of who this character Jesus is. If we go\nback to the first chapter of John’s Gospel:\n‘17 The law indeed was given through Moses; grace and truth came\nthrough Jesus Christ.’ John 1:17\nTruth, truth about God, truth about man lies at the very heart of who Jesus\nis and what he came to do. Early in his ministry, as people began to reject\nor follow Jesus, he declared to those who followed him.\n‘32 and you will know the truth, and the truth will make you free.\" John\n8:32\nAnd in that extended teaching in the upper room described for us by John,\nJesus declares to his disciples:\n‘I am the way, and the truth, and the life. No one comes to the Father\nexcept through me.’ John 14:6\nThat day Pilate asks, ‘What is truth?’ and truth was standing before him.\nPage 3 of 5\nHoly week 2013 – Were you there when they crucified my Lord\nThursday - Pilate\nThat question that Pilate asked of Jesus is a question that faces each one of\nus. ‘What is truth?’ What is the foundation on which I lay my life, my\nunderstanding of right and wrong, my understanding of my humanity, my\nmortality, my hopes and fears, my understanding of God himself?\nIt is said that the first casualty of war is the truth, as propaganda delivered\nby both sides in the conflict obscures rather than contributes to the search\nfor truth.\nAs I said at the outset, Pilate and Jesus represent not just two very\ndifferent personalities but two very different world views. In fact they\nrepresent two very different Kingdoms, the Kingdom of God and the\nKingdom of this world. As followers of Jesus, like our Lord, we are\ncalled to embody the values of the Kingdom of God on Pilate’s home\nterritory, the Kingdom of this world. Jesus, in praying for the disciples on\nthe night before he died, reminded them of this fundamental truth:\n14 I have given them your word, and the world has hated them because\nthey do not belong to the world, just as I do not belong to the world. 15\nI am not asking you to take them out of the world, but I ask you to\nprotect them from the evil one. 16 They do not belong to the world, just\nas I do not belong to the world. 17 Sanctify them in the truth; your\nword is truth. 18 As you have sent me into the world, so I have sent\nthem into the world. John 17:14-18\nChristian life is lived out at that intersection between the Kingdom of God\nand the world (or as the Americans put it ‘Where the rubber hits the\nroad’). It is at that sometimes painful intersection we have to answer the\nquestion of Pilate, ‘What is truth?’ The values of the world are always\nseeking to impinge on our lives. That is the underlying theme of the\nTemptations of Jesus in the wilderness, as Satan showed Jesus all the\nPage 4 of 5\nHoly week 2013 – Were you there when they crucified my Lord\nThursday - Pilate\nkingdoms of the world in all their splendour and said, ‘Bow down and\nworship me and all this will be yours.’\nThe world, and the values of the world, will seek to impinge on the life of\nthe Church itself, blunting our witness to the truth. An example of this is\nto be found in the very origins of Methodism itself. Large sections of the\nChurch of England of John Wesley’s day had allowed itself to become\nabsorbed with secular concerns, the comfort of Establishment. Methodism\narose in direct response to this. Many parts of the Church in the Southern\nUnited States became comfortable with the racialism of the society in\nwhich it was set and so we saw ‘white only’ churches and of course we\nalso saw the South African Dutch Reformed Church’s previous\nendorsement of the whole system of Apartheid from which they have\nsince formally repented.\nEvery Church community, every individual Christian, standing as they do\nat that interface between the Kingdom of God and the Kingdom of the\nWorld, in the way we order our lives, in the way we set our priorities, in\ndaily life, in public life, in Church life faces that question that Pilate posed\nto Jesus, ‘What is truth?’ Is it to be the truth as expressed in the life and\nteaching, the death and resurrection of Jesus Christ or the truth that the\nworld of Pilate purports to proclaim where power and privilege prevail?\nPage 5 of 5\nHoly week 2013 – Were you there when they crucified my Lord\nThursday - Pilate\nJohn 18:33-40\nJn 18:33 Then Pilate entered the headquarters again, summoned Jesus,\nand asked him, \"Are you the King of the Jews?\" 34 Jesus answered,\n\"Do you ask this on your own, or did others tell you about me?\" 35\nPilate replied, \"I am not a Jew, am I? Your own nation and the chief\npriests have handed you over to me. What have you done?\" 36 Jesus\nanswered, \"My kingdom is not from this world. If my kingdom were\nfrom this world, my followers would be fighting to keep me from\nbeing handed over to the Jews. But as it is, my kingdom is not from\nhere.\" 37 Pilate asked him, \"So you are a king?\" Jesus answered, \"You\nsay that I am a king. For this I was born, and for this I came into the\nworld, to testify to the truth. Everyone who belongs to the truth listens\nto my voice.\" 38 Pilate asked him, \"What is truth?\"\nAfter he had said this, he went out to the Jews again and told them,\n\"I find no case against him. 39 But you have a custom that I release\nsomeone for you at the Passover. Do you want me to release for you\nthe King of the Jews?\" 40 They shouted in reply, \"Not this man, but\nBarabbas!\" Now Barabbas was a bandit."
    }
}