{
    "title": "Were You There: Caiaphas",
    "date": "2013-03-26",
    "blurb": "This sermon, part of the Holy Week series, focuses on the character of Caiaphas, the High Priest, during the crucifixion of Jesus. It explores the religious establishment's reaction to Jesus and the tragic inability of Caiaphas to recognize Jesus as the Messiah. The sermon emphasizes the importance of taking the claims of Jesus seriously and warns against indifference.",
    "raw_text": "HOLY WEEK 2013-03-26 'Were you there when they crucified my Lord?' (2) Caiaphas\n\nDuring this season of Holy Week David and myself are sharing some thoughts around the central theme of 'Were you there when they crucified my Lord?'. Over the course of these nights we are looking at some of the participants in the whole drama. David began last night with Peter. Peter so courageous, so faithful and yet so vulnerable. He was the one who confessed Jesus as the Christ, he was the one who declared that he would stand by him, who followed him into the courtyard of the High Priest’s house – and yet he was the one who denied that he ever knew him and wept bitter tears of remorse and repentance.\n\nIt is Peter’s very humanity that makes him so attractive; it is in and through his very humanity that Peter comes through as a champion of the Gospel. Over the course of these nights David is tackling two of the disciples, I will be looking at two representatives of the establishment; the High Priest and Pilate, figure heads of the religious and political establishment of their day. That sharing out of themes was not to the forefront of our minds as we sat over coffee in the Rectory. I thought over that as I watched Songs of Praise for Palm Sunday the other night from Canterbury Cathedral. In the course of the programme the new Archbishop of Canterbury, Archbishop Julian Welby, was reflecting on the meaning of holy Week for him in his own faith journey, his experience of prayer, of personal loss, the meaning for him of the cross as an expression of God’s unconditional love for him. One aspect of the Holy Week story that he felt uncomfortable with, as head of an institutional Church, was the reaction of the religious establishment to the figure of Jesus.\n\nReligious establishments can be suspicious of what they see as a maverick element. We have to look no further than the history of our own two churches to see an example of that. John Wesley, an ordained priest of the Church of England, following his conversion experience at a Moravian Church Service, when his ‘heart was strangely warmed’, sought renewal in the Church of England. There was, as we know, a resistance within the Established Church and, eventually, Methodism went its separate way.\n\nOver the last few weeks, as we have witnessed changes in both Canterbury and Rome, we have heard from several quarters the call for the Church to focus on the Christ who calls us and whom we seek to serve. That is not to say that those who have gone before have not focussed on Christ or have not sought to serve him. It is rather a reminder of the need for each generation to remind itself of its primary allegiance and focus.\n\nI recall years ago listening to a BBC Radio 4 series ‘After Henry’. It featured three characters, the widow of Henry, their daughter and her elderly mother. They lived in separate flats in the one house. The old lady had this wonderful confidence that on all major issues God’s view on things coincided with her own. He saw things exactly as she did.\n\nMaybe that is the abiding temptation of religious tradition, religious establishment – we can presume to speak for God rather than allowing God to speak and act in and through us. As the Archbishop observed the other night on Songs of Praise this requires a certain honesty and humility – we might get it wrong.\n\nIt is at this point that I go back to Jesus standing in front of Caiaphas and the Sanhedrin. These were not unusually wicked men, the High Priest and the Council. They saw themselves as guardians of the nation’s faith. Jesus was not there on a political charge – that comes later when he is brought before Pilate. In this hastily convened court that night, Caiaphas goes right to the core of the question – who does Jesus say he is?\n\n'Are you the Christ, the Son of God?' Jesus said, 'Yes, it is as you say.'\n\nJesus was sentenced to death for blasphemy. He claimed a unique identification with God that he and God were so close that what he was, God was; and what God was, he was. No wonder Caiaphas was consumed with rage, declaring that Jesus was condemned by his own words.\n\nThere was a sense in which Caiaphas was right. You cannot be neutral in the face of someone who makes himself out to be the Son of God. We must either worship him and give him our life – or utterly condemn. In the words of C S Lewis, Jesus was either right, or mad, or utterly evil.\n\nWe are not dealing this week with the romantic death of an attractive young man who was hard done by. The Christian Church has not been built on the admiration of his teaching or sympathy for his death. Admiration or sympathy do not sustain people or give them hope. It is built on the fundamental assertion that he who was lifted up on the Cross was nothing less than the Son of God. He was crucified because he identified his message with the heart and mind of God. The tragedy is that Caiaphas and the religious tradition that waited for the coming of God’s Messiah, was not able to recognise him when he stood before them.\n\nTo Caiaphas and the Council that night, the issue was simple; if what Jesus says is true we must worship; if what he says is false he is a blasphemer and must be destroyed. There was no middle way, detachment was impossible.\n\nThankfully nowadays, we do not put people to death for blasphemy. But perhaps with the gentleness we have lost some of the passion. A priest of the Church of Ireland, known as Woodbine Willie to the troops he ministered to in the trenches of the First World War, put it rather nicely in a poem called 'Indifference'. At Golgotha, he said, they responded to Jesus with Passion, but…\n\nWhen Jesus came to Birmingham\nThey simply passed Him by,\nThey never hurt a hair of Him,\nThey only let Him die;\nFor men have grown more tender,\nAnd they would not give Him pain,\nThey only just passed down the street,\nAnd left Him in the rain.\n\nStill Jesus cried, 'Forgive them,\nFor they know not what they do!\nAnd still it rained the winter rain\nThat drenched Him through and through;\nThe crowd went home and left the streets\nWithout a soul to see,\nAnd Jesus crouched against a wall\nAnd cried for Calvary.\n\nGod can deal with our opposition far easier than he can deal with our indifference. Opposition at least shows that we care, that we are thinking about the issues.\n\nThe Church makes great claims for Jesus:\nwe believe that God was with him, that God was in him.\nGod was among us in Christ, among us in the streets of Jerusalem, in the Garden of Gethsemane, raised high on the Cross.\nhe died that sins might be forgiven, he died that we might live.\nWhatever else we may say about Caiaphas – at least he took these claims seriously.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2013/wereyoutherecaiaphas.txt",
        "raw_ocr_content": "Page 1 of 5\nHOLY WEEK 2013-03-26’Were you there when they crucified my Lord?’\n(2) Caiaphas\nDuring this season of Holy Week David and myself are sharing some thoughts\naround the central theme of ‘Were you there when they crucified my Lord?’.\nOver the course of these nights we are looking at some of the participants in\nthe whole drama. David began last night with Peter. Peter so courageous, so\nfaithful and yet so vulnerable. He was the one who confessed Jesus as the\nChrist, he was the one who declared that he would stand by him, who followed\nhim into the courtyard of the High Priest’s house – and yet he was the one who\ndenied that he ever knew him and wept bitter tears of remorse and repentance.\nIt is Peter’s very humanity that makes him so attractive; it is in and through his\nvery humanity that Peter comes through as a champion of the Gospel.\nOver the course of these nights David is tackling two of the disciples, I will be\nlooking at two representatives of the establishment; the High Priest and Pilate,\nfigure heads of the religious and political establishment of their day. That\nsharing out of themes was not to the forefront of our minds as we sat over\ncoffee in the Rectory. I thought over that as I watched Songs of Praise for\nPalm Sunday the other night from Canterbury Cathedral. In the course of the\nprogramme the new Archbishop of Canterbury, Archbishop Julian Welby, was\nreflecting on the meaning of holy Week for him in his own faith journey, his\nexperience of prayer, of personal loss, the meaning for him of the cross as an\nexpression of God’s unconditional love for him. One aspect of the Holy Week\nstory that he felt uncomfortable with, as head of an institutional Church, was\nthe reaction of the religious establishment to the figure of Jesus.\nReligious establishments can be suspicious of what they see as a maverick\nelement. We have to look no further than the history of our own two churches\nto see an example of that. John Wesley, an ordained priest of the Church of\nEngland, following his conversion experience at a Moravian Church Ser vice,\nwhen his ‘heart was strangely warmed’, sought renewal in the Church of\nPage 2 of 5\nHOLY WEEK 2013-03-26’Were you there when they crucified my Lord?’\n(2) Caiaphas\nEngland. There was, as we know, a resistance within the Established Church\nand, eventually, Methodism went its separate way.\nOver the last few weeks, as we have witnessed changes in both Canterbury and\nRome, we have heard from several quarters the call for the Church to focus on\nthe Christ who calls us and whom we seek to serve. That is not to say that\nthose who have gone before have not focussed on Christ or have not sought to\nserve him. It is rather a reminder of the need for each generation to remind\nitself of its primary allegiance and focus.\nI recall years ago listening to a BBC Radio 4 series ‘After Henry’. It featured\nthree characters, the widow of Henry, their daughter and her elderly mother.\nThey lived in separate flats in the one house. The old lady had this wonderful\nconfidence that on all major issues God’s view on things coincided with her\nown. He saw things exactly as she did.\nMaybe that is the abiding temptation of religious tradition, religious\nestablishment – we can presume to speak for God rather than allowing God to\nspeak and act in and through us. As the Archbishop observed the other night\non Songs of Praise this requires a certain honesty and humility – we might get\nit wrong.\nIt is at this point that I go back to Jesus standing in front of Caiaphas and the\nSanhedrin. These were not unusually wicked men, the High Priest and the\nCouncil. They saw themselves as guardians of the nation’s faith. Jesus was\nnot there on a political charge – that comes later when he is brought before\nPilate. In this hastily convened court that night, Caiaphas goes right to the core\nof the question – who does Jesus say he is?\n‘Are you the Christ, the Son of God?’ Jesus said, ‘Yes, it is as you say.’\nPage 3 of 5\nHOLY WEEK 2013-03-26’Were you there when they crucified my Lord?’\n(2) Caiaphas\nJesus was sentenced to death for blasphemy. He claimed a unique\nidentification with God that he and God were so close that what he was, God\nwas; and what God was, he was. No wonder Caiaphas was consumed with\nrage, declaring that Jesus was condemned by his own words.\nThere was a sense in which Caiaphas was right. You cannot be neutral in the\nface of someone who makes himself out to be the Son of God. We must either\nworship him and give him our life – or utterly condemn. In the words of C S\nLewis, Jesus was either right, or mad, or utterly evil.\nWe are not dealing this week with the romantic death of an attractive young\nman who was hard done by. The Christian Church has not been built on the\nadmiration of his teaching or sympathy for his death. Admiration or sympathy\ndo not sustain people or give them hope. It is built on the fundamental\nassertion that he who was lifted up on the Cross was nothing less than the Son\nof God. He was crucified because he identified his message with the heart and\nmind of God. The tragedy is that Caiaphas and the religious tradition that\nwaited for the coming of God’s Messiah, was not able to recognise him when\nhe stood before them.\nTo Caiaphas and the Council that night, the issue was simple; if what Jesus\nsays is true we must worship; if what he says is false he is a blasphemer and\nmust be destroyed. There was no middle way, detachment was impossible.\nThankfully nowadays, we do not put people to death for blasphemy. But\nperhaps with the gentleness we have lost some of the passion. A priest of the\nChurch of Ireland, known as Woodbine Willie to the troops he ministered to in\nthe trenches of the First World War, put it rather nicely in a poem called\nPage 4 of 5\nHOLY WEEK 2013-03-26’Were you there when they crucified my Lord?’\n(2) Caiaphas\n‘Indifference’. At Golgotha, he said, they responded to Jesus with Passion,\nbut…\nWhen Jesus came to Birmingham\nThey simply passed Him by,\nThey never hurt a hair of Him,\nThey only let Him die;\nFor men have grown more tender,\nAnd they would not give Him pain,\nThey only just passed down the street,\nAnd left Him in the rain.\nStill Jesus cried, 'Forgive them,\nFor they know not what they do!\nAnd still it rained the winter rain\nThat drenched Him through and through;\nThe crowd went home and left the streets\nWithout a soul to see,\nAnd Jesus crouched against a wall\nAnd cried for Calvary.\nGod can deal with our opposition far easier than he can deal with our\nindifference. Opposition at least shows that we care, that we are thinking about\nthe issues.\nThe Church makes great claims for Jesus:\nwe believe that God was with him, that God was in him.\nGod was among us in Christ, among us in the streets of Jerusalem, in the\nGarden of Gethsemane, raised high on the Cross.\nhe died that sins might be forgiven, he died that we might live.\nWhatever else we may say about Caiaphas – at least he took these claims\nseriously.\nPage 5 of 5\nHOLY WEEK 2013-03-26’Were you there when they crucified my Lord?’\n(2) Caiaphas\nLesson Mark 14:53-65\n53 They took Jesus to the high priest; and all the chief priests, the elders,\nand the scribes were assembled. 54 Peter had followed him at a distance,\nright into the courtyard of the high priest; and he was sitting with the\nguards, warming himself at the fire. 55 Now the chief priests and the\nwhole council were looking for testimony against Jesus to put him to\ndeath; but they found none. 56 For many gave false testimony against him,\nand their testimony did not agree. 57 Some stood up and gave false\ntestimony against him, saying, 58 \"We heard him say, 'I will destroy this\ntemple that is made with hands, and in three days I will build another, not\nmade with hands.' \" 59 But even on this point their testimony did not\nagree. 60 Then the high priest stood up before them and asked Jesus,\n\"Have you no answer? What is it that they testify against you?\" 61 But he\nwas silent and did not answer. Again the high priest asked him, \"Are you\nthe Messiah, the Son of the Blessed One?\" 62 Jesus said, \"I am; and\n'you will see the Son of Man\nseated at the right hand of the Power,'\nand 'coming with the clouds of heaven.' \"\n63 Then the high priest tore his clothes and said, \"Why do we still need\nwitnesses? 64 You have heard his blasphemy! What is your decision?\" All\nof them condemned him as deserving death. 65 Some began to spit on him,\nto blindfold him, and to strike him, saying to him, \"Prophesy!\" The guards\nalso took him over and beat him."
    }
}