{
    "title": "The Victim",
    "date": "2013-03-29",
    "blurb": "This sermon reflects on the different characters who participated in the first Holy Week, their hopes, ideas, and how Jesus related to them. It particularly focuses on Jesus' crucifixion, seen through the eyes of faith as God acting in power. The sermon emphasizes that 'It is finished' is not a cry of despair but a shout of triumph, signifying the completion of God's intended task.",
    "raw_text": "HOLY WEEK 2013 – Good Friday\n\n‘Were you there when they crucified my Lord’\n\nThe Victim\n\nOver this Holy Week, in services here and in Sutton Methodist Church, we have been looking at different characters who participated in the drama of that first Holy Week. As we look at the characters we cannot dissociate ourselves form them. They had their hopes, their ideas and, in part, their hopes and ideas are our hopes and ideas. As we reflect on how Jesus related to them, challenged them, so he relates to and challenges us.\n\nWe thought of the people who got it horribly wrong. Judas Iscariot, one of the inner circle of disciples, now a byword for treachery and betrayal; maybe at the heart of his failure was that he presumed to now better than Christ how the Messiah should operate. Then there was the High priest, the representative of the religious establishment of his day, the guardian of the nation’s faith. One thing you have to give to him is that he took Jesus’ claims concerning himself very seriously. But he could not accept that Jesus could be God’s promised Messiah. The tragedy was that the tradition he had given his life to, a tradition that should have pointed to Christ, blinded him so that he could not see the Messiah literally staring him in the face. But at least he reacted – too many look at Christ and are simply indifferent to who he was and what he came to do.\n\nWe thought of someone who really wanted to get it right, and yet seemed to get it wrong, Peter. Peter the first to confess Jesus as the Christ; Peter who promised Jesus that even if others ran away he would stand by him; Peter, who when Jesus was arrested followed him into the courtyard of the High Priest’s house and yet when challenged by a servant girl denied he ever knew him. But we also saw Peter’s real strength, his understanding of the forgiveness that Jesus offered, a humility that was prepared to accept and a steadfastness that kept him going on and on in his desire to serve and follow Christ.\n\nLast night we thought of Jesus before Pilate. Pilate and Jesus represent not just two very different personalities but two very different world views. In fact they represent two very different Kingdoms, the Kingdom of God and the Kingdom of this world. Christian life is lived out at that intersection between the Kingdom of God and the world (or as the Americans put it ‘Where the rubber hits the road’). It is at that sometimes painful intersection we have to answer the question of Pilate, ‘What is truth?’ The values of the world are always seeking to impinge on our lives.\n\nWell tonight on this Good Friday, we turn our attention to the figure at the centre of our story, Jesus upon the cross. What I want to do tonight is to think of ways in which we look at this story that is so central to our faith..\n\nEver since I was some 8 years of age, when I had the measles, I have had to wear glasses. Without these glasses the world is a hazy blur. While I am thankful that I can at least see, I cannot make out faces, TV or computer screen, the details of a landscape. Put on the glasses and the same faces, screens, landscapes become clear. It is not that the faces or the landscape have changed; rather the glasses enable me to see them as they are.\n\nWe read tonight as our lesson St John’s account of the crucifixion. It was an ugly business that first Good Friday. Jesus, before Pilate, sacrificed to the demands of the mob. Humiliated by the soldiers, scourged and paraded through the streets of Jerusalem, carrying his own cross out of the city to Golgotha. Then after three hours the cry goes up, ‘It is finished’.\n\nViewed through the eyes of the world, this was the ignominious end of a pretender to the throne of God. The High Priest’s estimate of him seems to have been vindicated; Judas’ betrayal of him gains a veneer of respectability and the disciples left as fools who followed a fool. Well, as Jesus said, ‘It is finished.’\n\nWhy, the, are we here some 2000 years later? Why have men and women down through the ages proclaimed the faith, lived the faith and died for the faith?\n\nHere is where my allusion to spectacles comes into play. As I say, viewed through the eyes of the world the cross is a mess, a victory of hate, of ugliness over love. Viewed through the spectacles of faith, it is God acting in power. Through the spectacles of faith we see it as it really is.\n\nJohn, in the way he presents the story in his Gospel, brings this out more forcibly than any of the other Gospel writers. He speaks of the Cross and the glorification of Jesus as one and the same thing. This paradox comes out in these dying words; ‘It is finished’. the word John uses in the Greek in which his Gospel is written is tetevlestai . It means not just it is finished, it is over but also it is accomplished, the job is done, the task is complete. All that the prophets foretold; then, recalling words spoken in the upper room the night before, all that the Father had sent him to do; the power of sin is broken, the world is over come.\n\nIt is at this point that my weakness meets Christ’s power. The sin of man meets the love of God and it is broken in body of Christ on the Cross. Our tragedy is our disobedience, our resistance to reality, our pettiness. the triumph of Christ is his obedience, his grasp of reality, his oneness with the Father.\n\nIn the life of Christ our whole human experience was re-run – this time as God always intended it to be. By his obedience, he justifies us; in fellowship with him we are a new creation.\n\nSo ‘It is finished’ is not a cry of despair but a shout of triumph. I often think back on words of Prof Vokes, who lectured us on John’s Gospel. He said of this final cry from the Cross, ‘John leaves us with a picture of Jesus reigning from the cross’. At this point, Matthew and Mark tell us the veil of the Temple was torn in two. As a German theologian put it:\n\nAt these words you hear fetters burst, and prison walls come tumbling down; barriers as high as heaven are overthrown, and gates which had been closed for thousands of years again move on their hinges.\n\nMy glasses enable me to see the world around me as it really is. May God grant to us all the insight to see the Cross as it really is, God in Christ in his broken and crucified body healing and redeeming his broken creation. Recognising his love for me, may I give myself to him in love and service.\n\nAwake my soul and sing of him who died for thee, and hail him as thy matchless King through all eternity.",
    "request": {
        "file_name": "raw/sermons archive/Sermons/Lent/Holy Week/2013/wereyoutherevictim.txt",
        "raw_ocr_content": "Page 1 of 4\nHOLY WEEK 2013 – Good Friday\n‘Were you there when they crucified my Lord’\nThe Victim\nOver this Holy Week, in services here and in Sutton Methodist Church, we\nhave been looking at different characters who participated in the drama of that\nfirst Holy Week. As we look at the characters we cannot dissociate ourselves\nform them. They had their hopes, their ideas and, in part, their hopes and ideas\nare our hopes and ideas. As we reflect on how Jesus related to them,\nchallenged them, so he relates to and challenges us.\nWe thought of the people who got it horribly wrong. Judas Iscariot, one of the\ninner circle of disciples, now a byword for treachery and betrayal; maybe at\nthe heart of his failure was that he presumed to now better than Christ how the\nMessiah should operate. Then there was the High priest, the representative of\nthe religious establishment of his day, the guardian of the nation’s faith. One\nthing you have to give to him is that he took Jesus’ claims concerning himself\nvery seriously. But he could not accept that Jesus could be God’s promised\nMessiah. The tragedy was that the tradition he had given his life to, a tradition\nthat should have pointed to Christ, blinded him so that he could not see the\nMessiah literally staring him in the face. But at least he reacted – too many\nlook at Christ and are simply indifferent to who he was and what he came to\ndo.\nWe thought of someone who really wanted to get it right, and yet seemed to\nget it wrong, Peter. Peter the first to confess Jesus as the Christ; Peter who\npromised Jesus that even if others ran away he would stand by him; Peter,\nwho when Jesus was arrested followed him into the courtyard of the High\nPriest’s house and yet when challenged by a servant girl denied he ever knew\nhim. But we also saw Peter’s real strength, his understanding of the\nforgiveness that Jesus offered, a humility that was prepared to accept and a\nPage 2 of 4\nHOLY WEEK 2013 – Good Friday\n‘Were you there when they crucified my Lord’\nThe Victim\nsteadfastness that kept him going on and on in his desire to serve and follow\nChrist.\nLast night we thought of Jesus before Pilate. Pilate and Jesus represent not\njust two very different personalities but two very different world views. In\nfact they represent two very different Kingdoms, the Kingdom of God and the\nKingdom of this world. Christian life is lived out at that intersection between\nthe Kingdom of God and the world (or as the Americans put it ‘Where the\nrubber hits the road’). It is at that sometimes painful intersection we have to\nanswer the question of Pilate, ‘What is truth?’ The values of the world are\nalways seeking to impinge on our lives.\nWell tonight on this Good Friday, we turn our attention to the figure at the\ncentre of our story, Jesus upon the cross. What I want to do tonight is to think\nof ways in which we look at this story that is so central to our faith..\nEver since I was some 8 years of age, when I had the measles, I have had to\nwear glasses. Without these glasses the world is a hazy blur. While I am\nthankful that I can at least see, I cannot make out faces, TV or computer\nscreen, the details of a landscape. Put on the glasses and the same faces,\nscreens, landscapes become clear. It is not that the faces or the landscape have\nchanged; rather the glasses enable me to see them as they are.\nWe read tonight as our lesson St John’s account of the crucifixion. It was an\nugly business that first Good Friday. Jesus, before Pilate, sacrificed to the\ndemands of the mob. Humiliated by the soldiers, scourged and paraded\nPage 3 of 4\nHOLY WEEK 2013 – Good Friday\n‘Were you there when they crucified my Lord’\nThe Victim\nthrough the streets of Jerusalem, carrying his own cross out of the city to\nGolgotha. Then after three hours the cry goes up, ‘It is finished’.\nViewed through the eyes of the world, this was the ignominious end of a\npretender to the throne of God. The High Priest’s estimate of him seems to\nhave been vindicated; Judas’ betrayal of him gains a veneer of respectability\nand the disciples left as fools who followed a fool. Well, as Jesus said, ‘It is\nfinished.’\nWhy, the, are we here some 2000 years later? Why have men and women\ndown through the ages proclaimed the faith, lived the faith and died for the\nfaith?\nHere is where my allusion to spectacles comes into play. As I say, viewed\nthrough the eyes of the world the cross is a mess, a victory of hate, of ugliness\nover love. Viewed through the spectacles of faith, it is God acting in power.\nThrough the spectacles of faith we see it as it really is.\nJohn, in the way he presents the story in his Gospel, brings this out more\nforcibly than any of the other Gospel writers. He speaks of the Cross and the\nglorification of Jesus as one and the same thing. This paradox comes out in\nthese dying words; ‘It is finished’. the word John uses in the Greek in which\nhis Gospel is written is tetevlestai . It means not just it is finished, it is over\nbut also it is accomplished, the job is done, the task is complete. All that the\nprophets foretold; then, recalling words spoken in the upper room the night\nbefore, all that the Father had sent him to do; the power of sin is broken, the\nworld is over come.\nPage 4 of 4\nHOLY WEEK 2013 – Good Friday\n‘Were you there when they crucified my Lord’\nThe Victim\nIt is at this point that my weakness meets Christ’s power. The sin of man\nmeets the love of God and it is broken in body of Christ on the Cross. Our\ntragedy is our disobedience, our resistance to reality, our pettiness. the\ntriumph of Christ is his obedience, his grasp of reality, his oneness with the\nFather.\nIn the life of Christ our whole human experience was re-run – this time as God\nalways intended it to be. By his obedience, he justifies us; in fellowship with\nhim we are a new creation.\nSo ‘It is finished’ is not a cry of despair but a shout of triumph. I often think\nback on words of Prof Vokes, who lectured us on John’s Gospel. He said of\nthis final cry from the Cross, ‘John leaves us with a picture of Jesus reigning\nfrom the cross’. At this point, Matthew and Mark tell us the veil of the\nTemple was torn in two. As a German theologian put it:\nAt these words you hear fetters burst, and prison walls come tumbling\ndown; barriers as high as heaven are overthrown, and gates which\nhad been closed for thousands of years again move on their hinges.\nMy glasses enable me to see the world around me as it really is. May God\ngrant to us all the insight to see the Cross as it really is, God in Christ in his\nbroken and crucified body healing and redeeming his broken creation.\nRecognising his love for me, may I give myself to him in love and service.\nAwake my soul and sing\nof him who died for thee,\nand hail him as thy matchless King\nthrough all eternity."
    }
}