{
    "title": "The Essence of Truth",
    "date": "2011-04-24",
    "blurb": "Kevin's sermon explores the concept of truth as revealed in the scriptures, particularly focusing on the teachings of Jesus Christ. He emphasizes the importance of living in truth, not just in words but through actions, and how truth is integral to the Christian faith. The sermon underscores the transformative power of truth and its role in guiding believers to live authentically and faithfully.",
    "raw_text": "## What is truth?\n\n**MATTHEW 22:16**\n16 So they sent their disciples to him, along with the Herodians, saying, \"Teacher, we know that you are sincere, and teach the way of God in accordance with truth, and show deference to no one; for you do not regard the face of men.\"\n\n**JOHN 1:17**\n17 The law indeed was given through Moses; grace and truth came through Jesus Christ.\n\n**JOHN 4:23-24**\n23 But the hour is coming, and is now here, when the true worshipers will worship the Father in spirit and truth, for the Father seeks such as these to worship him. 24 God is spirit, and those who worship him must worship in spirit and truth.\n\n**JOHN 8:32, 44**\n32 \"And you will know the truth, and the truth will make you free.\"\n44 \"You are from your father the devil, and you choose to do your father's desires. He was a murderer from the beginning and does not stand in the truth, because there is no truth in him. When he lies, he speaks according to his own nature, for he is a liar and the father of lies.\"\n\n**JOHN 14:6**\n6 Jesus said to him, \"I am the way, and the truth, and the life. No one comes to the Father except through me.\"\n\n**JOHN 16:13**\nWhen the Spirit of truth comes, he will guide you into all the truth; for he will not speak on his own, but will speak whatever he hears, and he will declare to you the things that are to come.\n\n**JOHN 17:17-19**\n17 Sanctify them in the truth; your word is truth. 18 As you have sent me into the world, so I have sent them into the world. 19 And for their sakes I sanctify myself, so that they also may be sanctified in truth.\n\n**JOHN 18:37-38**\n37 Pilate asked him, \"So you are a king?\" Jesus answered, \"You say that I am a king. For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.\" 38 Pilate asked him, \"What is truth?\"\n\n**1 JOHN 1:8; 2:4; 3:18-19; 5:6**\n8 If we say that we have no sin, we deceive ourselves, and the truth is not in us.\n4 Whoever says, \"I have come to know him,\" but does not obey his commandments, is a liar, and in such a person the truth does not exist;\n18 Little children, let us love, not in word or speech, but in truth and action. 19 And by this we will know that we are from the truth and will reassure our hearts before him.\n\n**2 JOHN 1:1-4**\n1 The elder to the elect lady and her children, whom I love in truth, and not only I but also all who know the truth, 2 because of the truth that abides in us and will be with us forever: 3 Grace, mercy, and peace will be with us from God the Father and from Jesus Christ, the Father's Son, in truth and love.\n\n**3 JOHN 1:1-4**\nThe elder to the beloved Gaius, whom I love in truth. 2 Beloved, I pray that all may go well with you and that you may be in good health, just as it is well with your soul. 3 I was overjoyed when some of the friends arrived and testified to your faithfulness to the truth, namely how you walk in the truth. 4 I have no greater joy than this, to hear that my children are walking in the truth.\n\n**ROMANS 2:8; 3:7**\n8 while for those who are self-seeking and who obey not the truth but wickedness, there will be wrath and fury.\n7 But if through my falsehood God's truthfulness abounds to his glory, why am I still being condemned as a sinner?\n\n**1 CORINTHIANS 13:6**\n6 it does not rejoice in wrongdoing, but rejoices in the truth.\n\n**2 CORINTHIANS 7:14; 11:10**\n14 For if I have been somewhat boastful about you to him, I was not disgraced; but just as everything we said to you was true, so our boasting to Titus has proved true as well.\n10 As the truth of Christ is in me, this boast of mine will not be silenced in the regions of Achaia.\n\n**GALATIANS 2:5; 5:7**\n5 we did not submit to them even for a moment, so that the truth of the gospel might always remain with you.\n7 You were running well; who prevented you from obeying the truth?\n\n**EPHESIANS 4:21; 5:9; 6:14**\n21 For surely you have heard about him and were taught in him, as truth is in Jesus.\n9 for the fruit of the light is found in all that is good and right and true.\n14 Stand therefore, and fasten the belt of truth around your waist, and put on the breastplate of righteousness.\n\n**PHILIPPIANS 1:18**\n18 What does it matter? Just this, that Christ is proclaimed in every way, whether out of false motives or true; and in that I rejoice.\n\n**COLOSSIANS 1:6**\nthat has come to you. Just as it is bearing fruit and growing in the whole world, so it has been bearing fruit among yourselves from the day you heard it and truly comprehended the grace of God.\n\n**2 THESSALONIANS 2:12**\n12 so that all who have not believed the truth but took pleasure in unrighteousness will be condemned.\n\n**1 TIMOTHY 2:7**\n7 For this I was appointed a herald and an apostle (I am telling the truth, I am not lying), a teacher of the Gentiles in faith and truth.\n\n**2 TIMOTHY 3:8**\n8 As Jannes and Jambres opposed Moses, so these people, of corrupt mind and counterfeit faith, also oppose the truth.\n\n**2 PETER 1:12**\n12 Therefore I intend to keep on reminding you of these things, though you know them already and are established in the truth that has come to you.",
    "request": {
        "file_name": "raw/sermons archive//Sermons/Lent/Holy Week/2011/What is truth - notes.txt",
        "raw_ocr_content": "Page 1 of 12\nWhat is truth?\nMATTHEW 22:16\n16 So they sent their disciples to him, along with the Herodians, saying, \"Teacher,\nwe know that you are sincere, and teach the way of God in accordance with\ntruth, and show deference to no one; for you do not regard\nMt 22:16 kai; ajpostevllousin aujtw'/ tou;\" maqhta;\" aujtw'n meta; tw'n JHrw/dianw'n\nlevgonte\": didavskale, oi[damen o{ti ajlhqh;\" ei\\ kai; th;n oJdo;n tou' qeou' ejn\najlhqeiva/ didavskei\" kai; ouj mevlei soi peri; oujdenov\". ouj ga;r blevpei\" eij\"\nprovswpon ajnqrwvpwn,\nJOHN\n:Jn 1:17. Grand Rapids: Zondervan, © 1989.\n17 The law indeed was given through Moses; grace and truth came through Jesus\nChrist.\nJn 1:17 o{ti oJ novmo\" dia; Mwu>sevw\" ejdovqh, hJ cavri\" kai; hJ ajlhvqeia dia;\njIhsou' Cristou' ejgevneto.\nJn 4:23. Grand Rapids: Zondervan, © 1989.\n23 But the hour is coming, and is now here, when the true worshipers will worship\nthe Father in spirit and truth, for the Father seeks such as these to worship him.\nJn 4:23 ajlla; e[rcetai w{ra kai; nu'n ejstin, o{te oiJ ajlhqinoi; proskunhtai;\nproskunhvsousin tw'/ patri; ejn pneuvmati kai; ajlhqeiva/: kai; ga;r oJ path;r\ntoiouvtou\" zhtei' tou;\" proskunou'nta\" aujtovn.\nJn 4:24 pneu'ma oJ qeov\", kai; tou;\" proskunou'nta\" aujto;n ejn pneuvmati kai;\najlhqeiva/ dei' proskunei'n.\n5:33. Grand Rapids: Zondervan, © 1989.\n33 You sent messengers to John, and he testified to the truth.\nJn 5:33 uJmei'\" ajpestavlkate pro;\" jIwavnnhn, kai; memartuvrhken th'/ ajlhqeiva/:\n:Jn 8:32. Grand Rapids: Zondervan, © 1989.\n32 and you will know the truth, and the truth will make you free.\"\nJn 8:32 kai; gnwvsesqe th;n ajlhvqeian, kai; hJ ajlhvqeia ejleuqerwvsei uJma'\".\nPage 2 of 12\nWhat is truth?\nJn 8:44. Grand Rapids: Zondervan, © 1989.\n44 You are from your father the devil, and you choose to do your father's desires.\nHe was a murderer from the beginning and does not stand in the truth, because\nthere is no truth in him. When he lies, he speaks according to his own nature, for\nhe is a liar and the father of lies.\nJn 8:44 uJmei'\" ejk tou' patro;\" tou' diabovlou ejste; kai; ta;\" ejpiqumiva\" tou' patro;\"\nuJmw'n qevlete poiei'n. ejkei'no\" ajnqrwpoktovno\" h\\n ajp j ajrch'\" kai; ejn th'/\najlhqeiva/ oujk e[sthken, o{ti oujk e[stin ajlhvqeia ejn aujtw'/. o{tan lalh'/ to;\nyeu'do\", ejk tw'n ijdivwn lalei', o{ti yeuvsth\" ejsti;n kai; oJ path;r aujtou'.\nJn 14:6. Grand Rapids: Zondervan.\n6 Jesus said to him, \"I am the way, and the truth, and the life. No one comes to\nthe Father except through me.\nJn 14:6 levgei aujtw'/ ªoJº jIhsou'\": ejgwv eijmi hJ oJdo;\" kai; hJ ajlhvqeia kai; hJ\nzwhv: oujdei;\" e[rcetai pro;\" to;n patevra eij mh; di j ejmou'.\nJn 16:13. Grand Rapids: Zondervan.\nWhen the Spirit of truth comes, he will guide you into all the truth; for he will not\nspeak on his own, but will speak whatever he hears, and he will declare to you\nthe things that are to come.\nJn 16:13 o{tan de; e[lqh/ ejkei'no\", to; pneu'ma th'\" ajlhqeiva\", oJdhghvsei uJma'\" ejn\nth'/ ajlhqeiva/ pavsh/: ouj ga;r lalhvsei ajf j eJautou', ajll j o{sa ajkouvsei lalhvsei\nkai; ta; ejrcovmena ajnaggelei' uJmi'n.\nJn 17:17-19. Grand Rapids: Zondervan.\n17 Sanctify them in the truth; your word is truth. 18 As you have sent me into the\nworld, so I have sent them into the world. 19 And for their sakes I sanctify myself,\nso that they also may be sanctified in truth.\nJn 17:17 aJgivason aujtou;\" ejn th'/ ajlhqeiva/: oJ lovgo\" oJ so;\" ajlhvqeiav ejstin.\nJn 17:18 kaqw;\" ejme; ajpevsteila\" eij\" to;n kovsmon, kagw; ajpevsteila aujtou;\" eij\"\nto;n kovsmon:\nJn 17:19 kai; uJpe;r aujtw'n ejgw; aJgiavzw ejmautovn, i{na w\\sin kai; aujtoi;\nhJgiasmevnoi ejn ajlhqeiva/.\nPage 3 of 12\nWhat is truth?\nJn 18:37-38. Grand Rapids: Zondervan.\n37 Pilate asked him, \"So you are a king?\" Jesus answered, \"You say that I am a\nking. For this I was born, and for this I came into the world, to testify to the truth.\nEveryone who belongs to the truth listens to my voice.\" 38 Pilate asked him,\n\"What is truth?\"\nJn 18:37 ei\\pen ou\\n aujtw'/ oJ Pila'to\": oujkou'n basileu;\" ei\\ suv… ajpekrivqh oJ\njIhsou'\": su; levgei\" o{ti basileuv\" eijmi. ejgw; eij\" tou'to gegevnnhmai kai; eij\"\ntou'to ejlhvluqa eij\" to;n kovsmon, i{na marturhvsw th'/ ajlhqeiva/: pa'\" oJ w]n ejk\nth'\" ajlhqeiva\" ajkouvei mou th'\" fwnh'\".\nJn 18:38 levgei aujtw'/ oJ Pila'to\": tiv ejstin ajlhvqeia… Kai; tou'to eijpw;n pavlin\nejxh'lqen pro;\" tou;\" jIoudaivou\" kai; levgei aujtoi'\": ejgw; oujdemivan euJrivskw\nejn aujtw'/ aijtivan.\n1 JOHN\n1Jn 1:8. Grand Rapids: Zondervan.\n8 If we say that we have no sin, we deceive ourselves, and the truth is not in us.\n1Jn 1:8 eja;n ei[pwmen o{ti aJmartivan oujk e[comen, eJautou;\" planw'men kai; hJ\najlhvqeia oujk e[stin ejn hJmi'n.\n1Jn 2:4. Grand Rapids: Zondervan.\n4 Whoever says, \"I have come to know him,\" but does not obey his\ncommandments, is a liar, and in such a person the truth does not exist;\n1Jn 2:4 oJ levgwn o{ti e[gnwka aujto;n kai; ta;\" ejntola;\" aujtou' mh; thrw'n, yeuvsth\"\nejsti;n kai; ejn touvtw/ hJ ajlhvqeia oujk e[stin:\n1Jn 3:18-19\n1Jn 3:18 Little children, let us love, not in word or speech, but in truth and action. 19\nAnd by this we will know that we are from the truth and will reassure our hearts\nbefore him\nPage 4 of 12\nWhat is truth?\n1Jn 3:18 Tekniva, mh; ajgapw'men lovgw/ mhde; th'/ glwvssh/ ajlla; ejn e[rgw/ kai;\najlhqeiva/.\n1Jn 5:6. Grand Rapids: Zondervan.\nThis is the one who came by water and blood, Jesus Christ, not with the water\nonly but with the water and the blood. And the Spirit is the one that testifies, for\nthe Spirit is the truth.\n1Jn 5:6 ou|to\" ejstin oJ ejlqw;n di j u{dato\" kai; ai{mato\", jIhsou'\" Cristov\", oujk ejn\ntw'/ u{dati movnon ajll j ejn tw'/ u{dati kai; ejn tw'/ ai{mati: kai; to; pneu'mav ejstin\nto; marturou'n, o{ti to; pneu'mav ejstin hJ ajlhvqeia.\n2 JOHN\n2Jn 1:1-4 Grand Rapids: Zondervan.\nThe elder to the elect lady and her children, whom I love in the truth, and not only\nI but also all who know the truth, 2 because of the truth that abides in us and will\nbe with us forever:\n2Jn 1:3 Grace, mercy, and peace will be with us from God the Father and from\nJesus Christ, the Father's Son, in truth and love.\nI was overjoyed to find some of your children walking in the truth, just as we\nhave been commanded by the Father.\n2Jn 1:1 JO presbuvtero\" ejklekth'/ kuriva/ kai; toi'\" tevknoi\" aujth'\", ou}\" ejgw;\najgapw' ejn ajlhqeiva/, kai; oujk ejgw; movno\" ajlla; kai; pavnte\" oiJ ejgnwkovte\"\nth;n ajlhvqeian,\n2Jn 1:2 dia; th;n ajlhvqeian th;n mevnousan ejn hJmi'n kai; meq j hJmw'n e[stai eij\"\nto;n aijw'na.\n2Jn 1:3 e[stai meq j hJmw'n cavri\" e[leo\" eijrhvnh para; qeou' patro;\" kai; para;\njIhsou' Cristou' tou' uiJou' tou' patro;\" ejn ajlhqeiva/ kai; ajgavph/.\n2Jn 1:4 jEcavrhn livan o{ti eu{rhka ejk tw'n tevknwn sou peripatou'nta\" ejn\najlhqeiva/, kaqw;\" ejntolh;n ejlavbomen para; tou' patrov\".\n3 JOHN\n3Jn 1:1-4. Grand Rapids: Zondervan.\nThe elder to the beloved Gaius, whom I love in truth.\nPage 5 of 12\nWhat is truth?\nBeloved, I pray that all may go well with you and that you may be in good\nhealth, just as it is well with your soul. 3 I was overjoyed when some of the\nfriends arrived and testified to your faithfulness to the truth, namely how you walk\nin the truth. 4 I have no greater joy than this, to hear that my children are walking\nin the truth.\n3Jn 1:1 JO presbuvtero\" Gai?w/ tw'/ ajgaphtw'/, o}n ejgw; ajgapw' ejn ajlhqeiva/.\n3Jn 1:2 jAgaphtev, peri; pavntwn eu[comaiv se eujodou'sqai kai; uJgiaivnein,\nkaqw;\" eujodou'taiv sou hJ yuchv.\n3Jn 1:3 ejcavrhn ga;r livan ejrcomevnwn ajdelfw'n kai; marturouvntwn sou th'/\najlhqeiva/, kaqw;\" su; ejn ajlhqeiva/ peripatei'\".\n3Jn 1:4 meizotevran touvtwn oujk e[cw caravn, i{na ajkouvw ta; ejma; tevkna ejn th'/\najlhqeiva/ peripatou'nta.\nROMANS\nRo 2:8. Grand Rapids: Zondervan.\n8 while for those who are self-seeking and who obey not the truth but\nwickedness, there will be wrath and fury.\nRo 2:8 toi'\" de; ejx ejriqeiva\" kai; ajpeiqou'si th'/ ajlhqeiva/ peiqomevnoi\" de; th'/\najdikiva/ ojrgh; kai; qumov\".\nRo 3:7. Grand Rapids: Zondervan, © 1989.\n7 But if through my falsehood God's truthfulness abounds to his glory, why am I\nstill being condemned as a sinner?\nRo 3:7 eij de; hJ ajlhvqeia tou' qeou' ejn tw'/ ejmw'/ yeuvsmati ejperivsseusen eij\"\nth;n dovxan aujtou', tiv e[ti kagw; wJ\" aJmartwlo;\" krivnomai…\n1 CORINTHIANS\n1Co 13:6. Grand Rapids: Zondervan.\n6 it does not rejoice in wrongdoing, but rejoices in the truth.\n1Co 13:6 ouj caivrei ejpi; th'/ ajdikiva/, sugcaivrei de; th'/ ajlhqeiva/:\nPage 6 of 12\nWhat is truth?\n2 CORINTHIANS\n2Co 7:14. Grand Rapids: Zondervan.\n14 For if I have been somewhat boastful about you to him, I was not disgraced;\nbut just as everything we said to you was true, so our boasting to Titus has\nproved true as well.\n2Co 7:14 o{ti ei[ ti aujtw'/ uJpe;r uJmw'n kekauvchmai, ouj kath/scuvnqhn, ajll j wJ\"\npavnta ejn ajlhqeiva/ ejlalhvsamen uJmi'n, ou{tw\" kai; hJ kauvchsi\" hJmw'n hJ\nejpi; Tivtou ajlhvqeia ejgenhvqh.\n2Co 11:10. Grand Rapids: Zondervan.\n10 As the truth of Christ is in me, this boast of mine will not be silenced in the\nregions of Achaia.\n2Co 11:10 e[stin ajlhvqeia Cristou' ejn ejmoi; o{ti hJ kauvchsi\" au{th ouj fraghvsetai\neij\" ejme; ejn toi'\" klivmasin th'\" jAcai?a\".\nGALATIANS\nGal 2:5. Grand Rapids: Zondervan.\n5 we did not submit to them even for a moment, so that the truth of the gospel\nmight always remain with you.\nGal 2:5 oi|\" oujde; pro;\" w{ran ei[xamen th'/ uJpotagh'/, i{na hJ ajlhvqeia tou'\neujaggelivou diameivnh/ pro;\" uJma'\".\nGal 5:7. Grand Rapids: Zondervan.\nGal 5:7 You were running well; who prevented you from obeying the truth?\nGal 5:7 jEtrevcete kalw'\": tiv\" uJma'\" ejnevkoyen ªth'/º ajlhqeiva/ mh; peivqesqai…\nEPHESIANS\nEph 4:21. Grand Rapids: Zondervan.\n21 For surely you have heard about him and were taught in him, as truth is in\nJesus.\nEph 4:21 ei[ ge aujto;n hjkouvsate kai; ejn aujtw'/ ejdidavcqhte, kaqwv\" ejstin\najlhvqeia ejn tw'/ jIhsou',\nPage 7 of 12\nWhat is truth?\nEph 5:9. Grand Rapids: Zondervan.\n-- 9 for the fruit of the light is found in all that is good and right and true.\nEph 5:9 —oJ ga;r karpo;\" tou' fwto;\" ejn pavsh/ ajgaqwsuvnh/ kai; dikaiosuvnh/ kai;\najlhqeiva/—\nEph 6:14. Grand Rapids: Zondervan.\n14 Stand therefore, and fasten the belt of truth around your waist, and put on the\nbreastplate of righteousness.\nEph 6:14 sth'te ou\\n perizwsavmenoi th;n ojsfu;n uJmw'n ejn ajlhqeiva/ kai;\nejndusavmenoi to;n qwvraka th'\" dikaiosuvnh\"\nPHILIPPIANS\nPhil 1:18. Grand Rapids: Zondervan.\n18 What does it matter? Just this, that Christ is proclaimed in every way, whether\nout of false motives or true; and in that I rejoice.\nPhil 1:18 Tiv gavr… plh;n o{ti panti; trovpw/, ei[te profavsei ei[te ajlhqeiva/, Cristo;\"\nkataggevlletai, kai; ejn touvtw/ caivrw. jAlla; kai; carhvsomai,\nCOLOSSIANS\nCol 1:6. Grand Rapids: Zondervan.\nthat has come to you. Just as it is bearing fruit and growing in the whole world, so\nit has been bearing fruit among yourselves from the day you heard it and truly\ncomprehended the grace of God.\nCol 1:6 tou' parovnto\" eij\" uJma'\", kaqw;\" kai; ejn panti; tw'/ kovsmw/ ejsti;n\nkarpoforouvmenon kai; aujxanovmenon kaqw;\" kai; ejn uJmi'n, ajf j h|\" hJmevra\"\nhjkouvsate kai; ejpevgnwte th;n cavrin tou' qeou' ejn ajlhqeiva/:\n2 THESSALONIANS\n2Th 2:12. Grand Rapids: Zondervan.\n12 so that all who have not believed the truth but took pleasure in\nunrighteousness will be condemned.\n2Th 2:12 i{na kriqw'sin pavnte\" oiJ mh; pisteuvsante\" th'/ ajlhqeiva/ ajlla;\neujdokhvsante\" th'/ ajdikiva/.\nPage 8 of 12\nWhat is truth?\n1 TIMOTHY\n1Ti 2:7. Grand Rapids: Zondervan.\n7 For this I was appointed a herald and an apostle (I am telling the truth, I am not\nlying), a teacher of the Gentiles in faith and truth.\n1Ti 2:7 eij\" o} ejtevqhn ejgw; kh'rux kai; ajpovstolo\", ajlhvqeian levgw ouj\nyeuvdomai, didavskalo\" ejqnw'n ejn pivstei kai; ajlhqeiva/.\n2 TIMOTHY\n2Ti 3:8. Grand Rapids: Zondervan.\n8 As Jannes and Jambres opposed Moses, so these people, of corrupt mind and\ncounterfeit faith, also oppose the truth.\n2Ti 3:8 o}n trovpon de; jIavnnh\" kai; jIambrh'\" ajntevsthsan Mwu>sei', ou{tw\" kai;\nou|toi ajnqivstantai th'/ ajlhqeiva/, a[nqrwpoi katefqarmevnoi to;n nou'n,\najdovkimoi peri; th;n pivstin.\n2 PETER\n:2Pe 1:12. Grand Rapids: Zondervan.\n2Pe 1:12 Therefore I intend to keep on reminding you of these things, though you\nknow them already and are established in the truth that has come to you.\n2Pe 1:12 Dio; mellhvsw ajei; uJma'\" uJpomimnhv/skein peri; touvtwn kaivper\neijdovta\" kai; ejsthrigmevnou\" ejn th'/ parouvsh/ ajlhqeiva/.\n:Jn 1:17. Grand Rapids: Zondervan, © 1989.\n17 The law indeed was given through Moses; grace and truth came through Jesus\nChrist.\nJn 1:17 o{ti oJ novmo\" dia; Mwu>sevw\" ejdovqh, hJ cavri\" kai; hJ ajlhvqeia dia;\njIhsou' Cristou' ejgevneto.\n:Jn 8:32. Grand Rapids: Zondervan, © 1989.\n32 and you will know the truth, and the truth will make you free.\"\nJn 8:32 kai; gnwvsesqe th;n ajlhvqeian, kai; hJ ajlhvqeia ejleuqerwvsei uJma'\".\nJn 14:6. Grand Rapids: Zondervan.\n6 Jesus said to him, \"I am the way, and the truth, and the life. No one comes to\nthe Father except through me.\nPage 9 of 12\nWhat is truth?\nJn 14:6 levgei aujtw'/ ªoJº jIhsou'\": ejgwv eijmi hJ oJdo;\" kai; hJ ajlhvqeia kai; hJ\nzwhv: oujdei;\" e[rcetai pro;\" to;n patevra eij mh; di j ejmou'.\n2 Jn 1:3\n2Jn 1:3 Grace, mercy, and peace will be with us from God the Father and from\nJesus Christ, the Father's Son, in truth and love.\n2Jn 1:3 e[stai meq j hJmw'n cavri\" e[leo\" eijrhvnh para; qeou' patro;\" kai; para;\njIhsou' Cristou' tou' uiJou' tou' patro;\" ejn ajlhqeiva/ kai; ajgavph/.\nEph 4:21. Grand Rapids: Zondervan.\n21 For surely you have heard about him and were taught in him, as truth is in\nJesus.\nJn 5:33. Grand Rapids: Zondervan, © 1989.\n33 You sent messengers to John, and he testified to the truth.\nJn 5:33 uJmei'\" ajpestavlkate pro;\" jIwavnnhn, kai; memartuvrhken th'/ ajlhqeiva/:\n1 Jon 1:8\n8 If we say that we have no sin, we deceive ourselves, and the truth is not in us.\n1Jn 1:8 eja;n ei[pwmen o{ti aJmartivan oujk e[comen, eJautou;\" planw'men kai; hJ\najlhvqeia oujk e[stin ejn hJmi'n.\nPage 10 of 12\nWhat is truth?\n1Jn 2:4. Grand Rapids: Zondervan.\n4 Whoever says, \"I have come to know him,\" but does not obey his\ncommandments, is a liar, and in such a person the truth does not exist;\n1Jn 2:4 oJ levgwn o{ti e[gnwka aujto;n kai; ta;\" ejntola;\" aujtou' mh; thrw'n, yeuvsth\"\nejsti;n kai; ejn touvtw/ hJ ajlhvqeia oujk e[stin:\nEph 5:9\n-- 9 for the fruit of the light is found in all that is good and right and true.\nEph 5:9 —oJ ga;r karpo;\" tou' fwto;\" ejn pavsh/ ajgaqwsuvnh/ kai; dikaiosuvnh/ kai;\najlhqeiva/—\nJn 16:13. Grand Rapids: Zondervan.\nPage 11 of 12\nWhat is truth?\nWhen the Spirit of truth comes, he will guide you into all the truth; for he will not\nspeak on his own, but will speak whatever he hears, and he will declare to you\nthe things that are to come.\nJn 16:13 o{tan de; e[lqh/ ejkei'no\", to; pneu'ma th'\" ajlhqeiva\", oJdhghvsei uJma'\" ejn\nth'/ ajlhqeiva/ pavsh/: ouj ga;r lalhvsei ajf j eJautou', ajll j o{sa ajkouvsei lalhvsei\nkai; ta; ejrcovmena ajnaggelei' uJmi'n.\nJn 17:17-19. Grand Rapids: Zondervan.\n17 Sanctify them in the truth; your word is truth. 18 As you have sent me into the\nworld, so I have sent them into the world. 19 And for their sakes I sanctify myself,\nso that they also may be sanctified in truth.\nJn 17:17 aJgivason aujtou;\" ejn th'/ ajlhqeiva/: oJ lovgo\" oJ so;\" ajlhvqeiav ejstin.\nJn 17:18 kaqw;\" ejme; ajpevsteila\" eij\" to;n kovsmon, kagw; ajpevsteila aujtou;\" eij\"\nto;n kovsmon:\nJn 17:19 kai; uJpe;r aujtw'n ejgw; aJgiavzw ejmautovn, i{na w\\sin kai; aujtoi;\nhJgiasmevnoi ejn ajlhqeiva/.\n1Jn 3:18-19\n1Jn 3:18 Little children, let us love, not in word or speech, but in truth and action. 19\nAnd by this we will know that we are from the truth and will reassure our hearts\nbefore him\n1Jn 3:18 Tekniva, mh; ajgapw'men lovgw/ mhde; th'/ glwvssh/ ajlla; ejn e[rgw/ kai;\najlhqeiva/.\n1Jn 5:6. Grand Rapids: Zondervan.\nThis is the one who came by water and blood, Jesus Christ, not with the water\nonly but with the water and the blood. And the Spirit is the one that testifies, for\nthe Spirit is the truth.\n1Jn 5:6 ou|to\" ejstin oJ ejlqw;n di j u{dato\" kai; ai{mato\", jIhsou'\" Cristov\", oujk ejn\ntw'/ u{dati movnon ajll j ejn tw'/ u{dati kai; ejn tw'/ ai{mati: kai; to; pneu'mav ejstin\nto; marturou'n, o{ti to; pneu'mav ejstin hJ ajlhvqeia.\n3Jn 1:1-4. Grand Rapids: Zondervan.\nPage 12 of 12\nWhat is truth?\nThe elder to the beloved Gaius, whom I love in truth.\nBeloved, I pray that all may go well with you and that you may be in good\nhealth, just as it is well with your soul. 3 I was overjoyed when some of the\nfriends arrived and testified to your faithfulness to the truth, namely how you walk\nin the truth. 4 I have no greater joy than this, to hear that my children are walking\nin the truth.\n3Jn 1:1 JO presbuvtero\" Gai?w/ tw'/ ajgaphtw'/, o}n ejgw; ajgapw' ejn ajlhqeiva/.\n3Jn 1:2 jAgaphtev, peri; pavntwn eu[comaiv se eujodou'sqai kai; uJgiaivnein,\nkaqw;\" eujodou'taiv sou hJ yuchv.\n3Jn 1:3 ejcavrhn ga;r livan ejrcomevnwn ajdelfw'n kai; marturouvntwn sou th'/\najlhqeiva/, kaqw;\" su; ejn ajlhqeiva/ peripatei'\".\n3Jn 1:4 meizotevran touvtwn oujk e[cw caravn, i{na ajkouvw ta; ejma; tevkna ejn th'/\najlhqeiva/ peripatou'nta.\nGal 5:7. Grand Rapids: Zondervan.\nGal 5:7 You were running well; who prevented you from obeying the truth?\nGal 5:7 jEtrevcete kalw'\": tiv\" uJma'\" ejnevkoyen ªth'/º ajlhqeiva/ mh; peivqesqai…"
    }
}